minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
#ifndef STM32H743_H_
#define STM32H743_H_

#include <stdint.h>

#define __IO volatile

/* CPU information */
#define __CM7_REV                0001
#define __MPU_PRESENT            1
#define __NVIC_PRIO_BITS         4
#define __Vendor_SysTickConfig   False
#define __FPU_PRESENT            1

/**
* @brief Interrupt Number Definition, according to the selected device
*        in @ref Library_configuration_section
*/
typedef enum {
/****** cortex-M Processor Exceptions Numbers *******************************************************************/
  NonMaskableInt_IRQn         = -14, /*!<Non Maskable Interrupt                                                  */
  HardFault_IRQn              = -13, /*!<Hard Fault Interrupt                                                    */
  MemoryManagement_IRQn       = -12, /*!<Memory Management Interrupt                                             */
  BusFault_IRQn               = -11, /*!<Bus Fault Interrupt                                                     */
  UsageFault_IRQn             = -10, /*!<Usage Fault Interrupt                                                   */
  SVCall_IRQn                 = -5,  /*!<SVCall Interrupt                                                        */
  DebugMonitor_IRQn           = -4,  /*!<Debug Monitor Interrupt                                                 */
  PendSV_IRQn                 = -2,  /*!<PendSV Interrupt                                                        */
  SysTick_IRQn                = -1,  /*!<SysTick Interrupt                                                       */
  WWDG1_IRQn                  = 0,   /*!<Window Watchdog interrupt Interrupt                                     */
  PVD_PVM_IRQn                = 1,   /*!<PVD through EXTI line Interrupt                                         */
  RTC_TAMP_STAMP_CSS_LSE_IRQn = 2,   /*!<RTC tamper, timestamp Interrupt                                         */
  RTC_WKUP_IRQn               = 3,   /*!<RTC Wakeup interrupt Interrupt                                          */
  FLASH_IRQn                  = 4,   /*!<Flash memory Interrupt                                                  */
  RCC_IRQn                    = 5,   /*!<RCC global interrupt Interrupt                                          */
  EXTI0_IRQn                  = 6,   /*!<EXTI Line 0 interrupt Interrupt                                         */
  EXTI1_IRQn                  = 7,   /*!<EXTI Line 1 interrupt Interrupt                                         */
  EXTI2_IRQn                  = 8,   /*!<EXTI Line 2 interrupt Interrupt                                         */
  EXTI3_IRQn                  = 9,   /*!<EXTI Line 3interrupt Interrupt                                          */
  EXTI4_IRQn                  = 10,  /*!<EXTI Line 4interrupt Interrupt                                          */
  DMA_STR0_IRQn               = 11,  /*!<DMA1 Stream0 Interrupt                                                  */
  DMA_STR1_IRQn               = 12,  /*!<DMA1 Stream1 Interrupt                                                  */
  DMA_STR2_IRQn               = 13,  /*!<DMA1 Stream2 Interrupt                                                  */
  DMA_STR3_IRQn               = 14,  /*!<DMA1 Stream3 Interrupt                                                  */
  DMA_STR4_IRQn               = 15,  /*!<DMA1 Stream4 Interrupt                                                  */
  DMA_STR5_IRQn               = 16,  /*!<DMA1 Stream5 Interrupt                                                  */
  DMA_STR6_IRQn               = 17,  /*!<DMA1 Stream6 Interrupt                                                  */
  ADC1_2_IRQn                 = 18,  /*!<ADC1 and ADC2 Interrupt                                                 */
  FDCAN1_IT0_IRQn             = 19,  /*!<FDCAN1 Interrupt 0 Interrupt                                            */
  FDCAN2_IT0_IRQn             = 20,  /*!<FDCAN2 Interrupt 0 Interrupt                                            */
  FDCAN1_IT1_IRQn             = 21,  /*!<FDCAN1 Interrupt 1 Interrupt                                            */
  FDCAN2_IT1_IRQn             = 22,  /*!<FDCAN2 Interrupt 1 Interrupt                                            */
  EXTI9_5_IRQn                = 23,  /*!<EXTI Line[9:5] interrupts Interrupt                                     */
  TIM1_BRK_IRQn               = 24,  /*!<TIM1 break interrupt Interrupt                                          */
  TIM1_UP_IRQn                = 25,  /*!<TIM1 update interrupt Interrupt                                         */
  TIM1_TRG_COM_IRQn           = 26,  /*!<TIM1 trigger and commutation Interrupt                                  */
  TIM_CC_IRQn                 = 27,  /*!<TIM1 capture / compare Interrupt                                        */
  TIM2_IRQn                   = 28,  /*!<TIM2 global interrupt Interrupt                                         */
  TIM3_IRQn                   = 29,  /*!<TIM3 global interrupt Interrupt                                         */
  TIM4_IRQn                   = 30,  /*!<TIM4 global interrupt Interrupt                                         */
  I2C1_EV_IRQn                = 31,  /*!<I2C1 event interrupt Interrupt                                          */
  I2C1_ER_IRQn                = 32,  /*!<I2C1 error interrupt Interrupt                                          */
  I2C2_EV_IRQn                = 33,  /*!<I2C2 event interrupt Interrupt                                          */
  I2C2_ER_IRQn                = 34,  /*!<I2C2 error interrupt Interrupt                                          */
  SPI1_IRQn                   = 35,  /*!<SPI1 global interrupt Interrupt                                         */
  SPI2_IRQn                   = 36,  /*!<SPI2 global interrupt Interrupt                                         */
  USART1_IRQn                 = 37,  /*!<USART1 global interrupt Interrupt                                       */
  USART2_IRQn                 = 38,  /*!<USART2 global interrupt Interrupt                                       */
  USART3_IRQn                 = 39,  /*!<USART3 global interrupt Interrupt                                       */
  EXTI15_10_IRQn              = 40,  /*!<EXTI Line[15:10] interrupts Interrupt                                   */
  RTC_ALARM_IRQn              = 41,  /*!<RTC alarms (A and B) Interrupt                                          */
  TIM8_BRK_TIM12_IRQn         = 43,  /*!<TIM8 break and TIM12 global interrupts Interrupt                        */
  TIM8_UP_TIM13_IRQn          = 44,  /*!<TIM8 update and TIM13 global interrupts Interrupt                       */
  TIM8_TRG_COM_TIM14_IRQn     = 45,  /*!<TIM8 trigger /commutation and TIM14 global interrupts Interrupt         */
  TIM8_CC_IRQn                = 46,  /*!<TIM8 capture / compare Interrupt                                        */
  DMA1_STR7_IRQn              = 47,  /*!<DMA1 Stream7 Interrupt                                                  */
  FMC_IRQn                    = 48,  /*!<FMC global interrupt Interrupt                                          */
  SDMMC1_IRQn                 = 49,  /*!<SDMMC global interrupt Interrupt                                        */
  TIM5_IRQn                   = 50,  /*!<TIM5 global interrupt Interrupt                                         */
  SPI3_IRQn                   = 51,  /*!<SPI3 global interrupt Interrupt                                         */
  UART4_IRQn                  = 52,  /*!<UART4 global interrupt Interrupt                                        */
  UART5_IRQn                  = 53,  /*!<UART5 global interrupt Interrupt                                        */
  TIM6_DAC_IRQn               = 54,  /*!<TIM6 global interrupt Interrupt                                         */
  TIM7_IRQn                   = 55,  /*!<TIM7 global interrupt Interrupt                                         */
  DMA2_STR0_IRQn              = 56,  /*!<DMA2 Stream0 interrupt Interrupt                                        */
  DMA2_STR1_IRQn              = 57,  /*!<DMA2 Stream1 interrupt Interrupt                                        */
  DMA2_STR2_IRQn              = 58,  /*!<DMA2 Stream2 interrupt Interrupt                                        */
  DMA2_STR3_IRQn              = 59,  /*!<DMA2 Stream3 interrupt Interrupt                                        */
  DMA2_STR4_IRQn              = 60,  /*!<DMA2 Stream4 interrupt Interrupt                                        */
  ETH_IRQn                    = 61,  /*!<Ethernet global interrupt Interrupt                                     */
  ETH_WKUP_IRQn               = 62,  /*!<Ethernet wakeup through EXTI Interrupt                                  */
  FDCAN_CAL_IRQn              = 63,  /*!<CAN2TX interrupts Interrupt                                             */
  DMA2_STR5_IRQn              = 68,  /*!<DMA2 Stream5 interrupt Interrupt                                        */
  DMA2_STR6_IRQn              = 69,  /*!<DMA2 Stream6 interrupt Interrupt                                        */
  DMA2_STR7_IRQn              = 70,  /*!<DMA2 Stream7 interrupt Interrupt                                        */
  USART6_IRQn                 = 71,  /*!<USART6 global interrupt Interrupt                                       */
  I2C3_EV_IRQn                = 72,  /*!<I2C3 event interrupt Interrupt                                          */
  I2C3_ER_IRQn                = 73,  /*!<I2C3 error interrupt Interrupt                                          */
  OTG_HS_EP1_OUT_IRQn         = 74,  /*!<OTG_HS out global interrupt Interrupt                                   */
  OTG_HS_EP1_IN_IRQn          = 75,  /*!<OTG_HS in global interrupt Interrupt                                    */
  OTG_HS_WKUP_IRQn            = 76,  /*!<OTG_HS wakeup interrupt Interrupt                                       */
  OTG_HS_IRQn                 = 77,  /*!<OTG_HS global interrupt Interrupt                                       */
  DCMI_IRQn                   = 78,  /*!<DCMI global interrupt Interrupt                                         */
  HASH_RNG_IRQn               = 80,  /*!<HASH OR RNG interrupt  Interrupt                                        */
  FPU_IRQn                    = 81,  /*!< CPU FPU interrupt Interrupt                                            */
  UART7_IRQn                  = 82,  /*!<UART7 global interrupt Interrupt                                        */
  UART8_IRQn                  = 83,  /*!<UART8 global interrupt Interrupt                                        */
  SPI4_IRQn                   = 84,  /*!<SPI4 global interrupt Interrupt                                         */
  SPI5_IRQn                   = 85,  /*!<SPI5 global interrupt Interrupt                                         */
  SPI6_IRQn                   = 86,  /*!<SPI6 global interrupt Interrupt                                         */
  SAI1_IRQn                   = 87,  /*!<SAI1 global interrupt Interrupt                                         */
  LTDC_IRQn                   = 88,  /*!<LCD-TFT global interrupt Interrupt                                      */
  LTDC_ER_IRQn                = 89,  /*!<LCD-TFT error interrupt Interrupt                                       */
  DMA2D_IRQn                  = 90,  /*!<DMA2D global interrupt Interrupt                                        */
  SAI2_IRQn                   = 91,  /*!<SAI2 global interrupt Interrupt                                         */
  QUADSPI_IRQn                = 92,  /*!<QuadSPI global interrupt Interrupt                                      */
  LPTIM1_IRQn                 = 93,  /*!<LPTIM1 global interrupt Interrupt                                       */
  CEC_IRQn                    = 94,  /*!<HDMI-CEC global interrupt Interrupt                                     */
  I2C4_EV_IRQn                = 95,  /*!<I2C4 event interrupt Interrupt                                          */
  I2C4_ER_IRQn                = 96,  /*!<I2C4 error interrupt Interrupt                                          */
  SPDIF_IRQn                  = 97,  /*!<SPDIFRX global interrupt Interrupt                                      */
  OTG_FS_EP1_OUT_IRQn         = 98,  /*!<OTG_FS out global interrupt Interrupt                                   */
  OTG_FS_EP1_IN_IRQn          = 99,  /*!<OTG_FS in global interrupt Interrupt                                    */
  OTG_FS_WKUP_IRQn            = 100, /*!<OTG_FS wakeup Interrupt                                                 */
  OTG_FS_IRQn                 = 101, /*!<OTG_FS global interrupt Interrupt                                       */
  DMAMUX1_OV_IRQn             = 102, /*!<DMAMUX1 overrun interrupt Interrupt                                     */
  HRTIM1_MST_IRQn             = 103, /*!<HRTIM1 master timer interrupt Interrupt                                 */
  HRTIM1_TIMA_IRQn            = 104, /*!<HRTIM1 timer A interrupt Interrupt                                      */
  HRTIM_TIMB_IRQn             = 105, /*!<HRTIM1 timer B interrupt Interrupt                                      */
  HRTIM1_TIMC_IRQn            = 106, /*!<HRTIM1 timer C interrupt Interrupt                                      */
  HRTIM1_TIMD_IRQn            = 107, /*!<HRTIM1 timer D interrupt Interrupt                                      */
  HRTIM_TIME_IRQn             = 108, /*!<HRTIM1 timer E interrupt Interrupt                                      */
  HRTIM1_FLT_IRQn             = 109, /*!<HRTIM1 fault interrupt Interrupt                                        */
  DFSDM1_FLT0_IRQn            = 110, /*!<DFSDM1 filter 0 interrupt Interrupt                                     */
  DFSDM1_FLT1_IRQn            = 111, /*!<DFSDM1 filter 1 interrupt Interrupt                                     */
  DFSDM1_FLT2_IRQn            = 112, /*!<DFSDM1 filter 2 interrupt Interrupt                                     */
  DFSDM1_FLT3_IRQn            = 113, /*!<DFSDM1 filter 3 interrupt Interrupt                                     */
  SAI3_IRQn                   = 114, /*!<SAI3 global interrupt Interrupt                                         */
  SWPMI1_IRQn                 = 115, /*!<SWPMI global interrupt Interrupt                                        */
  TIM15_IRQn                  = 116, /*!<TIM15 global interrupt Interrupt                                        */
  TIM16_IRQn                  = 117, /*!<TIM16 global interrupt Interrupt                                        */
  TIM17_IRQn                  = 118, /*!<TIM17 global interrupt Interrupt                                        */
  MDIOS_WKUP_IRQn             = 119, /*!<MDIOS wakeup Interrupt                                                  */
  MDIOS_IRQn                  = 120, /*!<MDIOS global interrupt Interrupt                                        */
  JPEG_IRQn                   = 121, /*!<JPEG global interrupt Interrupt                                         */
  MDMA_IRQn                   = 122, /*!<MDMA Interrupt                                                          */
  SDMMC_IRQn                  = 124, /*!<SDMMC global interrupt Interrupt                                        */
  HSEM0_IRQn                  = 125, /*!<HSEM global interrupt 1 Interrupt                                       */
  ADC3_IRQn                   = 127, /*!<ADC3 global interrupt Interrupt                                         */
  DMAMUX2_OVR_IRQn            = 128, /*!<DMAMUX2 overrun interrupt Interrupt                                     */
  BDMA_CH0_IRQn               = 129, /*!<BDMA channel 0 interrupt Interrupt                                      */
  BDMA_CH1_IRQn               = 130, /*!<BDMA channel 1 interrupt Interrupt                                      */
  BDMA_CH2_IRQn               = 131, /*!<BDMA channel 2 interrupt Interrupt                                      */
  BDMA_CH3_IRQn               = 132, /*!<BDMA channel 3 interrupt Interrupt                                      */
  BDMA_CH4_IRQn               = 133, /*!<BDMA channel 4 interrupt Interrupt                                      */
  BDMA_CH5_IRQn               = 134, /*!<BDMA channel 5 interrupt Interrupt                                      */
  BDMA_CH6_IRQn               = 135, /*!<BDMA channel 6 interrupt Interrupt                                      */
  BDMA_CH7_IRQn               = 136, /*!<BDMA channel 7 interrupt Interrupt                                      */
  COMP_IRQn                   = 137, /*!<COMP1 and COMP2 Interrupt                                               */
  LPTIM2_IRQn                 = 138, /*!<LPTIM2 timer interrupt Interrupt                                        */
  LPTIM3_IRQn                 = 139, /*!<LPTIM2 timer interrupt Interrupt                                        */
  LPTIM4_IRQn                 = 140, /*!<LPTIM4 timer interrupt Interrupt                                        */
  LPTIM5_IRQn                 = 141, /*!<LPTIM2 timer interrupt Interrupt                                        */
  LPUART_IRQn                 = 142, /*!<LPUART global interrupt Interrupt                                       */
  WWDG1_RST_IRQn              = 143, /*!<Window Watchdog interrupt Interrupt                                     */
  CRS_IRQn                    = 144, /*!<Clock Recovery System globa Interrupt                                   */
  SAI4_IRQn                   = 146, /*!<SAI4 global interrupt Interrupt                                         */
  WKUP_IRQn                   = 149, /*!<WKUP1 to WKUP6 pins Interrupt                                           */
} IRQn_Type;

/*------------------------ Device type Define ---------------------*/

