minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
typedef struct {
  union {
      __IO uint32_t S0CR_reg;
  
      // bit fields
      struct {
          __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t DMEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t TEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t HTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t TCIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t PFCTRL_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t DIR_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t CIRC_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t PINC_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t MINC_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t PSIZE_bit : 2; // bit offset=11  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t MSIZE_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t PINCOS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t PL_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t DBM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t CT_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t RESERVED0: 1;
          __IO uint32_t PBURST_bit : 2; // bit offset=21  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t MBURST_bit : 2; // bit offset=23  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t RESERVED1 : 7;
      } S0CR_bits;
  };
  
  __IO uint32_t S0NDTR_reg;
  
  __IO uint32_t S0PAR_reg;
  
  __IO uint32_t S0M0AR_reg;
  
  __IO uint32_t S0M1AR_reg;
  
  union {
      __IO uint32_t S0FCR_reg;
  
      // bit fields
      struct {
          __IO uint32_t FTH_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t DMDIS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t FS_bit : 3; // bit offset=3  bit width=3  access=SVDAccessType.READ_ONLY
          __IO uint32_t RESERVED0: 1;
          __IO uint32_t FEIE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t RESERVED1 : 24;
      } S0FCR_bits;
  };
  
} dma_stream_x_cfg_t;

typedef struct {
  union {
      __IO uint32_t DMAMUX_C0CR_reg;
  
      // bit fields
      struct {
          __IO uint32_t DMAREQ_ID_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
          __IO uint32_t RESERVED0: 1;
          __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t RESERVED1: 6;
          __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
          __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
          __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
          __IO uint32_t SYNC_ID_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
          __IO uint32_t RESERVED2 : 5;
      } DMAMUX_C0CR_bits;
  };
  
} dmamux_cxcr_reg_t;

// Device STM32H743

// Peripheral ADC1 @ base_address=0x40022000
typedef struct adc1_t {

    // ISR @ offset=0x00000000
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t ADRDY_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOSMP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOC_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOS_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD2_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD3_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JQOVF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t LDORDY_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } ISR_bits;
    };

    // IER @ offset=0x00000004
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t ADRDYIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOSMPIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOSIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVRIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOSIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD1IE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD2IE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD3IE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JQOVFIE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 21;
        } IER_bits;
    };

