minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // JDR3 @ offset=0x00000088
    __IO uint32_t JDR3_reg;

    // JDR4 @ offset=0x0000008C
    __IO uint32_t JDR4_reg;

    __IO uint8_t RESERVED4[16];

    // AWD2CR @ offset=0x000000A0
    __IO uint32_t AWD2CR_reg;

    // AWD3CR @ offset=0x000000A4
    __IO uint32_t AWD3CR_reg;

    __IO uint8_t RESERVED5[8];

    // LTR2 @ offset=0x000000B0
    __IO uint32_t LTR2_reg;

    // HTR2 @ offset=0x000000B4
    __IO uint32_t HTR2_reg;

    // LTR3 @ offset=0x000000B8
    __IO uint32_t LTR3_reg;

    // HTR3 @ offset=0x000000BC
    __IO uint32_t HTR3_reg;

    // DIFSEL @ offset=0x000000C0
    __IO uint32_t DIFSEL_reg;

    // CALFACT @ offset=0x000000C4
    union {
        __IO uint32_t CALFACT_reg;

        // bit fields
        struct {
            __IO uint32_t CALFACT_S_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t CALFACT_D_bit : 11; // bit offset=16  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 5;
        } CALFACT_bits;
    };

    // CALFACT2 @ offset=0x000000C8
    __IO uint32_t CALFACT2_reg;

} adc1_t;

// Peripheral ADC12_Common @ base_address=0x40022300
typedef struct adc12_common_t {

    // CSR @ offset=0x00000000
    union {
        __IO uint32_t CSR_reg;

        // bit fields
        struct {
            __IO uint32_t ADRDY_MST_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOSMP_MST_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOC_MST_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOS_MST_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_MST_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOC_MST_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOS_MST_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD1_MST_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD2_MST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD3_MST_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JQOVF_MST_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t ADRDY_SLV_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOSMP_SLV_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOC_SLV_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOS_SLV_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_SLV_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOC_SLV_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOS_SLV_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD1_SLV_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD2_SLV_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD3_SLV_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JQOVF_SLV_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 5;
        } CSR_bits;
    };

    __IO uint8_t RESERVED0[4];

    // CCR @ offset=0x00000008
    union {
        __IO uint32_t CCR_reg;

        // bit fields
        struct {
            __IO uint32_t DUAL_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DELAY_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t DAMDF_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKMODE_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRESC_bit : 4; // bit offset=18  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t VREFEN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSENSEEN_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VBATEN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 7;
        } CCR_bits;
    };

    // CDR @ offset=0x0000000C
    union {
        __IO uint32_t CDR_reg;

        // bit fields
        struct {
            __IO uint32_t RDATA_MST_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t RDATA_SLV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } CDR_bits;
    };

    // CDR2 @ offset=0x00000010
    __IO uint32_t CDR2_reg;

} adc12_common_t;

// Peripheral ADC2 @ base_address=0x40022100
typedef struct adc2_t {

    // ISR @ offset=0x00000000
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t ADRDY_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOSMP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOC_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOS_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD2_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD3_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JQOVF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t LDORDY_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } ISR_bits;
    };

    // IER @ offset=0x00000004
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t ADRDYIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOSMPIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOSIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVRIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEOSIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD1IE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD2IE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWD3IE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JQOVFIE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 21;
        } IER_bits;
    };

