minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // SMPR2 @ offset=0x00000018
    union {
        __IO uint32_t SMPR2_reg;

        // bit fields
        struct {
            __IO uint32_t SMP10_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP11_bit : 3; // bit offset=3  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP12_bit : 3; // bit offset=6  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP13_bit : 3; // bit offset=9  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP14_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP15_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP16_bit : 3; // bit offset=18  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP17_bit : 3; // bit offset=21  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP18_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP19_bit : 3; // bit offset=27  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } SMPR2_bits;
    };

    // PCSEL @ offset=0x0000001C
    __IO uint32_t PCSEL_reg;

    // LTR1 @ offset=0x00000020
    __IO uint32_t LTR1_reg;

    // LHTR1 @ offset=0x00000024
    __IO uint32_t LHTR1_reg;

    __IO uint8_t RESERVED0[8];

    // SQR1 @ offset=0x00000030
    union {
        __IO uint32_t SQR1_reg;

        // bit fields
        struct {
            __IO uint32_t L3_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t SQ1_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SQ2_bit : 5; // bit offset=12  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SQ3_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SQ4_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } SQR1_bits;
    };

    // SQR2 @ offset=0x00000034
    union {
        __IO uint32_t SQR2_reg;

        // bit fields
        struct {
            __IO uint32_t SQ5_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SQ6_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SQ7_bit : 5; // bit offset=12  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SQ8_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SQ9_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } SQR2_bits;
    };

    // SQR3 @ offset=0x00000038
    union {
        __IO uint32_t SQR3_reg;

        // bit fields
        struct {
            __IO uint32_t SQ10_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SQ11_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SQ12_bit : 5; // bit offset=12  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SQ13_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SQ14_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } SQR3_bits;
    };

    // SQR4 @ offset=0x0000003C
    union {
        __IO uint32_t SQR4_reg;

        // bit fields
        struct {
            __IO uint32_t SQ15_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SQ16_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 21;
        } SQR4_bits;
    };

    // DR @ offset=0x00000040
    __IO uint32_t DR_reg;

    __IO uint8_t RESERVED1[8];

    // JSQR @ offset=0x0000004C
    union {
        __IO uint32_t JSQR_reg;

        // bit fields
        struct {
            __IO uint32_t JL_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEXTSEL_bit : 5; // bit offset=2  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEXTEN_bit : 2; // bit offset=7  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t JSQ1_bit : 5; // bit offset=9  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t JSQ2_bit : 5; // bit offset=15  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t JSQ3_bit : 5; // bit offset=21  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t JSQ4_bit : 5; // bit offset=27  bit width=5  access=SVDAccessType.READ_WRITE
        } JSQR_bits;
    };

    __IO uint8_t RESERVED2[16];

    // OFR1 @ offset=0x00000060
    union {
        __IO uint32_t OFR1_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR1_bits;
    };

    // OFR2 @ offset=0x00000064
    union {
        __IO uint32_t OFR2_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR2_bits;
    };

    // OFR3 @ offset=0x00000068
    union {
        __IO uint32_t OFR3_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR3_bits;
    };

    // OFR4 @ offset=0x0000006C
    union {
        __IO uint32_t OFR4_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR4_bits;
    };

    __IO uint8_t RESERVED3[16];

    // JDR1 @ offset=0x00000080
    __IO uint32_t JDR1_reg;

    // JDR2 @ offset=0x00000084
    __IO uint32_t JDR2_reg;

