minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // CFGR2 @ offset=0x00000010
    union {
        __IO uint32_t CFGR2_reg;

        // bit fields
        struct {
            __IO uint32_t ROVSE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JOVSE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t OVSS_bit : 4; // bit offset=5  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TROVS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ROVSM_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSHIFT1_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSHIFT2_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSHIFT3_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSHIFT4_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t OSR_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t LSHIFT_bit : 4; // bit offset=28  bit width=4  access=SVDAccessType.READ_WRITE
        } CFGR2_bits;
    };

    // SMPR1 @ offset=0x00000014
    union {
        __IO uint32_t SMPR1_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SMP1_bit : 3; // bit offset=3  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP2_bit : 3; // bit offset=6  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP3_bit : 3; // bit offset=9  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP4_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP5_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP6_bit : 3; // bit offset=18  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP7_bit : 3; // bit offset=21  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP8_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP9_bit : 3; // bit offset=27  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 2;
        } SMPR1_bits;
    };

    // SMPR2 @ offset=0x00000018
    union {
        __IO uint32_t SMPR2_reg;

        // bit fields
        struct {
            __IO uint32_t SMP10_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP11_bit : 3; // bit offset=3  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP12_bit : 3; // bit offset=6  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP13_bit : 3; // bit offset=9  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP14_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP15_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP16_bit : 3; // bit offset=18  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP17_bit : 3; // bit offset=21  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP18_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMP19_bit : 3; // bit offset=27  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } SMPR2_bits;
    };

    // PCSEL @ offset=0x0000001C
    __IO uint32_t PCSEL_reg;

    // LTR1 @ offset=0x00000020
    __IO uint32_t LTR1_reg;

    // LHTR1 @ offset=0x00000024
    __IO uint32_t LHTR1_reg;

    __IO uint8_t RESERVED0[8];

    // SQR1 @ offset=0x00000030
    union {
        __IO uint32_t SQR1_reg;

        // bit fields
        struct {
            __IO uint32_t L3_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t SQ1_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SQ2_bit : 5; // bit offset=12  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SQ3_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SQ4_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } SQR1_bits;
    };

    // SQR2 @ offset=0x00000034
    union {
        __IO uint32_t SQR2_reg;

        // bit fields
        struct {
            __IO uint32_t SQ5_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SQ6_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SQ7_bit : 5; // bit offset=12  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SQ8_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SQ9_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } SQR2_bits;
    };

    // SQR3 @ offset=0x00000038
    union {
        __IO uint32_t SQR3_reg;

        // bit fields
        struct {
            __IO uint32_t SQ10_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SQ11_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SQ12_bit : 5; // bit offset=12  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SQ13_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SQ14_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } SQR3_bits;
    };

