minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // SQR4 @ offset=0x0000003C
    union {
        __IO uint32_t SQR4_reg;

        // bit fields
        struct {
            __IO uint32_t SQ15_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SQ16_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 21;
        } SQR4_bits;
    };

    // DR @ offset=0x00000040
    __IO uint32_t DR_reg;

    __IO uint8_t RESERVED1[8];

    // JSQR @ offset=0x0000004C
    union {
        __IO uint32_t JSQR_reg;

        // bit fields
        struct {
            __IO uint32_t JL_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEXTSEL_bit : 5; // bit offset=2  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEXTEN_bit : 2; // bit offset=7  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t JSQ1_bit : 5; // bit offset=9  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t JSQ2_bit : 5; // bit offset=15  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t JSQ3_bit : 5; // bit offset=21  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t JSQ4_bit : 5; // bit offset=27  bit width=5  access=SVDAccessType.READ_WRITE
        } JSQR_bits;
    };

    __IO uint8_t RESERVED2[16];

    // OFR1 @ offset=0x00000060
    union {
        __IO uint32_t OFR1_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR1_bits;
    };

    // OFR2 @ offset=0x00000064
    union {
        __IO uint32_t OFR2_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR2_bits;
    };

    // OFR3 @ offset=0x00000068
    union {
        __IO uint32_t OFR3_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR3_bits;
    };

    // OFR4 @ offset=0x0000006C
    union {
        __IO uint32_t OFR4_reg;

        // bit fields
        struct {
            __IO uint32_t OFFSET1_bit : 26; // bit offset=0  bit width=26  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET1_CH_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSATE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OFR4_bits;
    };

    __IO uint8_t RESERVED3[16];

    // JDR1 @ offset=0x00000080
    __IO uint32_t JDR1_reg;

    // JDR2 @ offset=0x00000084
    __IO uint32_t JDR2_reg;

    // JDR3 @ offset=0x00000088
    __IO uint32_t JDR3_reg;

    // JDR4 @ offset=0x0000008C
    __IO uint32_t JDR4_reg;

    __IO uint8_t RESERVED4[16];

    // AWD2CR @ offset=0x000000A0
    __IO uint32_t AWD2CR_reg;

    // AWD3CR @ offset=0x000000A4
    __IO uint32_t AWD3CR_reg;

    __IO uint8_t RESERVED5[8];

    // LTR2 @ offset=0x000000B0
    __IO uint32_t LTR2_reg;

    // HTR2 @ offset=0x000000B4
    __IO uint32_t HTR2_reg;

    // LTR3 @ offset=0x000000B8
    __IO uint32_t LTR3_reg;

    // HTR3 @ offset=0x000000BC
    __IO uint32_t HTR3_reg;

    // DIFSEL @ offset=0x000000C0
    __IO uint32_t DIFSEL_reg;

    // CALFACT @ offset=0x000000C4
    union {
        __IO uint32_t CALFACT_reg;

        // bit fields
        struct {
            __IO uint32_t CALFACT_S_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t CALFACT_D_bit : 11; // bit offset=16  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 5;
        } CALFACT_bits;
    };

    // CALFACT2 @ offset=0x000000C8
    __IO uint32_t CALFACT2_reg;

} adc3_t;

// Peripheral ADC3_Common @ base_address=0x58026300
typedef struct adc3_common_t {

    // CSR @ offset=0x00000000
    union {
        __IO uint32_t CSR_reg;

        // bit fields
        struct {
            __IO uint32_t ADRDY_MST_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOSMP_MST_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOC_MST_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOS_MST_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_MST_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOC_MST_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOS_MST_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD1_MST_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD2_MST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD3_MST_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JQOVF_MST_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t ADRDY_SLV_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOSMP_SLV_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOC_SLV_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOS_SLV_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_SLV_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOC_SLV_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEOS_SLV_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD1_SLV_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD2_SLV_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWD3_SLV_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JQOVF_SLV_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 5;
        } CSR_bits;
    };

    __IO uint8_t RESERVED0[4];

    // CCR @ offset=0x00000008
    union {
        __IO uint32_t CCR_reg;

        // bit fields
        struct {
            __IO uint32_t DUAL_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DELAY_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t DAMDF_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKMODE_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRESC_bit : 4; // bit offset=18  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t VREFEN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSENSEEN_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VBATEN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 7;
        } CCR_bits;
    };

    // CDR @ offset=0x0000000C
    union {
        __IO uint32_t CDR_reg;

        // bit fields
        struct {
            __IO uint32_t RDATA_MST_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t RDATA_SLV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } CDR_bits;
    };

