minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // CDR2 @ offset=0x00000010
    __IO uint32_t CDR2_reg;

} adc3_common_t;

// Peripheral AXI @ base_address=0x51000000
typedef struct axi_t {

    __IO uint8_t RESERVED0[8144];

    // AXI_PERIPH_ID_4 @ offset=0x00001FD0
    union {
        __IO uint32_t AXI_PERIPH_ID_4_reg;

        // bit fields
        struct {
            __IO uint32_t JEP106CON_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t KCOUNT4_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } AXI_PERIPH_ID_4_bits;
    };

    __IO uint8_t RESERVED1[12];

    // AXI_PERIPH_ID_0 @ offset=0x00001FE0
    __IO uint32_t AXI_PERIPH_ID_0_reg;

    // AXI_PERIPH_ID_1 @ offset=0x00001FE4
    union {
        __IO uint32_t AXI_PERIPH_ID_1_reg;

        // bit fields
        struct {
            __IO uint32_t PARTNUM_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEP106I_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } AXI_PERIPH_ID_1_bits;
    };

    // AXI_PERIPH_ID_2 @ offset=0x00001FE8
    union {
        __IO uint32_t AXI_PERIPH_ID_2_reg;

        // bit fields
        struct {
            __IO uint32_t JEP106ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t JEDEC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t REVISION_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } AXI_PERIPH_ID_2_bits;
    };

    // AXI_PERIPH_ID_3 @ offset=0x00001FEC
    union {
        __IO uint32_t AXI_PERIPH_ID_3_reg;

        // bit fields
        struct {
            __IO uint32_t CUST_MOD_NUM_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t REV_AND_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } AXI_PERIPH_ID_3_bits;
    };

    // AXI_COMP_ID_0 @ offset=0x00001FF0
    __IO uint32_t AXI_COMP_ID_0_reg;

    // AXI_COMP_ID_1 @ offset=0x00001FF4
    union {
        __IO uint32_t AXI_COMP_ID_1_reg;

        // bit fields
        struct {
            __IO uint32_t PREAMBLE_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t CLASS_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } AXI_COMP_ID_1_bits;
    };

    // AXI_COMP_ID_2 @ offset=0x00001FF8
    __IO uint32_t AXI_COMP_ID_2_reg;

    // AXI_COMP_ID_3 @ offset=0x00001FFC
    __IO uint32_t AXI_COMP_ID_3_reg;

    __IO uint8_t RESERVED2[8];

    // AXI_TARG1_FN_MOD_ISS_BM @ offset=0x00002008
    union {
        __IO uint32_t AXI_TARG1_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG1_FN_MOD_ISS_BM_bits;
    };

    __IO uint8_t RESERVED3[24];

    // AXI_TARG1_FN_MOD2 @ offset=0x00002024
    __IO uint32_t AXI_TARG1_FN_MOD2_reg;

    __IO uint8_t RESERVED4[4];

    // AXI_TARG1_FN_MOD_LB @ offset=0x0000202C
    __IO uint32_t AXI_TARG1_FN_MOD_LB_reg;

    __IO uint8_t RESERVED5[216];

    // AXI_TARG1_FN_MOD @ offset=0x00002108
    union {
        __IO uint32_t AXI_TARG1_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG1_FN_MOD_bits;
    };

    __IO uint8_t RESERVED6[3836];

    // AXI_TARG2_FN_MOD_ISS_BM @ offset=0x00003008
    union {
        __IO uint32_t AXI_TARG2_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG2_FN_MOD_ISS_BM_bits;
    };

    __IO uint8_t RESERVED7[24];

    // AXI_TARG2_FN_MOD2 @ offset=0x00003024
    __IO uint32_t AXI_TARG2_FN_MOD2_reg;

    __IO uint8_t RESERVED8[4];

    // AXI_TARG2_FN_MOD_LB @ offset=0x0000302C
    __IO uint32_t AXI_TARG2_FN_MOD_LB_reg;

    __IO uint8_t RESERVED9[216];

    // AXI_TARG2_FN_MOD @ offset=0x00003108
    union {
        __IO uint32_t AXI_TARG2_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG2_FN_MOD_bits;
    };

    __IO uint8_t RESERVED10[3836];

    // AXI_TARG3_FN_MOD_ISS_BM @ offset=0x00004008
    union {
        __IO uint32_t AXI_TARG3_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG3_FN_MOD_ISS_BM_bits;
    };

    __IO uint8_t RESERVED11[4092];

    // AXI_TARG4_FN_MOD_ISS_BM @ offset=0x00005008
    union {
        __IO uint32_t AXI_TARG4_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG4_FN_MOD_ISS_BM_bits;
    };

    __IO uint8_t RESERVED12[4092];

    // AXI_TARG5_FN_MOD_ISS_BM @ offset=0x00006008
    union {
        __IO uint32_t AXI_TARG5_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG5_FN_MOD_ISS_BM_bits;
    };

    __IO uint8_t RESERVED13[4092];

    // AXI_TARG6_FN_MOD_ISS_BM @ offset=0x00007008
    union {
        __IO uint32_t AXI_TARG6_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG6_FN_MOD_ISS_BM_bits;
    };

