minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    __IO uint8_t RESERVED14[4096];

    // AXI_TARG7_FN_MOD_ISS_BM @ offset=0x0000800C
    union {
        __IO uint32_t AXI_TARG7_FN_MOD_ISS_BM_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG7_FN_MOD_ISS_BM_bits;
    };

    __IO uint8_t RESERVED15[20];

    // AXI_TARG7_FN_MOD2 @ offset=0x00008024
    __IO uint32_t AXI_TARG7_FN_MOD2_reg;

    __IO uint8_t RESERVED16[224];

    // AXI_TARG7_FN_MOD @ offset=0x00008108
    union {
        __IO uint32_t AXI_TARG7_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_TARG7_FN_MOD_bits;
    };

    __IO uint8_t RESERVED17[237336];

    // AXI_INI1_FN_MOD2 @ offset=0x00042024
    __IO uint32_t AXI_INI1_FN_MOD2_reg;

    // AXI_INI1_FN_MOD_AHB @ offset=0x00042028
    union {
        __IO uint32_t AXI_INI1_FN_MOD_AHB_reg;

        // bit fields
        struct {
            __IO uint32_t RD_INC_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WR_INC_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI1_FN_MOD_AHB_bits;
    };

    __IO uint8_t RESERVED18[212];

    // AXI_INI1_READ_QOS @ offset=0x00042100
    __IO uint32_t AXI_INI1_READ_QOS_reg;

    // AXI_INI1_WRITE_QOS @ offset=0x00042104
    __IO uint32_t AXI_INI1_WRITE_QOS_reg;

    // AXI_INI1_FN_MOD @ offset=0x00042108
    union {
        __IO uint32_t AXI_INI1_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI1_FN_MOD_bits;
    };

    __IO uint8_t RESERVED19[4084];

    // AXI_INI2_READ_QOS @ offset=0x00043100
    __IO uint32_t AXI_INI2_READ_QOS_reg;

    // AXI_INI2_WRITE_QOS @ offset=0x00043104
    __IO uint32_t AXI_INI2_WRITE_QOS_reg;

    // AXI_INI2_FN_MOD @ offset=0x00043108
    union {
        __IO uint32_t AXI_INI2_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI2_FN_MOD_bits;
    };

    __IO uint8_t RESERVED20[3864];

    // AXI_INI3_FN_MOD2 @ offset=0x00044024
    __IO uint32_t AXI_INI3_FN_MOD2_reg;

    // AXI_INI3_FN_MOD_AHB @ offset=0x00044028
    union {
        __IO uint32_t AXI_INI3_FN_MOD_AHB_reg;

        // bit fields
        struct {
            __IO uint32_t RD_INC_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WR_INC_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI3_FN_MOD_AHB_bits;
    };

    __IO uint8_t RESERVED21[212];

    // AXI_INI3_READ_QOS @ offset=0x00044100
    __IO uint32_t AXI_INI3_READ_QOS_reg;

    // AXI_INI3_WRITE_QOS @ offset=0x00044104
    __IO uint32_t AXI_INI3_WRITE_QOS_reg;

    // AXI_INI3_FN_MOD @ offset=0x00044108
    union {
        __IO uint32_t AXI_INI3_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI3_FN_MOD_bits;
    };

    __IO uint8_t RESERVED22[4084];

    // AXI_INI4_READ_QOS @ offset=0x00045100
    __IO uint32_t AXI_INI4_READ_QOS_reg;

    // AXI_INI4_WRITE_QOS @ offset=0x00045104
    __IO uint32_t AXI_INI4_WRITE_QOS_reg;

    // AXI_INI4_FN_MOD @ offset=0x00045108
    union {
        __IO uint32_t AXI_INI4_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI4_FN_MOD_bits;
    };

    __IO uint8_t RESERVED23[4084];

    // AXI_INI5_READ_QOS @ offset=0x00046100
    __IO uint32_t AXI_INI5_READ_QOS_reg;

    // AXI_INI5_WRITE_QOS @ offset=0x00046104
    __IO uint32_t AXI_INI5_WRITE_QOS_reg;

    // AXI_INI5_FN_MOD @ offset=0x00046108
    union {
        __IO uint32_t AXI_INI5_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI5_FN_MOD_bits;
    };

    __IO uint8_t RESERVED24[4084];

    // AXI_INI6_READ_QOS @ offset=0x00047100
    __IO uint32_t AXI_INI6_READ_QOS_reg;

    // AXI_INI6_WRITE_QOS @ offset=0x00047104
    __IO uint32_t AXI_INI6_WRITE_QOS_reg;

    // AXI_INI6_FN_MOD @ offset=0x00047108
    union {
        __IO uint32_t AXI_INI6_FN_MOD_reg;

        // bit fields
        struct {
            __IO uint32_t READ_ISS_OVERRIDE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRITE_ISS_OVERRIDE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } AXI_INI6_FN_MOD_bits;
    };

} axi_t;

// Peripheral BDMA @ base_address=0x58025400
typedef struct bdma_t {

