minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // BDMA_CNDTR0 @ offset=0x0000000C
    __IO uint32_t BDMA_CNDTR0_reg;

    // BDMA_CPAR0 @ offset=0x00000010
    __IO uint32_t BDMA_CPAR0_reg;

    // BDMA_CM0AR0 @ offset=0x00000014
    __IO uint32_t BDMA_CM0AR0_reg;

    // BDMA_CM1AR0 @ offset=0x00000018
    __IO uint32_t BDMA_CM1AR0_reg;

    // BDMA_CCR1 @ offset=0x0000001C
    union {
        __IO uint32_t BDMA_CCR1_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HTIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CIRC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PINC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MINC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSIZE_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSIZE_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MEM2MEM_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBM_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CT_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 15;
        } BDMA_CCR1_bits;
    };

    // BDMA_CNDTR1 @ offset=0x00000020
    __IO uint32_t BDMA_CNDTR1_reg;

    // BDMA_CPAR1 @ offset=0x00000024
    __IO uint32_t BDMA_CPAR1_reg;

    // BDMA_CM0AR1 @ offset=0x00000028
    __IO uint32_t BDMA_CM0AR1_reg;

    // BDMA_CM1AR1 @ offset=0x0000002C
    __IO uint32_t BDMA_CM1AR1_reg;

    // BDMA_CCR2 @ offset=0x00000030
    union {
        __IO uint32_t BDMA_CCR2_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HTIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CIRC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PINC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MINC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSIZE_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSIZE_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MEM2MEM_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBM_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CT_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 15;
        } BDMA_CCR2_bits;
    };

    // BDMA_CNDTR2 @ offset=0x00000034
    __IO uint32_t BDMA_CNDTR2_reg;

    // BDMA_CPAR2 @ offset=0x00000038
    __IO uint32_t BDMA_CPAR2_reg;

    // BDMA_CM0AR2 @ offset=0x0000003C
    __IO uint32_t BDMA_CM0AR2_reg;

    // BDMA_CM1AR2 @ offset=0x00000040
    __IO uint32_t BDMA_CM1AR2_reg;

    // BDMA_CCR3 @ offset=0x00000044
    union {
        __IO uint32_t BDMA_CCR3_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HTIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CIRC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PINC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MINC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSIZE_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSIZE_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MEM2MEM_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBM_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CT_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 15;
        } BDMA_CCR3_bits;
    };

    // BDMA_CNDTR3 @ offset=0x00000048
    __IO uint32_t BDMA_CNDTR3_reg;

    // BDMA_CPAR3 @ offset=0x0000004C
    __IO uint32_t BDMA_CPAR3_reg;

    // BDMA_CM0AR3 @ offset=0x00000050
    __IO uint32_t BDMA_CM0AR3_reg;

    // BDMA_CM1AR3 @ offset=0x00000054
    __IO uint32_t BDMA_CM1AR3_reg;

