minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // BDMA_CPAR7 @ offset=0x0000009C
    __IO uint32_t BDMA_CPAR7_reg;

    // BDMA_CM0AR7 @ offset=0x000000A0
    __IO uint32_t BDMA_CM0AR7_reg;

    // BDMA_CM1AR7 @ offset=0x000000A4
    __IO uint32_t BDMA_CM1AR7_reg;

} bdma_t;

// Peripheral CAN_CCU @ base_address=0x4000A800
typedef struct can_ccu_t {

    // CREL @ offset=0x00000000
    union {
        __IO uint32_t CREL_reg;

        // bit fields
        struct {
            __IO uint32_t DAY_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MON_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t YEAR_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t SUBSTEP_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t STEP_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t REL_bit : 4; // bit offset=28  bit width=4  access=SVDAccessType.READ_WRITE
        } CREL_bits;
    };

    // CCFG @ offset=0x00000004
    union {
        __IO uint32_t CCFG_reg;

        // bit fields
        struct {
            __IO uint32_t TQBT_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BCC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFL_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OCPM_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CDIV_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 11;
            __IO uint32_t SWR_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CCFG_bits;
    };

    // CSTAT @ offset=0x00000008
    union {
        __IO uint32_t CSTAT_reg;

        // bit fields
        struct {
            __IO uint32_t OCPC_bit : 18; // bit offset=0  bit width=18  access=SVDAccessType.READ_WRITE
            __IO uint32_t TQC_bit : 11; // bit offset=18  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CALS_bit : 2; // bit offset=30  bit width=2  access=SVDAccessType.READ_WRITE
        } CSTAT_bits;
    };

    // CWD @ offset=0x0000000C
    union {
        __IO uint32_t CWD_reg;

        // bit fields
        struct {
            __IO uint32_t WDC_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t WDV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CWD_bits;
    };

    // IR @ offset=0x00000010
    union {
        __IO uint32_t IR_reg;

        // bit fields
        struct {
            __IO uint32_t CWE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSC_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } IR_bits;
    };

    // IE @ offset=0x00000014
    union {
        __IO uint32_t IE_reg;

        // bit fields
        struct {
            __IO uint32_t CWEE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSCE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } IE_bits;
    };

} can_ccu_t;

// Peripheral CEC @ base_address=0x40006C00
typedef struct cec_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t CECEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXSOM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXEOM_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } CR_bits;
    };

    // CFGR @ offset=0x00000004
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t SFT_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXTOL_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRESTP_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BREGEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LBPEGEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRDNOGEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SFTOPT_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t OAR_bit : 15; // bit offset=16  bit width=15  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSTN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR_bits;
    };

    // TXDR @ offset=0x00000008
    __IO uint32_t TXDR_reg;

    // RXDR @ offset=0x0000000C
    __IO uint32_t RXDR_reg;

    // ISR @ offset=0x00000010
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t RXBR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXEND_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXOVR_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBPE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LBPE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXACKE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARBLST_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXBR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXEND_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXUDR_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXERR_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXACKE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 19;
        } ISR_bits;
    };

    // IER @ offset=0x00000014
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t RXBRIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXENDIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXOVRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BREIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBPEIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LBPEIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXACKIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARBLSTIE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXBRIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXENDIE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXUDRIE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXERRIE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXACKIE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 19;
        } IER_bits;
    };

} cec_t;

// Peripheral COMP1 @ base_address=0x58003800
typedef struct comp1_t {

    // SR @ offset=0x00000000
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t C1VAL_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t C2VAL_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t C1IF_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t C2IF_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 14;
        } SR_bits;
    };

    // ICFR @ offset=0x00000004
    union {
        __IO uint32_t ICFR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 16;
            __IO uint32_t CC1IF_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC2IF_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1 : 14;
        } ICFR_bits;
    };

