minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // OR @ offset=0x00000008
    union {
        __IO uint32_t OR_reg;

        // bit fields
        struct {
            __IO uint32_t AFOP_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t OR_bit : 21; // bit offset=11  bit width=21  access=SVDAccessType.READ_WRITE
        } OR_bits;
    };

    // CFGR1 @ offset=0x0000000C
    union {
        __IO uint32_t CFGR1_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRGEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCALEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t POLARITY_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ITEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t HYST_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t PWRMODE_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t INMSEL_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t INPSEL_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 3;
            __IO uint32_t BLANKING_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6: 3;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR1_bits;
    };

    // CFGR2 @ offset=0x00000010
    union {
        __IO uint32_t CFGR2_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRGEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCALEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t POLARITY_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WINMODE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t ITEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t HYST_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t PWRMODE_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t INMSEL_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t INPSEL_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 3;
            __IO uint32_t BLANKING_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6: 3;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR2_bits;
    };

} comp1_t;

// Peripheral CRC @ base_address=0x58024C00
typedef struct crc_t {

    // DR @ offset=0x00000000
    __IO uint32_t DR_reg;

    // IDR @ offset=0x00000004
    __IO uint32_t IDR_reg;

    // CR @ offset=0x00000008
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESET_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t POLYSIZE_bit : 2; // bit offset=3  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t REV_IN_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t REV_OUT_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 24;
        } CR_bits;
    };

    __IO uint8_t RESERVED0[4];

    // INIT @ offset=0x00000010
    __IO uint32_t INIT_reg;

    // POL @ offset=0x00000014
    __IO uint32_t POL_reg;

} crc_t;

// Peripheral CRS @ base_address=0x40008400
typedef struct crs_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t SYNCOKIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCWARNIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ESYNCIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AUTOTRIMEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWSYNC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TRIM_bit : 6; // bit offset=8  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 18;
        } CR_bits;
    };

    // CFGR @ offset=0x00000004
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t RELOAD_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t FELIM_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCDIV_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SYNCSRC_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SYNCPOL_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR_bits;
    };

