minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // ISR @ offset=0x00000008
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t SYNCOKF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SYNCWARNF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ERRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ESYNCF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SYNCERR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SYNCMISS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TRIMOVF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t FEDIR_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FECAP_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } ISR_bits;
    };

    // ICR @ offset=0x0000000C
    union {
        __IO uint32_t ICR_reg;

        // bit fields
        struct {
            __IO uint32_t SYNCOKC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCWARNC_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERRC_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ESYNCC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 28;
        } ICR_bits;
    };

} crs_t;

// Peripheral DAC @ base_address=0x40007400
typedef struct dac_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEN1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSEL1_bit : 3; // bit offset=2  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t WAVE1_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MAMP1_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAEN1_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAUDRIE1_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CEN1_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t EN2_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEN2_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSEL2_bit : 3; // bit offset=18  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t WAVE2_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MAMP2_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAEN2_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAUDRIE2_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CEN2_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 1;
        } CR_bits;
    };

    // SWTRGR @ offset=0x00000004
    union {
        __IO uint32_t SWTRGR_reg;

        // bit fields
        struct {
            __IO uint32_t SWTRIG1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SWTRIG2_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 30;
        } SWTRGR_bits;
    };

    // DHR12R1 @ offset=0x00000008
    __IO uint32_t DHR12R1_reg;

    // DHR12L1 @ offset=0x0000000C
    __IO uint32_t DHR12L1_reg;

    // DHR8R1 @ offset=0x00000010
    __IO uint32_t DHR8R1_reg;

    // DHR12R2 @ offset=0x00000014
    __IO uint32_t DHR12R2_reg;

    // DHR12L2 @ offset=0x00000018
    __IO uint32_t DHR12L2_reg;

    // DHR8R2 @ offset=0x0000001C
    __IO uint32_t DHR8R2_reg;

    // DHR12RD @ offset=0x00000020
    union {
        __IO uint32_t DHR12RD_reg;

        // bit fields
        struct {
            __IO uint32_t DACC1DHR_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t DACC2DHR_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } DHR12RD_bits;
    };

    // DHR12LD @ offset=0x00000024
    union {
        __IO uint32_t DHR12LD_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t DACC1DHR_bit : 12; // bit offset=4  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t DACC2DHR_bit : 12; // bit offset=20  bit width=12  access=SVDAccessType.READ_WRITE
        } DHR12LD_bits;
    };

    // DHR8RD @ offset=0x00000028
    union {
        __IO uint32_t DHR8RD_reg;

        // bit fields
        struct {
            __IO uint32_t DACC1DHR_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DACC2DHR_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } DHR8RD_bits;
    };

    // DOR1 @ offset=0x0000002C
    __IO uint32_t DOR1_reg;

    // DOR2 @ offset=0x00000030
    __IO uint32_t DOR2_reg;

    // SR @ offset=0x00000034
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t DMAUDR1_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CAL_FLAG1_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BWST1_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 13;
            __IO uint32_t DMAUDR2_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CAL_FLAG2_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BWST2_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } SR_bits;
    };

    // CCR @ offset=0x00000038
    union {
        __IO uint32_t CCR_reg;

        // bit fields
        struct {
            __IO uint32_t OTRIM1_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t OTRIM2_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 11;
        } CCR_bits;
    };

    // MCR @ offset=0x0000003C
    union {
        __IO uint32_t MCR_reg;

        // bit fields
        struct {
            __IO uint32_t MODE1_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t MODE2_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 13;
        } MCR_bits;
    };

    // SHSR1 @ offset=0x00000040
    __IO uint32_t SHSR1_reg;

    // SHSR2 @ offset=0x00000044
    __IO uint32_t SHSR2_reg;

    // SHHR @ offset=0x00000048
    union {
        __IO uint32_t SHHR_reg;

        // bit fields
        struct {
            __IO uint32_t THOLD1_bit : 10; // bit offset=0  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 6;
            __IO uint32_t THOLD2_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 6;
        } SHHR_bits;
    };

    // SHRR @ offset=0x0000004C
    union {
        __IO uint32_t SHRR_reg;

        // bit fields
        struct {
            __IO uint32_t TREFRESH1_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t TREFRESH2_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } SHRR_bits;
    };

} dac_t;

// Peripheral DBGMCU @ base_address=0x5C001000
typedef struct dbgmcu_t {

    // IDC @ offset=0x00000000
    union {
        __IO uint32_t IDC_reg;

        // bit fields
        struct {
            __IO uint32_t DEV_ID_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t REV_ID_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } IDC_bits;
    };

    // CR @ offset=0x00000004
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t DBGSLEEP_D1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBGSTOP_D1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBGSTBY_D1_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBGSLEEP_D2_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBGSTOP_D2_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBGSTBY_D2_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DBGSTOP_D3_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBGSTBY_D3_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 11;
            __IO uint32_t TRACECLKEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t D1DBGCKEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t D3DBGCKEN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 5;
            __IO uint32_t TRGOEN_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 3;
        } CR_bits;
    };

    __IO uint8_t RESERVED0[44];

    // APB3FZ1 @ offset=0x00000034
    __IO uint32_t APB3FZ1_reg;

    __IO uint8_t RESERVED1[4];

