minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // APB1LFZ1 @ offset=0x0000003C
    union {
        __IO uint32_t APB1LFZ1_reg;

        // bit fields
        struct {
            __IO uint32_t DBG_TIM2_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM3_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM4_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM5_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM6_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM7_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM12_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM13_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM14_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_LPTIM1_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t DBG_I2C1_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_I2C2_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_I2C3_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } APB1LFZ1_bits;
    };

    __IO uint8_t RESERVED2[12];

    // APB2FZ1 @ offset=0x0000004C
    union {
        __IO uint32_t APB2FZ1_reg;

        // bit fields
        struct {
            __IO uint32_t DBG_TIM1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM8_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t DBG_TIM15_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM16_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_TIM17_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 10;
            __IO uint32_t DBG_HRTIM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 2;
        } APB2FZ1_bits;
    };

    __IO uint8_t RESERVED3[4];

    // APB4FZ1 @ offset=0x00000054
    union {
        __IO uint32_t APB4FZ1_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t DBG_I2C4_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DBG_LPTIM2_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_LPTIM3_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_LPTIM4_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBG_LPTIM5_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t DBG_RTC_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DBG_IWDG1_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 13;
        } APB4FZ1_bits;
    };

} dbgmcu_t;

// Peripheral DCMI @ base_address=0x48020000
typedef struct dcmi_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t CAPTURE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CROP_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JPEG_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ESS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PCKPOL_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSPOL_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSPOL_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FCRC_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t EDM_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ENABLE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t BSM_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t OEBS_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OELS_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 11;
        } CR_bits;
    };

    // SR @ offset=0x00000004
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t HSYNC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VSYNC_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FNE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 29;
        } SR_bits;
    };

