minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // RIS @ offset=0x00000008
    union {
        __IO uint32_t RIS_reg;

        // bit fields
        struct {
            __IO uint32_t FRAME_RIS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_RIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ERR_RIS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VSYNC_RIS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LINE_RIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 27;
        } RIS_bits;
    };

    // IER @ offset=0x0000000C
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t FRAME_IE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVR_IE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERR_IE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSYNC_IE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LINE_IE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 27;
        } IER_bits;
    };

    // MIS @ offset=0x00000010
    union {
        __IO uint32_t MIS_reg;

        // bit fields
        struct {
            __IO uint32_t FRAME_MIS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_MIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ERR_MIS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VSYNC_MIS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LINE_MIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 27;
        } MIS_bits;
    };

    // ICR @ offset=0x00000014
    union {
        __IO uint32_t ICR_reg;

        // bit fields
        struct {
            __IO uint32_t FRAME_ISC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t OVR_ISC_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ERR_ISC_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t VSYNC_ISC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t LINE_ISC_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 27;
        } ICR_bits;
    };

    // ESCR @ offset=0x00000018
    union {
        __IO uint32_t ESCR_reg;

        // bit fields
        struct {
            __IO uint32_t FSC_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSC_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t LEC_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t FEC_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } ESCR_bits;
    };

    // ESUR @ offset=0x0000001C
    union {
        __IO uint32_t ESUR_reg;

        // bit fields
        struct {
            __IO uint32_t FSU_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSU_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t LEU_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t FEU_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } ESUR_bits;
    };

    // CWSTRT @ offset=0x00000020
    union {
        __IO uint32_t CWSTRT_reg;

        // bit fields
        struct {
            __IO uint32_t HOFFCNT_bit : 14; // bit offset=0  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t VST_bit : 13; // bit offset=16  bit width=13  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 3;
        } CWSTRT_bits;
    };

    // CWSIZE @ offset=0x00000024
    union {
        __IO uint32_t CWSIZE_reg;

        // bit fields
        struct {
            __IO uint32_t CAPCNT_bit : 14; // bit offset=0  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t VLINE_bit : 14; // bit offset=16  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 2;
        } CWSIZE_bits;
    };

    // DR @ offset=0x00000028
    union {
        __IO uint32_t DR_reg;

        // bit fields
        struct {
            __IO uint32_t BYTE0_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t BYTE1_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t BYTE2_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t BYTE3_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_ONLY
        } DR_bits;
    };

} dcmi_t;

// Peripheral DELAY_Block_QUADSPI @ base_address=0x52006000
typedef struct delay_block_quadspi_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t DEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } CR_bits;
    };

    // CFGR @ offset=0x00000004
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t SEL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t UNIT_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t LNG_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t LNGF_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR_bits;
    };

} delay_block_quadspi_t;

// Peripheral DELAY_Block_SDMMC1 @ base_address=0x52008000
typedef struct delay_block_sdmmc1_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t DEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } CR_bits;
    };

    // CFGR @ offset=0x00000004
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t SEL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t UNIT_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t LNG_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t LNGF_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR_bits;
    };

} delay_block_sdmmc1_t;

// Peripheral DELAY_Block_SDMMC2 @ base_address=0x48022800
typedef struct delay_block_sdmmc2_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t DEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } CR_bits;
    };

    // CFGR @ offset=0x00000004
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t SEL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t UNIT_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t LNG_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t LNGF_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFGR_bits;
    };

