minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
} delay_block_sdmmc2_t;

// Peripheral DFSDM @ base_address=0x40017000
typedef struct dfsdm_t {

    // DFSDM_CHCFG0R1 @ offset=0x00000000
    union {
        __IO uint32_t DFSDM_CHCFG0R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG0R1_bits;
    };

    // DFSDM_CHCFG1R1 @ offset=0x00000004
    union {
        __IO uint32_t DFSDM_CHCFG1R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG1R1_bits;
    };

    // DFSDM_CHCFG2R1 @ offset=0x00000008
    union {
        __IO uint32_t DFSDM_CHCFG2R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG2R1_bits;
    };

    // DFSDM_CHCFG3R1 @ offset=0x0000000C
    union {
        __IO uint32_t DFSDM_CHCFG3R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG3R1_bits;
    };

    // DFSDM_CHCFG4R1 @ offset=0x00000010
    union {
        __IO uint32_t DFSDM_CHCFG4R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG4R1_bits;
    };

    // DFSDM_CHCFG5R1 @ offset=0x00000014
    union {
        __IO uint32_t DFSDM_CHCFG5R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG5R1_bits;
    };

    // DFSDM_CHCFG6R1 @ offset=0x00000018
    union {
        __IO uint32_t DFSDM_CHCFG6R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG6R1_bits;
    };

    // DFSDM_CHCFG7R1 @ offset=0x0000001C
    union {
        __IO uint32_t DFSDM_CHCFG7R1_reg;

        // bit fields
        struct {
            __IO uint32_t SITP_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPICKSEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SCDEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHINSEL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DATMPX_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATPACK_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKOUTDIV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 6;
            __IO uint32_t CKOUTSRC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DFSDMEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG7R1_bits;
    };

    // DFSDM_CHCFG0R2 @ offset=0x00000020
    union {
        __IO uint32_t DFSDM_CHCFG0R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG0R2_bits;
    };

    // DFSDM_CHCFG1R2 @ offset=0x00000024
    union {
        __IO uint32_t DFSDM_CHCFG1R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG1R2_bits;
    };

