minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DFSDM_CHCFG2R2 @ offset=0x00000028
    union {
        __IO uint32_t DFSDM_CHCFG2R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG2R2_bits;
    };

    // DFSDM_CHCFG3R2 @ offset=0x0000002C
    union {
        __IO uint32_t DFSDM_CHCFG3R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG3R2_bits;
    };

    // DFSDM_CHCFG4R2 @ offset=0x00000030
    union {
        __IO uint32_t DFSDM_CHCFG4R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG4R2_bits;
    };

    // DFSDM_CHCFG5R2 @ offset=0x00000034
    union {
        __IO uint32_t DFSDM_CHCFG5R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG5R2_bits;
    };

    // DFSDM_CHCFG6R2 @ offset=0x00000038
    union {
        __IO uint32_t DFSDM_CHCFG6R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG6R2_bits;
    };

    // DFSDM_CHCFG7R2 @ offset=0x0000003C
    union {
        __IO uint32_t DFSDM_CHCFG7R2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DTRBS_bit : 5; // bit offset=3  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFFSET_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM_CHCFG7R2_bits;
    };

    // DFSDM_AWSCD0R @ offset=0x00000040
    union {
        __IO uint32_t DFSDM_AWSCD0R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD0R_bits;
    };

    // DFSDM_AWSCD1R @ offset=0x00000044
    union {
        __IO uint32_t DFSDM_AWSCD1R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD1R_bits;
    };

    // DFSDM_AWSCD2R @ offset=0x00000048
    union {
        __IO uint32_t DFSDM_AWSCD2R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD2R_bits;
    };

    // DFSDM_AWSCD3R @ offset=0x0000004C
    union {
        __IO uint32_t DFSDM_AWSCD3R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD3R_bits;
    };

    // DFSDM_AWSCD4R @ offset=0x00000050
    union {
        __IO uint32_t DFSDM_AWSCD4R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD4R_bits;
    };

