minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DFSDM_AWSCD5R @ offset=0x00000054
    union {
        __IO uint32_t DFSDM_AWSCD5R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD5R_bits;
    };

    // DFSDM_AWSCD6R @ offset=0x00000058
    union {
        __IO uint32_t DFSDM_AWSCD6R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD6R_bits;
    };

    // DFSDM_AWSCD7R @ offset=0x0000005C
    union {
        __IO uint32_t DFSDM_AWSCD7R_reg;

        // bit fields
        struct {
            __IO uint32_t SCDT_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BKSCD_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFOSR_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t AWFORD_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DFSDM_AWSCD7R_bits;
    };

    // DFSDM_CHWDAT0R @ offset=0x00000060
    __IO uint32_t DFSDM_CHWDAT0R_reg;

    // DFSDM_CHWDAT1R @ offset=0x00000064
    __IO uint32_t DFSDM_CHWDAT1R_reg;

    // DFSDM_CHWDAT2R @ offset=0x00000068
    __IO uint32_t DFSDM_CHWDAT2R_reg;

    // DFSDM_CHWDAT3R @ offset=0x0000006C
    __IO uint32_t DFSDM_CHWDAT3R_reg;

    // DFSDM_CHWDAT4R @ offset=0x00000070
    __IO uint32_t DFSDM_CHWDAT4R_reg;

    // DFSDM_CHWDAT5R @ offset=0x00000074
    __IO uint32_t DFSDM_CHWDAT5R_reg;

    // DFSDM_CHWDAT6R @ offset=0x00000078
    __IO uint32_t DFSDM_CHWDAT6R_reg;

    // DFSDM_CHWDAT7R @ offset=0x0000007C
    __IO uint32_t DFSDM_CHWDAT7R_reg;

    // DFSDM_CHDATIN0R @ offset=0x00000080
    union {
        __IO uint32_t DFSDM_CHDATIN0R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN0R_bits;
    };

    // DFSDM_CHDATIN1R @ offset=0x00000084
    union {
        __IO uint32_t DFSDM_CHDATIN1R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN1R_bits;
    };

    // DFSDM_CHDATIN2R @ offset=0x00000088
    union {
        __IO uint32_t DFSDM_CHDATIN2R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN2R_bits;
    };

    // DFSDM_CHDATIN3R @ offset=0x0000008C
    union {
        __IO uint32_t DFSDM_CHDATIN3R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN3R_bits;
    };

    // DFSDM_CHDATIN4R @ offset=0x00000090
    union {
        __IO uint32_t DFSDM_CHDATIN4R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN4R_bits;
    };

    // DFSDM_CHDATIN5R @ offset=0x00000094
    union {
        __IO uint32_t DFSDM_CHDATIN5R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN5R_bits;
    };

    // DFSDM_CHDATIN6R @ offset=0x00000098
    union {
        __IO uint32_t DFSDM_CHDATIN6R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN6R_bits;
    };

    // DFSDM_CHDATIN7R @ offset=0x0000009C
    union {
        __IO uint32_t DFSDM_CHDATIN7R_reg;

        // bit fields
        struct {
            __IO uint32_t INDAT0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INDAT1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } DFSDM_CHDATIN7R_bits;
    };

    // DFSDM0_CR1 @ offset=0x000000A0
    union {
        __IO uint32_t DFSDM0_CR1_reg;

        // bit fields
        struct {
            __IO uint32_t DFEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JSWSTART_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t JSYNC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JSCAN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JDMAEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t JEXTSEL_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t JEXTEN_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t RSWSTART_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RCONT_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSYNC_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t RDMAEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 2;
            __IO uint32_t RCH_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 2;
            __IO uint32_t FAST_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWFSEL_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6 : 1;
        } DFSDM0_CR1_bits;
    };

