minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DFSDM1_CR2 @ offset=0x000000B4
    union {
        __IO uint32_t DFSDM1_CR2_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t REOCIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JOVRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ROVRIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWDIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCDIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t EXCH_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWDCH_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } DFSDM1_CR2_bits;
    };

    // DFSDM2_CR2 @ offset=0x000000B8
    union {
        __IO uint32_t DFSDM2_CR2_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t REOCIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JOVRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ROVRIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWDIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCDIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t EXCH_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWDCH_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } DFSDM2_CR2_bits;
    };

    // DFSDM3_CR2 @ offset=0x000000BC
    union {
        __IO uint32_t DFSDM3_CR2_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t REOCIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JOVRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ROVRIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWDIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCDIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKABIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t EXCH_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWDCH_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } DFSDM3_CR2_bits;
    };

    // DFSDM0_ISR @ offset=0x000000C0
    union {
        __IO uint32_t DFSDM0_ISR_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t REOCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWDF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t JCIP_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RCIP_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t SCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_ONLY
        } DFSDM0_ISR_bits;
    };

    // DFSDM1_ISR @ offset=0x000000C4
    union {
        __IO uint32_t DFSDM1_ISR_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t REOCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWDF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t JCIP_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RCIP_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t SCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_ONLY
        } DFSDM1_ISR_bits;
    };

    // DFSDM2_ISR @ offset=0x000000C8
    union {
        __IO uint32_t DFSDM2_ISR_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t REOCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWDF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t JCIP_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RCIP_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t SCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_ONLY
        } DFSDM2_ISR_bits;
    };

    // DFSDM3_ISR @ offset=0x000000CC
    union {
        __IO uint32_t DFSDM3_ISR_reg;

        // bit fields
        struct {
            __IO uint32_t JEOCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t REOCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t JOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWDF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t JCIP_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RCIP_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t SCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_ONLY
        } DFSDM3_ISR_bits;
    };

    // DFSDM0_ICR @ offset=0x000000D0
    union {
        __IO uint32_t DFSDM0_ICR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CLRJOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 12;
            __IO uint32_t CLRCKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRSCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } DFSDM0_ICR_bits;
    };

    // DFSDM1_ICR @ offset=0x000000D4
    union {
        __IO uint32_t DFSDM1_ICR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CLRJOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 12;
            __IO uint32_t CLRCKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRSCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } DFSDM1_ICR_bits;
    };

    // DFSDM2_ICR @ offset=0x000000D8
    union {
        __IO uint32_t DFSDM2_ICR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CLRJOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 12;
            __IO uint32_t CLRCKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRSCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } DFSDM2_ICR_bits;
    };

    // DFSDM3_ICR @ offset=0x000000DC
    union {
        __IO uint32_t DFSDM3_ICR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CLRJOVRF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRROVRF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 12;
            __IO uint32_t CLRCKABF_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRSCDF_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } DFSDM3_ICR_bits;
    };

    // DFSDM0_JCHGR @ offset=0x000000E0
    __IO uint32_t DFSDM0_JCHGR_reg;

    // DFSDM1_JCHGR @ offset=0x000000E4
    __IO uint32_t DFSDM1_JCHGR_reg;

    // DFSDM2_JCHGR @ offset=0x000000E8
    __IO uint32_t DFSDM2_JCHGR_reg;

