minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DFSDM3_JCHGR @ offset=0x000000EC
    __IO uint32_t DFSDM3_JCHGR_reg;

    // DFSDM0_FCR @ offset=0x000000F0
    union {
        __IO uint32_t DFSDM0_FCR_reg;

        // bit fields
        struct {
            __IO uint32_t IOSR_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t FOSR_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t FORD_bit : 3; // bit offset=29  bit width=3  access=SVDAccessType.READ_WRITE
        } DFSDM0_FCR_bits;
    };

    // DFSDM1_FCR @ offset=0x000000F4
    union {
        __IO uint32_t DFSDM1_FCR_reg;

        // bit fields
        struct {
            __IO uint32_t IOSR_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t FOSR_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t FORD_bit : 3; // bit offset=29  bit width=3  access=SVDAccessType.READ_WRITE
        } DFSDM1_FCR_bits;
    };

    // DFSDM2_FCR @ offset=0x000000F8
    union {
        __IO uint32_t DFSDM2_FCR_reg;

        // bit fields
        struct {
            __IO uint32_t IOSR_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t FOSR_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t FORD_bit : 3; // bit offset=29  bit width=3  access=SVDAccessType.READ_WRITE
        } DFSDM2_FCR_bits;
    };

    // DFSDM3_FCR @ offset=0x000000FC
    union {
        __IO uint32_t DFSDM3_FCR_reg;

        // bit fields
        struct {
            __IO uint32_t IOSR_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t FOSR_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t FORD_bit : 3; // bit offset=29  bit width=3  access=SVDAccessType.READ_WRITE
        } DFSDM3_FCR_bits;
    };

    // DFSDM0_JDATAR @ offset=0x00000100
    union {
        __IO uint32_t DFSDM0_JDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t JDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t JDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM0_JDATAR_bits;
    };

    // DFSDM1_JDATAR @ offset=0x00000104
    union {
        __IO uint32_t DFSDM1_JDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t JDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t JDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM1_JDATAR_bits;
    };

    // DFSDM2_JDATAR @ offset=0x00000108
    union {
        __IO uint32_t DFSDM2_JDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t JDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t JDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM2_JDATAR_bits;
    };

    // DFSDM3_JDATAR @ offset=0x0000010C
    union {
        __IO uint32_t DFSDM3_JDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t JDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t JDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM3_JDATAR_bits;
    };

    // DFSDM0_RDATAR @ offset=0x00000110
    union {
        __IO uint32_t DFSDM0_RDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t RDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RPEND_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t RDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM0_RDATAR_bits;
    };

    // DFSDM1_RDATAR @ offset=0x00000114
    union {
        __IO uint32_t DFSDM1_RDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t RDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RPEND_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t RDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM1_RDATAR_bits;
    };

    // DFSDM2_RDATAR @ offset=0x00000118
    union {
        __IO uint32_t DFSDM2_RDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t RDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RPEND_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t RDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM2_RDATAR_bits;
    };

    // DFSDM3_RDATAR @ offset=0x0000011C
    union {
        __IO uint32_t DFSDM3_RDATAR_reg;

        // bit fields
        struct {
            __IO uint32_t RDATACH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RPEND_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t RDATA_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM3_RDATAR_bits;
    };

