minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DFSDM0_AWHTR @ offset=0x00000120
    union {
        __IO uint32_t DFSDM0_AWHTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWH_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWHT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM0_AWHTR_bits;
    };

    // DFSDM1_AWHTR @ offset=0x00000124
    union {
        __IO uint32_t DFSDM1_AWHTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWH_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWHT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM1_AWHTR_bits;
    };

    // DFSDM2_AWHTR @ offset=0x00000128
    union {
        __IO uint32_t DFSDM2_AWHTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWH_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWHT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM2_AWHTR_bits;
    };

    // DFSDM3_AWHTR @ offset=0x0000012C
    union {
        __IO uint32_t DFSDM3_AWHTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWH_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWHT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM3_AWHTR_bits;
    };

    // DFSDM0_AWLTR @ offset=0x00000130
    union {
        __IO uint32_t DFSDM0_AWLTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWLT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM0_AWLTR_bits;
    };

    // DFSDM1_AWLTR @ offset=0x00000134
    union {
        __IO uint32_t DFSDM1_AWLTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWLT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM1_AWLTR_bits;
    };

    // DFSDM2_AWLTR @ offset=0x00000138
    union {
        __IO uint32_t DFSDM2_AWLTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWLT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM2_AWLTR_bits;
    };

    // DFSDM3_AWLTR @ offset=0x0000013C
    union {
        __IO uint32_t DFSDM3_AWLTR_reg;

        // bit fields
        struct {
            __IO uint32_t BKAWL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t AWLT_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_WRITE
        } DFSDM3_AWLTR_bits;
    };

    // DFSDM0_AWSR @ offset=0x00000140
    union {
        __IO uint32_t DFSDM0_AWSR_reg;

        // bit fields
        struct {
            __IO uint32_t AWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } DFSDM0_AWSR_bits;
    };

    // DFSDM1_AWSR @ offset=0x00000144
    union {
        __IO uint32_t DFSDM1_AWSR_reg;

        // bit fields
        struct {
            __IO uint32_t AWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } DFSDM1_AWSR_bits;
    };

    // DFSDM2_AWSR @ offset=0x00000148
    union {
        __IO uint32_t DFSDM2_AWSR_reg;

        // bit fields
        struct {
            __IO uint32_t AWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } DFSDM2_AWSR_bits;
    };

    // DFSDM3_AWSR @ offset=0x0000014C
    union {
        __IO uint32_t DFSDM3_AWSR_reg;

        // bit fields
        struct {
            __IO uint32_t AWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t AWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } DFSDM3_AWSR_bits;
    };

    // DFSDM0_AWCFR @ offset=0x00000150
    union {
        __IO uint32_t DFSDM0_AWCFR_reg;

        // bit fields
        struct {
            __IO uint32_t CLRAWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRAWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } DFSDM0_AWCFR_bits;
    };

    // DFSDM1_AWCFR @ offset=0x00000154
    union {
        __IO uint32_t DFSDM1_AWCFR_reg;

        // bit fields
        struct {
            __IO uint32_t CLRAWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRAWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } DFSDM1_AWCFR_bits;
    };

    // DFSDM2_AWCFR @ offset=0x00000158
    union {
        __IO uint32_t DFSDM2_AWCFR_reg;

        // bit fields
        struct {
            __IO uint32_t CLRAWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRAWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } DFSDM2_AWCFR_bits;
    };

