minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DFSDM3_AWCFR @ offset=0x0000015C
    union {
        __IO uint32_t DFSDM3_AWCFR_reg;

        // bit fields
        struct {
            __IO uint32_t CLRAWLTF_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLRAWHTF_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } DFSDM3_AWCFR_bits;
    };

    // DFSDM0_EXMAX @ offset=0x00000160
    union {
        __IO uint32_t DFSDM0_EXMAX_reg;

        // bit fields
        struct {
            __IO uint32_t EXMAXCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMAX_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM0_EXMAX_bits;
    };

    // DFSDM1_EXMAX @ offset=0x00000164
    union {
        __IO uint32_t DFSDM1_EXMAX_reg;

        // bit fields
        struct {
            __IO uint32_t EXMAXCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMAX_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM1_EXMAX_bits;
    };

    // DFSDM2_EXMAX @ offset=0x00000168
    union {
        __IO uint32_t DFSDM2_EXMAX_reg;

        // bit fields
        struct {
            __IO uint32_t EXMAXCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMAX_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM2_EXMAX_bits;
    };

    // DFSDM3_EXMAX @ offset=0x0000016C
    union {
        __IO uint32_t DFSDM3_EXMAX_reg;

        // bit fields
        struct {
            __IO uint32_t EXMAXCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMAX_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM3_EXMAX_bits;
    };

    // DFSDM0_EXMIN @ offset=0x00000170
    union {
        __IO uint32_t DFSDM0_EXMIN_reg;

        // bit fields
        struct {
            __IO uint32_t EXMINCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMIN_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM0_EXMIN_bits;
    };

    // DFSDM1_EXMIN @ offset=0x00000174
    union {
        __IO uint32_t DFSDM1_EXMIN_reg;

        // bit fields
        struct {
            __IO uint32_t EXMINCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMIN_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM1_EXMIN_bits;
    };

    // DFSDM2_EXMIN @ offset=0x00000178
    union {
        __IO uint32_t DFSDM2_EXMIN_reg;

        // bit fields
        struct {
            __IO uint32_t EXMINCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMIN_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM2_EXMIN_bits;
    };

    // DFSDM3_EXMIN @ offset=0x0000017C
    union {
        __IO uint32_t DFSDM3_EXMIN_reg;

        // bit fields
        struct {
            __IO uint32_t EXMINCH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t EXMIN_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
        } DFSDM3_EXMIN_bits;
    };

    // DFSDM0_CNVTIMR @ offset=0x00000180
    __IO uint32_t DFSDM0_CNVTIMR_reg;

    // DFSDM1_CNVTIMR @ offset=0x00000184
    __IO uint32_t DFSDM1_CNVTIMR_reg;

    // DFSDM2_CNVTIMR @ offset=0x00000188
    __IO uint32_t DFSDM2_CNVTIMR_reg;

    // DFSDM3_CNVTIMR @ offset=0x0000018C
    __IO uint32_t DFSDM3_CNVTIMR_reg;

} dfsdm_t;

// Peripheral DMA1 @ base_address=0x40020000
typedef struct dma1_t {

    // LISR @ offset=0x00000000
    union {
        __IO uint32_t LISR_reg;

        // bit fields
        struct {
            __IO uint32_t FEIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DMEIF0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF0_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DMEIF1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF1_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF1_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF1_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t FEIF2_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DMEIF2_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF2_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF2_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF2_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF3_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t DMEIF3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF3_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF3_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF3_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED5 : 4;
        } LISR_bits;
    };

    // HISR @ offset=0x00000004
    union {
        __IO uint32_t HISR_reg;

        // bit fields
        struct {
            __IO uint32_t FEIF4_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DMEIF4_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF4_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF5_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DMEIF5_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF5_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF5_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF5_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t FEIF6_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DMEIF6_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF6_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF6_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF6_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF7_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t DMEIF7_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF7_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF7_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF7_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED5 : 4;
        } HISR_bits;
    };

    // LIFCR @ offset=0x00000008
    union {
        __IO uint32_t LIFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CFEIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CDMEIF0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF0_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CDMEIF1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF1_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF1_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF1_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t CFEIF2_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t CDMEIF2_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF2_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF2_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF2_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF3_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t CDMEIF3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF3_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF3_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF3_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5 : 4;
        } LIFCR_bits;
    };

    // HIFCR @ offset=0x0000000C
    union {
        __IO uint32_t HIFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CFEIF4_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CDMEIF4_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF4_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF5_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CDMEIF5_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF5_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF5_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF5_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t CFEIF6_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t CDMEIF6_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF6_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF6_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF6_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF7_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t CDMEIF7_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF7_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF7_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF7_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5 : 4;
        } HIFCR_bits;
    };

    dma_stream_x_cfg_t DMA_Stream_x_Cfg[8];
} dma1_t;

// Peripheral DMA2 @ base_address=0x40020400
typedef struct dma2_t {

