minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // LISR @ offset=0x00000000
    union {
        __IO uint32_t LISR_reg;

        // bit fields
        struct {
            __IO uint32_t FEIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DMEIF0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF0_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DMEIF1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF1_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF1_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF1_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t FEIF2_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DMEIF2_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF2_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF2_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF2_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF3_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t DMEIF3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF3_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF3_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF3_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED5 : 4;
        } LISR_bits;
    };

    // HISR @ offset=0x00000004
    union {
        __IO uint32_t HISR_reg;

        // bit fields
        struct {
            __IO uint32_t FEIF4_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DMEIF4_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF4_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF5_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DMEIF5_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF5_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF5_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF5_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t FEIF6_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DMEIF6_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF6_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF6_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF6_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FEIF7_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t DMEIF7_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEIF7_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HTIF7_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF7_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED5 : 4;
        } HISR_bits;
    };

    // LIFCR @ offset=0x00000008
    union {
        __IO uint32_t LIFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CFEIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CDMEIF0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF0_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CDMEIF1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF1_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF1_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF1_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t CFEIF2_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t CDMEIF2_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF2_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF2_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF2_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF3_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t CDMEIF3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF3_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF3_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF3_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5 : 4;
        } LIFCR_bits;
    };

    // HIFCR @ offset=0x0000000C
    union {
        __IO uint32_t HIFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CFEIF4_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CDMEIF4_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF4_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF5_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CDMEIF5_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF5_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF5_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF5_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t CFEIF6_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t CDMEIF6_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF6_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF6_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF6_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CFEIF7_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t CDMEIF7_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTEIF7_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHTIF7_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF7_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5 : 4;
        } HIFCR_bits;
    };

    dma_stream_x_cfg_t DMA_Stream_x_Cfg[8];
} dma2_t;

// Peripheral DMA2D @ base_address=0x52001000
typedef struct dma2d_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t START_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SUSP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ABORT_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t TEIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TWIE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CAEIE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CEIE_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t MODE_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 14;
        } CR_bits;
    };

    // ISR @ offset=0x00000004
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TEIF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TWIF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CAEIF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTCIF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CEIF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 26;
        } ISR_bits;
    };

    // IFCR @ offset=0x00000008
    union {
        __IO uint32_t IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEIF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTWIF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CAECIF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCTCIF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCEIF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 26;
        } IFCR_bits;
    };

    // FGMAR @ offset=0x0000000C
    __IO uint32_t FGMAR_reg;

    // FGOR @ offset=0x00000010
    __IO uint32_t FGOR_reg;

    // BGMAR @ offset=0x00000014
    __IO uint32_t BGMAR_reg;

