minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // BGOR @ offset=0x00000018
    __IO uint32_t BGOR_reg;

    // FGPFCCR @ offset=0x0000001C
    union {
        __IO uint32_t FGPFCCR_reg;

        // bit fields
        struct {
            __IO uint32_t CM_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCM_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t START_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CS_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t AM_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSS_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t AI_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t ALPHA_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } FGPFCCR_bits;
    };

    // FGCOLR @ offset=0x00000020
    union {
        __IO uint32_t FGCOLR_reg;

        // bit fields
        struct {
            __IO uint32_t BLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t GREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 8;
        } FGCOLR_bits;
    };

    // BGPFCCR @ offset=0x00000024
    union {
        __IO uint32_t BGPFCCR_reg;

        // bit fields
        struct {
            __IO uint32_t CM_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCM_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t START_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CS_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t AM_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t AI_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t ALPHA_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } BGPFCCR_bits;
    };

    // BGCOLR @ offset=0x00000028
    union {
        __IO uint32_t BGCOLR_reg;

        // bit fields
        struct {
            __IO uint32_t BLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t GREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 8;
        } BGCOLR_bits;
    };

    // FGCMAR @ offset=0x0000002C
    __IO uint32_t FGCMAR_reg;

    // BGCMAR @ offset=0x00000030
    __IO uint32_t BGCMAR_reg;

    // OPFCCR @ offset=0x00000034
    union {
        __IO uint32_t OPFCCR_reg;

        // bit fields
        struct {
            __IO uint32_t CM_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 17;
            __IO uint32_t AI_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 10;
        } OPFCCR_bits;
    };

    // OCOLR @ offset=0x00000038
    union {
        __IO uint32_t OCOLR_reg;

        // bit fields
        struct {
            __IO uint32_t BLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t GREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t ALPHA_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } OCOLR_bits;
    };

    // OMAR @ offset=0x0000003C
    __IO uint32_t OMAR_reg;

    // OOR @ offset=0x00000040
    __IO uint32_t OOR_reg;

    // NLR @ offset=0x00000044
    union {
        __IO uint32_t NLR_reg;

        // bit fields
        struct {
            __IO uint32_t NL_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 14; // bit offset=16  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } NLR_bits;
    };

    // LWR @ offset=0x00000048
    __IO uint32_t LWR_reg;

    // AMTCR @ offset=0x0000004C
    union {
        __IO uint32_t AMTCR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t DT_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } AMTCR_bits;
    };

} dma2d_t;

// Peripheral DMAMUX1 @ base_address=0x40020800
typedef struct dmamux1_t {

    dmamux_cxcr_reg_t DMAMUX_CxCR_Reg[16];
    __IO uint8_t RESERVED0[128];

    // DMAMUX_CSR @ offset=0x00000080
    union {
        __IO uint32_t DMAMUX_CSR_reg;

        // bit fields
        struct {
            __IO uint32_t SOF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOF15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } DMAMUX_CSR_bits;
    };

    // DMAMUX_CFR @ offset=0x00000084
    union {
        __IO uint32_t DMAMUX_CFR_reg;

        // bit fields
        struct {
            __IO uint32_t CSOF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CSOF15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 16;
        } DMAMUX_CFR_bits;
    };

    __IO uint8_t RESERVED1[120];

    // DMAMUX_RG0CR @ offset=0x00000100
    union {
        __IO uint32_t DMAMUX_RG0CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG0CR_bits;
    };

    // DMAMUX_RG1CR @ offset=0x00000104
    union {
        __IO uint32_t DMAMUX_RG1CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG1CR_bits;
    };

