minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DMAMUX_RG2CR @ offset=0x00000108
    union {
        __IO uint32_t DMAMUX_RG2CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG2CR_bits;
    };

    // DMAMUX_RG3CR @ offset=0x0000010C
    union {
        __IO uint32_t DMAMUX_RG3CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG3CR_bits;
    };

    // DMAMUX_RG4CR @ offset=0x00000110
    union {
        __IO uint32_t DMAMUX_RG4CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG4CR_bits;
    };

    // DMAMUX_RG5CR @ offset=0x00000114
    union {
        __IO uint32_t DMAMUX_RG5CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG5CR_bits;
    };

    // DMAMUX_RG6CR @ offset=0x00000118
    union {
        __IO uint32_t DMAMUX_RG6CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG6CR_bits;
    };

    // DMAMUX_RG7CR @ offset=0x0000011C
    union {
        __IO uint32_t DMAMUX_RG7CR_reg;

        // bit fields
        struct {
            __IO uint32_t SIG_ID_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t OIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t GE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GNBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 8;
        } DMAMUX_RG7CR_bits;
    };

    __IO uint8_t RESERVED2[32];

    // DMAMUX_RGSR @ offset=0x00000140
    union {
        __IO uint32_t DMAMUX_RGSR_reg;

        // bit fields
        struct {
            __IO uint32_t OF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OF7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } DMAMUX_RGSR_bits;
    };

    // DMAMUX_RGCFR @ offset=0x00000144
    union {
        __IO uint32_t DMAMUX_RGCFR_reg;

        // bit fields
        struct {
            __IO uint32_t COF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COF7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 24;
        } DMAMUX_RGCFR_bits;
    };

