minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
} dmamux1_t;

// Peripheral DMAMUX2 @ base_address=0x58025800
typedef struct dmamux2_t {

    // C0CR @ offset=0x00000000
    union {
        __IO uint32_t C0CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C0CR_bits;
    };

    // C1CR @ offset=0x00000004
    union {
        __IO uint32_t C1CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C1CR_bits;
    };

    // C2CR @ offset=0x00000008
    union {
        __IO uint32_t C2CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C2CR_bits;
    };

    // C3CR @ offset=0x0000000C
    union {
        __IO uint32_t C3CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C3CR_bits;
    };

    // C4CR @ offset=0x00000010
    union {
        __IO uint32_t C4CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C4CR_bits;
    };

    // C5CR @ offset=0x00000014
    union {
        __IO uint32_t C5CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C5CR_bits;
    };

    // C6CR @ offset=0x00000018
    union {
        __IO uint32_t C6CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C6CR_bits;
    };

    // C7CR @ offset=0x0000001C
    union {
        __IO uint32_t C7CR_reg;

        // bit fields
        struct {
            __IO uint32_t DMAREQ_ID_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SOIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPOL_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBREQ_bit : 5; // bit offset=19  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_ID_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } C7CR_bits;
    };

