minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // CPUIMR1 @ offset=0x00000080
    union {
        __IO uint32_t CPUIMR1_reg;

        // bit fields
        struct {
            __IO uint32_t MR0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR22_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR23_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR24_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR25_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR26_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR27_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR28_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR29_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR30_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR31_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CPUIMR1_bits;
    };

    // CPUEMR1 @ offset=0x00000084
    union {
        __IO uint32_t CPUEMR1_reg;

        // bit fields
        struct {
            __IO uint32_t MR0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR22_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR23_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR24_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR25_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR26_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR27_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR28_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR29_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR30_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR31_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CPUEMR1_bits;
    };

    // CPUPR1 @ offset=0x00000088
    union {
        __IO uint32_t CPUPR1_reg;

        // bit fields
        struct {
            __IO uint32_t PR0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PR21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 10;
        } CPUPR1_bits;
    };

    __IO uint8_t RESERVED4[4];

    // CPUIMR2 @ offset=0x00000090
    union {
        __IO uint32_t CPUIMR2_reg;

        // bit fields
        struct {
            __IO uint32_t MR0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t MR14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR22_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR23_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR24_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR25_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR26_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR27_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR28_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR29_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR30_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR31_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CPUIMR2_bits;
    };

    // CPUEMR2 @ offset=0x00000094
    union {
        __IO uint32_t CPUEMR2_reg;

        // bit fields
        struct {
            __IO uint32_t MR32_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR33_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR34_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR35_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR36_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR37_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR38_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR39_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR40_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR41_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR42_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR43_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR44_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t MR46_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR47_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR48_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR49_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR50_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR51_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR52_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR53_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR54_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR55_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR56_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR57_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR58_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR59_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR60_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR61_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR62_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MR63_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CPUEMR2_bits;
    };

    // CPUPR2 @ offset=0x00000098
    union {
        __IO uint32_t CPUPR2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 17;
            __IO uint32_t PR49_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t PR51_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 12;
        } CPUPR2_bits;
    };

    __IO uint8_t RESERVED5[4];

    // CPUIMR3 @ offset=0x000000A0
    union {
        __IO uint32_t CPUIMR3_reg;

        // bit fields
        struct {
            __IO uint32_t MR64_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR65_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR66_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR67_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR68_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR69_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR70_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR71_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR72_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR73_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR74_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR75_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR76_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR77_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR78_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR79_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR80_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t MR82_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t MR84_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR85_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR86_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR87_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR88_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 7;
        } CPUIMR3_bits;
    };

    // CPUEMR3 @ offset=0x000000A4
    union {
        __IO uint32_t CPUEMR3_reg;

        // bit fields
        struct {
            __IO uint32_t MR64_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR65_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR66_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR67_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR68_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR69_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR70_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR71_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR72_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR73_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR74_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR75_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR76_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR77_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR78_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR79_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR80_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t MR82_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t MR84_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR85_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR86_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR87_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MR88_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 7;
        } CPUEMR3_bits;
    };

    // CPUPR3 @ offset=0x000000A8
    union {
        __IO uint32_t CPUPR3_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 18;
            __IO uint32_t PR82_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t PR84_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PR85_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PR86_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 9;
        } CPUPR3_bits;
    };

} exti_t;

