minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
// Peripheral Ethernet_DMA @ base_address=0x40029000
typedef struct ethernet_dma_t {

    // DMAMR @ offset=0x00000000
    union {
        __IO uint32_t DMAMR_reg;

        // bit fields
        struct {
            __IO uint32_t SWR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DA_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t TXPR_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PR_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t INTM_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 15;
        } DMAMR_bits;
    };

    // DMASBMR @ offset=0x00000004
    union {
        __IO uint32_t DMASBMR_reg;

        // bit fields
        struct {
            __IO uint32_t FB_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t AAL_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t MB_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RB_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 16;
        } DMASBMR_bits;
    };

    // DMAISR @ offset=0x00000008
    union {
        __IO uint32_t DMAISR_reg;

        // bit fields
        struct {
            __IO uint32_t DC0IS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t MTLIS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MACIS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 14;
        } DMAISR_bits;
    };

    // DMADSR @ offset=0x0000000C
    union {
        __IO uint32_t DMADSR_reg;

        // bit fields
        struct {
            __IO uint32_t AXWHSTS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t RPS0_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t TPS0_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 16;
        } DMADSR_bits;
    };

    __IO uint8_t RESERVED0[240];

    // DMACCR @ offset=0x00000100
    union {
        __IO uint32_t DMACCR_reg;

        // bit fields
        struct {
            __IO uint32_t MSS_bit : 14; // bit offset=0  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t PBLX8_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DSL_bit : 3; // bit offset=18  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 11;
        } DMACCR_bits;
    };

    // DMACTxCR @ offset=0x00000104
    union {
        __IO uint32_t DMACTXCR_reg;

        // bit fields
        struct {
            __IO uint32_t ST_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t OSF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t TSE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t TXPBL_bit : 6; // bit offset=16  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 10;
        } DMACTXCR_bits;
    };

    // DMACRxCR @ offset=0x00000108
    union {
        __IO uint32_t DMACRXCR_reg;

        // bit fields
        struct {
            __IO uint32_t SR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBSZ_bit : 14; // bit offset=1  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RXPBL_bit : 6; // bit offset=16  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 9;
            __IO uint32_t RPF_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } DMACRXCR_bits;
    };

    __IO uint8_t RESERVED1[8];

    // DMACTxDLAR @ offset=0x00000114
    __IO uint32_t DMACTXDLAR_reg;

    __IO uint8_t RESERVED2[4];

    // DMACRxDLAR @ offset=0x0000011C
    __IO uint32_t DMACRXDLAR_reg;

    // DMACTxDTPR @ offset=0x00000120
    __IO uint32_t DMACTXDTPR_reg;

    __IO uint8_t RESERVED3[4];

    // DMACRxDTPR @ offset=0x00000128
    __IO uint32_t DMACRXDTPR_reg;

    // DMACTxRLR @ offset=0x0000012C
    __IO uint32_t DMACTXRLR_reg;

    // DMACRxRLR @ offset=0x00000130
    __IO uint32_t DMACRXRLR_reg;

    // DMACIER @ offset=0x00000134
    union {
        __IO uint32_t DMACIER_reg;

        // bit fields
        struct {
            __IO uint32_t TIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXSE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TBUE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t RIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBUE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RWTE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETIE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERIE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FBEE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CDEE_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AIE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NIE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } DMACIER_bits;
    };

