minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DMACRxIWTR @ offset=0x00000138
    __IO uint32_t DMACRXIWTR_reg;

    __IO uint8_t RESERVED4[8];

    // DMACCATxDR @ offset=0x00000144
    __IO uint32_t DMACCATXDR_reg;

    __IO uint8_t RESERVED5[4];

    // DMACCARxDR @ offset=0x0000014C
    __IO uint32_t DMACCARXDR_reg;

    __IO uint8_t RESERVED6[4];

    // DMACCATxBR @ offset=0x00000154
    __IO uint32_t DMACCATXBR_reg;

    __IO uint8_t RESERVED7[4];

    // DMACCARxBR @ offset=0x0000015C
    __IO uint32_t DMACCARXBR_reg;

    // DMACSR @ offset=0x00000160
    union {
        __IO uint32_t DMACSR_reg;

        // bit fields
        struct {
            __IO uint32_t TI_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TPS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TBU_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t RI_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBU_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RPS_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RWT_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ET_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ER_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FBE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CDE_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AIS_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NIS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEB_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t REB_bit : 3; // bit offset=19  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 10;
        } DMACSR_bits;
    };

    __IO uint8_t RESERVED8[8];

    // DMACMFCR @ offset=0x0000016C
    union {
        __IO uint32_t DMACMFCR_reg;

        // bit fields
        struct {
            __IO uint32_t MFC_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t MFCO_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 16;
        } DMACMFCR_bits;
    };

} ethernet_dma_t;

// Peripheral Ethernet_MAC @ base_address=0x40028000
typedef struct ethernet_mac_t {

    // MACCR @ offset=0x00000000
    union {
        __IO uint32_t MACCR_reg;

        // bit fields
        struct {
            __IO uint32_t RE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRELEN_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DC_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BL_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCRS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DO_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECRSFD_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LM_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DM_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FES_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t JE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JD_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t WD_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACS_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CST_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t S2KP_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPSLCE_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IPG_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t IPC_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SARC_bit : 3; // bit offset=28  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARPEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACCR_bits;
    };

    // MACECR @ offset=0x00000004
    union {
        __IO uint32_t MACECR_reg;

        // bit fields
        struct {
            __IO uint32_t GPSL_bit : 14; // bit offset=0  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t DCRCC_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USP_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 5;
            __IO uint32_t EIPGEN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EIPG_bit : 5; // bit offset=25  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 2;
        } MACECR_bits;
    };

