minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MACPFR @ offset=0x00000008
    union {
        __IO uint32_t MACPFR_reg;

        // bit fields
        struct {
            __IO uint32_t PR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HUC_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HMC_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DAIF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PM_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PCF_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SAIF_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SAF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HPF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t VTFE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t IPFE_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DNTU_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 9;
            __IO uint32_t RA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACPFR_bits;
    };

    // MACWTR @ offset=0x0000000C
    union {
        __IO uint32_t MACWTR_reg;

        // bit fields
        struct {
            __IO uint32_t WTO_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PWE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 23;
        } MACWTR_bits;
    };

    // MACHT0R @ offset=0x00000010
    __IO uint32_t MACHT0R_reg;

    // MACHT1R @ offset=0x00000014
    __IO uint32_t MACHT1R_reg;

    __IO uint8_t RESERVED0[56];

    // MACVTR @ offset=0x00000050
    union {
        __IO uint32_t MACVTR_reg;

        // bit fields
        struct {
            __IO uint32_t VL_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETV_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VTIM_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ESVL_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERSVLM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DOVLTC_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EVLS_bit : 2; // bit offset=21  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t EVLRXS_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VTHM_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EDVLP_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERIVLT_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EIVLS_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t EIVLRXS_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACVTR_bits;
    };

    __IO uint8_t RESERVED1[4];

    // MACVHTR @ offset=0x00000058
    __IO uint32_t MACVHTR_reg;

    __IO uint8_t RESERVED2[4];

    // MACVIR @ offset=0x00000060
    union {
        __IO uint32_t MACVIR_reg;

        // bit fields
        struct {
            __IO uint32_t VLT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t VLC_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t VLP_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSVL_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VLTI_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 11;
        } MACVIR_bits;
    };

    // MACIVIR @ offset=0x00000064
    union {
        __IO uint32_t MACIVIR_reg;

        // bit fields
        struct {
            __IO uint32_t VLT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t VLC_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t VLP_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSVL_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VLTI_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 11;
        } MACIVIR_bits;
    };

    __IO uint8_t RESERVED3[8];

    // MACQTxFCR @ offset=0x00000070
    union {
        __IO uint32_t MACQTXFCR_reg;

        // bit fields
        struct {
            __IO uint32_t FCB_BPA_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TFE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t PLT_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DZPQ_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 8;
            __IO uint32_t PT_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MACQTXFCR_bits;
    };

    __IO uint8_t RESERVED4[28];

    // MACRxFCR @ offset=0x00000090
    union {
        __IO uint32_t MACRXFCR_reg;

        // bit fields
        struct {
            __IO uint32_t RFE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } MACRXFCR_bits;
    };

