minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    __IO uint8_t RESERVED5[28];

    // MACISR @ offset=0x000000B0
    union {
        __IO uint32_t MACISR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t PHYIS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PMTIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LPIIS_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t MMCIS_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MMCRXIS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MMCTXIS_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t TSIS_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXSTSIS_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RXSTSIS_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 17;
        } MACISR_bits;
    };

    // MACIER @ offset=0x000000B4
    union {
        __IO uint32_t MACIER_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t PHYIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PMTIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPIIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t TSIE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXSTSIE_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXSTSIE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 17;
        } MACIER_bits;
    };

    // MACRxTxSR @ offset=0x000000B8
    union {
        __IO uint32_t MACRXTXSR_reg;

        // bit fields
        struct {
            __IO uint32_t TJT_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NCARR_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LCARR_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EXDEF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LCOL_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EXCOL_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t RWT_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 23;
        } MACRXTXSR_bits;
    };

    __IO uint8_t RESERVED6[4];

    // MACPCSR @ offset=0x000000C0
    union {
        __IO uint32_t MACPCSR_reg;

        // bit fields
        struct {
            __IO uint32_t PWRDWN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MGKPKTEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RWKPKTEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t MGKPRCVD_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RWKPRCVD_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t GLBLUCAST_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RWKPFE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 13;
            __IO uint32_t RWKPTR_bit : 5; // bit offset=24  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t RWKFILTRST_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACPCSR_bits;
    };

    // MACRWKPFR @ offset=0x000000C4
    __IO uint32_t MACRWKPFR_reg;

    __IO uint8_t RESERVED7[8];

    // MACLCSR @ offset=0x000000D0
    union {
        __IO uint32_t MACLCSR_reg;

        // bit fields
        struct {
            __IO uint32_t TLPIEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TLPIEX_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RLPIEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RLPIEX_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t TLPIST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RLPIST_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t LPIEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLSEN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPITXA_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPITE_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 11;
        } MACLCSR_bits;
    };

    // MACLTCR @ offset=0x000000D4
    union {
        __IO uint32_t MACLTCR_reg;

        // bit fields
        struct {
            __IO uint32_t TWT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t LST_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 6;
        } MACLTCR_bits;
    };

    // MACLETR @ offset=0x000000D8
    __IO uint32_t MACLETR_reg;

    // MAC1USTCR @ offset=0x000000DC
    __IO uint32_t MAC1USTCR_reg;

    __IO uint8_t RESERVED8[48];

    // MACVR @ offset=0x00000110
    union {
        __IO uint32_t MACVR_reg;

        // bit fields
        struct {
            __IO uint32_t SNPSVER_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t USERVER_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } MACVR_bits;
    };

    // MACDR @ offset=0x00000114
    union {
        __IO uint32_t MACDR_reg;

        // bit fields
        struct {
            __IO uint32_t RPESTS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RFCFCSTS_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t TPESTS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TFCSTS_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 13;
        } MACDR_bits;
    };

    __IO uint8_t RESERVED9[8];

