minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MACHWF1R @ offset=0x00000120
    union {
        __IO uint32_t MACHWF1R_reg;

        // bit fields
        struct {
            __IO uint32_t RXFIFOSIZE_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TXFIFOSIZE_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t OSTEN_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PTOEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ADVTHWORD_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ADDR64_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t DCBEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SPHEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TSOEN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t DBGMEMA_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AVSEL_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t HASHTBLSZ_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t L3L4FNUM_bit : 4; // bit offset=27  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 1;
        } MACHWF1R_bits;
    };

    // MACHWF2R @ offset=0x00000124
    union {
        __IO uint32_t MACHWF2R_reg;

        // bit fields
        struct {
            __IO uint32_t RXQCNT_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t TXQCNT_bit : 4; // bit offset=6  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t RXCHCNT_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t TXCHCNT_bit : 4; // bit offset=18  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t PPSOUTNUM_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t AUXSNAPNUM_bit : 3; // bit offset=28  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED5 : 1;
        } MACHWF2R_bits;
    };

    __IO uint8_t RESERVED10[216];

    // MACMDIOAR @ offset=0x00000200
    union {
        __IO uint32_t MACMDIOAR_reg;

        // bit fields
        struct {
            __IO uint32_t MB_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t C45E_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GOC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SKAP_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t CR_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t NTC_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t RDA_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t PA_bit : 5; // bit offset=21  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t BTB_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSE_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 4;
        } MACMDIOAR_bits;
    };

    // MACMDIODR @ offset=0x00000204
    union {
        __IO uint32_t MACMDIODR_reg;

        // bit fields
        struct {
            __IO uint32_t MD_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RA_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MACMDIODR_bits;
    };

    __IO uint8_t RESERVED11[248];

    // MACA0HR @ offset=0x00000300
    union {
        __IO uint32_t MACA0HR_reg;

        // bit fields
        struct {
            __IO uint32_t ADDRHI_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t AE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } MACA0HR_bits;
    };

    // MACA0LR @ offset=0x00000304
    __IO uint32_t MACA0LR_reg;

    // MACA1HR @ offset=0x00000308
    union {
        __IO uint32_t MACA1HR_reg;

        // bit fields
        struct {
            __IO uint32_t ADDRHI_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t MBC_bit : 6; // bit offset=24  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t SA_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACA1HR_bits;
    };

    // MACA1LR @ offset=0x0000030C
    __IO uint32_t MACA1LR_reg;

    // MACA2HR @ offset=0x00000310
    union {
        __IO uint32_t MACA2HR_reg;

        // bit fields
        struct {
            __IO uint32_t ADDRHI_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t MBC_bit : 6; // bit offset=24  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t SA_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACA2HR_bits;
    };

    // MACA2LR @ offset=0x00000314
    __IO uint32_t MACA2LR_reg;

    // MACA3HR @ offset=0x00000318
    union {
        __IO uint32_t MACA3HR_reg;

        // bit fields
        struct {
            __IO uint32_t ADDRHI_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t MBC_bit : 6; // bit offset=24  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t SA_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACA3HR_bits;
    };

    // MACA3LR @ offset=0x0000031C
    __IO uint32_t MACA3LR_reg;

    __IO uint8_t RESERVED12[992];

    // MMC_CONTROL @ offset=0x00000700
    union {
        __IO uint32_t MMC_CONTROL_reg;

        // bit fields
        struct {
            __IO uint32_t CNTRST_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNTSTOPRO_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSTONRD_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNTFREEZ_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNTPRST_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNTPRSTLVL_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t UCDBC_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 23;
        } MMC_CONTROL_bits;
    };

