minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MMC_RX_INTERRUPT @ offset=0x00000704
    union {
        __IO uint32_t MMC_RX_INTERRUPT_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t RXCRCERPIS_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RXALGNERPIS_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 10;
            __IO uint32_t RXUCGPIS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 8;
            __IO uint32_t RXLPIUSCIS_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RXLPITRCIS_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 4;
        } MMC_RX_INTERRUPT_bits;
    };

    // MMC_TX_INTERRUPT @ offset=0x00000708
    union {
        __IO uint32_t MMC_TX_INTERRUPT_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t TXSCOLGPIS_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXMCOLGPIS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 5;
            __IO uint32_t TXGPKTIS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t TXLPIUSCIS_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXLPITRCIS_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 4;
        } MMC_TX_INTERRUPT_bits;
    };

    // MMC_RX_INTERRUPT_MASK @ offset=0x0000070C
    union {
        __IO uint32_t MMC_RX_INTERRUPT_MASK_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t RXCRCERPIM_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXALGNERPIM_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 10;
            __IO uint32_t RXUCGPIM_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 8;
            __IO uint32_t RXLPIUSCIM_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXLPITRCIM_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 4;
        } MMC_RX_INTERRUPT_MASK_bits;
    };

    // MMC_TX_INTERRUPT_MASK @ offset=0x00000710
    union {
        __IO uint32_t MMC_TX_INTERRUPT_MASK_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t TXSCOLGPIM_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXMCOLGPIM_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 5;
            __IO uint32_t TXGPKTIM_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t TXLPIUSCIM_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXLPITRCIM_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 4;
        } MMC_TX_INTERRUPT_MASK_bits;
    };

    __IO uint8_t RESERVED13[56];

    // TX_SINGLE_COLLISION_GOOD_PACKETS @ offset=0x0000074C
    __IO uint32_t TX_SINGLE_COLLISION_GOOD_PACKETS_reg;

    // TX_MULTIPLE_COLLISION_GOOD_PACKETS @ offset=0x00000750
    __IO uint32_t TX_MULTIPLE_COLLISION_GOOD_PACKETS_reg;

    __IO uint8_t RESERVED14[20];

    // TX_PACKET_COUNT_GOOD @ offset=0x00000768
    __IO uint32_t TX_PACKET_COUNT_GOOD_reg;

    __IO uint8_t RESERVED15[40];

    // RX_CRC_ERROR_PACKETS @ offset=0x00000794
    __IO uint32_t RX_CRC_ERROR_PACKETS_reg;

    // RX_ALIGNMENT_ERROR_PACKETS @ offset=0x00000798
    __IO uint32_t RX_ALIGNMENT_ERROR_PACKETS_reg;

    __IO uint8_t RESERVED16[40];

    // RX_UNICAST_PACKETS_GOOD @ offset=0x000007C4
    __IO uint32_t RX_UNICAST_PACKETS_GOOD_reg;

    __IO uint8_t RESERVED17[36];

    // TX_LPI_USEC_CNTR @ offset=0x000007EC
    __IO uint32_t TX_LPI_USEC_CNTR_reg;

    // TX_LPI_TRAN_CNTR @ offset=0x000007F0
    __IO uint32_t TX_LPI_TRAN_CNTR_reg;

    // RX_LPI_USEC_CNTR @ offset=0x000007F4
    __IO uint32_t RX_LPI_USEC_CNTR_reg;

    // RX_LPI_TRAN_CNTR @ offset=0x000007F8
    __IO uint32_t RX_LPI_TRAN_CNTR_reg;

    __IO uint8_t RESERVED18[260];

    // MACL3L4C0R @ offset=0x00000900
    union {
        __IO uint32_t MACL3L4C0R_reg;

        // bit fields
        struct {
            __IO uint32_t L3PEN0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t L3SAM0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3SAIM0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3DAM0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3DAIM0_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3HSBM0_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3HDBM0_bit : 5; // bit offset=11  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4PEN0_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t L4SPM0_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4SPIM0_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4DPM0_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4DPIM0_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 10;
        } MACL3L4C0R_bits;
    };

    // MACL4A0R @ offset=0x00000904
    union {
        __IO uint32_t MACL4A0R_reg;

        // bit fields
        struct {
            __IO uint32_t L4SP0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4DP0_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MACL4A0R_bits;
    };

    __IO uint8_t RESERVED19[8];

    // MACL3A00R @ offset=0x00000910
    __IO uint32_t MACL3A00R_reg;

    // MACL3A10R @ offset=0x00000914
    __IO uint32_t MACL3A10R_reg;

