minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MACL3A20 @ offset=0x00000918
    __IO uint32_t MACL3A20_reg;

    // MACL3A30 @ offset=0x0000091C
    __IO uint32_t MACL3A30_reg;

    __IO uint8_t RESERVED20[16];

    // MACL3L4C1R @ offset=0x00000930
    union {
        __IO uint32_t MACL3L4C1R_reg;

        // bit fields
        struct {
            __IO uint32_t L3PEN1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t L3SAM1_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3SAIM1_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3DAM1_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3DAIM1_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3HSBM1_bit : 5; // bit offset=6  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t L3HDBM1_bit : 5; // bit offset=11  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4PEN1_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t L4SPM1_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4SPIM1_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4DPM1_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4DPIM1_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 10;
        } MACL3L4C1R_bits;
    };

    // MACL4A1R @ offset=0x00000934
    union {
        __IO uint32_t MACL4A1R_reg;

        // bit fields
        struct {
            __IO uint32_t L4SP1_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t L4DP1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MACL4A1R_bits;
    };

    __IO uint8_t RESERVED21[8];

    // MACL3A01R @ offset=0x00000940
    __IO uint32_t MACL3A01R_reg;

    // MACL3A11R @ offset=0x00000944
    __IO uint32_t MACL3A11R_reg;

    // MACL3A21R @ offset=0x00000948
    __IO uint32_t MACL3A21R_reg;

    // MACL3A31R @ offset=0x0000094C
    __IO uint32_t MACL3A31R_reg;

    __IO uint8_t RESERVED22[400];

    // MACARPAR @ offset=0x00000AE0
    __IO uint32_t MACARPAR_reg;

    __IO uint8_t RESERVED23[28];

    // MACTSCR @ offset=0x00000B00
    union {
        __IO uint32_t MACTSCR_reg;

        // bit fields
        struct {
            __IO uint32_t TSENA_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSCFUPDT_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSINIT_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSUPDT_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TSADDREG_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t TSENALL_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSCTRLSSR_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSVER2ENA_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSIPENA_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSIPV6ENA_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSIPV4ENA_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSEVNTENA_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSMSTRENA_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNAPTYPSEL_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSENMACADDR_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSC_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t TXTSSTSM_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 7;
        } MACTSCR_bits;
    };

    // MACSSIR @ offset=0x00000B04
    union {
        __IO uint32_t MACSSIR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t SNSINC_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSINC_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } MACSSIR_bits;
    };

    // MACSTSR @ offset=0x00000B08
    __IO uint32_t MACSTSR_reg;

    // MACSTNR @ offset=0x00000B0C
    __IO uint32_t MACSTNR_reg;

    // MACSTSUR @ offset=0x00000B10
    __IO uint32_t MACSTSUR_reg;

    // MACSTNUR @ offset=0x00000B14
    union {
        __IO uint32_t MACSTNUR_reg;

        // bit fields
        struct {
            __IO uint32_t TSSS_bit : 31; // bit offset=0  bit width=31  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDSUB_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACSTNUR_bits;
    };

    // MACTSAR @ offset=0x00000B18
    __IO uint32_t MACTSAR_reg;

    __IO uint8_t RESERVED24[4];

    // MACTSSR @ offset=0x00000B20
    union {
        __IO uint32_t MACTSSR_reg;

        // bit fields
        struct {
            __IO uint32_t TSSOVF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TSTARGT0_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AUXTSTRIG_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TSTRGTERR0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t TXTSSIS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ATSSTN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t ATSSTM_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ATSNS_bit : 5; // bit offset=25  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 2;
        } MACTSSR_bits;
    };

    __IO uint8_t RESERVED25[12];

