minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MACTxTSSNR @ offset=0x00000B30
    union {
        __IO uint32_t MACTXTSSNR_reg;

        // bit fields
        struct {
            __IO uint32_t TXTSSLO_bit : 31; // bit offset=0  bit width=31  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXTSSMIS_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } MACTXTSSNR_bits;
    };

    // MACTxTSSSR @ offset=0x00000B34
    __IO uint32_t MACTXTSSSR_reg;

    __IO uint8_t RESERVED26[8];

    // MACACR @ offset=0x00000B40
    union {
        __IO uint32_t MACACR_reg;

        // bit fields
        struct {
            __IO uint32_t ATSFC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t ATSEN0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ATSEN1_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ATSEN2_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ATSEN3_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 24;
        } MACACR_bits;
    };

    __IO uint8_t RESERVED27[4];

    // MACATSNR @ offset=0x00000B48
    __IO uint32_t MACATSNR_reg;

    // MACATSSR @ offset=0x00000B4C
    __IO uint32_t MACATSSR_reg;

    // MACTSIACR @ offset=0x00000B50
    __IO uint32_t MACTSIACR_reg;

    // MACTSEACR @ offset=0x00000B54
    __IO uint32_t MACTSEACR_reg;

    // MACTSICNR @ offset=0x00000B58
    __IO uint32_t MACTSICNR_reg;

    // MACTSECNR @ offset=0x00000B5C
    __IO uint32_t MACTSECNR_reg;

    __IO uint8_t RESERVED28[16];

    // MACPPSCR @ offset=0x00000B70
    union {
        __IO uint32_t MACPPSCR_reg;

        // bit fields
        struct {
            __IO uint32_t PPSCTRL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t PPSEN0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGTMODSEL0_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 25;
        } MACPPSCR_bits;
    };

    __IO uint8_t RESERVED29[12];

    // MACPPSTTSR @ offset=0x00000B80
    __IO uint32_t MACPPSTTSR_reg;

    // MACPPSTTNR @ offset=0x00000B84
    union {
        __IO uint32_t MACPPSTTNR_reg;

        // bit fields
        struct {
            __IO uint32_t TTSL0_bit : 31; // bit offset=0  bit width=31  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGTBUSY0_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MACPPSTTNR_bits;
    };

    // MACPPSIR @ offset=0x00000B88
    __IO uint32_t MACPPSIR_reg;

    // MACPPSWR @ offset=0x00000B8C
    __IO uint32_t MACPPSWR_reg;

    __IO uint8_t RESERVED30[48];

    // MACPOCR @ offset=0x00000BC0
    union {
        __IO uint32_t MACPOCR_reg;

        // bit fields
        struct {
            __IO uint32_t PTOEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ASYNCEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t APDREQEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t ASYNCTRIG_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t APDREQTRIG_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DRRDIS_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 16;
        } MACPOCR_bits;
    };

    // MACSPI0R @ offset=0x00000BC4
    __IO uint32_t MACSPI0R_reg;

    // MACSPI1R @ offset=0x00000BC8
    __IO uint32_t MACSPI1R_reg;

    // MACSPI2R @ offset=0x00000BCC
    __IO uint32_t MACSPI2R_reg;

    // MACLMIR @ offset=0x00000BD0
    union {
        __IO uint32_t MACLMIR_reg;

        // bit fields
        struct {
            __IO uint32_t LSI_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DRSYNCR_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t LMPDRI_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } MACLMIR_bits;
    };

} ethernet_mac_t;

// Peripheral Ethernet_MTL @ base_address=0x40028C00
typedef struct ethernet_mtl_t {

    // MTLOMR @ offset=0x00000000
    union {
        __IO uint32_t MTLOMR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DTXSTS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t CNTPRST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNTCLR_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 22;
        } MTLOMR_bits;
    };

    __IO uint8_t RESERVED0[28];

    // MTLISR @ offset=0x00000020
    __IO uint32_t MTLISR_reg;

    __IO uint8_t RESERVED1[220];

    // MTLTxQOMR @ offset=0x00000100
    union {
        __IO uint32_t MTLTXQOMR_reg;

        // bit fields
        struct {
            __IO uint32_t FTQ_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXQEN_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t TTC_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t TQS_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 13;
        } MTLTXQOMR_bits;
    };

    // MTLTxQUR @ offset=0x00000104
    union {
        __IO uint32_t MTLTXQUR_reg;

        // bit fields
        struct {
            __IO uint32_t UFFRMCNT_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_ONLY
            __IO uint32_t UFCNTOVF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 20;
        } MTLTXQUR_bits;
    };

    // MTLTxQDR @ offset=0x00000108
    union {
        __IO uint32_t MTLTXQDR_reg;

        // bit fields
        struct {
            __IO uint32_t TXQPAUSED_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TRCSTS_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t TWCSTS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXQSTS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXSTSFSTS_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t PTXQ_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t STXSTSF_bit : 3; // bit offset=20  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 9;
        } MTLTXQDR_bits;
    };

    __IO uint8_t RESERVED2[32];

    // MTLQICSR @ offset=0x0000012C
    union {
        __IO uint32_t MTLQICSR_reg;

        // bit fields
        struct {
            __IO uint32_t TXUNFIS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t TXUIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t RXOVFIS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t RXOIE_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 7;
        } MTLQICSR_bits;
    };

