minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MTLRxQOMR @ offset=0x00000130
    union {
        __IO uint32_t MTLRXQOMR_reg;

        // bit fields
        struct {
            __IO uint32_t RTC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t FUP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FEP_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIS_TCP_EF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EHFC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RFA_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t RFD_bit : 3; // bit offset=14  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t RQS_bit : 3; // bit offset=20  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 9;
        } MTLRXQOMR_bits;
    };

    // MTLRxQMPOCR @ offset=0x00000134
    union {
        __IO uint32_t MTLRXQMPOCR_reg;

        // bit fields
        struct {
            __IO uint32_t OVFPKTCNT_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVFCNTOVF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t MISPKTCNT_bit : 11; // bit offset=16  bit width=11  access=SVDAccessType.READ_ONLY
            __IO uint32_t MISCNTOVF_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 4;
        } MTLRXQMPOCR_bits;
    };

    // MTLRxQDR @ offset=0x00000138
    union {
        __IO uint32_t MTLRXQDR_reg;

        // bit fields
        struct {
            __IO uint32_t RWCSTS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RRCSTS_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RXQSTS_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 10;
            __IO uint32_t PRXQ_bit : 14; // bit offset=16  bit width=14  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 2;
        } MTLRXQDR_bits;
    };

} ethernet_mtl_t;

// Peripheral FDCAN1 @ base_address=0x4000A000
typedef struct fdcan1_t {

    // FDCAN_CREL @ offset=0x00000000
    union {
        __IO uint32_t FDCAN_CREL_reg;

        // bit fields
        struct {
            __IO uint32_t DAY_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MON_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t YEAR_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t SUBSTEP_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t STEP_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t REL_bit : 4; // bit offset=28  bit width=4  access=SVDAccessType.READ_ONLY
        } FDCAN_CREL_bits;
    };

    // FDCAN_ENDN @ offset=0x00000004
    __IO uint32_t FDCAN_ENDN_reg;

    __IO uint8_t RESERVED0[4];

    // FDCAN_DBTP @ offset=0x0000000C
    union {
        __IO uint32_t FDCAN_DBTP_reg;

        // bit fields
        struct {
            __IO uint32_t DSJW_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t DTSEG2_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t DTSEG1_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DBRP_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t TDC_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 8;
        } FDCAN_DBTP_bits;
    };

    // FDCAN_TEST @ offset=0x00000010
    union {
        __IO uint32_t FDCAN_TEST_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t LBCK_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TX_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RX_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 24;
        } FDCAN_TEST_bits;
    };

    // FDCAN_RWD @ offset=0x00000014
    union {
        __IO uint32_t FDCAN_RWD_reg;

        // bit fields
        struct {
            __IO uint32_t WDC_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t WDV_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } FDCAN_RWD_bits;
    };

    // FDCAN_CCCR @ offset=0x00000018
    union {
        __IO uint32_t FDCAN_CCCR_reg;

        // bit fields
        struct {
            __IO uint32_t INIT_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ASM_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSA_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MON_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DAR_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEST_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FDOE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BSE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t PXHD_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EFBI_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXP_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NISO_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } FDCAN_CCCR_bits;
    };

