minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // FDCAN_GFC @ offset=0x00000080
    union {
        __IO uint32_t FDCAN_GFC_reg;

        // bit fields
        struct {
            __IO uint32_t RRFE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RRFS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ANFE_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ANFS_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 26;
        } FDCAN_GFC_bits;
    };

    // FDCAN_SIDFC @ offset=0x00000084
    union {
        __IO uint32_t FDCAN_SIDFC_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t FLSSA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSS_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } FDCAN_SIDFC_bits;
    };

    // FDCAN_XIDFC @ offset=0x00000088
    union {
        __IO uint32_t FDCAN_XIDFC_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t FLESA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSE_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } FDCAN_XIDFC_bits;
    };

    __IO uint8_t RESERVED4[4];

    // FDCAN_XIDAM @ offset=0x00000090
    __IO uint32_t FDCAN_XIDAM_reg;

    // FDCAN_HPMS @ offset=0x00000094
    union {
        __IO uint32_t FDCAN_HPMS_reg;

        // bit fields
        struct {
            __IO uint32_t BIDX_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_ONLY
            __IO uint32_t MSI_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t FIDX_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t FLST_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } FDCAN_HPMS_bits;
    };

    // FDCAN_NDAT1 @ offset=0x00000098
    union {
        __IO uint32_t FDCAN_NDAT1_reg;

        // bit fields
        struct {
            __IO uint32_t ND0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND22_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND23_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND24_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND25_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND26_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND27_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND28_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND29_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND30_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND31_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } FDCAN_NDAT1_bits;
    };

    // FDCAN_NDAT2 @ offset=0x0000009C
    union {
        __IO uint32_t FDCAN_NDAT2_reg;

        // bit fields
        struct {
            __IO uint32_t ND32_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND33_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND34_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND35_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND36_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND37_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND38_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND39_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND40_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND41_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND42_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND43_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND44_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND45_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND46_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND47_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND48_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND49_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND50_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND51_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND52_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND53_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND54_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND55_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND56_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND57_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND58_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND59_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND60_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND61_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND62_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ND63_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } FDCAN_NDAT2_bits;
    };

    // FDCAN_RXF0C @ offset=0x000000A0
    union {
        __IO uint32_t FDCAN_RXF0C_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t F0SA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t F0S_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t F0WM_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } FDCAN_RXF0C_bits;
    };

