minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // FDCAN_RXF0S @ offset=0x000000A4
    union {
        __IO uint32_t FDCAN_RXF0S_reg;

        // bit fields
        struct {
            __IO uint32_t F0FL_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t F0G_bit : 6; // bit offset=8  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t F0P_bit : 6; // bit offset=16  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t F0F_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RF0L_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 6;
        } FDCAN_RXF0S_bits;
    };

    // FDCAN_RXF0A @ offset=0x000000A8
    __IO uint32_t FDCAN_RXF0A_reg;

    // FDCAN_RXBC @ offset=0x000000AC
    __IO uint32_t FDCAN_RXBC_reg;

    // FDCAN_RXF1C @ offset=0x000000B0
    union {
        __IO uint32_t FDCAN_RXF1C_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t F1SA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t F1S_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t F1WM_bit : 7; // bit offset=24  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 1;
        } FDCAN_RXF1C_bits;
    };

    // FDCAN_RXF1S @ offset=0x000000B4
    union {
        __IO uint32_t FDCAN_RXF1S_reg;

        // bit fields
        struct {
            __IO uint32_t F1FL_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t F1GI_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t F1PI_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t F1F_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RF1L_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 4;
            __IO uint32_t DMS_bit : 2; // bit offset=30  bit width=2  access=SVDAccessType.READ_WRITE
        } FDCAN_RXF1S_bits;
    };

    // FDCAN_RXF1A @ offset=0x000000B8
    __IO uint32_t FDCAN_RXF1A_reg;

    // FDCAN_RXESC @ offset=0x000000BC
    union {
        __IO uint32_t FDCAN_RXESC_reg;

        // bit fields
        struct {
            __IO uint32_t F0DS_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t F1DS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t RBDS_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 21;
        } FDCAN_RXESC_bits;
    };

    // FDCAN_TXBC @ offset=0x000000C0
    union {
        __IO uint32_t FDCAN_TXBC_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t TBSA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t NDTB_bit : 6; // bit offset=16  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t TFQS_bit : 6; // bit offset=24  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t TFQM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 1;
        } FDCAN_TXBC_bits;
    };

    // FDCAN_TXFQS @ offset=0x000000C4
    union {
        __IO uint32_t FDCAN_TXFQS_reg;

        // bit fields
        struct {
            __IO uint32_t TFFL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t TFGI_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t TFQPI_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_ONLY
            __IO uint32_t TFQF_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 10;
        } FDCAN_TXFQS_bits;
    };

    // FDCAN_TXESC @ offset=0x000000C8
    __IO uint32_t FDCAN_TXESC_reg;

    // FDCAN_TXBRP @ offset=0x000000CC
    __IO uint32_t FDCAN_TXBRP_reg;

    // FDCAN_TXBAR @ offset=0x000000D0
    __IO uint32_t FDCAN_TXBAR_reg;

    // FDCAN_TXBCR @ offset=0x000000D4
    __IO uint32_t FDCAN_TXBCR_reg;

    // FDCAN_TXBTO @ offset=0x000000D8
    __IO uint32_t FDCAN_TXBTO_reg;

    // FDCAN_TXBCF @ offset=0x000000DC
    __IO uint32_t FDCAN_TXBCF_reg;

    // FDCAN_TXBTIE @ offset=0x000000E0
    __IO uint32_t FDCAN_TXBTIE_reg;

    // FDCAN_TXBCIE @ offset=0x000000E4
    __IO uint32_t FDCAN_TXBCIE_reg;

    __IO uint8_t RESERVED5[8];

    // FDCAN_TXEFC @ offset=0x000000F0
    union {
        __IO uint32_t FDCAN_TXEFC_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t EFSA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t EFS_bit : 6; // bit offset=16  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t EFWM_bit : 6; // bit offset=24  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 2;
        } FDCAN_TXEFC_bits;
    };

    // FDCAN_TXEFS @ offset=0x000000F4
    union {
        __IO uint32_t FDCAN_TXEFS_reg;

        // bit fields
        struct {
            __IO uint32_t EFFL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t EFGI_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t EFPI_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t EFF_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEFL_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 6;
        } FDCAN_TXEFS_bits;
    };

    // FDCAN_TXEFA @ offset=0x000000F8
    __IO uint32_t FDCAN_TXEFA_reg;

    __IO uint8_t RESERVED6[4];

    // FDCAN_TTTMC @ offset=0x00000100
    union {
        __IO uint32_t FDCAN_TTTMC_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t TMSA_bit : 14; // bit offset=2  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t TME_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 9;
        } FDCAN_TTTMC_bits;
    };

    // FDCAN_TTRMC @ offset=0x00000104
    union {
        __IO uint32_t FDCAN_TTRMC_reg;

        // bit fields
        struct {
            __IO uint32_t RID_bit : 29; // bit offset=0  bit width=29  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t XTD_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RMPS_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } FDCAN_TTRMC_bits;
    };

    // FDCAN_TTOCF @ offset=0x00000108
    union {
        __IO uint32_t FDCAN_TTOCF_reg;

        // bit fields
        struct {
            __IO uint32_t OM_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t GEN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TM_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LDSDL_bit : 3; // bit offset=5  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t IRTO_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t EECS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWL_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t EGTF_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECC_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EVTP_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 5;
        } FDCAN_TTOCF_bits;
    };

    // FDCAN_TTMLM @ offset=0x0000010C
    union {
        __IO uint32_t FDCAN_TTMLM_reg;

        // bit fields
        struct {
            __IO uint32_t CCM_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSS_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXEW_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t ENTT_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } FDCAN_TTMLM_bits;
    };

    // FDCAN_TURCF @ offset=0x00000110
    union {
        __IO uint32_t FDCAN_TURCF_reg;

        // bit fields
        struct {
            __IO uint32_t NCL_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DC_bit : 14; // bit offset=16  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t ELT_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } FDCAN_TURCF_bits;
    };

    // FDCAN_TTOCN @ offset=0x00000114
    union {
        __IO uint32_t FDCAN_TTOCN_reg;

        // bit fields
        struct {
            __IO uint32_t SGT_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWP_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWS_bit : 2; // bit offset=3  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RTIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TMC_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TTIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GCS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FGP_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TMG_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NIG_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ESCN_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t LCKC_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } FDCAN_TTOCN_bits;
    };

    // CAN_TTGTP @ offset=0x00000118
    union {
        __IO uint32_t CAN_TTGTP_reg;

        // bit fields
        struct {
            __IO uint32_t NCL_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTP_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CAN_TTGTP_bits;
    };

    // FDCAN_TTTMK @ offset=0x0000011C
    union {
        __IO uint32_t FDCAN_TTTMK_reg;

        // bit fields
        struct {
            __IO uint32_t TM_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t TICC_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t LCKM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } FDCAN_TTTMK_bits;
    };

