minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // FDCAN_NBTP @ offset=0x0000001C
    union {
        __IO uint32_t FDCAN_NBTP_reg;

        // bit fields
        struct {
            __IO uint32_t TSEG2_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t NTSEG1_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBRP_bit : 9; // bit offset=16  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t NSJW_bit : 7; // bit offset=25  bit width=7  access=SVDAccessType.READ_WRITE
        } FDCAN_NBTP_bits;
    };

    // FDCAN_TSCC @ offset=0x00000020
    union {
        __IO uint32_t FDCAN_TSCC_reg;

        // bit fields
        struct {
            __IO uint32_t TSS_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t TCP_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 12;
        } FDCAN_TSCC_bits;
    };

    // FDCAN_TSCV @ offset=0x00000024
    __IO uint32_t FDCAN_TSCV_reg;

    // FDCAN_TOCC @ offset=0x00000028
    union {
        __IO uint32_t FDCAN_TOCC_reg;

        // bit fields
        struct {
            __IO uint32_t ETOC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TOS_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t TOP_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } FDCAN_TOCC_bits;
    };

    // FDCAN_TOCV @ offset=0x0000002C
    __IO uint32_t FDCAN_TOCV_reg;

    __IO uint8_t RESERVED1[16];

    // FDCAN_ECR @ offset=0x00000040
    union {
        __IO uint32_t FDCAN_ECR_reg;

        // bit fields
        struct {
            __IO uint32_t TEC_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t TREC_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CEL_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 8;
        } FDCAN_ECR_bits;
    };

    // FDCAN_PSR @ offset=0x00000044
    union {
        __IO uint32_t FDCAN_PSR_reg;

        // bit fields
        struct {
            __IO uint32_t LEC_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACT_bit : 2; // bit offset=3  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t EP_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EW_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BO_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DLEC_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESI_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBRS_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t REDL_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PXE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TDCV_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 9;
        } FDCAN_PSR_bits;
    };

    // FDCAN_TDCR @ offset=0x00000048
    union {
        __IO uint32_t FDCAN_TDCR_reg;

        // bit fields
        struct {
            __IO uint32_t TDCF_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TDCO_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 17;
        } FDCAN_TDCR_bits;
    };

    __IO uint8_t RESERVED2[4];

    // FDCAN_IR @ offset=0x00000050
    union {
        __IO uint32_t FDCAN_IR_reg;

        // bit fields
        struct {
            __IO uint32_t RF0N_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF0W_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF0F_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF0L_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF1N_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF1W_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF1F_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RF1L_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HPM_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TC_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEFN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEFW_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEFF_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEFL_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TSW_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MRAF_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TOO_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t DRX_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ELO_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EP_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EW_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BO_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t WDI_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PEA_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PED_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ARA_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 2;
        } FDCAN_IR_bits;
    };

