minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // FDCAN_TTOST @ offset=0x0000012C
    union {
        __IO uint32_t FDCAN_TTOST_reg;

        // bit fields
        struct {
            __IO uint32_t EL_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MS_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYS_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t GTP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t QCS_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RTO_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 6;
            __IO uint32_t WGTD_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GFI_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TMP_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t GSI_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WFE_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AWE_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WECS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPL_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } FDCAN_TTOST_bits;
    };

    // FDCAN_TURNA @ offset=0x00000130
    __IO uint32_t FDCAN_TURNA_reg;

    // FDCAN_TTLGT @ offset=0x00000134
    union {
        __IO uint32_t FDCAN_TTLGT_reg;

        // bit fields
        struct {
            __IO uint32_t LT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t GT_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } FDCAN_TTLGT_bits;
    };

    // FDCAN_TTCTC @ offset=0x00000138
    union {
        __IO uint32_t FDCAN_TTCTC_reg;

        // bit fields
        struct {
            __IO uint32_t CT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t CC_bit : 6; // bit offset=16  bit width=6  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 10;
        } FDCAN_TTCTC_bits;
    };

    // FDCAN_TTCPT @ offset=0x0000013C
    union {
        __IO uint32_t FDCAN_TTCPT_reg;

        // bit fields
        struct {
            __IO uint32_t CT_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t SWV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } FDCAN_TTCPT_bits;
    };

    // FDCAN_TTCSM @ offset=0x00000140
    __IO uint32_t FDCAN_TTCSM_reg;

    __IO uint8_t RESERVED7[444];

    // FDCAN_TTTS @ offset=0x00000300
    union {
        __IO uint32_t FDCAN_TTTS_reg;

        // bit fields
        struct {
            __IO uint32_t SWTDEL_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t EVTSEL_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } FDCAN_TTTS_bits;
    };

} fdcan2_t;

// Peripheral FMC @ base_address=0x52004000
typedef struct fmc_t {

    // BCR1 @ offset=0x00000000
    union {
        __IO uint32_t BCR1_reg;

        // bit fields
        struct {
            __IO uint32_t MBKEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUXEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MTYP_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FACCEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BURSTEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITPOL_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t WAITCFG_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WREN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITEN_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTMOD_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ASYNCWAIT_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPSIZE_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t CBURSTRW_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCLKEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WFDIS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t BMAP_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 5;
            __IO uint32_t FMCEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } BCR1_bits;
    };

    // BTR1 @ offset=0x00000004
    union {
        __IO uint32_t BTR1_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLKDIV_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATLAT_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } BTR1_bits;
    };

    // BCR2 @ offset=0x00000008
    union {
        __IO uint32_t BCR2_reg;

        // bit fields
        struct {
            __IO uint32_t MBKEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUXEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MTYP_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FACCEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BURSTEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITPOL_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t WAITCFG_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WREN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITEN_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTMOD_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ASYNCWAIT_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPSIZE_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t CBURSTRW_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCLKEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WFDIS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t BMAP_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 5;
            __IO uint32_t FMCEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } BCR2_bits;
    };

