minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // BTR2 @ offset=0x0000000C
    union {
        __IO uint32_t BTR2_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLKDIV_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATLAT_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } BTR2_bits;
    };

    // BCR3 @ offset=0x00000010
    union {
        __IO uint32_t BCR3_reg;

        // bit fields
        struct {
            __IO uint32_t MBKEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUXEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MTYP_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FACCEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BURSTEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITPOL_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t WAITCFG_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WREN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITEN_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTMOD_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ASYNCWAIT_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPSIZE_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t CBURSTRW_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCLKEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WFDIS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t BMAP_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 5;
            __IO uint32_t FMCEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } BCR3_bits;
    };

    // BTR3 @ offset=0x00000014
    union {
        __IO uint32_t BTR3_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLKDIV_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATLAT_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } BTR3_bits;
    };

    // BCR4 @ offset=0x00000018
    union {
        __IO uint32_t BCR4_reg;

        // bit fields
        struct {
            __IO uint32_t MBKEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUXEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MTYP_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FACCEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BURSTEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITPOL_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t WAITCFG_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WREN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAITEN_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTMOD_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ASYNCWAIT_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPSIZE_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t CBURSTRW_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCLKEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WFDIS_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t BMAP_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 5;
            __IO uint32_t FMCEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } BCR4_bits;
    };

    // BTR4 @ offset=0x0000001C
    union {
        __IO uint32_t BTR4_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLKDIV_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATLAT_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 2;
        } BTR4_bits;
    };

