minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    __IO uint8_t RESERVED0[96];

    // PCR @ offset=0x00000080
    union {
        __IO uint32_t PCR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t PWAITEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PBKEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t PWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t TCLR_bit : 4; // bit offset=9  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAR_bit : 4; // bit offset=13  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCPS_bit : 3; // bit offset=17  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 12;
        } PCR_bits;
    };

    // SR @ offset=0x00000084
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t IRS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ILS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IFS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IREN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ILEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IFEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FEMPT_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 25;
        } SR_bits;
    };

    // PMEM @ offset=0x00000088
    union {
        __IO uint32_t PMEM_reg;

        // bit fields
        struct {
            __IO uint32_t MEMSET_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MEMWAIT_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MEMHOLD_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MEMHIZ_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } PMEM_bits;
    };

    // PATT @ offset=0x0000008C
    union {
        __IO uint32_t PATT_reg;

        // bit fields
        struct {
            __IO uint32_t ATTSET_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t ATTWAIT_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t ATTHOLD_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t ATTHIZ_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } PATT_bits;
    };

    __IO uint8_t RESERVED1[4];

    // ECCR @ offset=0x00000094
    __IO uint32_t ECCR_reg;

    __IO uint8_t RESERVED2[108];

    // BWTR1 @ offset=0x00000104
    union {
        __IO uint32_t BWTR1_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 2;
        } BWTR1_bits;
    };

    __IO uint8_t RESERVED3[4];

    // BWTR2 @ offset=0x0000010C
    union {
        __IO uint32_t BWTR2_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 2;
        } BWTR2_bits;
    };

    __IO uint8_t RESERVED4[4];

    // BWTR3 @ offset=0x00000114
    union {
        __IO uint32_t BWTR3_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 2;
        } BWTR3_bits;
    };

    __IO uint8_t RESERVED5[4];

    // BWTR4 @ offset=0x0000011C
    union {
        __IO uint32_t BWTR4_reg;

        // bit fields
        struct {
            __IO uint32_t ADDSET_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDHLD_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAST_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BUSTURN_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t ACCMOD_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 2;
        } BWTR4_bits;
    };

    __IO uint8_t RESERVED6[32];

    // SDCR1 @ offset=0x00000140
    union {
        __IO uint32_t SDCR1_reg;

        // bit fields
        struct {
            __IO uint32_t NC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NR_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NB_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CAS_bit : 2; // bit offset=7  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WP_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SDCLK_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBURST_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RPIPE_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 17;
        } SDCR1_bits;
    };

    // SDCR2 @ offset=0x00000144
    union {
        __IO uint32_t SDCR2_reg;

        // bit fields
        struct {
            __IO uint32_t NC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NR_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MWID_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NB_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CAS_bit : 2; // bit offset=7  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WP_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SDCLK_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RBURST_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RPIPE_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 17;
        } SDCR2_bits;
    };

    // SDTR1 @ offset=0x00000148
    union {
        __IO uint32_t SDTR1_reg;

        // bit fields
        struct {
            __IO uint32_t TMRD_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXSR_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRAS_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRC_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TWR_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRP_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRCD_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 4;
        } SDTR1_bits;
    };

