minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // SDTR2 @ offset=0x0000014C
    union {
        __IO uint32_t SDTR2_reg;

        // bit fields
        struct {
            __IO uint32_t TMRD_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXSR_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRAS_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRC_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TWR_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRP_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRCD_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 4;
        } SDTR2_bits;
    };

    // SDCMR @ offset=0x00000150
    union {
        __IO uint32_t SDCMR_reg;

        // bit fields
        struct {
            __IO uint32_t MODE_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTB2_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTB1_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NRFS_bit : 4; // bit offset=5  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t MRD_bit : 14; // bit offset=9  bit width=14  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 9;
        } SDCMR_bits;
    };

    // SDRTR @ offset=0x00000154
    union {
        __IO uint32_t SDRTR_reg;

        // bit fields
        struct {
            __IO uint32_t CRE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COUNT_bit : 13; // bit offset=1  bit width=13  access=SVDAccessType.READ_WRITE
            __IO uint32_t REIE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 17;
        } SDRTR_bits;
    };

    // SDSR @ offset=0x00000158
    union {
        __IO uint32_t SDSR_reg;

        // bit fields
        struct {
            __IO uint32_t RE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MODES1_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t MODES2_bit : 2; // bit offset=3  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 27;
        } SDSR_bits;
    };

} fmc_t;

// Peripheral Flash @ base_address=0x52002000
typedef struct flash_t {

    // ACR @ offset=0x00000000
    union {
        __IO uint32_t ACR_reg;

        // bit fields
        struct {
            __IO uint32_t LATENCY_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRHIGHFREQ_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 26;
        } ACR_bits;
    };

    // KEYR1 @ offset=0x00000004
    __IO uint32_t KEYR1_reg;

    // OPTKEYR @ offset=0x00000008
    __IO uint32_t OPTKEYR_reg;

    // CR1 @ offset=0x0000000C
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t LOCK1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PG1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SER1_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BER1_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSIZE1_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FW1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t START1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNB1_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t CRC_EN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOPIE1_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRPERRIE1_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PGSERRIE1_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STRBERRIE1_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t INCERRIE1_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPERRIE1_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDPERRIE1_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDSERRIE1_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNECCERR1_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBECCERRIE1_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRCENDIE1_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRCRDERRIE1_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 3;
        } CR1_bits;
    };

    // SR1 @ offset=0x00000010
    union {
        __IO uint32_t SR1_reg;

        // bit fields
        struct {
            __IO uint32_t BSY1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WBNE1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t QW1_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRC_BUSY1_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 12;
            __IO uint32_t EOP1_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRPERR1_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PGSERR1_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STRBERR1_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t INCERR1_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPERR1_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDPERR1_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDSERR1_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNECCERR_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBECCERR1_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRCEND1_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRCRDERR1_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 3;
        } SR1_bits;
    };

