minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // CCR1 @ offset=0x00000014
    union {
        __IO uint32_t CCR1_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 16;
            __IO uint32_t CLR_EOP1_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_WRPERR1_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_PGSERR1_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_STRBERR1_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CLR_INCERR1_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_OPERR1_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_RDPERR1_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_RDSERR1_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_SNECCERR1_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_DBECCERR1_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_CRCEND1_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLR_CRCRDERR1_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 3;
        } CCR1_bits;
    };

    // OPTCR @ offset=0x00000018
    union {
        __IO uint32_t OPTCR_reg;

        // bit fields
        struct {
            __IO uint32_t OPTLOCK_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPTSTART_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t MER_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 25;
            __IO uint32_t OPTCHANGEERRIE_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWAP_BANK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OPTCR_bits;
    };

    // OPTSR_CUR @ offset=0x0000001C
    union {
        __IO uint32_t OPTSR_CUR_reg;

        // bit fields
        struct {
            __IO uint32_t OPT_BUSY_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BOR_LEV_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG1_SW_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t NRST_STOP_D1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NRST_STBY_D1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDP_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t IWDG_FZ_STOP_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG_FZ_SDBY_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ST_RAM_SIZE_bit : 2; // bit offset=19  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SECURITY_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 7;
            __IO uint32_t IO_HSLV_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPTCHANGEERR_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWAP_BANK_OPT_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OPTSR_CUR_bits;
    };

    // OPTSR_PRG @ offset=0x00000020
    union {
        __IO uint32_t OPTSR_PRG_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t BOR_LEV_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG1_SW_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t NRST_STOP_D1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NRST_STBY_D1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDP_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t IWDG_FZ_STOP_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG_FZ_SDBY_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ST_RAM_SIZE_bit : 2; // bit offset=19  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SECURITY_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 7;
            __IO uint32_t IO_HSLV_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t SWAP_BANK_OPT_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OPTSR_PRG_bits;
    };

    // OPTCCR @ offset=0x00000024
    __IO uint32_t OPTCCR_reg;

    // PRAR_CUR1 @ offset=0x00000028
    union {
        __IO uint32_t PRAR_CUR1_reg;

        // bit fields
        struct {
            __IO uint32_t PROT_AREA_START1_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PROT_AREA_END1_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMEP1_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } PRAR_CUR1_bits;
    };

    // PRAR_PRG1 @ offset=0x0000002C
    union {
        __IO uint32_t PRAR_PRG1_reg;

        // bit fields
        struct {
            __IO uint32_t PROT_AREA_START1_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PROT_AREA_END1_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMEP1_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } PRAR_PRG1_bits;
    };

    // SCAR_CUR1 @ offset=0x00000030
    union {
        __IO uint32_t SCAR_CUR1_reg;

        // bit fields
        struct {
            __IO uint32_t SEC_AREA_START1_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SEC_AREA_END1_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMES1_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } SCAR_CUR1_bits;
    };

    // SCAR_PRG1 @ offset=0x00000034
    union {
        __IO uint32_t SCAR_PRG1_reg;

        // bit fields
        struct {
            __IO uint32_t SEC_AREA_START1_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SEC_AREA_END1_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMES1_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } SCAR_PRG1_bits;
    };

    // WPSN_CUR1R @ offset=0x00000038
    __IO uint32_t WPSN_CUR1R_reg;

    // WPSN_PRG1R @ offset=0x0000003C
    __IO uint32_t WPSN_PRG1R_reg;

    // BOOT_CURR @ offset=0x00000040
    union {
        __IO uint32_t BOOT_CURR_reg;

        // bit fields
        struct {
            __IO uint32_t BOOT_ADD0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t BOOT_ADD1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } BOOT_CURR_bits;
    };

    // BOOT_PRGR @ offset=0x00000044
    union {
        __IO uint32_t BOOT_PRGR_reg;

        // bit fields
        struct {
            __IO uint32_t BOOT_ADD0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t BOOT_ADD1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } BOOT_PRGR_bits;
    };

    __IO uint8_t RESERVED0[8];

    // CRCCR1 @ offset=0x00000050
    union {
        __IO uint32_t CRCCR1_reg;

        // bit fields
        struct {
            __IO uint32_t CRC_SECT_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t ALL_BANK_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRC_BY_SECT_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADD_SECT_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLEAN_SECT_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 5;
            __IO uint32_t START_CRC_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLEAN_CRC_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t CRC_BURST_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 10;
        } CRCCR1_bits;
    };

    // CRCSADD1R @ offset=0x00000054
    __IO uint32_t CRCSADD1R_reg;

