minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // OPTCR_ @ offset=0x00000118
    union {
        __IO uint32_t OPTCR__reg;

        // bit fields
        struct {
            __IO uint32_t OPTLOCK_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPTSTART_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t MER_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 25;
            __IO uint32_t OPTCHANGEERRIE_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWAP_BANK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OPTCR__bits;
    };

    // OPTSR_CUR_ @ offset=0x0000011C
    union {
        __IO uint32_t OPTSR_CUR__reg;

        // bit fields
        struct {
            __IO uint32_t OPT_BUSY_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BOR_LEV_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG1_SW_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t NRST_STOP_D1_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NRST_STBY_D1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDP_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t IWDG_FZ_STOP_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG_FZ_SDBY_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ST_RAM_SIZE_bit : 2; // bit offset=19  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SECURITY_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 7;
            __IO uint32_t IO_HSLV_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPTCHANGEERR_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWAP_BANK_OPT_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OPTSR_CUR__bits;
    };

    // OPTSR_PRG_ @ offset=0x00000120
    union {
        __IO uint32_t OPTSR_PRG__reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t BOR_LEV_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t IWDG1_SW_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t NRST_STOP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NRST_STDY_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDP_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t FZ_IWDG_STOP_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FZ_IWDG_SDBY_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ST_RAM_SIZE_bit : 2; // bit offset=19  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SECURITY_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 7;
            __IO uint32_t IO_HSLV_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t SWAP_BANK_OPT_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OPTSR_PRG__bits;
    };

    // OPTCCR_ @ offset=0x00000124
    __IO uint32_t OPTCCR__reg;

    // PRAR_CUR2 @ offset=0x00000128
    union {
        __IO uint32_t PRAR_CUR2_reg;

        // bit fields
        struct {
            __IO uint32_t PROT_AREA_START2_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PROT_AREA_END2_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMEP2_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } PRAR_CUR2_bits;
    };

    // PRAR_PRG2 @ offset=0x0000012C
    union {
        __IO uint32_t PRAR_PRG2_reg;

        // bit fields
        struct {
            __IO uint32_t PROT_AREA_START2_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PROT_AREA_END2_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMEP2_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } PRAR_PRG2_bits;
    };

    // SCAR_CUR2 @ offset=0x00000130
    union {
        __IO uint32_t SCAR_CUR2_reg;

        // bit fields
        struct {
            __IO uint32_t SEC_AREA_START2_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SEC_AREA_END2_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMES2_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } SCAR_CUR2_bits;
    };

    // SCAR_PRG2 @ offset=0x00000134
    union {
        __IO uint32_t SCAR_PRG2_reg;

        // bit fields
        struct {
            __IO uint32_t SEC_AREA_START2_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SEC_AREA_END2_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DMES2_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } SCAR_PRG2_bits;
    };

