minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // WPSN_CUR2R @ offset=0x00000138
    __IO uint32_t WPSN_CUR2R_reg;

    // WPSN_PRG2R @ offset=0x0000013C
    __IO uint32_t WPSN_PRG2R_reg;

    // BOOT_CURR_ @ offset=0x00000140
    union {
        __IO uint32_t BOOT_CURR__reg;

        // bit fields
        struct {
            __IO uint32_t BOOT_ADD0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t BOOT_ADD1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } BOOT_CURR__bits;
    };

    // BOOT_PRGR_ @ offset=0x00000144
    union {
        __IO uint32_t BOOT_PRGR__reg;

        // bit fields
        struct {
            __IO uint32_t BOOT_ADD0_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t BOOT_ADD1_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } BOOT_PRGR__bits;
    };

    __IO uint8_t RESERVED2[8];

    // CRCCR2 @ offset=0x00000150
    union {
        __IO uint32_t CRCCR2_reg;

        // bit fields
        struct {
            __IO uint32_t CRC_SECT_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t ALL_BANK_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRC_BY_SECT_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADD_SECT_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLEAN_SECT_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 5;
            __IO uint32_t START_CRC_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CLEAN_CRC_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t CRC_BURST_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 10;
        } CRCCR2_bits;
    };

    // CRCSADD2R @ offset=0x00000154
    __IO uint32_t CRCSADD2R_reg;

    // CRCEADD2R @ offset=0x00000158
    __IO uint32_t CRCEADD2R_reg;

    // CRCDATAR_ @ offset=0x0000015C
    __IO uint32_t CRCDATAR__reg;

    // ECC_FA2R @ offset=0x00000160
    __IO uint32_t ECC_FA2R_reg;

} flash_t;

// Peripheral GPIOA @ base_address=0x58020000
typedef struct gpioa_t {

    // MODER @ offset=0x00000000
    union {
        __IO uint32_t MODER_reg;

        // bit fields
        struct {
            __IO uint32_t MODE0_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE1_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE2_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE3_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE4_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE5_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE6_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE7_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE8_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE9_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE10_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE11_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE12_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE13_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE14_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODE15_bit : 2; // bit offset=30  bit width=2  access=SVDAccessType.READ_WRITE
        } MODER_bits;
    };

    // OTYPER @ offset=0x00000004
    union {
        __IO uint32_t OTYPER_reg;

        // bit fields
        struct {
            __IO uint32_t OT0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OT15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } OTYPER_bits;
    };

