minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
} hrtim_common_t;

// Peripheral HRTIM_Master @ base_address=0x40017400
typedef struct hrtim_master_t {

    // MCR @ offset=0x00000000
    union {
        __IO uint32_t MCR_reg;

        // bit fields
        struct {
            __IO uint32_t CK_PSC_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t CONT_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RETRIG_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HALF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t SYNC_IN_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCRSTM_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCSTRTM_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_OUT_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNC_SRC_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TACEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TBCEN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCCEN_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TDCEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TECEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t DACSYNC_bit : 2; // bit offset=25  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PREEN_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t MREPU_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRSTDMA_bit : 2; // bit offset=30  bit width=2  access=SVDAccessType.READ_WRITE
        } MCR_bits;
    };

    // MISR @ offset=0x00000004
    union {
        __IO uint32_t MISR_reg;

        // bit fields
        struct {
            __IO uint32_t MCMP1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MCMP2_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MCMP3_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MCMP4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MREP_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SYNC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MUPD_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 25;
        } MISR_bits;
    };

    // MICR @ offset=0x00000008
    union {
        __IO uint32_t MICR_reg;

        // bit fields
        struct {
            __IO uint32_t MCMP1C_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t MCMP2C_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t MCMP3C_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t MCMP4C_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t MREPC_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SYNCC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t MUPDC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 25;
        } MICR_bits;
    };

    // MDIER4 @ offset=0x0000000C
    union {
        __IO uint32_t MDIER4_reg;

        // bit fields
        struct {
            __IO uint32_t MCMP1IE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCMP2IE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCMP3IE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCMP4IE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MREPIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUPDIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t MCMP1DE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCMP2DE_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCMP3DE_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCMP4DE_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MREPDE_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCDE_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUPDDE_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 9;
        } MDIER4_bits;
    };

    // MCNTR @ offset=0x00000010
    __IO uint32_t MCNTR_reg;

    // MPER @ offset=0x00000014
    __IO uint32_t MPER_reg;

    // MREP @ offset=0x00000018
    __IO uint32_t MREP_reg;

    // MCMP1R @ offset=0x0000001C
    __IO uint32_t MCMP1R_reg;

    __IO uint8_t RESERVED0[4];

    // MCMP2R @ offset=0x00000024
    __IO uint32_t MCMP2R_reg;

