minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // FLTER @ offset=0x00000068
    union {
        __IO uint32_t FLTER_reg;

        // bit fields
        struct {
            __IO uint32_t FLT1EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FLT2EN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FLT3EN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FLT4EN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FLT5EN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 26;
            __IO uint32_t FLTLCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } FLTER_bits;
    };

} hrtim_time_t;

// Peripheral HSEM @ base_address=0x58026400
typedef struct hsem_t {

    // HSEM_R0 @ offset=0x00000000
    union {
        __IO uint32_t HSEM_R0_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R0_bits;
    };

    // HSEM_R1 @ offset=0x00000004
    union {
        __IO uint32_t HSEM_R1_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R1_bits;
    };

    // HSEM_R2 @ offset=0x00000008
    union {
        __IO uint32_t HSEM_R2_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R2_bits;
    };

    // HSEM_R3 @ offset=0x0000000C
    union {
        __IO uint32_t HSEM_R3_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R3_bits;
    };

    // HSEM_R4 @ offset=0x00000010
    union {
        __IO uint32_t HSEM_R4_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R4_bits;
    };

    // HSEM_R5 @ offset=0x00000014
    union {
        __IO uint32_t HSEM_R5_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R5_bits;
    };

    // HSEM_R6 @ offset=0x00000018
    union {
        __IO uint32_t HSEM_R6_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R6_bits;
    };

    // HSEM_R7 @ offset=0x0000001C
    union {
        __IO uint32_t HSEM_R7_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R7_bits;
    };

    // HSEM_R8 @ offset=0x00000020
    union {
        __IO uint32_t HSEM_R8_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R8_bits;
    };

    // HSEM_R9 @ offset=0x00000024
    union {
        __IO uint32_t HSEM_R9_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R9_bits;
    };

    // HSEM_R10 @ offset=0x00000028
    union {
        __IO uint32_t HSEM_R10_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R10_bits;
    };

