minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // HSEM_R11 @ offset=0x0000002C
    union {
        __IO uint32_t HSEM_R11_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R11_bits;
    };

    // HSEM_R12 @ offset=0x00000030
    union {
        __IO uint32_t HSEM_R12_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R12_bits;
    };

    // HSEM_R13 @ offset=0x00000034
    union {
        __IO uint32_t HSEM_R13_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R13_bits;
    };

    // HSEM_R14 @ offset=0x00000038
    union {
        __IO uint32_t HSEM_R14_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R14_bits;
    };

    // HSEM_R15 @ offset=0x0000003C
    union {
        __IO uint32_t HSEM_R15_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R15_bits;
    };

    // HSEM_R16 @ offset=0x00000040
    union {
        __IO uint32_t HSEM_R16_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R16_bits;
    };

    // HSEM_R17 @ offset=0x00000044
    union {
        __IO uint32_t HSEM_R17_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R17_bits;
    };

    // HSEM_R18 @ offset=0x00000048
    union {
        __IO uint32_t HSEM_R18_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R18_bits;
    };

    // HSEM_R19 @ offset=0x0000004C
    union {
        __IO uint32_t HSEM_R19_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R19_bits;
    };

    // HSEM_R20 @ offset=0x00000050
    union {
        __IO uint32_t HSEM_R20_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R20_bits;
    };

    // HSEM_R21 @ offset=0x00000054
    union {
        __IO uint32_t HSEM_R21_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R21_bits;
    };

    // HSEM_R22 @ offset=0x00000058
    union {
        __IO uint32_t HSEM_R22_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R22_bits;
    };

    // HSEM_R23 @ offset=0x0000005C
    union {
        __IO uint32_t HSEM_R23_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R23_bits;
    };

    // HSEM_R24 @ offset=0x00000060
    union {
        __IO uint32_t HSEM_R24_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_R24_bits;
    };

