minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // HSEM_RLR7 @ offset=0x0000009C
    union {
        __IO uint32_t HSEM_RLR7_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR7_bits;
    };

    // HSEM_RLR8 @ offset=0x000000A0
    union {
        __IO uint32_t HSEM_RLR8_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR8_bits;
    };

    // HSEM_RLR9 @ offset=0x000000A4
    union {
        __IO uint32_t HSEM_RLR9_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR9_bits;
    };

    // HSEM_RLR10 @ offset=0x000000A8
    union {
        __IO uint32_t HSEM_RLR10_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR10_bits;
    };

    // HSEM_RLR11 @ offset=0x000000AC
    union {
        __IO uint32_t HSEM_RLR11_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR11_bits;
    };

    // HSEM_RLR12 @ offset=0x000000B0
    union {
        __IO uint32_t HSEM_RLR12_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR12_bits;
    };

    // HSEM_RLR13 @ offset=0x000000B4
    union {
        __IO uint32_t HSEM_RLR13_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR13_bits;
    };

    // HSEM_RLR14 @ offset=0x000000B8
    union {
        __IO uint32_t HSEM_RLR14_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR14_bits;
    };

    // HSEM_RLR15 @ offset=0x000000BC
    union {
        __IO uint32_t HSEM_RLR15_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR15_bits;
    };

    // HSEM_RLR16 @ offset=0x000000C0
    union {
        __IO uint32_t HSEM_RLR16_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR16_bits;
    };

    // HSEM_RLR17 @ offset=0x000000C4
    union {
        __IO uint32_t HSEM_RLR17_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR17_bits;
    };

    // HSEM_RLR18 @ offset=0x000000C8
    union {
        __IO uint32_t HSEM_RLR18_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR18_bits;
    };

    // HSEM_RLR19 @ offset=0x000000CC
    union {
        __IO uint32_t HSEM_RLR19_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR19_bits;
    };

    // HSEM_RLR20 @ offset=0x000000D0
    union {
        __IO uint32_t HSEM_RLR20_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR20_bits;
    };

    // HSEM_RLR21 @ offset=0x000000D4
    union {
        __IO uint32_t HSEM_RLR21_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR21_bits;
    };

    // HSEM_RLR22 @ offset=0x000000D8
    union {
        __IO uint32_t HSEM_RLR22_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR22_bits;
    };

    // HSEM_RLR23 @ offset=0x000000DC
    union {
        __IO uint32_t HSEM_RLR23_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR23_bits;
    };

