minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // HSEM_RLR24 @ offset=0x000000E0
    union {
        __IO uint32_t HSEM_RLR24_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR24_bits;
    };

    // HSEM_RLR25 @ offset=0x000000E4
    union {
        __IO uint32_t HSEM_RLR25_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR25_bits;
    };

    // HSEM_RLR26 @ offset=0x000000E8
    union {
        __IO uint32_t HSEM_RLR26_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR26_bits;
    };

    // HSEM_RLR27 @ offset=0x000000EC
    union {
        __IO uint32_t HSEM_RLR27_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR27_bits;
    };

    // HSEM_RLR28 @ offset=0x000000F0
    union {
        __IO uint32_t HSEM_RLR28_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR28_bits;
    };

    // HSEM_RLR29 @ offset=0x000000F4
    union {
        __IO uint32_t HSEM_RLR29_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR29_bits;
    };

    // HSEM_RLR30 @ offset=0x000000F8
    union {
        __IO uint32_t HSEM_RLR30_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR30_bits;
    };

    // HSEM_RLR31 @ offset=0x000000FC
    union {
        __IO uint32_t HSEM_RLR31_reg;

        // bit fields
        struct {
            __IO uint32_t PROCID_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t MASTERID_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t LOCK_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_RLR31_bits;
    };

    // HSEM_IER @ offset=0x00000100
    union {
        __IO uint32_t HSEM_IER_reg;

        // bit fields
        struct {
            __IO uint32_t ISEM0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM22_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM23_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM24_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM25_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM26_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM27_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM28_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM29_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM30_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISEM31_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } HSEM_IER_bits;
    };

    // HSEM_ICR @ offset=0x00000104
    union {
        __IO uint32_t HSEM_ICR_reg;

        // bit fields
        struct {
            __IO uint32_t ISEM0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM16_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM17_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM18_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM19_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM20_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM21_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM22_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM23_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM24_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM25_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM26_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM27_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM28_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM29_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM30_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ISEM31_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } HSEM_ICR_bits;
    };

