minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // ICR @ offset=0x0000001C
    union {
        __IO uint32_t ICR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t ADDRCF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t NACKCF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t STOPCF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t BERRCF_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ARLOCF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t OVRCF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t PECCF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TIMOUTCF_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ALERTCF_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 18;
        } ICR_bits;
    };

    // PECR @ offset=0x00000020
    __IO uint32_t PECR_reg;

    // RXDR @ offset=0x00000024
    __IO uint32_t RXDR_reg;

    // TXDR @ offset=0x00000028
    __IO uint32_t TXDR_reg;

} i2c1_t;

// Peripheral I2C2 @ base_address=0x40005800
typedef struct i2c2_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t PE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADDRIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NACKIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STOPIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ERRIE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DNF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ANFOFF_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TXDMAEN_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXDMAEN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBC_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NOSTRETCH_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WUPEN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GCEN_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMBHEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMBDEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ALERTEN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PECEN_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 8;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t SADD_bit : 10; // bit offset=0  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RD_WRN_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADD10_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HEAD10R_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t START_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STOP_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NACK_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBYTES_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RELOAD_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AUTOEND_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PECBYTE_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 5;
        } CR2_bits;
    };

    // OAR1 @ offset=0x00000008
    union {
        __IO uint32_t OAR1_reg;

        // bit fields
        struct {
            __IO uint32_t OA1_bit : 10; // bit offset=0  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t OA1MODE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t OA1EN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } OAR1_bits;
    };

    // OAR2 @ offset=0x0000000C
    union {
        __IO uint32_t OAR2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t OA2_bit : 7; // bit offset=1  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t OA2MSK_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t OA2EN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 16;
        } OAR2_bits;
    };

    // TIMINGR @ offset=0x00000010
    union {
        __IO uint32_t TIMINGR_reg;

        // bit fields
        struct {
            __IO uint32_t SCLL_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCLH_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t SDADEL_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCLDEL_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PRESC_bit : 4; // bit offset=28  bit width=4  access=SVDAccessType.READ_WRITE
        } TIMINGR_bits;
    };

    // TIMEOUTR @ offset=0x00000014
    union {
        __IO uint32_t TIMEOUTR_reg;

        // bit fields
        struct {
            __IO uint32_t TIMEOUTA_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIDLE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t TIMOUTEN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIMEOUTB_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t TEXTEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } TIMEOUTR_bits;
    };

    // ISR @ offset=0x00000018
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TXE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXNE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ADDR_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NACKF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t STOPF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCR_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BERR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ARLO_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PECERR_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TIMEOUT_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ALERT_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BUSY_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t DIR_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ADDCODE_bit : 7; // bit offset=17  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 8;
        } ISR_bits;
    };

