minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // ICR @ offset=0x0000001C
    union {
        __IO uint32_t ICR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t ADDRCF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t NACKCF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t STOPCF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t BERRCF_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ARLOCF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t OVRCF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t PECCF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TIMOUTCF_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ALERTCF_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 18;
        } ICR_bits;
    };

    // PECR @ offset=0x00000020
    __IO uint32_t PECR_reg;

    // RXDR @ offset=0x00000024
    __IO uint32_t RXDR_reg;

    // TXDR @ offset=0x00000028
    __IO uint32_t TXDR_reg;

} i2c4_t;

// Peripheral IWDG @ base_address=0x58004800
typedef struct iwdg_t {

    // KR @ offset=0x00000000
    __IO uint32_t KR_reg;

    // PR @ offset=0x00000004
    __IO uint32_t PR_reg;

    // RLR @ offset=0x00000008
    __IO uint32_t RLR_reg;

    // SR @ offset=0x0000000C
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t PVU_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RVU_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t WVU_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 29;
        } SR_bits;
    };

    // WINR @ offset=0x00000010
    __IO uint32_t WINR_reg;

} iwdg_t;

// Peripheral JPEG @ base_address=0x52003000
typedef struct jpeg_t {

    // CONFR0 @ offset=0x00000000
    __IO uint32_t CONFR0_reg;

    // CONFR1 @ offset=0x00000004
    union {
        __IO uint32_t CONFR1_reg;

        // bit fields
        struct {
            __IO uint32_t NF_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COLORSPACE_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NS_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t HDR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t YSIZE_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CONFR1_bits;
    };

    // CONFR2 @ offset=0x00000008
    __IO uint32_t CONFR2_reg;

    // CONFR3 @ offset=0x0000000C
    __IO uint32_t CONFR3_reg;

    // CONFRN1 @ offset=0x00000010
    union {
        __IO uint32_t CONFRN1_reg;

        // bit fields
        struct {
            __IO uint32_t HD_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HA_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t QT_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NB_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSF_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } CONFRN1_bits;
    };

    // CONFRN2 @ offset=0x00000014
    union {
        __IO uint32_t CONFRN2_reg;

        // bit fields
        struct {
            __IO uint32_t HD_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HA_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t QT_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NB_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSF_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } CONFRN2_bits;
    };

    // CONFRN3 @ offset=0x00000018
    union {
        __IO uint32_t CONFRN3_reg;

        // bit fields
        struct {
            __IO uint32_t HD_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HA_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t QT_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NB_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSF_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } CONFRN3_bits;
    };

    // CONFRN4 @ offset=0x0000001C
    union {
        __IO uint32_t CONFRN4_reg;

        // bit fields
        struct {
            __IO uint32_t HD_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HA_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t QT_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NB_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSF_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } CONFRN4_bits;
    };

    __IO uint8_t RESERVED0[16];

    // CR @ offset=0x00000030
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t JCEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IFTIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IFNFIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFNEIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EOCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HPDIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t IDMAEN_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ODMAEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IFF_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OFF_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 17;
        } CR_bits;
    };

    // SR @ offset=0x00000034
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t IFTF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t IFNFF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OFTF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OFNEF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOCF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HPDF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t COF_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 24;
        } SR_bits;
    };

    // CFR @ offset=0x00000038
    union {
        __IO uint32_t CFR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t CEOCF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHPDF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 25;
        } CFR_bits;
    };

    __IO uint8_t RESERVED1[4];

    // DIR @ offset=0x00000040
    __IO uint32_t DIR_reg;

    // DOR @ offset=0x00000044
    __IO uint32_t DOR_reg;

