minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
// Peripheral LPTIM5 @ base_address=0x58003000
typedef struct lptim5_t {

    // ISR @ offset=0x00000000
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t CMPM_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ARRM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EXTTRIG_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CMPOK_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ARROK_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t UP_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t DOWN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 25;
        } ISR_bits;
    };

    // ICR @ offset=0x00000004
    union {
        __IO uint32_t ICR_reg;

        // bit fields
        struct {
            __IO uint32_t CMPMCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ARRMCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EXTTRIGCF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CMPOKCF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t ARROKCF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t UPCF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t DOWNCF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 25;
        } ICR_bits;
    };

    // IER @ offset=0x00000008
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t CMPMIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARRMIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTTRIGIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CMPOKIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARROKIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UPIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DOWNIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 25;
        } IER_bits;
    };

    // CFGR @ offset=0x0000000C
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t CKSEL_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKPOL_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKFLT_bit : 2; // bit offset=3  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TRGFLT_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t PRESC_bit : 3; // bit offset=9  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t TRIGSEL_bit : 3; // bit offset=13  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t TRIGEN_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIMOUT_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAVE_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAVPOL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRELOAD_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COUNTMODE_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ENC_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 7;
        } CFGR_bits;
    };

    // CR @ offset=0x00000010
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t ENABLE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNGSTRT_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNTSTRT_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COUNTRST_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RSTARE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 27;
        } CR_bits;
    };

    // CMP @ offset=0x00000014
    __IO uint32_t CMP_reg;

    // ARR @ offset=0x00000018
    __IO uint32_t ARR_reg;

    // CNT @ offset=0x0000001C
    __IO uint32_t CNT_reg;

    __IO uint8_t RESERVED0[4];

    // CFGR2 @ offset=0x00000024
    __IO uint32_t CFGR2_reg;

} lptim5_t;

// Peripheral LPUART1 @ base_address=0x58000C00
typedef struct lpuart1_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t UE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UESM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IDLEIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXNEIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXEIE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PEIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PCE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WAKE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t M0_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MME_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CMIE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DEDT_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEAT_bit : 5; // bit offset=21  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t M1_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FIFOEN_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXFEIE_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXFFIE_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t ADDM7_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t STOP_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SWAP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXINV_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXINV_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DATAINV_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSBFIRST_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 4;
            __IO uint32_t ADD_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } CR2_bits;
    };

