minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // PRESC @ offset=0x0000002C
    __IO uint32_t PRESC_reg;

} lpuart1_t;

// Peripheral LTDC @ base_address=0x50001000
typedef struct ltdc_t {

    __IO uint8_t RESERVED0[8];

    // SSCR @ offset=0x00000008
    union {
        __IO uint32_t SSCR_reg;

        // bit fields
        struct {
            __IO uint32_t VSH_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t HSW_bit : 10; // bit offset=16  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 6;
        } SSCR_bits;
    };

    // BPCR @ offset=0x0000000C
    union {
        __IO uint32_t BPCR_reg;

        // bit fields
        struct {
            __IO uint32_t AVBP_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t AHBP_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } BPCR_bits;
    };

    // AWCR @ offset=0x00000010
    union {
        __IO uint32_t AWCR_reg;

        // bit fields
        struct {
            __IO uint32_t AAH_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t AAV_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } AWCR_bits;
    };

    // TWCR @ offset=0x00000014
    union {
        __IO uint32_t TWCR_reg;

        // bit fields
        struct {
            __IO uint32_t TOTALH_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t TOTALW_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } TWCR_bits;
    };

    // GCR @ offset=0x00000018
    union {
        __IO uint32_t GCR_reg;

        // bit fields
        struct {
            __IO uint32_t LTDCEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DBW_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DGW_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t DRW_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 11;
            __IO uint32_t PCPOL_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEPOL_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSPOL_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSPOL_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } GCR_bits;
    };

    __IO uint8_t RESERVED1[8];

    // SRCR @ offset=0x00000024
    union {
        __IO uint32_t SRCR_reg;

        // bit fields
        struct {
            __IO uint32_t IMR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VBR_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } SRCR_bits;
    };

    __IO uint8_t RESERVED2[4];

    // BCCR @ offset=0x0000002C
    union {
        __IO uint32_t BCCR_reg;

        // bit fields
        struct {
            __IO uint32_t BCBLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BCGREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t BCRED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 8;
        } BCCR_bits;
    };

    __IO uint8_t RESERVED3[4];

    // IER @ offset=0x00000034
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t LIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FUIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TERRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RRIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 28;
        } IER_bits;
    };

    // ISR @ offset=0x00000038
    union {
        __IO uint32_t ISR_reg;

        // bit fields
        struct {
            __IO uint32_t LIF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FUIF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TERRIF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RRIF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 28;
        } ISR_bits;
    };

    // ICR @ offset=0x0000003C
    union {
        __IO uint32_t ICR_reg;

        // bit fields
        struct {
            __IO uint32_t CLIF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CFUIF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CTERRIF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CRRIF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 28;
        } ICR_bits;
    };

    // LIPCR @ offset=0x00000040
    __IO uint32_t LIPCR_reg;

    // CPSR @ offset=0x00000044
    union {
        __IO uint32_t CPSR_reg;

        // bit fields
        struct {
            __IO uint32_t CYPOS_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t CXPOS_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } CPSR_bits;
    };

    // CDSR @ offset=0x00000048
    union {
        __IO uint32_t CDSR_reg;

        // bit fields
        struct {
            __IO uint32_t VDES_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HDES_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VSYNCS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t HSYNCS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 28;
        } CDSR_bits;
    };

    __IO uint8_t RESERVED4[56];

    // L1CR @ offset=0x00000084
    union {
        __IO uint32_t L1CR_reg;

        // bit fields
        struct {
            __IO uint32_t LEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COLKEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CLUTEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 27;
        } L1CR_bits;
    };

    // L1WHPCR @ offset=0x00000088
    union {
        __IO uint32_t L1WHPCR_reg;

        // bit fields
        struct {
            __IO uint32_t WHSTPOS_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t WHSPPOS_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } L1WHPCR_bits;
    };

