minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // L1WVPCR @ offset=0x0000008C
    union {
        __IO uint32_t L1WVPCR_reg;

        // bit fields
        struct {
            __IO uint32_t WVSTPOS_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t WVSPPOS_bit : 11; // bit offset=16  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 5;
        } L1WVPCR_bits;
    };

    // L1CKCR @ offset=0x00000090
    union {
        __IO uint32_t L1CKCR_reg;

        // bit fields
        struct {
            __IO uint32_t CKBLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKGREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKRED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 8;
        } L1CKCR_bits;
    };

    // L1PFCR @ offset=0x00000094
    __IO uint32_t L1PFCR_reg;

    // L1CACR @ offset=0x00000098
    __IO uint32_t L1CACR_reg;

    // L1DCCR @ offset=0x0000009C
    union {
        __IO uint32_t L1DCCR_reg;

        // bit fields
        struct {
            __IO uint32_t DCBLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCGREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCRED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCALPHA_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } L1DCCR_bits;
    };

    // L1BFCR @ offset=0x000000A0
    union {
        __IO uint32_t L1BFCR_reg;

        // bit fields
        struct {
            __IO uint32_t BF2_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t BF1_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 21;
        } L1BFCR_bits;
    };

    __IO uint8_t RESERVED5[8];

    // L1CFBAR @ offset=0x000000AC
    __IO uint32_t L1CFBAR_reg;

    // L1CFBLR @ offset=0x000000B0
    union {
        __IO uint32_t L1CFBLR_reg;

        // bit fields
        struct {
            __IO uint32_t CFBLL_bit : 13; // bit offset=0  bit width=13  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t CFBP_bit : 13; // bit offset=16  bit width=13  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 3;
        } L1CFBLR_bits;
    };

    // L1CFBLNR @ offset=0x000000B4
    __IO uint32_t L1CFBLNR_reg;

    __IO uint8_t RESERVED6[12];

    // L1CLUTWR @ offset=0x000000C4
    union {
        __IO uint32_t L1CLUTWR_reg;

        // bit fields
        struct {
            __IO uint32_t BLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t GREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLUTADD_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.WRITE_ONLY
        } L1CLUTWR_bits;
    };

    __IO uint8_t RESERVED7[60];

    // L2CR @ offset=0x00000104
    union {
        __IO uint32_t L2CR_reg;

        // bit fields
        struct {
            __IO uint32_t LEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COLKEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CLUTEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 27;
        } L2CR_bits;
    };

    // L2WHPCR @ offset=0x00000108
    union {
        __IO uint32_t L2WHPCR_reg;

        // bit fields
        struct {
            __IO uint32_t WHSTPOS_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t WHSPPOS_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } L2WHPCR_bits;
    };

    // L2WVPCR @ offset=0x0000010C
    union {
        __IO uint32_t L2WVPCR_reg;

        // bit fields
        struct {
            __IO uint32_t WVSTPOS_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t WVSPPOS_bit : 11; // bit offset=16  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 5;
        } L2WVPCR_bits;
    };

    // L2CKCR @ offset=0x00000110
    union {
        __IO uint32_t L2CKCR_reg;

        // bit fields
        struct {
            __IO uint32_t CKBLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKGREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKRED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 8;
        } L2CKCR_bits;
    };

    // L2PFCR @ offset=0x00000114
    __IO uint32_t L2PFCR_reg;

    // L2CACR @ offset=0x00000118
    __IO uint32_t L2CACR_reg;

    // L2DCCR @ offset=0x0000011C
    union {
        __IO uint32_t L2DCCR_reg;

        // bit fields
        struct {
            __IO uint32_t DCBLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCGREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCRED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCALPHA_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } L2DCCR_bits;
    };

    // L2BFCR @ offset=0x00000120
    union {
        __IO uint32_t L2BFCR_reg;

        // bit fields
        struct {
            __IO uint32_t BF2_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t BF1_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 21;
        } L2BFCR_bits;
    };

    __IO uint8_t RESERVED8[8];

