minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // L2CFBAR @ offset=0x0000012C
    __IO uint32_t L2CFBAR_reg;

    // L2CFBLR @ offset=0x00000130
    union {
        __IO uint32_t L2CFBLR_reg;

        // bit fields
        struct {
            __IO uint32_t CFBLL_bit : 13; // bit offset=0  bit width=13  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t CFBP_bit : 13; // bit offset=16  bit width=13  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 3;
        } L2CFBLR_bits;
    };

    // L2CFBLNR @ offset=0x00000134
    __IO uint32_t L2CFBLNR_reg;

    __IO uint8_t RESERVED9[12];

    // L2CLUTWR @ offset=0x00000144
    union {
        __IO uint32_t L2CLUTWR_reg;

        // bit fields
        struct {
            __IO uint32_t BLUE_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t GREEN_bit : 8; // bit offset=8  bit width=8  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RED_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLUTADD_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.WRITE_ONLY
        } L2CLUTWR_bits;
    };

} ltdc_t;

// Peripheral MDIOS @ base_address=0x40009400
typedef struct mdios_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WRIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RDIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DPC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PORT_ADDRESS_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } CR_bits;
    };

    // WRFR @ offset=0x00000004
    __IO uint32_t WRFR_reg;

    // CWRFR @ offset=0x00000008
    __IO uint32_t CWRFR_reg;

    // RDFR @ offset=0x0000000C
    __IO uint32_t RDFR_reg;

    // CRDFR @ offset=0x00000010
    __IO uint32_t CRDFR_reg;

    // SR @ offset=0x00000014
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t PERF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SERF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TERF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 29;
        } SR_bits;
    };

    // CLRFR @ offset=0x00000018
    union {
        __IO uint32_t CLRFR_reg;

        // bit fields
        struct {
            __IO uint32_t CPERF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSERF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTERF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } CLRFR_bits;
    };

    // DINR0 @ offset=0x0000001C
    __IO uint32_t DINR0_reg;

    // DINR1 @ offset=0x00000020
    __IO uint32_t DINR1_reg;

    // DINR2 @ offset=0x00000024
    __IO uint32_t DINR2_reg;

    // DINR3 @ offset=0x00000028
    __IO uint32_t DINR3_reg;

    // DINR4 @ offset=0x0000002C
    __IO uint32_t DINR4_reg;

    // DINR5 @ offset=0x00000030
    __IO uint32_t DINR5_reg;

    // DINR6 @ offset=0x00000034
    __IO uint32_t DINR6_reg;

    // DINR7 @ offset=0x00000038
    __IO uint32_t DINR7_reg;

    // DINR8 @ offset=0x0000003C
    __IO uint32_t DINR8_reg;

    // DINR9 @ offset=0x00000040
    __IO uint32_t DINR9_reg;

    // DINR10 @ offset=0x00000044
    __IO uint32_t DINR10_reg;

    // DINR11 @ offset=0x00000048
    __IO uint32_t DINR11_reg;

    // DINR12 @ offset=0x0000004C
    __IO uint32_t DINR12_reg;

    // DINR13 @ offset=0x00000050
    __IO uint32_t DINR13_reg;

    // DINR14 @ offset=0x00000054
    __IO uint32_t DINR14_reg;

    // DINR15 @ offset=0x00000058
    __IO uint32_t DINR15_reg;

    // DINR16 @ offset=0x0000005C
    __IO uint32_t DINR16_reg;

    // DINR17 @ offset=0x00000060
    __IO uint32_t DINR17_reg;

    // DINR18 @ offset=0x00000064
    __IO uint32_t DINR18_reg;

    // DINR19 @ offset=0x00000068
    __IO uint32_t DINR19_reg;

    // DINR20 @ offset=0x0000006C
    __IO uint32_t DINR20_reg;

    // DINR21 @ offset=0x00000070
    __IO uint32_t DINR21_reg;

    // DINR22 @ offset=0x00000074
    __IO uint32_t DINR22_reg;

    // DINR23 @ offset=0x00000078
    __IO uint32_t DINR23_reg;

    // DINR24 @ offset=0x0000007C
    __IO uint32_t DINR24_reg;

    // DINR25 @ offset=0x00000080
    __IO uint32_t DINR25_reg;

    // DINR26 @ offset=0x00000084
    __IO uint32_t DINR26_reg;

    // DINR27 @ offset=0x00000088
    __IO uint32_t DINR27_reg;

    // DINR28 @ offset=0x0000008C
    __IO uint32_t DINR28_reg;

    // DINR29 @ offset=0x00000090
    __IO uint32_t DINR29_reg;

    // DINR30 @ offset=0x00000094
    __IO uint32_t DINR30_reg;

    // DINR31 @ offset=0x00000098
    __IO uint32_t DINR31_reg;

    // DOUTR0 @ offset=0x0000009C
    __IO uint32_t DOUTR0_reg;

    // DOUTR1 @ offset=0x000000A0
    __IO uint32_t DOUTR1_reg;

    // DOUTR2 @ offset=0x000000A4
    __IO uint32_t DOUTR2_reg;

    // DOUTR3 @ offset=0x000000A8
    __IO uint32_t DOUTR3_reg;

    // DOUTR4 @ offset=0x000000AC
    __IO uint32_t DOUTR4_reg;

    // DOUTR5 @ offset=0x000000B0
    __IO uint32_t DOUTR5_reg;

    // DOUTR6 @ offset=0x000000B4
    __IO uint32_t DOUTR6_reg;

    // DOUTR7 @ offset=0x000000B8
    __IO uint32_t DOUTR7_reg;

    // DOUTR8 @ offset=0x000000BC
    __IO uint32_t DOUTR8_reg;

    // DOUTR9 @ offset=0x000000C0
    __IO uint32_t DOUTR9_reg;

    // DOUTR10 @ offset=0x000000C4
    __IO uint32_t DOUTR10_reg;

