minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DOUTR11 @ offset=0x000000C8
    __IO uint32_t DOUTR11_reg;

    // DOUTR12 @ offset=0x000000CC
    __IO uint32_t DOUTR12_reg;

    // DOUTR13 @ offset=0x000000D0
    __IO uint32_t DOUTR13_reg;

    // DOUTR14 @ offset=0x000000D4
    __IO uint32_t DOUTR14_reg;

    // DOUTR15 @ offset=0x000000D8
    __IO uint32_t DOUTR15_reg;

    // DOUTR16 @ offset=0x000000DC
    __IO uint32_t DOUTR16_reg;

    // DOUTR17 @ offset=0x000000E0
    __IO uint32_t DOUTR17_reg;

    // DOUTR18 @ offset=0x000000E4
    __IO uint32_t DOUTR18_reg;

    // DOUTR19 @ offset=0x000000E8
    __IO uint32_t DOUTR19_reg;

    // DOUTR20 @ offset=0x000000EC
    __IO uint32_t DOUTR20_reg;

    // DOUTR21 @ offset=0x000000F0
    __IO uint32_t DOUTR21_reg;

    // DOUTR22 @ offset=0x000000F4
    __IO uint32_t DOUTR22_reg;

    // DOUTR23 @ offset=0x000000F8
    __IO uint32_t DOUTR23_reg;

    // DOUTR24 @ offset=0x000000FC
    __IO uint32_t DOUTR24_reg;

    // DOUTR25 @ offset=0x00000100
    __IO uint32_t DOUTR25_reg;

    // DOUTR26 @ offset=0x00000104
    __IO uint32_t DOUTR26_reg;

    // DOUTR27 @ offset=0x00000108
    __IO uint32_t DOUTR27_reg;

    // DOUTR28 @ offset=0x0000010C
    __IO uint32_t DOUTR28_reg;

    // DOUTR29 @ offset=0x00000110
    __IO uint32_t DOUTR29_reg;

    // DOUTR30 @ offset=0x00000114
    __IO uint32_t DOUTR30_reg;

    // DOUTR31 @ offset=0x00000118
    __IO uint32_t DOUTR31_reg;

} mdios_t;

// Peripheral MDMA @ base_address=0x52000000
typedef struct mdma_t {

    // MDMA_GISR0 @ offset=0x00000000
    union {
        __IO uint32_t MDMA_GISR0_reg;

        // bit fields
        struct {
            __IO uint32_t GIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF1_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF2_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF3_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF4_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF5_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF6_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF7_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF8_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF9_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF10_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF11_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF12_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF13_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF14_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GIF15_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 16;
        } MDMA_GISR0_bits;
    };

    __IO uint8_t RESERVED0[60];

    // MDMA_C0ISR @ offset=0x00000040
    union {
        __IO uint32_t MDMA_C0ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TEIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTCIF0_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BRTIF0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BTIF0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t CRQA0_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } MDMA_C0ISR_bits;
    };

    // MDMA_C0IFCR @ offset=0x00000044
    union {
        __IO uint32_t MDMA_C0IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEIF0_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CCTCIF0_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBRTIF0_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBTIF0_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLTCIF0_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 27;
        } MDMA_C0IFCR_bits;
    };

    // MDMA_C0ESR @ offset=0x00000048
    union {
        __IO uint32_t MDMA_C0ESR_reg;

        // bit fields
        struct {
            __IO uint32_t TEA_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t TED_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TELD_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMD_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ASE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BSE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 20;
        } MDMA_C0ESR_bits;
    };

    // MDMA_C0CR @ offset=0x0000004C
    union {
        __IO uint32_t MDMA_C0CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BTIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BEX_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HEX_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WEX_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SWRQ_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 15;
        } MDMA_C0CR_bits;
    };

    // MDMA_C0TCR @ offset=0x00000050
    union {
        __IO uint32_t MDMA_C0TCR_reg;

        // bit fields
        struct {
            __IO uint32_t SINC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSIZE_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DSIZE_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SINCOS_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINCOS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBURST_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBURST_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TLEN_bit : 7; // bit offset=18  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKE_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PAM_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGM_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWRM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BWM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MDMA_C0TCR_bits;
    };

    // MDMA_C0BNDTR @ offset=0x00000054
    union {
        __IO uint32_t MDMA_C0BNDTR_reg;

        // bit fields
        struct {
            __IO uint32_t BNDT_bit : 17; // bit offset=0  bit width=17  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BRSUM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRDUM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRC_bit : 12; // bit offset=20  bit width=12  access=SVDAccessType.READ_WRITE
        } MDMA_C0BNDTR_bits;
    };

    // MDMA_C0SAR @ offset=0x00000058
    __IO uint32_t MDMA_C0SAR_reg;

