minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MDMA_C6DAR @ offset=0x000001DC
    __IO uint32_t MDMA_C6DAR_reg;

    // MDMA_C6BRUR @ offset=0x000001E0
    union {
        __IO uint32_t MDMA_C6BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C6BRUR_bits;
    };

    // MDMA_C6LAR @ offset=0x000001E4
    __IO uint32_t MDMA_C6LAR_reg;

    // MDMA_C6TBR @ offset=0x000001E8
    union {
        __IO uint32_t MDMA_C6TBR_reg;

        // bit fields
        struct {
            __IO uint32_t TSEL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t SBUS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBUS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 14;
        } MDMA_C6TBR_bits;
    };

    __IO uint8_t RESERVED13[4];

    // MDMA_C6MAR @ offset=0x000001F0
    __IO uint32_t MDMA_C6MAR_reg;

    // MDMA_C6MDR @ offset=0x000001F4
    __IO uint32_t MDMA_C6MDR_reg;

    __IO uint8_t RESERVED14[8];

    // MDMA_C7ISR @ offset=0x00000200
    union {
        __IO uint32_t MDMA_C7ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TEIF7_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTCIF7_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BRTIF7_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BTIF7_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF7_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t CRQA7_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } MDMA_C7ISR_bits;
    };

    // MDMA_C7IFCR @ offset=0x00000204
    union {
        __IO uint32_t MDMA_C7IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEIF7_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CCTCIF7_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBRTIF7_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBTIF7_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLTCIF7_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 27;
        } MDMA_C7IFCR_bits;
    };

    // MDMA_C7ESR @ offset=0x00000208
    union {
        __IO uint32_t MDMA_C7ESR_reg;

        // bit fields
        struct {
            __IO uint32_t TEA_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t TED_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TELD_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMD_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ASE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BSE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 20;
        } MDMA_C7ESR_bits;
    };

    // MDMA_C7CR @ offset=0x0000020C
    union {
        __IO uint32_t MDMA_C7CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BTIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BEX_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HEX_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WEX_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SWRQ_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 15;
        } MDMA_C7CR_bits;
    };

    // MDMA_C7TCR @ offset=0x00000210
    union {
        __IO uint32_t MDMA_C7TCR_reg;

        // bit fields
        struct {
            __IO uint32_t SINC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSIZE_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DSIZE_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SINCOS_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINCOS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBURST_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBURST_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TLEN_bit : 7; // bit offset=18  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKE_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PAM_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGM_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWRM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BWM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MDMA_C7TCR_bits;
    };

    // MDMA_C7BNDTR @ offset=0x00000214
    union {
        __IO uint32_t MDMA_C7BNDTR_reg;

        // bit fields
        struct {
            __IO uint32_t BNDT_bit : 17; // bit offset=0  bit width=17  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BRSUM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRDUM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRC_bit : 12; // bit offset=20  bit width=12  access=SVDAccessType.READ_WRITE
        } MDMA_C7BNDTR_bits;
    };

    // MDMA_C7SAR @ offset=0x00000218
    __IO uint32_t MDMA_C7SAR_reg;

    // MDMA_C7DAR @ offset=0x0000021C
    __IO uint32_t MDMA_C7DAR_reg;

    // MDMA_C7BRUR @ offset=0x00000220
    union {
        __IO uint32_t MDMA_C7BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C7BRUR_bits;
    };

    // MDMA_C7LAR @ offset=0x00000224
    __IO uint32_t MDMA_C7LAR_reg;

    // MDMA_C7TBR @ offset=0x00000228
    union {
        __IO uint32_t MDMA_C7TBR_reg;

        // bit fields
        struct {
            __IO uint32_t TSEL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t SBUS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBUS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 14;
        } MDMA_C7TBR_bits;
    };

    __IO uint8_t RESERVED15[4];

    // MDMA_C7MAR @ offset=0x00000230
    __IO uint32_t MDMA_C7MAR_reg;

    // MDMA_C7MDR @ offset=0x00000234
    __IO uint32_t MDMA_C7MDR_reg;

    __IO uint8_t RESERVED16[8];

    // MDMA_C8ISR @ offset=0x00000240
    union {
        __IO uint32_t MDMA_C8ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TEIF8_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTCIF8_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BRTIF8_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BTIF8_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF8_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t CRQA8_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } MDMA_C8ISR_bits;
    };

    // MDMA_C8IFCR @ offset=0x00000244
    union {
        __IO uint32_t MDMA_C8IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEIF8_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CCTCIF8_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBRTIF8_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBTIF8_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLTCIF8_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 27;
        } MDMA_C8IFCR_bits;
    };

