minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MDMA_C8ESR @ offset=0x00000248
    union {
        __IO uint32_t MDMA_C8ESR_reg;

        // bit fields
        struct {
            __IO uint32_t TEA_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t TED_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TELD_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMD_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ASE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BSE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 20;
        } MDMA_C8ESR_bits;
    };

    // MDMA_C8CR @ offset=0x0000024C
    union {
        __IO uint32_t MDMA_C8CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BTIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BEX_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HEX_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WEX_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SWRQ_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 15;
        } MDMA_C8CR_bits;
    };

    // MDMA_C8TCR @ offset=0x00000250
    union {
        __IO uint32_t MDMA_C8TCR_reg;

        // bit fields
        struct {
            __IO uint32_t SINC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSIZE_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DSIZE_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SINCOS_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINCOS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBURST_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBURST_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TLEN_bit : 7; // bit offset=18  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKE_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PAM_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGM_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWRM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BWM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MDMA_C8TCR_bits;
    };

    // MDMA_C8BNDTR @ offset=0x00000254
    union {
        __IO uint32_t MDMA_C8BNDTR_reg;

        // bit fields
        struct {
            __IO uint32_t BNDT_bit : 17; // bit offset=0  bit width=17  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BRSUM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRDUM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRC_bit : 12; // bit offset=20  bit width=12  access=SVDAccessType.READ_WRITE
        } MDMA_C8BNDTR_bits;
    };

    // MDMA_C8SAR @ offset=0x00000258
    __IO uint32_t MDMA_C8SAR_reg;

    // MDMA_C8DAR @ offset=0x0000025C
    __IO uint32_t MDMA_C8DAR_reg;

    // MDMA_C8BRUR @ offset=0x00000260
    union {
        __IO uint32_t MDMA_C8BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C8BRUR_bits;
    };

    // MDMA_C8LAR @ offset=0x00000264
    __IO uint32_t MDMA_C8LAR_reg;

    // MDMA_C8TBR @ offset=0x00000268
    union {
        __IO uint32_t MDMA_C8TBR_reg;

        // bit fields
        struct {
            __IO uint32_t TSEL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t SBUS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBUS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 14;
        } MDMA_C8TBR_bits;
    };

    __IO uint8_t RESERVED17[4];

    // MDMA_C8MAR @ offset=0x00000270
    __IO uint32_t MDMA_C8MAR_reg;

    // MDMA_C8MDR @ offset=0x00000274
    __IO uint32_t MDMA_C8MDR_reg;

    __IO uint8_t RESERVED18[8];

    // MDMA_C9ISR @ offset=0x00000280
    union {
        __IO uint32_t MDMA_C9ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TEIF9_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTCIF9_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BRTIF9_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BTIF9_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF9_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t CRQA9_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } MDMA_C9ISR_bits;
    };

    // MDMA_C9IFCR @ offset=0x00000284
    union {
        __IO uint32_t MDMA_C9IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEIF9_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CCTCIF9_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBRTIF9_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBTIF9_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLTCIF9_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 27;
        } MDMA_C9IFCR_bits;
    };

    // MDMA_C9ESR @ offset=0x00000288
    union {
        __IO uint32_t MDMA_C9ESR_reg;

        // bit fields
        struct {
            __IO uint32_t TEA_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t TED_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TELD_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMD_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ASE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BSE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 20;
        } MDMA_C9ESR_bits;
    };

    // MDMA_C9CR @ offset=0x0000028C
    union {
        __IO uint32_t MDMA_C9CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BTIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BEX_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HEX_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WEX_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SWRQ_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 15;
        } MDMA_C9CR_bits;
    };

    // MDMA_C9TCR @ offset=0x00000290
    union {
        __IO uint32_t MDMA_C9TCR_reg;

        // bit fields
        struct {
            __IO uint32_t SINC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSIZE_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DSIZE_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SINCOS_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINCOS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBURST_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBURST_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TLEN_bit : 7; // bit offset=18  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKE_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PAM_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGM_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWRM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BWM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MDMA_C9TCR_bits;
    };

    // MDMA_C9BNDTR @ offset=0x00000294
    union {
        __IO uint32_t MDMA_C9BNDTR_reg;

        // bit fields
        struct {
            __IO uint32_t BNDT_bit : 17; // bit offset=0  bit width=17  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BRSUM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRDUM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRC_bit : 12; // bit offset=20  bit width=12  access=SVDAccessType.READ_WRITE
        } MDMA_C9BNDTR_bits;
    };

    // MDMA_C9SAR @ offset=0x00000298
    __IO uint32_t MDMA_C9SAR_reg;

    // MDMA_C9DAR @ offset=0x0000029C
    __IO uint32_t MDMA_C9DAR_reg;

    // MDMA_C9BRUR @ offset=0x000002A0
    union {
        __IO uint32_t MDMA_C9BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C9BRUR_bits;
    };

