minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MDMA_C12DAR @ offset=0x0000035C
    __IO uint32_t MDMA_C12DAR_reg;

    // MDMA_C12BRUR @ offset=0x00000360
    union {
        __IO uint32_t MDMA_C12BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C12BRUR_bits;
    };

    // MDMA_C12LAR @ offset=0x00000364
    __IO uint32_t MDMA_C12LAR_reg;

    // MDMA_C12TBR @ offset=0x00000368
    union {
        __IO uint32_t MDMA_C12TBR_reg;

        // bit fields
        struct {
            __IO uint32_t TSEL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t SBUS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBUS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 14;
        } MDMA_C12TBR_bits;
    };

    __IO uint8_t RESERVED25[4];

    // MDMA_C12MAR @ offset=0x00000370
    __IO uint32_t MDMA_C12MAR_reg;

    // MDMA_C12MDR @ offset=0x00000374
    __IO uint32_t MDMA_C12MDR_reg;

    __IO uint8_t RESERVED26[8];

    // MDMA_C13ISR @ offset=0x00000380
    union {
        __IO uint32_t MDMA_C13ISR_reg;

        // bit fields
        struct {
            __IO uint32_t TEIF13_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTCIF13_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BRTIF13_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BTIF13_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCIF13_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t CRQA13_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } MDMA_C13ISR_bits;
    };

    // MDMA_C13IFCR @ offset=0x00000384
    union {
        __IO uint32_t MDMA_C13IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEIF13_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CCTCIF13_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBRTIF13_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CBTIF13_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLTCIF13_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 27;
        } MDMA_C13IFCR_bits;
    };

    // MDMA_C13ESR @ offset=0x00000388
    union {
        __IO uint32_t MDMA_C13ESR_reg;

        // bit fields
        struct {
            __IO uint32_t TEA_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t TED_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TELD_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMD_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ASE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BSE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 20;
        } MDMA_C13ESR_bits;
    };

    // MDMA_C13CR @ offset=0x0000038C
    union {
        __IO uint32_t MDMA_C13CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BTIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PL_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t BEX_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HEX_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WEX_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SWRQ_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED2 : 15;
        } MDMA_C13CR_bits;
    };

    // MDMA_C13TCR @ offset=0x00000390
    union {
        __IO uint32_t MDMA_C13TCR_reg;

        // bit fields
        struct {
            __IO uint32_t SINC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSIZE_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DSIZE_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SINCOS_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DINCOS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBURST_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBURST_bit : 3; // bit offset=15  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TLEN_bit : 7; // bit offset=18  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKE_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PAM_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TRGM_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWRM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BWM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } MDMA_C13TCR_bits;
    };

    // MDMA_C13BNDTR @ offset=0x00000394
    union {
        __IO uint32_t MDMA_C13BNDTR_reg;

        // bit fields
        struct {
            __IO uint32_t BNDT_bit : 17; // bit offset=0  bit width=17  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t BRSUM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRDUM_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BRC_bit : 12; // bit offset=20  bit width=12  access=SVDAccessType.READ_WRITE
        } MDMA_C13BNDTR_bits;
    };

    // MDMA_C13SAR @ offset=0x00000398
    __IO uint32_t MDMA_C13SAR_reg;

    // MDMA_C13DAR @ offset=0x0000039C
    __IO uint32_t MDMA_C13DAR_reg;

    // MDMA_C13BRUR @ offset=0x000003A0
    union {
        __IO uint32_t MDMA_C13BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C13BRUR_bits;
    };

