minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // MDMA_C15SAR @ offset=0x00000418
    __IO uint32_t MDMA_C15SAR_reg;

    // MDMA_C15DAR @ offset=0x0000041C
    __IO uint32_t MDMA_C15DAR_reg;

    // MDMA_C15BRUR @ offset=0x00000420
    union {
        __IO uint32_t MDMA_C15BRUR_reg;

        // bit fields
        struct {
            __IO uint32_t SUV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t DUV_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } MDMA_C15BRUR_bits;
    };

    // MDMA_C15LAR @ offset=0x00000424
    __IO uint32_t MDMA_C15LAR_reg;

    // MDMA_C15TBR @ offset=0x00000428
    union {
        __IO uint32_t MDMA_C15TBR_reg;

        // bit fields
        struct {
            __IO uint32_t TSEL_bit : 6; // bit offset=0  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 10;
            __IO uint32_t SBUS_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBUS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 14;
        } MDMA_C15TBR_bits;
    };

    __IO uint8_t RESERVED31[4];

    // MDMA_C15MAR @ offset=0x00000430
    __IO uint32_t MDMA_C15MAR_reg;

    // MDMA_C15MDR @ offset=0x00000434
    __IO uint32_t MDMA_C15MDR_reg;

} mdma_t;

// Peripheral OPAMP @ base_address=0x40009000
typedef struct opamp_t {

    // OPAMP1_CSR @ offset=0x00000000
    union {
        __IO uint32_t OPAMP1_CSR_reg;

        // bit fields
        struct {
            __IO uint32_t OPAEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FORCE_VP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VP_SEL_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t VM_SEL_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t OPAHSM_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t CALON_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CALSEL_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PGA_GAIN_bit : 4; // bit offset=14  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t USERTRIM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 10;
            __IO uint32_t TSTREF_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CALOUT_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 1;
        } OPAMP1_CSR_bits;
    };

    // OPAMP1_OTR @ offset=0x00000004
    union {
        __IO uint32_t OPAMP1_OTR_reg;

        // bit fields
        struct {
            __IO uint32_t TRIMOFFSETN_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t TRIMOFFSETP_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } OPAMP1_OTR_bits;
    };

    // OPAMP1_HSOTR @ offset=0x00000008
    union {
        __IO uint32_t OPAMP1_HSOTR_reg;

        // bit fields
        struct {
            __IO uint32_t TRIMLPOFFSETN_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t TRIMLPOFFSETP_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } OPAMP1_HSOTR_bits;
    };

    __IO uint8_t RESERVED0[4];

    // OPAMP2_CSR @ offset=0x00000010
    union {
        __IO uint32_t OPAMP2_CSR_reg;

        // bit fields
        struct {
            __IO uint32_t OPAEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FORCE_VP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t VM_SEL_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t OPAHSM_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t CALON_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CALSEL_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PGA_GAIN_bit : 4; // bit offset=14  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t USERTRIM_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 10;
            __IO uint32_t TSTREF_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CALOUT_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 1;
        } OPAMP2_CSR_bits;
    };

    // OPAMP2_OTR @ offset=0x00000014
    union {
        __IO uint32_t OPAMP2_OTR_reg;

        // bit fields
        struct {
            __IO uint32_t TRIMOFFSETN_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t TRIMOFFSETP_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } OPAMP2_OTR_bits;
    };

    // OPAMP2_HSOTR @ offset=0x00000018
    union {
        __IO uint32_t OPAMP2_HSOTR_reg;

        // bit fields
        struct {
            __IO uint32_t TRIMLPOFFSETN_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t TRIMLPOFFSETP_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } OPAMP2_HSOTR_bits;
    };

} opamp_t;

// Peripheral OTG1_HS_DEVICE @ base_address=0x40040800
typedef struct otg1_hs_device_t {

