minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    };

    // OTG_HS_DTXFSTS6 @ offset=0x000001A4
    __IO uint32_t OTG_HS_DTXFSTS6_reg;

    union {
        // OTG_HS_DIEPINT5 @ offset=0x000001A8
        union {
            __IO uint32_t OTG_HS_DIEPINT5_reg;

            // bit fields
            struct {
                __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0: 1;
                __IO uint32_t TOC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t ITTXFE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED1: 1;
                __IO uint32_t INEPNE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t TXFE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t TXFIFOUDRN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t BNA_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED2: 1;
                __IO uint32_t PKTDRPSTS_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t BERR_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t NAK_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED3 : 18;
            } OTG_HS_DIEPINT5_bits;
        };

        // OTG_HS_DIEPTSIZ7 @ offset=0x000001A8
        union {
            __IO uint32_t OTG_HS_DIEPTSIZ7_reg;

            // bit fields
            struct {
                __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
                __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
                __IO uint32_t MCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0 : 1;
            } OTG_HS_DIEPTSIZ7_bits;
        };

    };

    // OTG_HS_DTXFSTS7 @ offset=0x000001AC
    __IO uint32_t OTG_HS_DTXFSTS7_reg;

    // OTG_HS_DIEPTSIZ5 @ offset=0x000001B0
    union {
        __IO uint32_t OTG_HS_DIEPTSIZ5_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_DIEPTSIZ5_bits;
    };

    __IO uint8_t RESERVED18[4];

    // OTG_HS_DTXFSTS5 @ offset=0x000001B8
    __IO uint32_t OTG_HS_DTXFSTS5_reg;

    __IO uint8_t RESERVED19[4];

    // OTG_HS_DIEPCTL6 @ offset=0x000001C0
    union {
        __IO uint32_t OTG_HS_DIEPCTL6_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXFNUM_bit : 4; // bit offset=22  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPCTL6_bits;
    };

    __IO uint8_t RESERVED20[4];

    // OTG_HS_DIEPINT6 @ offset=0x000001C8
    union {
        __IO uint32_t OTG_HS_DIEPINT6_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TOC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ITTXFE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t INEPNE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXFE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXFIFOUDRN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BNA_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t PKTDRPSTS_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BERR_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NAK_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 18;
        } OTG_HS_DIEPINT6_bits;
    };

