minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    };

    union {
        // OTG_HS_GRXSTSP_Host @ offset=0x00000020
        union {
            __IO uint32_t OTG_HS_GRXSTSP_HOST_reg;

            // bit fields
            struct {
                __IO uint32_t CHNUM_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
                __IO uint32_t BCNT_bit : 11; // bit offset=4  bit width=11  access=SVDAccessType.READ_ONLY
                __IO uint32_t DPID_bit : 2; // bit offset=15  bit width=2  access=SVDAccessType.READ_ONLY
                __IO uint32_t PKTSTS_bit : 4; // bit offset=17  bit width=4  access=SVDAccessType.READ_ONLY
                __IO uint32_t RESERVED0 : 11;
            } OTG_HS_GRXSTSP_HOST_bits;
        };

        // OTG_HS_GRXSTSP_Device @ offset=0x00000020
        union {
            __IO uint32_t OTG_HS_GRXSTSP_DEVICE_reg;

            // bit fields
            struct {
                __IO uint32_t EPNUM_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
                __IO uint32_t BCNT_bit : 11; // bit offset=4  bit width=11  access=SVDAccessType.READ_ONLY
                __IO uint32_t DPID_bit : 2; // bit offset=15  bit width=2  access=SVDAccessType.READ_ONLY
                __IO uint32_t PKTSTS_bit : 4; // bit offset=17  bit width=4  access=SVDAccessType.READ_ONLY
                __IO uint32_t FRMNUM_bit : 4; // bit offset=21  bit width=4  access=SVDAccessType.READ_ONLY
                __IO uint32_t RESERVED0 : 7;
            } OTG_HS_GRXSTSP_DEVICE_bits;
        };

    };

    // OTG_HS_GRXFSIZ @ offset=0x00000024
    __IO uint32_t OTG_HS_GRXFSIZ_reg;

    union {
        // OTG_HS_HNPTXFSIZ_Host @ offset=0x00000028
        union {
            __IO uint32_t OTG_HS_HNPTXFSIZ_HOST_reg;

            // bit fields
            struct {
                __IO uint32_t NPTXFSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
                __IO uint32_t NPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
            } OTG_HS_HNPTXFSIZ_HOST_bits;
        };

        // OTG_HS_DIEPTXF0_Device @ offset=0x00000028
        union {
            __IO uint32_t OTG_HS_DIEPTXF0_DEVICE_reg;

            // bit fields
            struct {
                __IO uint32_t TX0FSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
                __IO uint32_t TX0FD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
            } OTG_HS_DIEPTXF0_DEVICE_bits;
        };

    };

    // OTG_HS_GNPTXSTS @ offset=0x0000002C
    union {
        __IO uint32_t OTG_HS_GNPTXSTS_reg;

        // bit fields
        struct {
            __IO uint32_t NPTXFSAV_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t NPTQXSAV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t NPTXQTOP_bit : 7; // bit offset=24  bit width=7  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_GNPTXSTS_bits;
    };

    __IO uint8_t RESERVED0[8];

    // OTG_HS_GCCFG @ offset=0x00000038
    union {
        __IO uint32_t OTG_HS_GCCFG_reg;

        // bit fields
        struct {
            __IO uint32_t DCDET_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PDET_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SDET_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PS2DET_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 12;
            __IO uint32_t PWRDWN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BCDEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCDEN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PDEN_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SDEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VBDEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 10;
        } OTG_HS_GCCFG_bits;
    };

    // OTG_HS_CID @ offset=0x0000003C
    __IO uint32_t OTG_HS_CID_reg;

    __IO uint8_t RESERVED1[20];

    // OTG_HS_GLPMCFG @ offset=0x00000054
    union {
        __IO uint32_t OTG_HS_GLPMCFG_reg;

        // bit fields
        struct {
            __IO uint32_t LPMEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPMACK_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BESL_bit : 4; // bit offset=2  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t REMWAKE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t L1SSEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BESLTHRS_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t L1DSEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPMRST_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t SLPSTS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t L1RSMOK_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LPMCHIDX_bit : 4; // bit offset=17  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPMRCNT_bit : 3; // bit offset=21  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNDLPM_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPMRCNTSTS_bit : 3; // bit offset=25  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t ENBESL_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 3;
        } OTG_HS_GLPMCFG_bits;
    };

    __IO uint8_t RESERVED2[168];

    // OTG_HS_HPTXFSIZ @ offset=0x00000100
    union {
        __IO uint32_t OTG_HS_HPTXFSIZ_reg;

        // bit fields
        struct {
            __IO uint32_t PTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t PTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_HPTXFSIZ_bits;
    };

