minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // OTG_HS_DIEPTXF1 @ offset=0x00000104
    union {
        __IO uint32_t OTG_HS_DIEPTXF1_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF1_bits;
    };

    // OTG_HS_DIEPTXF2 @ offset=0x00000108
    union {
        __IO uint32_t OTG_HS_DIEPTXF2_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF2_bits;
    };

    // OTG_HS_DIEPTXF3 @ offset=0x0000010C
    union {
        __IO uint32_t OTG_HS_DIEPTXF3_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF3_bits;
    };

    // OTG_HS_DIEPTXF4 @ offset=0x00000110
    union {
        __IO uint32_t OTG_HS_DIEPTXF4_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF4_bits;
    };

    // OTG_HS_DIEPTXF5 @ offset=0x00000114
    union {
        __IO uint32_t OTG_HS_DIEPTXF5_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF5_bits;
    };

    // OTG_HS_DIEPTXF6 @ offset=0x00000118
    union {
        __IO uint32_t OTG_HS_DIEPTXF6_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF6_bits;
    };

    // OTG_HS_DIEPTXF7 @ offset=0x0000011C
    union {
        __IO uint32_t OTG_HS_DIEPTXF7_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPTXF7_bits;
    };

    // OTG_DIEPTXF8 @ offset=0x00000120
    union {
        __IO uint32_t OTG_DIEPTXF8_reg;

        // bit fields
        struct {
            __IO uint32_t INEPTXSA_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPTXFD_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_DIEPTXF8_bits;
    };

} otg1_hs_global_t;

// Peripheral OTG1_HS_HOST @ base_address=0x40040400
typedef struct otg1_hs_host_t {

    // OTG_HS_HCFG @ offset=0x00000000
    union {
        __IO uint32_t OTG_HS_HCFG_reg;

        // bit fields
        struct {
            __IO uint32_t FSLSPCS_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FSLSS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 29;
        } OTG_HS_HCFG_bits;
    };

    // OTG_HS_HFIR @ offset=0x00000004
    __IO uint32_t OTG_HS_HFIR_reg;

    // OTG_HS_HFNUM @ offset=0x00000008
    union {
        __IO uint32_t OTG_HS_HFNUM_reg;

        // bit fields
        struct {
            __IO uint32_t FRNUM_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t FTREM_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } OTG_HS_HFNUM_bits;
    };

    __IO uint8_t RESERVED0[4];

    // OTG_HS_HPTXSTS @ offset=0x00000010
    union {
        __IO uint32_t OTG_HS_HPTXSTS_reg;

        // bit fields
        struct {
            __IO uint32_t PTXFSAVL_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t PTXQSAV_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t PTXQTOP_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_ONLY
        } OTG_HS_HPTXSTS_bits;
    };

    // OTG_HS_HAINT @ offset=0x00000014
    __IO uint32_t OTG_HS_HAINT_reg;

    // OTG_HS_HAINTMSK @ offset=0x00000018
    __IO uint32_t OTG_HS_HAINTMSK_reg;

    __IO uint8_t RESERVED1[36];

    // OTG_HS_HPRT @ offset=0x00000040
    union {
        __IO uint32_t OTG_HS_HPRT_reg;

        // bit fields
        struct {
            __IO uint32_t PCSTS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PCDET_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PENA_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PENCHNG_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t POCA_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t POCCHNG_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRES_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSUSP_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t PLSTS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t PPWR_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PTCTL_bit : 4; // bit offset=13  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t PSPD_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 13;
        } OTG_HS_HPRT_bits;
    };

