minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // OTG_HS_HCSPLT12 @ offset=0x0000027C
    union {
        __IO uint32_t OTG_HS_HCSPLT12_reg;

        // bit fields
        struct {
            __IO uint32_t PRTADDR_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t HUBADDR_bit : 7; // bit offset=7  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t XACTPOS_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMPLSPLT_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t SPLITEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_HCSPLT12_bits;
    };

    // OTG_HS_HCINT12 @ offset=0x00000280
    union {
        __IO uint32_t OTG_HS_HCINT12_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHH_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AHBERR_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NAK_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACK_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NYET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXERR_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BBERR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FRMOR_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DTERR_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 21;
        } OTG_HS_HCINT12_bits;
    };

    // OTG_HS_HCINTMSK12 @ offset=0x00000284
    union {
        __IO uint32_t OTG_HS_HCINTMSK12_reg;

        // bit fields
        struct {
            __IO uint32_t XFRCM_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHHM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AHBERR_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALLM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NAKM_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACKM_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NYET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXERRM_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BBERRM_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FRMORM_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DTERRM_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 21;
        } OTG_HS_HCINTMSK12_bits;
    };

    // OTG_HS_HCTSIZ12 @ offset=0x00000288
    union {
        __IO uint32_t OTG_HS_HCTSIZ12_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t DPID_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_HCTSIZ12_bits;
    };

    // OTG_HS_HCDMA12 @ offset=0x0000028C
    __IO uint32_t OTG_HS_HCDMA12_reg;

    // OTG_HS_HCCHAR13 @ offset=0x00000290
    union {
        __IO uint32_t OTG_HS_HCCHAR13_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPNUM_bit : 4; // bit offset=11  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDIR_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t LSDEV_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MC_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DAD_bit : 7; // bit offset=22  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t ODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_HCCHAR13_bits;
    };

    // OTG_HS_HCSPLT13 @ offset=0x00000294
    union {
        __IO uint32_t OTG_HS_HCSPLT13_reg;

        // bit fields
        struct {
            __IO uint32_t PRTADDR_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t HUBADDR_bit : 7; // bit offset=7  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t XACTPOS_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMPLSPLT_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t SPLITEN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_HCSPLT13_bits;
    };

    // OTG_HS_HCINT13 @ offset=0x00000298
    union {
        __IO uint32_t OTG_HS_HCINT13_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHH_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AHBERR_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NAK_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ACK_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NYET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXERR_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BBERR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FRMOR_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DTERR_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 21;
        } OTG_HS_HCINT13_bits;
    };

