minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // OTG_HS_DCFG @ offset=0x00000000
    union {
        __IO uint32_t OTG_HS_DCFG_reg;

        // bit fields
        struct {
            __IO uint32_t DSPD_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NZLSOHSK_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DAD_bit : 7; // bit offset=4  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t PFIVL_bit : 2; // bit offset=11  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 11;
            __IO uint32_t PERSCHIVL_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 6;
        } OTG_HS_DCFG_bits;
    };

    // OTG_HS_DCTL @ offset=0x00000004
    union {
        __IO uint32_t OTG_HS_DCTL_reg;

        // bit fields
        struct {
            __IO uint32_t RWUSIG_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GINSTS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t GONSTS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCTL_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SGINAK_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CGINAK_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SGONAK_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CGONAK_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t POPRGDNE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 20;
        } OTG_HS_DCTL_bits;
    };

    // OTG_HS_DSTS @ offset=0x00000008
    union {
        __IO uint32_t OTG_HS_DSTS_reg;

        // bit fields
        struct {
            __IO uint32_t SUSPSTS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ENUMSPD_bit : 2; // bit offset=1  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t EERR_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t FNSOF_bit : 14; // bit offset=8  bit width=14  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 10;
        } OTG_HS_DSTS_bits;
    };

    __IO uint8_t RESERVED0[4];

    // OTG_HS_DIEPMSK @ offset=0x00000010
    union {
        __IO uint32_t OTG_HS_DIEPMSK_reg;

        // bit fields
        struct {
            __IO uint32_t XFRCM_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TOM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ITTXFEMSK_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPNMM_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t INEPNEM_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t TXFURM_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BIM_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 22;
        } OTG_HS_DIEPMSK_bits;
    };

    // OTG_HS_DOEPMSK @ offset=0x00000014
    union {
        __IO uint32_t OTG_HS_DOEPMSK_reg;

        // bit fields
        struct {
            __IO uint32_t XFRCM_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t STUPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OTEPDM_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t B2BSTUP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t OPEM_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BOIM_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 22;
        } OTG_HS_DOEPMSK_bits;
    };

    // OTG_HS_DAINT @ offset=0x00000018
    union {
        __IO uint32_t OTG_HS_DAINT_reg;

        // bit fields
        struct {
            __IO uint32_t IEPINT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t OEPINT_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } OTG_HS_DAINT_bits;
    };

    // OTG_HS_DAINTMSK @ offset=0x0000001C
    union {
        __IO uint32_t OTG_HS_DAINTMSK_reg;

        // bit fields
        struct {
            __IO uint32_t IEPM_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t OEPM_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } OTG_HS_DAINTMSK_bits;
    };

    __IO uint8_t RESERVED1[8];

    // OTG_HS_DVBUSDIS @ offset=0x00000028
    __IO uint32_t OTG_HS_DVBUSDIS_reg;

    // OTG_HS_DVBUSPULSE @ offset=0x0000002C
    __IO uint32_t OTG_HS_DVBUSPULSE_reg;

    // OTG_HS_DTHRCTL @ offset=0x00000030
    union {
        __IO uint32_t OTG_HS_DTHRCTL_reg;

        // bit fields
        struct {
            __IO uint32_t NONISOTHREN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ISOTHREN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXTHRLEN_bit : 9; // bit offset=2  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t RXTHREN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXTHRLEN_bit : 9; // bit offset=17  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t ARPEN_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 4;
        } OTG_HS_DTHRCTL_bits;
    };

    // OTG_HS_DIEPEMPMSK @ offset=0x00000034
    __IO uint32_t OTG_HS_DIEPEMPMSK_reg;

    // OTG_HS_DEACHINT @ offset=0x00000038
    union {
        __IO uint32_t OTG_HS_DEACHINT_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t IEP1INT_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 15;
            __IO uint32_t OEP1INT_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 14;
        } OTG_HS_DEACHINT_bits;
    };

    // OTG_HS_DEACHINTMSK @ offset=0x0000003C
    union {
        __IO uint32_t OTG_HS_DEACHINTMSK_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t IEP1INTM_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 15;
            __IO uint32_t OEP1INTM_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 14;
        } OTG_HS_DEACHINTMSK_bits;
    };

    __IO uint8_t RESERVED2[192];

