minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    __IO uint8_t RESERVED21[20];

    // OTG_HS_DIEPCTL7 @ offset=0x000001E0
    union {
        __IO uint32_t OTG_HS_DIEPCTL7_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXFNUM_bit : 4; // bit offset=22  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DIEPCTL7_bits;
    };

    __IO uint8_t RESERVED22[4];

    // OTG_HS_DIEPINT7 @ offset=0x000001E8
    union {
        __IO uint32_t OTG_HS_DIEPINT7_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TOC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ITTXFE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t INEPNE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXFE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXFIFOUDRN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BNA_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t PKTDRPSTS_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BERR_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NAK_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 18;
        } OTG_HS_DIEPINT7_bits;
    };

    __IO uint8_t RESERVED23[276];

    // OTG_HS_DOEPCTL0 @ offset=0x00000300
    union {
        __IO uint32_t OTG_HS_DOEPCTL0_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t SNPM_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.WRITE_ONLY
        } OTG_HS_DOEPCTL0_bits;
    };

    __IO uint8_t RESERVED24[4];

    // OTG_HS_DOEPINT0 @ offset=0x00000308
    union {
        __IO uint32_t OTG_HS_DOEPINT0_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t STUP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OTEPDIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t B2BSTUP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t NYET_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 17;
        } OTG_HS_DOEPINT0_bits;
    };

    __IO uint8_t RESERVED25[4];

    // OTG_HS_DOEPTSIZ0 @ offset=0x00000310
    union {
        __IO uint32_t OTG_HS_DOEPTSIZ0_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 12;
            __IO uint32_t PKTCNT_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 9;
            __IO uint32_t STUPCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 1;
        } OTG_HS_DOEPTSIZ0_bits;
    };

