minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // OTG_HS_DOEPCTL3 @ offset=0x00000360
    union {
        __IO uint32_t OTG_HS_DOEPCTL3_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNPM_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DOEPCTL3_bits;
    };

    __IO uint8_t RESERVED33[4];

    // OTG_HS_DOEPINT3 @ offset=0x00000368
    union {
        __IO uint32_t OTG_HS_DOEPINT3_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t STUP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OTEPDIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t B2BSTUP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t NYET_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 17;
        } OTG_HS_DOEPINT3_bits;
    };

    __IO uint8_t RESERVED34[4];

    // OTG_HS_DOEPTSIZ3 @ offset=0x00000370
    union {
        __IO uint32_t OTG_HS_DOEPTSIZ3_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXDPID_STUPCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_DOEPTSIZ3_bits;
    };

    __IO uint8_t RESERVED35[12];

    // OTG_HS_DOEPCTL4 @ offset=0x00000380
    union {
        __IO uint32_t OTG_HS_DOEPCTL4_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNPM_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DOEPCTL4_bits;
    };

    __IO uint8_t RESERVED36[4];

    // OTG_HS_DOEPINT4 @ offset=0x00000388
    union {
        __IO uint32_t OTG_HS_DOEPINT4_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t STUP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OTEPDIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t B2BSTUP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t NYET_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 17;
        } OTG_HS_DOEPINT4_bits;
    };

    __IO uint8_t RESERVED37[4];

    // OTG_HS_DOEPTSIZ4 @ offset=0x00000390
    union {
        __IO uint32_t OTG_HS_DOEPTSIZ4_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXDPID_STUPCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_DOEPTSIZ4_bits;
    };

