minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    __IO uint8_t RESERVED38[12];

    // OTG_HS_DOEPCTL5 @ offset=0x000003A0
    union {
        __IO uint32_t OTG_HS_DOEPCTL5_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNPM_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DOEPCTL5_bits;
    };

    __IO uint8_t RESERVED39[4];

    // OTG_HS_DOEPINT5 @ offset=0x000003A8
    union {
        __IO uint32_t OTG_HS_DOEPINT5_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t STUP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OTEPDIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t B2BSTUP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t NYET_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 17;
        } OTG_HS_DOEPINT5_bits;
    };

    __IO uint8_t RESERVED40[4];

    // OTG_HS_DOEPTSIZ5 @ offset=0x000003B0
    union {
        __IO uint32_t OTG_HS_DOEPTSIZ5_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXDPID_STUPCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_DOEPTSIZ5_bits;
    };

    __IO uint8_t RESERVED41[12];

    // OTG_HS_DOEPCTL6 @ offset=0x000003C0
    union {
        __IO uint32_t OTG_HS_DOEPCTL6_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNPM_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DOEPCTL6_bits;
    };

    __IO uint8_t RESERVED42[4];

    // OTG_HS_DOEPINT6 @ offset=0x000003C8
    union {
        __IO uint32_t OTG_HS_DOEPINT6_reg;

        // bit fields
        struct {
            __IO uint32_t XFRC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPDISD_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t STUP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OTEPDIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t B2BSTUP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t NYET_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 17;
        } OTG_HS_DOEPINT6_bits;
    };

    __IO uint8_t RESERVED43[4];

    // OTG_HS_DOEPTSIZ6 @ offset=0x000003D0
    union {
        __IO uint32_t OTG_HS_DOEPTSIZ6_reg;

        // bit fields
        struct {
            __IO uint32_t XFRSIZ_bit : 19; // bit offset=0  bit width=19  access=SVDAccessType.READ_WRITE
            __IO uint32_t PKTCNT_bit : 10; // bit offset=19  bit width=10  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXDPID_STUPCNT_bit : 2; // bit offset=29  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 1;
        } OTG_HS_DOEPTSIZ6_bits;
    };

    __IO uint8_t RESERVED44[12];

    // OTG_HS_DOEPCTL7 @ offset=0x000003E0
    union {
        __IO uint32_t OTG_HS_DOEPCTL7_reg;

        // bit fields
        struct {
            __IO uint32_t MPSIZ_bit : 11; // bit offset=0  bit width=11  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t USBAEP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EONUM_DPID_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t NAKSTS_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EPTYP_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SNPM_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STALL_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t CNAK_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SNAK_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SD0PID_SEVNFRM_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SODDFRM_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t EPDIS_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t EPENA_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } OTG_HS_DOEPCTL7_bits;
    };

