minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
// Peripheral PWR @ base_address=0x58024800
typedef struct pwr_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t LPDS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t PVDE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLS_bit : 3; // bit offset=5  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t DBP_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FLPS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t SVOS_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t AVDEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ALS_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 13;
        } CR1_bits;
    };

    // CSR1 @ offset=0x00000004
    union {
        __IO uint32_t CSR1_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PVDO_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 8;
            __IO uint32_t ACTVOSRDY_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t ACTVOS_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t AVDO_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 15;
        } CSR1_bits;
    };

    // CR2 @ offset=0x00000008
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t BREN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t MONEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 11;
            __IO uint32_t BRRDY_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2: 3;
            __IO uint32_t VBATL_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VBATH_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMPL_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TEMPH_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED3 : 8;
        } CR2_bits;
    };

    // CR3 @ offset=0x0000000C
    union {
        __IO uint32_t CR3_reg;

        // bit fields
        struct {
            __IO uint32_t BYPASS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LDOEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SCUEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t VBE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VBRS_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 14;
            __IO uint32_t USB33DEN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USBREGEN_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USB33RDY_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 5;
        } CR3_bits;
    };

    // CPUCR @ offset=0x00000010
    union {
        __IO uint32_t CPUCR_reg;

        // bit fields
        struct {
            __IO uint32_t PDDS_D1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PDDS_D2_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PDDS_D3_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t STOPF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SBF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SBF_D1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SBF_D2_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CSSF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t RUN_D3_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 20;
        } CPUCR_bits;
    };

    __IO uint8_t RESERVED0[4];

    // D3CR @ offset=0x00000018
    union {
        __IO uint32_t D3CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t VOSRDY_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VOS_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } D3CR_bits;
    };

    __IO uint8_t RESERVED1[4];

    // WKUPCR @ offset=0x00000020
    __IO uint32_t WKUPCR_reg;

    // WKUPFR @ offset=0x00000024
    union {
        __IO uint32_t WKUPFR_reg;

        // bit fields
        struct {
            __IO uint32_t WKUPF1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPF2_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPF3_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPF4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPF5_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPF6_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 26;
        } WKUPFR_bits;
    };

