minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // WKUPEPR @ offset=0x00000028
    union {
        __IO uint32_t WKUPEPR_reg;

        // bit fields
        struct {
            __IO uint32_t WKUPEN1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPEN2_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPEN3_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPEN4_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPEN5_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPEN6_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t WKUPP1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPP2_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPP3_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPP4_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPP5_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPP6_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t WKUPPUPD1_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPPUPD2_bit : 2; // bit offset=18  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPPUPD3_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPPUPD4_bit : 2; // bit offset=22  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPPUPD5_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WKUPPUPD6_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 4;
        } WKUPEPR_bits;
    };

} pwr_t;

// Peripheral QUADSPI @ base_address=0x52005000
typedef struct quadspi_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ABORT_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCEN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSHIFT_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DFM_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FSEL_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FTHRES_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t TEIE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCIE_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FTIE_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMIE_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TOIE_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t APMS_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PMM_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRESCALER_bit : 8; // bit offset=24  bit width=8  access=SVDAccessType.READ_WRITE
        } CR_bits;
    };

    // DCR @ offset=0x00000004
    union {
        __IO uint32_t DCR_reg;

        // bit fields
        struct {
            __IO uint32_t CKMODE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t CSHT_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 5;
            __IO uint32_t FSIZE_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 11;
        } DCR_bits;
    };

    // SR @ offset=0x00000008
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t TEF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FTF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SMF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TOF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t BUSY_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t FLEVEL_bit : 6; // bit offset=8  bit width=6  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 18;
        } SR_bits;
    };

    // FCR @ offset=0x0000000C
    union {
        __IO uint32_t FCR_reg;

        // bit fields
        struct {
            __IO uint32_t CTEF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTCF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CSMF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CTOF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 27;
        } FCR_bits;
    };

    // DLR @ offset=0x00000010
    __IO uint32_t DLR_reg;

