minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // CCR @ offset=0x00000014
    union {
        __IO uint32_t CCR_reg;

        // bit fields
        struct {
            __IO uint32_t INSTRUCTION_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t IMODE_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADMODE_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ADSIZE_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ABMODE_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ABSIZE_bit : 2; // bit offset=16  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t DCYC_bit : 5; // bit offset=18  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DMODE_bit : 2; // bit offset=24  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t FMODE_bit : 2; // bit offset=26  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SIOO_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DHHC_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DDRM_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CCR_bits;
    };

    // AR @ offset=0x00000018
    __IO uint32_t AR_reg;

    // ABR @ offset=0x0000001C
    __IO uint32_t ABR_reg;

    // DR @ offset=0x00000020
    __IO uint32_t DR_reg;

    // PSMKR @ offset=0x00000024
    __IO uint32_t PSMKR_reg;

    // PSMAR @ offset=0x00000028
    __IO uint32_t PSMAR_reg;

    // PIR @ offset=0x0000002C
    __IO uint32_t PIR_reg;

    // LPTR @ offset=0x00000030
    __IO uint32_t LPTR_reg;

} quadspi_t;

// Peripheral RAMECC1 @ base_address=0x52009000
typedef struct ramecc1_t {

    // IER @ offset=0x00000000
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t GIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCSEIE__bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCDEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCDEBWIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 28;
        } IER_bits;
    };

    __IO uint8_t RESERVED0[28];

    // M1CR @ offset=0x00000020
    union {
        __IO uint32_t M1CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M1CR_bits;
    };

    // M1SR @ offset=0x00000024
    union {
        __IO uint32_t M1SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M1SR_bits;
    };

    // M1FAR @ offset=0x00000028
    __IO uint32_t M1FAR_reg;

    // M1FDRL @ offset=0x0000002C
    __IO uint32_t M1FDRL_reg;

    // M1FDRH @ offset=0x00000030
    __IO uint32_t M1FDRH_reg;

    // M1FECR @ offset=0x00000034
    __IO uint32_t M1FECR_reg;

    __IO uint8_t RESERVED1[8];

    // M2CR @ offset=0x00000040
    union {
        __IO uint32_t M2CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M2CR_bits;
    };

    // M2SR @ offset=0x00000044
    union {
        __IO uint32_t M2SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M2SR_bits;
    };

    // M2FAR @ offset=0x00000048
    __IO uint32_t M2FAR_reg;

    // M2FDRL @ offset=0x0000004C
    __IO uint32_t M2FDRL_reg;

    // M2FDRH @ offset=0x00000050
    __IO uint32_t M2FDRH_reg;

    __IO uint8_t RESERVED2[4];

    // M2FECR @ offset=0x00000058
    __IO uint32_t M2FECR_reg;

    __IO uint8_t RESERVED3[4];

    // M3CR @ offset=0x00000060
    union {
        __IO uint32_t M3CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M3CR_bits;
    };

    // M3SR @ offset=0x00000064
    union {
        __IO uint32_t M3SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M3SR_bits;
    };

    // M3FAR @ offset=0x00000068
    __IO uint32_t M3FAR_reg;

    // M3FDRL @ offset=0x0000006C
    __IO uint32_t M3FDRL_reg;

    // M3FDRH @ offset=0x00000070
    __IO uint32_t M3FDRH_reg;

    __IO uint8_t RESERVED4[8];

    // M3FECR @ offset=0x0000007C
    __IO uint32_t M3FECR_reg;

    // M4CR @ offset=0x00000080
    union {
        __IO uint32_t M4CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M4CR_bits;
    };

    // M4SR @ offset=0x00000084
    union {
        __IO uint32_t M4SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M4SR_bits;
    };

    // M4FAR @ offset=0x00000088
    __IO uint32_t M4FAR_reg;

