minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // M4FDRL @ offset=0x0000008C
    __IO uint32_t M4FDRL_reg;

    union {
        // M4FDRH @ offset=0x00000090
        __IO uint32_t M4FDRH_reg;

        // M4FECR @ offset=0x00000090
        __IO uint32_t M4FECR_reg;

    };

    __IO uint8_t RESERVED5[12];

    // M5CR @ offset=0x000000A0
    union {
        __IO uint32_t M5CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M5CR_bits;
    };

    // M5SR @ offset=0x000000A4
    union {
        __IO uint32_t M5SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M5SR_bits;
    };

    // M5FAR @ offset=0x000000A8
    __IO uint32_t M5FAR_reg;

    // M5FDRL @ offset=0x000000AC
    __IO uint32_t M5FDRL_reg;

    // M5FDRH @ offset=0x000000B0
    __IO uint32_t M5FDRH_reg;

    // M5FECR @ offset=0x000000B4
    __IO uint32_t M5FECR_reg;

} ramecc1_t;

// Peripheral RAMECC2 @ base_address=0x48023000
typedef struct ramecc2_t {

    // IER @ offset=0x00000000
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t GIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCSEIE__bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCDEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCDEBWIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 28;
        } IER_bits;
    };

    __IO uint8_t RESERVED0[28];

    // M1CR @ offset=0x00000020
    union {
        __IO uint32_t M1CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M1CR_bits;
    };

    // M1SR @ offset=0x00000024
    union {
        __IO uint32_t M1SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M1SR_bits;
    };

    // M1FAR @ offset=0x00000028
    __IO uint32_t M1FAR_reg;

    // M1FDRL @ offset=0x0000002C
    __IO uint32_t M1FDRL_reg;

    // M1FDRH @ offset=0x00000030
    __IO uint32_t M1FDRH_reg;

    // M1FECR @ offset=0x00000034
    __IO uint32_t M1FECR_reg;

    __IO uint8_t RESERVED1[8];

    // M2CR @ offset=0x00000040
    union {
        __IO uint32_t M2CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M2CR_bits;
    };

    // M2SR @ offset=0x00000044
    union {
        __IO uint32_t M2SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M2SR_bits;
    };

    // M2FAR @ offset=0x00000048
    __IO uint32_t M2FAR_reg;

    // M2FDRL @ offset=0x0000004C
    __IO uint32_t M2FDRL_reg;

    // M2FDRH @ offset=0x00000050
    __IO uint32_t M2FDRH_reg;

    __IO uint8_t RESERVED2[4];

    // M2FECR @ offset=0x00000058
    __IO uint32_t M2FECR_reg;

    __IO uint8_t RESERVED3[4];

    // M3CR @ offset=0x00000060
    union {
        __IO uint32_t M3CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M3CR_bits;
    };

    // M3SR @ offset=0x00000064
    union {
        __IO uint32_t M3SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M3SR_bits;
    };

    // M3FAR @ offset=0x00000068
    __IO uint32_t M3FAR_reg;

    // M3FDRL @ offset=0x0000006C
    __IO uint32_t M3FDRL_reg;

    // M3FDRH @ offset=0x00000070
    __IO uint32_t M3FDRH_reg;

    __IO uint8_t RESERVED4[8];

    // M3FECR @ offset=0x0000007C
    __IO uint32_t M3FECR_reg;

    // M4CR @ offset=0x00000080
    union {
        __IO uint32_t M4CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M4CR_bits;
    };

    // M4SR @ offset=0x00000084
    union {
        __IO uint32_t M4SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M4SR_bits;
    };

    // M4FAR @ offset=0x00000088
    __IO uint32_t M4FAR_reg;

