minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // M4FDRL @ offset=0x0000008C
    __IO uint32_t M4FDRL_reg;

    union {
        // M4FDRH @ offset=0x00000090
        __IO uint32_t M4FDRH_reg;

        // M4FECR @ offset=0x00000090
        __IO uint32_t M4FECR_reg;

    };

    __IO uint8_t RESERVED5[12];

    // M5CR @ offset=0x000000A0
    union {
        __IO uint32_t M5CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M5CR_bits;
    };

    // M5SR @ offset=0x000000A4
    union {
        __IO uint32_t M5SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M5SR_bits;
    };

    // M5FAR @ offset=0x000000A8
    __IO uint32_t M5FAR_reg;

    // M5FDRL @ offset=0x000000AC
    __IO uint32_t M5FDRL_reg;

    // M5FDRH @ offset=0x000000B0
    __IO uint32_t M5FDRH_reg;

    // M5FECR @ offset=0x000000B4
    __IO uint32_t M5FECR_reg;

} ramecc2_t;

// Peripheral RAMECC3 @ base_address=0x58027000
typedef struct ramecc3_t {

    // IER @ offset=0x00000000
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t GIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCSEIE__bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCDEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GECCDEBWIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 28;
        } IER_bits;
    };

    __IO uint8_t RESERVED0[28];

    // M1CR @ offset=0x00000020
    union {
        __IO uint32_t M1CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M1CR_bits;
    };

    // M1SR @ offset=0x00000024
    union {
        __IO uint32_t M1SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M1SR_bits;
    };

    // M1FAR @ offset=0x00000028
    __IO uint32_t M1FAR_reg;

    // M1FDRL @ offset=0x0000002C
    __IO uint32_t M1FDRL_reg;

    // M1FDRH @ offset=0x00000030
    __IO uint32_t M1FDRH_reg;

    // M1FECR @ offset=0x00000034
    __IO uint32_t M1FECR_reg;

    __IO uint8_t RESERVED1[8];

    // M2CR @ offset=0x00000040
    union {
        __IO uint32_t M2CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t ECCSEIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCDEBWIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECCELEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } M2CR_bits;
    };

    // M2SR @ offset=0x00000044
    union {
        __IO uint32_t M2SR_reg;

        // bit fields
        struct {
            __IO uint32_t SEDCF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEDF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DEBWDF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } M2SR_bits;
    };

    // M2FAR @ offset=0x00000048
    __IO uint32_t M2FAR_reg;

    // M2FDRL @ offset=0x0000004C
    __IO uint32_t M2FDRL_reg;

    // M2FDRH @ offset=0x00000050
    __IO uint32_t M2FDRH_reg;

    __IO uint8_t RESERVED2[4];

    // M2FECR @ offset=0x00000058
    __IO uint32_t M2FECR_reg;

} ramecc3_t;

// Peripheral RCC @ base_address=0x58024400
typedef struct rcc_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t HSION_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSIKERON_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSIRDY_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSIDIV_bit : 2; // bit offset=3  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSIDIVF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CSION_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSIRDY_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSIKERON_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t RC48ON_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RC48RDY_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t D1CKRDY_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t D2CKRDY_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSEON_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSERDY_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSEBYP_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSECSSON_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t PLL1ON_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL1RDY_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL2ON_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL2RDY_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL3ON_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL3RDY_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 2;
        } CR_bits;
    };

    union {
        // ICSCR @ offset=0x00000004
        union {
            __IO uint32_t ICSCR_reg;

            // bit fields
            struct {
                __IO uint32_t HSICAL_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
                __IO uint32_t HSITRIM_bit : 6; // bit offset=12  bit width=6  access=SVDAccessType.READ_WRITE
                __IO uint32_t CSICAL_bit : 8; // bit offset=18  bit width=8  access=SVDAccessType.READ_ONLY
                __IO uint32_t CSITRIM_bit : 5; // bit offset=26  bit width=5  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0 : 1;
            } ICSCR_bits;
        };

        // HSICFGR @ offset=0x00000004
        union {
            __IO uint32_t HSICFGR_reg;

            // bit fields
            struct {
                __IO uint32_t HSICAL_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
                __IO uint32_t RESERVED0: 12;
                __IO uint32_t HSITRIM_bit : 7; // bit offset=24  bit width=7  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED1 : 1;
            } HSICFGR_bits;
        };

