minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    };

    // CRRCR @ offset=0x00000008
    __IO uint32_t CRRCR_reg;

    __IO uint8_t RESERVED0[4];

    // CFGR @ offset=0x00000010
    union {
        __IO uint32_t CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t SW_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWS_bit : 3; // bit offset=3  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t STOPWUCK_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t STOPKERWUCK_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RTCPRE_bit : 6; // bit offset=8  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t HRTIMSEL_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIMPRE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t MCO1PRE_bit : 4; // bit offset=18  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCO1SEL_bit : 3; // bit offset=22  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCO2PRE_bit : 4; // bit offset=25  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCO2SEL_bit : 3; // bit offset=29  bit width=3  access=SVDAccessType.READ_WRITE
        } CFGR_bits;
    };

    __IO uint8_t RESERVED1[4];

    // D1CFGR @ offset=0x00000018
    union {
        __IO uint32_t D1CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t HPRE_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t D1PPRE_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t D1CPRE_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 20;
        } D1CFGR_bits;
    };

    // D2CFGR @ offset=0x0000001C
    union {
        __IO uint32_t D2CFGR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t D2PPRE1_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t D2PPRE2_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 21;
        } D2CFGR_bits;
    };

    // D3CFGR @ offset=0x00000020
    __IO uint32_t D3CFGR_reg;

    __IO uint8_t RESERVED2[4];

    // PLLCKSELR @ offset=0x00000028
    union {
        __IO uint32_t PLLCKSELR_reg;

        // bit fields
        struct {
            __IO uint32_t PLLSRC_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t DIVM1_bit : 6; // bit offset=4  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t DIVM2_bit : 6; // bit offset=12  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t DIVM3_bit : 6; // bit offset=20  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 6;
        } PLLCKSELR_bits;
    };

    // PLLCFGR @ offset=0x0000002C
    union {
        __IO uint32_t PLLCFGR_reg;

        // bit fields
        struct {
            __IO uint32_t PLL1FRACEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL1VCOSEL_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL1RGE_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL2FRACEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL2VCOSEL_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL2RGE_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL3FRACEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL3VCOSEL_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PLL3RGE_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t DIVP1EN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVQ1EN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVR1EN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVP2EN_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVQ2EN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVR2EN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVP3EN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVQ3EN_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVR3EN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 7;
        } PLLCFGR_bits;
    };

    // PLL1DIVR @ offset=0x00000030
    union {
        __IO uint32_t PLL1DIVR_reg;

        // bit fields
        struct {
            __IO uint32_t DIVN1_bit : 9; // bit offset=0  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVP1_bit : 7; // bit offset=9  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVQ1_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DIVR1_bit : 7; // bit offset=24  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 1;
        } PLL1DIVR_bits;
    };

    // PLL1FRACR @ offset=0x00000034
    __IO uint32_t PLL1FRACR_reg;

    // PLL2DIVR @ offset=0x00000038
    union {
        __IO uint32_t PLL2DIVR_reg;

        // bit fields
        struct {
            __IO uint32_t DIVN2_bit : 9; // bit offset=0  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVP2_bit : 7; // bit offset=9  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVQ2_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DIVR2_bit : 7; // bit offset=24  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 1;
        } PLL2DIVR_bits;
    };

    // PLL2FRACR @ offset=0x0000003C
    __IO uint32_t PLL2FRACR_reg;

    // PLL3DIVR @ offset=0x00000040
    union {
        __IO uint32_t PLL3DIVR_reg;

        // bit fields
        struct {
            __IO uint32_t DIVN3_bit : 9; // bit offset=0  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVP3_bit : 7; // bit offset=9  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIVQ3_bit : 7; // bit offset=16  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DIVR3_bit : 7; // bit offset=24  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 1;
        } PLL3DIVR_bits;
    };

    // PLL3FRACR @ offset=0x00000044
    __IO uint32_t PLL3FRACR_reg;

    __IO uint8_t RESERVED3[4];

    // D1CCIPR @ offset=0x0000004C
    union {
        __IO uint32_t D1CCIPR_reg;

        // bit fields
        struct {
            __IO uint32_t FMCSEL_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t QSPISEL_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 10;
            __IO uint32_t SDMMCSEL_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 11;
            __IO uint32_t CKPERSEL_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 2;
        } D1CCIPR_bits;
    };

    // D2CCIP1R @ offset=0x00000050
    union {
        __IO uint32_t D2CCIP1R_reg;

        // bit fields
        struct {
            __IO uint32_t SAI1SEL_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t SAI23SEL_bit : 3; // bit offset=6  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t SPI123SEL_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SPI45SEL_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SPDIFSEL_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 2;
            __IO uint32_t DFSDM1SEL_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 3;
            __IO uint32_t FDCANSEL_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6: 1;
            __IO uint32_t SWPSEL_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } D2CCIP1R_bits;
    };

