minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // GCR @ offset=0x000000A0
    __IO uint32_t GCR_reg;

    __IO uint8_t RESERVED7[4];

    // D3AMR @ offset=0x000000A8
    union {
        __IO uint32_t D3AMR_reg;

        // bit fields
        struct {
            __IO uint32_t BDMAAMEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t LPUART1AMEN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t SPI6AMEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t I2C4AMEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t LPTIM2AMEN_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPTIM3AMEN_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPTIM4AMEN_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPTIM5AMEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t COMP12AMEN_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VREFAMEN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RTCAMEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 2;
            __IO uint32_t CRCAMEN_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6: 1;
            __IO uint32_t SAI4AMEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED7: 2;
            __IO uint32_t ADC3AMEN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED8: 3;
            __IO uint32_t BKPRAMAMEN_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SRAM4AMEN_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED9 : 2;
        } D3AMR_bits;
    };

    __IO uint8_t RESERVED8[36];

    // RSR @ offset=0x000000D0
    union {
        __IO uint32_t RSR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 16;
            __IO uint32_t RMVF_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPURSTF_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t D1RSTF_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t D2RSTF_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BORRSTF_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PINRSTF_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PORRSTF_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SFTRSTF_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t IWDG1RSTF_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t WWDG1RSTF_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t LPWRRSTF_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5 : 1;
        } RSR_bits;
    };

    // AHB3ENR @ offset=0x000000D4
    union {
        __IO uint32_t AHB3ENR_reg;

        // bit fields
        struct {
            __IO uint32_t MDMAEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DMA2DEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t JPGDECEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t FMCEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t QSPIEN_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SDMMC1EN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 15;
        } AHB3ENR_bits;
    };

    // AHB1ENR @ offset=0x000000D8
    union {
        __IO uint32_t AHB1ENR_reg;

        // bit fields
        struct {
            __IO uint32_t DMA1EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMA2EN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t ADC12EN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 9;
            __IO uint32_t ETH1MACEN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETH1TXEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETH1RXEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t USB1OTGHSEN_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USB1OTGHSULPIEN_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USB2OTGHSEN_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USB2OTGHSULPIEN_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 3;
        } AHB1ENR_bits;
    };

    // AHB2ENR @ offset=0x000000DC
    union {
        __IO uint32_t AHB2ENR_reg;

        // bit fields
        struct {
            __IO uint32_t DCMIEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t CRYPTEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HASHEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RNGEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t SDMMC2EN_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 19;
            __IO uint32_t SRAM1EN_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SRAM2EN_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SRAM3EN_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } AHB2ENR_bits;
    };

    // AHB4ENR @ offset=0x000000E0
    union {
        __IO uint32_t AHB4ENR_reg;

        // bit fields
        struct {
            __IO uint32_t GPIOAEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOBEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOCEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIODEN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOEEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOFEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOGEN_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOHEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOIEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOJEN_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GPIOKEN_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t CRCEN_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t BDMAEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t ADC3EN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HSEMEN_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t BKPRAMEN_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 3;
        } AHB4ENR_bits;
    };

