minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // C1_APB1HLPENR @ offset=0x00000174
    union {
        __IO uint32_t C1_APB1HLPENR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CRSLPEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SWPLPEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t OPAMPLPEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MDIOSLPEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t FDCANLPEN_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 23;
        } C1_APB1HLPENR_bits;
    };

    // C1_APB2LPENR @ offset=0x00000178
    union {
        __IO uint32_t C1_APB2LPENR_reg;

        // bit fields
        struct {
            __IO uint32_t TIM1LPEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIM8LPEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t USART1LPEN_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t USART6LPEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 6;
            __IO uint32_t SPI1LPEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SPI4LPEN_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 2;
            __IO uint32_t TIM15LPEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIM16LPEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIM17LPEN_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t SPI5LPEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t SAI1LPEN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SAI2LPEN_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SAI3LPEN_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 3;
            __IO uint32_t DFSDM1LPEN_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HRTIMLPEN_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6 : 2;
        } C1_APB2LPENR_bits;
    };

    // C1_APB4LPENR @ offset=0x0000017C
    union {
        __IO uint32_t C1_APB4LPENR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SYSCFGLPEN_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t LPUART1LPEN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SPI6LPEN_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t I2C4LPEN_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t LPTIM2LPEN_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPTIM3LPEN_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPTIM4LPEN_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LPTIM5LPEN_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 1;
            __IO uint32_t COMP12LPEN_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VREFLPEN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RTCAPBLPEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6: 4;
            __IO uint32_t SAI4LPEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED7 : 10;
        } C1_APB4LPENR_bits;
    };

} rcc_t;

// Peripheral RNG @ base_address=0x48021800
typedef struct rng_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t RNGEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CED_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 26;
        } CR_bits;
    };

    // SR @ offset=0x00000004
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t DRDY_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CECS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SECS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CEIS_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SEIS_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 25;
        } SR_bits;
    };

