minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // RTC_WUTR @ offset=0x00000014
    __IO uint32_t RTC_WUTR_reg;

    __IO uint8_t RESERVED0[4];

    // RTC_ALRMAR @ offset=0x0000001C
    union {
        __IO uint32_t RTC_ALRMAR_reg;

        // bit fields
        struct {
            __IO uint32_t SU_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ST_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MNU_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t MNT_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK2_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HU_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t HT_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PM_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK3_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DU_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DT_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WDSEL_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK4_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } RTC_ALRMAR_bits;
    };

    // RTC_ALRMBR @ offset=0x00000020
    union {
        __IO uint32_t RTC_ALRMBR_reg;

        // bit fields
        struct {
            __IO uint32_t SU_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ST_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK1_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MNU_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t MNT_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK2_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HU_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t HT_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PM_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK3_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DU_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t DT_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WDSEL_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSK4_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } RTC_ALRMBR_bits;
    };

    // RTC_WPR @ offset=0x00000024
    __IO uint32_t RTC_WPR_reg;

    // RTC_SSR @ offset=0x00000028
    __IO uint32_t RTC_SSR_reg;

    // RTC_SHIFTR @ offset=0x0000002C
    union {
        __IO uint32_t RTC_SHIFTR_reg;

        // bit fields
        struct {
            __IO uint32_t SUBFS_bit : 15; // bit offset=0  bit width=15  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0: 16;
            __IO uint32_t ADD1S_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.WRITE_ONLY
        } RTC_SHIFTR_bits;
    };

    // RTC_TSTR @ offset=0x00000030
    union {
        __IO uint32_t RTC_TSTR_reg;

        // bit fields
        struct {
            __IO uint32_t SU_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t ST_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t MNU_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t MNT_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t HU_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t HT_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t PM_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED2 : 9;
        } RTC_TSTR_bits;
    };

    // RTC_TSDR @ offset=0x00000034
    union {
        __IO uint32_t RTC_TSDR_reg;

        // bit fields
        struct {
            __IO uint32_t DU_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t DT_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t MU_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t MT_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t WDU_bit : 3; // bit offset=13  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 16;
        } RTC_TSDR_bits;
    };

    // RTC_TSSSR @ offset=0x00000038
    __IO uint32_t RTC_TSSSR_reg;

    // RTC_CALR @ offset=0x0000003C
    union {
        __IO uint32_t RTC_CALR_reg;

        // bit fields
        struct {
            __IO uint32_t CALM_bit : 9; // bit offset=0  bit width=9  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t CALW16_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CALW8_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CALP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 16;
        } RTC_CALR_bits;
    };

    // RTC_TAMPCR @ offset=0x00000040
    union {
        __IO uint32_t RTC_TAMPCR_reg;

        // bit fields
        struct {
            __IO uint32_t TAMP1E_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP1TRG_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMPIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP2E_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP2TRG_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP3E_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP3TRG_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMPTS_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMPFREQ_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMPFLT_bit : 2; // bit offset=11  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMPPRCH_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMPPUDIS_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP1IE_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP1NOERASE_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP1MF_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP2IE_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP2NOERASE_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP2MF_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP3IE_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP3NOERASE_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TAMP3MF_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 7;
        } RTC_TAMPCR_bits;
    };

    // RTC_ALRMASSR @ offset=0x00000044
    union {
        __IO uint32_t RTC_ALRMASSR_reg;

        // bit fields
        struct {
            __IO uint32_t SS_bit : 15; // bit offset=0  bit width=15  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t MASKSS_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } RTC_ALRMASSR_bits;
    };

