minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // RTC_ALRMBSSR @ offset=0x00000048
    union {
        __IO uint32_t RTC_ALRMBSSR_reg;

        // bit fields
        struct {
            __IO uint32_t SS_bit : 15; // bit offset=0  bit width=15  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t MASKSS_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } RTC_ALRMBSSR_bits;
    };

    // RTC_OR @ offset=0x0000004C
    union {
        __IO uint32_t RTC_OR_reg;

        // bit fields
        struct {
            __IO uint32_t RTC_ALARM_TYPE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RTC_OUT_RMP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 30;
        } RTC_OR_bits;
    };

    // RTC_BKP0R @ offset=0x00000050
    __IO uint32_t RTC_BKP0R_reg;

    // RTC_BKP1R @ offset=0x00000054
    __IO uint32_t RTC_BKP1R_reg;

    // RTC_BKP2R @ offset=0x00000058
    __IO uint32_t RTC_BKP2R_reg;

    // RTC_BKP3R @ offset=0x0000005C
    __IO uint32_t RTC_BKP3R_reg;

    // RTC_BKP4R @ offset=0x00000060
    __IO uint32_t RTC_BKP4R_reg;

    // RTC_BKP5R @ offset=0x00000064
    __IO uint32_t RTC_BKP5R_reg;

    // RTC_BKP6R @ offset=0x00000068
    __IO uint32_t RTC_BKP6R_reg;

    // RTC_BKP7R @ offset=0x0000006C
    __IO uint32_t RTC_BKP7R_reg;

    // RTC_BKP8R @ offset=0x00000070
    __IO uint32_t RTC_BKP8R_reg;

    // RTC_BKP9R @ offset=0x00000074
    __IO uint32_t RTC_BKP9R_reg;

    // RTC_BKP10R @ offset=0x00000078
    __IO uint32_t RTC_BKP10R_reg;

    // RTC_BKP11R @ offset=0x0000007C
    __IO uint32_t RTC_BKP11R_reg;

    // RTC_BKP12R @ offset=0x00000080
    __IO uint32_t RTC_BKP12R_reg;

    // RTC_BKP13R @ offset=0x00000084
    __IO uint32_t RTC_BKP13R_reg;

    // RTC_BKP14R @ offset=0x00000088
    __IO uint32_t RTC_BKP14R_reg;

    // RTC_BKP15R @ offset=0x0000008C
    __IO uint32_t RTC_BKP15R_reg;

    // RTC_BKP16R @ offset=0x00000090
    __IO uint32_t RTC_BKP16R_reg;

    // RTC_BKP17R @ offset=0x00000094
    __IO uint32_t RTC_BKP17R_reg;

    // RTC_BKP18R @ offset=0x00000098
    __IO uint32_t RTC_BKP18R_reg;

    // RTC_BKP19R @ offset=0x0000009C
    __IO uint32_t RTC_BKP19R_reg;

    // RTC_BKP20R @ offset=0x000000A0
    __IO uint32_t RTC_BKP20R_reg;

    // RTC_BKP21R @ offset=0x000000A4
    __IO uint32_t RTC_BKP21R_reg;

    // RTC_BKP22R @ offset=0x000000A8
    __IO uint32_t RTC_BKP22R_reg;

    // RTC_BKP23R @ offset=0x000000AC
    __IO uint32_t RTC_BKP23R_reg;

    // RTC_BKP24R @ offset=0x000000B0
    __IO uint32_t RTC_BKP24R_reg;

    // RTC_BKP25R @ offset=0x000000B4
    __IO uint32_t RTC_BKP25R_reg;

    // RTC_BKP26R @ offset=0x000000B8
    __IO uint32_t RTC_BKP26R_reg;

    // RTC_BKP27R @ offset=0x000000BC
    __IO uint32_t RTC_BKP27R_reg;

    // RTC_BKP28R @ offset=0x000000C0
    __IO uint32_t RTC_BKP28R_reg;

    // RTC_BKP29R @ offset=0x000000C4
    __IO uint32_t RTC_BKP29R_reg;

    // RTC_BKP30R @ offset=0x000000C8
    __IO uint32_t RTC_BKP30R_reg;

    // RTC_BKP31R @ offset=0x000000CC
    __IO uint32_t RTC_BKP31R_reg;

} rtc_t;

// Peripheral SAI1 @ base_address=0x40015800
typedef struct sai1_t {

    // SAI_GCR @ offset=0x00000000
    union {
        __IO uint32_t SAI_GCR_reg;

        // bit fields
        struct {
            __IO uint32_t SYNCIN_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t SYNCOUT_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 26;
        } SAI_GCR_bits;
    };

    // SAI_ACR1 @ offset=0x00000004
    union {
        __IO uint32_t SAI_ACR1_reg;

        // bit fields
        struct {
            __IO uint32_t MODE_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRTCFG_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DS_bit : 3; // bit offset=5  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSBFIRST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKSTR_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCEN_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MONO_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OUTDRIV_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t SAIXEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t NOMCK_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCKDIV_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t OSR_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 5;
        } SAI_ACR1_bits;
    };

    // SAI_ACR2 @ offset=0x00000008
    union {
        __IO uint32_t SAI_ACR2_reg;

        // bit fields
        struct {
            __IO uint32_t FTH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t FFLUSH_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TRIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTEVAL_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTECNT_bit : 6; // bit offset=7  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPL_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMP_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } SAI_ACR2_bits;
    };

