minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // SAI_AFRCR @ offset=0x0000000C
    union {
        __IO uint32_t SAI_AFRCR_reg;

        // bit fields
        struct {
            __IO uint32_t FRL_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t FSALL_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t FSDEF_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FSPOL_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FSOFF_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 13;
        } SAI_AFRCR_bits;
    };

    // SAI_ASLOTR @ offset=0x00000010
    union {
        __IO uint32_t SAI_ASLOTR_reg;

        // bit fields
        struct {
            __IO uint32_t FBOFF_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SLOTSZ_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBSLOT_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t SLOTEN_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } SAI_ASLOTR_bits;
    };

    // SAI_AIM @ offset=0x00000014
    union {
        __IO uint32_t SAI_AIM_reg;

        // bit fields
        struct {
            __IO uint32_t OVRUDRIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTEDETIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WCKCFGIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FREQIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNRDYIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AFSDETIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LFSDETIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 25;
        } SAI_AIM_bits;
    };

    // SAI_ASR @ offset=0x00000018
    union {
        __IO uint32_t SAI_ASR_reg;

        // bit fields
        struct {
            __IO uint32_t OVRUDR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MUTEDET_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t WCKCFG_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FREQ_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CNRDY_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AFSDET_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LFSDET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t FLVL_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 13;
        } SAI_ASR_bits;
    };

    // SAI_ACLRFR @ offset=0x0000001C
    union {
        __IO uint32_t SAI_ACLRFR_reg;

        // bit fields
        struct {
            __IO uint32_t COVRUDR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CMUTEDET_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CWCKCFG_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CCNRDY_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CAFSDET_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLFSDET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1 : 25;
        } SAI_ACLRFR_bits;
    };

    // SAI_ADR @ offset=0x00000020
    __IO uint32_t SAI_ADR_reg;

    // SAI_BCR1 @ offset=0x00000024
    union {
        __IO uint32_t SAI_BCR1_reg;

        // bit fields
        struct {
            __IO uint32_t MODE_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PRTCFG_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DS_bit : 3; // bit offset=5  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSBFIRST_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKSTR_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCEN_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t MONO_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OUTDRIV_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t SAIXEN_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DMAEN_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t NOMCK_bit : 1; // bit offset=19  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MCKDIV_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 2;
            __IO uint32_t OSR_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 5;
        } SAI_BCR1_bits;
    };

    // SAI_BCR2 @ offset=0x00000028
    union {
        __IO uint32_t SAI_BCR2_reg;

        // bit fields
        struct {
            __IO uint32_t FTH_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t FFLUSH_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TRIS_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTEVAL_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTECNT_bit : 6; // bit offset=7  bit width=6  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPL_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMP_bit : 2; // bit offset=14  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } SAI_BCR2_bits;
    };

    // SAI_BFRCR @ offset=0x0000002C
    union {
        __IO uint32_t SAI_BFRCR_reg;

        // bit fields
        struct {
            __IO uint32_t FRL_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t FSALL_bit : 7; // bit offset=8  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t FSDEF_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FSPOL_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FSOFF_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 13;
        } SAI_BFRCR_bits;
    };

