minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // SAI_BSLOTR @ offset=0x00000030
    union {
        __IO uint32_t SAI_BSLOTR_reg;

        // bit fields
        struct {
            __IO uint32_t FBOFF_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t SLOTSZ_bit : 2; // bit offset=6  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBSLOT_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t SLOTEN_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } SAI_BSLOTR_bits;
    };

    // SAI_BIM @ offset=0x00000034
    union {
        __IO uint32_t SAI_BIM_reg;

        // bit fields
        struct {
            __IO uint32_t OVRUDRIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MUTEDETIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t WCKCFGIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t FREQIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNRDYIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AFSDETIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LFSDETIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 25;
        } SAI_BIM_bits;
    };

    // SAI_BSR @ offset=0x00000038
    union {
        __IO uint32_t SAI_BSR_reg;

        // bit fields
        struct {
            __IO uint32_t OVRUDR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MUTEDET_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t WCKCFG_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FREQ_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CNRDY_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t AFSDET_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t LFSDET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 9;
            __IO uint32_t FLVL_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 13;
        } SAI_BSR_bits;
    };

    // SAI_BCLRFR @ offset=0x0000003C
    union {
        __IO uint32_t SAI_BCLRFR_reg;

        // bit fields
        struct {
            __IO uint32_t COVRUDR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CMUTEDET_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CWCKCFG_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CCNRDY_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CAFSDET_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CLFSDET_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1 : 25;
        } SAI_BCLRFR_bits;
    };

    // SAI_BDR @ offset=0x00000040
    __IO uint32_t SAI_BDR_reg;

    // SAI_PDMCR @ offset=0x00000044
    union {
        __IO uint32_t SAI_PDMCR_reg;

        // bit fields
        struct {
            __IO uint32_t PDMEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t MICNBR_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t CKEN1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKEN2_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKEN3_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKEN4_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 20;
        } SAI_PDMCR_bits;
    };

    // SAI_PDMDLY @ offset=0x00000048
    union {
        __IO uint32_t SAI_PDMDLY_reg;

        // bit fields
        struct {
            __IO uint32_t DLYM1L_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t DLYM1R_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t DLYM2L_bit : 3; // bit offset=8  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t DLYM2R_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t DLYM3L_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4: 1;
            __IO uint32_t DLYM3R_bit : 3; // bit offset=20  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED5: 1;
            __IO uint32_t DLYM4L_bit : 3; // bit offset=24  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED6: 1;
            __IO uint32_t DLYM4R_bit : 3; // bit offset=28  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED7 : 1;
        } SAI_PDMDLY_bits;
    };

} sai4_t;

// Peripheral SDMMC1 @ base_address=0x52007000
typedef struct sdmmc1_t {

    // POWER @ offset=0x00000000
    union {
        __IO uint32_t POWER_reg;

        // bit fields
        struct {
            __IO uint32_t PWRCTRL_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSWITCH_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VSWITCHEN_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIRPOL_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 27;
        } POWER_bits;
    };

