minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // ACKTIMER @ offset=0x00000040
    __IO uint32_t ACKTIMER_reg;

    __IO uint8_t RESERVED0[12];

    // IDMACTRLR @ offset=0x00000050
    union {
        __IO uint32_t IDMACTRLR_reg;

        // bit fields
        struct {
            __IO uint32_t IDMAEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IDMABMODE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IDMABACT_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 29;
        } IDMACTRLR_bits;
    };

    // IDMABSIZER @ offset=0x00000054
    __IO uint32_t IDMABSIZER_reg;

    // IDMABASE0R @ offset=0x00000058
    __IO uint32_t IDMABASE0R_reg;

    // IDMABASE1R @ offset=0x0000005C
    __IO uint32_t IDMABASE1R_reg;

    __IO uint8_t RESERVED1[32];

    // FIFOR @ offset=0x00000080
    __IO uint32_t FIFOR_reg;

    __IO uint8_t RESERVED2[880];

    // VER @ offset=0x000003F4
    union {
        __IO uint32_t VER_reg;

        // bit fields
        struct {
            __IO uint32_t MINREV_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t MAJREV_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } VER_bits;
    };

    // ID @ offset=0x000003F8
    __IO uint32_t ID_reg;

} sdmmc2_t;

// Peripheral SPDIFRX @ base_address=0x40004000
typedef struct spdifrx_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t SPDIFRXEN_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXDMAEN_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RXSTEO_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DRFMT_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t PMSK_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t VMSK_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CUMSK_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PTMSK_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CBDMAEN_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CHSEL_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t NBTR_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t WFA_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t INSEL_bit : 3; // bit offset=16  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CKSEN_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKSBKPEN_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 10;
        } CR_bits;
    };

    // IMR @ offset=0x00000004
    union {
        __IO uint32_t IMR_reg;

        // bit fields
        struct {
            __IO uint32_t RXNEIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSRNEIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PERRIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVRIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBLKIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SYNCDIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IFEIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 25;
        } IMR_bits;
    };

    // SR @ offset=0x00000008
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t RXNE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CSRNE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t PERR_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SBD_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SYNCD_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t FERR_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SERR_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TERR_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t WIDTH5_bit : 15; // bit offset=16  bit width=15  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 1;
        } SR_bits;
    };

    // IFCR @ offset=0x0000000C
    union {
        __IO uint32_t IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t PERRCF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t OVRCF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SBDCF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SYNCDCF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1 : 26;
        } IFCR_bits;
    };

    union {
        // DR_00 @ offset=0x00000010
        union {
            __IO uint32_t DR_00_reg;

            // bit fields
            struct {
                __IO uint32_t DR_bit : 24; // bit offset=0  bit width=24  access=SVDAccessType.READ_ONLY
                __IO uint32_t PE_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t V_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t U_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t C_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t PT_bit : 2; // bit offset=28  bit width=2  access=SVDAccessType.READ_ONLY
                __IO uint32_t RESERVED0 : 2;
            } DR_00_bits;
        };

        // DR_01 @ offset=0x00000010
        union {
            __IO uint32_t DR_01_reg;

            // bit fields
            struct {
                __IO uint32_t PE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t V_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t U_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t C_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
                __IO uint32_t PT_bit : 2; // bit offset=4  bit width=2  access=SVDAccessType.READ_ONLY
                __IO uint32_t RESERVED0: 2;
                __IO uint32_t DR_bit : 24; // bit offset=8  bit width=24  access=SVDAccessType.READ_ONLY
            } DR_01_bits;
        };

        // DR_10 @ offset=0x00000010
        union {
            __IO uint32_t DR_10_reg;

            // bit fields
            struct {
                __IO uint32_t DRNL1_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
                __IO uint32_t DRNL2_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
            } DR_10_bits;
        };

