minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    };

    // CSR @ offset=0x00000014
    union {
        __IO uint32_t CSR_reg;

        // bit fields
        struct {
            __IO uint32_t USR_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_ONLY
            __IO uint32_t CS_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t SOB_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 7;
        } CSR_bits;
    };

    // DIR @ offset=0x00000018
    union {
        __IO uint32_t DIR_reg;

        // bit fields
        struct {
            __IO uint32_t THI_bit : 13; // bit offset=0  bit width=13  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t TLO_bit : 13; // bit offset=16  bit width=13  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 3;
        } DIR_bits;
    };

    __IO uint8_t RESERVED0[984];

    // VERR @ offset=0x000003F4
    union {
        __IO uint32_t VERR_reg;

        // bit fields
        struct {
            __IO uint32_t MINREV_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t MAJREV_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } VERR_bits;
    };

    // IDR @ offset=0x000003F8
    __IO uint32_t IDR_reg;

    // SIDR @ offset=0x000003FC
    __IO uint32_t SIDR_reg;

} spdifrx_t;

// Peripheral SPI1 @ base_address=0x40013000
typedef struct spi1_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t SPE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t MASRX_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CSTART_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CSUSP_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t HDDIR_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSI_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRC33_17_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RCRCI_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TCRCI_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t IOLOCK_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t TSIZE_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSER_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } CR2_bits;
    };

    // CFG1 @ offset=0x00000008
    union {
        __IO uint32_t CFG1_reg;

        // bit fields
        struct {
            __IO uint32_t DSIZE_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t FTHVL_bit : 4; // bit offset=5  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDRCFG_bit : 2; // bit offset=9  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDRDET_bit : 2; // bit offset=11  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t RXDMAEN_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXDMAEN_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRCSIZE_bit : 5; // bit offset=16  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CRCEN_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 5;
            __IO uint32_t MBR_bit : 3; // bit offset=28  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 1;
        } CFG1_bits;
    };

    // CFG2 @ offset=0x0000000C
    union {
        __IO uint32_t CFG2_reg;

        // bit fields
        struct {
            __IO uint32_t MSSI_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t MIDI_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t IOSWP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t COMM_bit : 2; // bit offset=17  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t SP_bit : 3; // bit offset=19  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MASTER_bit : 1; // bit offset=22  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t LSBFRST_bit : 1; // bit offset=23  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPHA_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CPOL_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSM_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t SSIOP_bit : 1; // bit offset=28  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSOE_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SSOM_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AFCNTR_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CFG2_bits;
    };

    // IER @ offset=0x00000010
    union {
        __IO uint32_t IER_reg;

        // bit fields
        struct {
            __IO uint32_t RXPIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXPIE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t DPXPIE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOTIE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TXTFIE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDRIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OVRIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CRCEIE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIFREIE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MODFIE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TSERFIE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 21;
        } IER_bits;
    };

    // SR @ offset=0x00000014
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t RXP_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t DXP_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t EOT_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXTF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t UDR_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t OVR_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CRCE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TIFRE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t MODF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TSERF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t SUSP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t TXC_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RXPLVL_bit : 2; // bit offset=13  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RXWNE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t CTSIZE_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_ONLY
        } SR_bits;
    };

    // IFCR @ offset=0x00000018
    union {
        __IO uint32_t IFCR_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t EOTC_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TXTFC_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t UDRC_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t OVRC_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CRCEC_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TIFREC_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t MODFC_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TSERFC_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t SUSPC_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1 : 20;
        } IFCR_bits;
    };

    __IO uint8_t RESERVED0[4];

