minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
} swpmi_t;

// Peripheral SYSCFG @ base_address=0x58000400
typedef struct syscfg_t {

    __IO uint8_t RESERVED0[4];

    // PMCR @ offset=0x00000004
    union {
        __IO uint32_t PMCR_reg;

        // bit fields
        struct {
            __IO uint32_t I2C1FMP_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t I2C2FMP_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t I2C3FMP_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t I2C4FMP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PB6FMP_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PB7FMP_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PB8FMP_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PB9FMP_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BOOSTE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BOOSTVDDSEL_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 11;
            __IO uint32_t EPIS_bit : 3; // bit offset=21  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t PA0SO_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PA1SO_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PC2SO_bit : 1; // bit offset=26  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t PC3SO_bit : 1; // bit offset=27  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 4;
        } PMCR_bits;
    };

    // EXTICR1 @ offset=0x00000008
    union {
        __IO uint32_t EXTICR1_reg;

        // bit fields
        struct {
            __IO uint32_t EXTI0_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI1_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI2_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI3_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } EXTICR1_bits;
    };

    // EXTICR2 @ offset=0x0000000C
    union {
        __IO uint32_t EXTICR2_reg;

        // bit fields
        struct {
            __IO uint32_t EXTI4_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI5_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI6_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI7_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } EXTICR2_bits;
    };

    // EXTICR3 @ offset=0x00000010
    union {
        __IO uint32_t EXTICR3_reg;

        // bit fields
        struct {
            __IO uint32_t EXTI8_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI9_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI10_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI11_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } EXTICR3_bits;
    };

    // EXTICR4 @ offset=0x00000014
    union {
        __IO uint32_t EXTICR4_reg;

        // bit fields
        struct {
            __IO uint32_t EXTI12_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI13_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI14_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t EXTI15_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 16;
        } EXTICR4_bits;
    };

    __IO uint8_t RESERVED1[8];

    // CCCSR @ offset=0x00000020
    union {
        __IO uint32_t CCCSR_reg;

        // bit fields
        struct {
            __IO uint32_t EN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 6;
            __IO uint32_t READY_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 7;
            __IO uint32_t HSLV_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 15;
        } CCCSR_bits;
    };

    // CCVR @ offset=0x00000024
    union {
        __IO uint32_t CCVR_reg;

        // bit fields
        struct {
            __IO uint32_t NCV_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t PCV_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0 : 24;
        } CCVR_bits;
    };

    // CCCR @ offset=0x00000028
    union {
        __IO uint32_t CCCR_reg;

        // bit fields
        struct {
            __IO uint32_t NCC_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t PCC_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 24;
        } CCCR_bits;
    };

    // PWRCR @ offset=0x0000002C
    __IO uint32_t PWRCR_reg;

    __IO uint8_t RESERVED2[244];

    // PKGR @ offset=0x00000124
    __IO uint32_t PKGR_reg;

    __IO uint8_t RESERVED3[472];

    // UR0 @ offset=0x00000300
    union {
        __IO uint32_t UR0_reg;

        // bit fields
        struct {
            __IO uint32_t BKS_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t RDP_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 8;
        } UR0_bits;
    };

    __IO uint8_t RESERVED4[4];

    // UR2 @ offset=0x00000308
    union {
        __IO uint32_t UR2_reg;

        // bit fields
        struct {
            __IO uint32_t BORH_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t BOOT_ADD0_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } UR2_bits;
    };

    // UR3 @ offset=0x0000030C
    __IO uint32_t UR3_reg;

