minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // UR4 @ offset=0x00000310
    __IO uint32_t UR4_reg;

    // UR5 @ offset=0x00000314
    union {
        __IO uint32_t UR5_reg;

        // bit fields
        struct {
            __IO uint32_t MESAD_1_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t WRPN_1_bit : 8; // bit offset=16  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 8;
        } UR5_bits;
    };

    // UR6 @ offset=0x00000318
    union {
        __IO uint32_t UR6_reg;

        // bit fields
        struct {
            __IO uint32_t PA_BEG_1_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t PA_END_1_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 4;
        } UR6_bits;
    };

    // UR7 @ offset=0x0000031C
    union {
        __IO uint32_t UR7_reg;

        // bit fields
        struct {
            __IO uint32_t SA_BEG_1_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SA_END_1_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 4;
        } UR7_bits;
    };

    // UR8 @ offset=0x00000320
    union {
        __IO uint32_t UR8_reg;

        // bit fields
        struct {
            __IO uint32_t MEPAD_2_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t MESAD_2_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } UR8_bits;
    };

    // UR9 @ offset=0x00000324
    union {
        __IO uint32_t UR9_reg;

        // bit fields
        struct {
            __IO uint32_t WRPN_2_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 8;
            __IO uint32_t PA_BEG_2_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 4;
        } UR9_bits;
    };

    // UR10 @ offset=0x00000328
    union {
        __IO uint32_t UR10_reg;

        // bit fields
        struct {
            __IO uint32_t PA_END_2_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t SA_BEG_2_bit : 12; // bit offset=16  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 4;
        } UR10_bits;
    };

    // UR11 @ offset=0x0000032C
    union {
        __IO uint32_t UR11_reg;

        // bit fields
        struct {
            __IO uint32_t SA_END_2_bit : 12; // bit offset=0  bit width=12  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t IWDG1M_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } UR11_bits;
    };

    // UR12 @ offset=0x00000330
    __IO uint32_t UR12_reg;

    // UR13 @ offset=0x00000334
    union {
        __IO uint32_t UR13_reg;

        // bit fields
        struct {
            __IO uint32_t SDRS_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 14;
            __IO uint32_t D1SBRST_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } UR13_bits;
    };

    // UR14 @ offset=0x00000338
    __IO uint32_t UR14_reg;

    // UR15 @ offset=0x0000033C
    __IO uint32_t UR15_reg;

    // UR16 @ offset=0x00000340
    union {
        __IO uint32_t UR16_reg;

        // bit fields
        struct {
            __IO uint32_t FZIWDGSTP_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t PKP_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t RESERVED1 : 15;
        } UR16_bits;
    };

    // UR17 @ offset=0x00000344
    __IO uint32_t UR17_reg;

} syscfg_t;

// Peripheral TIM1 @ base_address=0x40010000
typedef struct tim1_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t CEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t URS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CMS_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARPE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKD_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t UIFREMAP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 20;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t CCPC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CCUS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCDS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MMS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TI1S_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS1N_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS2_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS2N_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS3_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS3N_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS4_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t OIS5_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t OIS6_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t MMS2_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 8;
        } CR2_bits;
    };

