minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DCR @ offset=0x00000048
    union {
        __IO uint32_t DCR_reg;

        // bit fields
        struct {
            __IO uint32_t DBA_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DBL_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } DCR_bits;
    };

    // DMAR @ offset=0x0000004C
    __IO uint32_t DMAR_reg;

    __IO uint8_t RESERVED0[4];

    // CCMR3_Output @ offset=0x00000054
    union {
        __IO uint32_t CCMR3_OUTPUT_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t OC5FE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC5PE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC5M_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC5CE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t OC6FE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC6PE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC6M_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC6CE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OC5M3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 7;
            __IO uint32_t OC6M3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 7;
        } CCMR3_OUTPUT_bits;
    };

    // CCR5 @ offset=0x00000058
    union {
        __IO uint32_t CCR5_reg;

        // bit fields
        struct {
            __IO uint32_t CCR5_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 13;
            __IO uint32_t GC5C1_bit : 1; // bit offset=29  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GC5C2_bit : 1; // bit offset=30  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t GC5C3_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CCR5_bits;
    };

    // CCR6 @ offset=0x0000005C
    __IO uint32_t CCR6_reg;

    // AF1 @ offset=0x00000060
    union {
        __IO uint32_t AF1_reg;

        // bit fields
        struct {
            __IO uint32_t BKINE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKCMP1E_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKCMP2E_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t BKDF1BK0E_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKINP_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKCMP1P_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKCMP2P_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t ETRSEL_bit : 4; // bit offset=14  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 14;
        } AF1_bits;
    };

    // AF2 @ offset=0x00000064
    union {
        __IO uint32_t AF2_reg;

        // bit fields
        struct {
            __IO uint32_t BK2INE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2CMP1E_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2CMP2E_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 5;
            __IO uint32_t BK2DF1BK1E_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2INP_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2CMP1P_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2CMP2P_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 20;
        } AF2_bits;
    };

    // TISEL @ offset=0x00000068
    union {
        __IO uint32_t TISEL_reg;

        // bit fields
        struct {
            __IO uint32_t TI1SEL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t TI2SEL_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t TI3SEL_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t TI4SEL_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 4;
        } TISEL_bits;
    };

} tim1_t;

// Peripheral TIM12 @ base_address=0x40001800
typedef struct tim12_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t CEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t URS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CMS_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARPE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKD_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t UIFREMAP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 20;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t CCDS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MMS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TI1S_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 24;
        } CR2_bits;
    };

