minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DCR @ offset=0x00000048
    union {
        __IO uint32_t DCR_reg;

        // bit fields
        struct {
            __IO uint32_t DBA_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DBL_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } DCR_bits;
    };

    // DMAR @ offset=0x0000004C
    __IO uint32_t DMAR_reg;

    __IO uint8_t RESERVED2[16];

    // AF1 @ offset=0x00000060
    __IO uint32_t AF1_reg;

    __IO uint8_t RESERVED3[4];

    // TISEL @ offset=0x00000068
    union {
        __IO uint32_t TISEL_reg;

        // bit fields
        struct {
            __IO uint32_t TI1SEL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t TI2SEL_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t TI3SEL_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t TI4SEL_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 4;
        } TISEL_bits;
    };

} tim12_t;

// Peripheral TIM13 @ base_address=0x40001C00
typedef struct tim13_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t CEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t URS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CMS_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARPE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKD_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t UIFREMAP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 20;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t CCDS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MMS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TI1S_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 24;
        } CR2_bits;
    };

    // SMCR @ offset=0x00000008
    union {
        __IO uint32_t SMCR_reg;

        // bit fields
        struct {
            __IO uint32_t SMS_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSM_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETPS_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMS_3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t TS_4_3_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 10;
        } SMCR_bits;
    };

    // DIER @ offset=0x0000000C
    union {
        __IO uint32_t DIER_reg;

        // bit fields
        struct {
            __IO uint32_t UIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1IE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2IE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3IE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4IE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t UDE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1DE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2DE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3DE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4DE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t TDE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 17;
        } DIER_bits;
    };

    // SR @ offset=0x00000010
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t UIF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1IF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2IF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3IF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4IF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TIF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t CC1OF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2OF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3OF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4OF_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 19;
        } SR_bits;
    };

    // EGR @ offset=0x00000014
    union {
        __IO uint32_t EGR_reg;

        // bit fields
        struct {
            __IO uint32_t UG_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC1G_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC2G_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC3G_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC4G_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TG_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED1 : 25;
        } EGR_bits;
    };

    union {
        // CCMR1_Output @ offset=0x00000018
        union {
            __IO uint32_t CCMR1_OUTPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC1S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1FE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1PE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1M_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1CE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC2S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2FE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2PE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2M_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2CE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1M_3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0: 7;
                __IO uint32_t OC2M_3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED1 : 7;
            } CCMR1_OUTPUT_bits;
        };

        // CCMR1_Input @ offset=0x00000018
        union {
            __IO uint32_t CCMR1_INPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC1S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t ICPCS_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC1F_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC2S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC2PCS_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC2F_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0 : 16;
            } CCMR1_INPUT_bits;
        };

