minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    };

    union {
        // CCMR2_Output @ offset=0x0000001C
        union {
            __IO uint32_t CCMR2_OUTPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC3S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3FE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3PE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3M_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3CE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC4S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4FE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4PE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4M_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t O24CE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3M_3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0: 7;
                __IO uint32_t OC4M_3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED1 : 7;
            } CCMR2_OUTPUT_bits;
        };

        // CCMR2_Input @ offset=0x0000001C
        union {
            __IO uint32_t CCMR2_INPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC3S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC3PSC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC3F_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC4S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC4PSC_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC4F_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0 : 16;
            } CCMR2_INPUT_bits;
        };

    };

    // CCER @ offset=0x00000020
    union {
        __IO uint32_t CCER_reg;

        // bit fields
        struct {
            __IO uint32_t CC1E_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1P_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CC1NP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2E_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2P_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t CC2NP_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3E_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3P_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t CC3NP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4E_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4P_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t CC4NP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 16;
        } CCER_bits;
    };

    // CNT @ offset=0x00000024
    union {
        __IO uint32_t CNT_reg;

        // bit fields
        struct {
            __IO uint32_t CNT_L_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t CNT_H_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CNT_bits;
    };

    // PSC @ offset=0x00000028
    __IO uint32_t PSC_reg;

    // ARR @ offset=0x0000002C
    union {
        __IO uint32_t ARR_reg;

        // bit fields
        struct {
            __IO uint32_t ARR_L_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARR_H_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } ARR_bits;
    };

    __IO uint8_t RESERVED0[4];

    // CCR1 @ offset=0x00000034
    union {
        __IO uint32_t CCR1_reg;

        // bit fields
        struct {
            __IO uint32_t CCR1_L_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCR1_H_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CCR1_bits;
    };

    // CCR2 @ offset=0x00000038
    union {
        __IO uint32_t CCR2_reg;

        // bit fields
        struct {
            __IO uint32_t CCR2_L_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCR2_H_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CCR2_bits;
    };

    // CCR3 @ offset=0x0000003C
    union {
        __IO uint32_t CCR3_reg;

        // bit fields
        struct {
            __IO uint32_t CCR3_L_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCR3_H_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CCR3_bits;
    };

    // CCR4 @ offset=0x00000040
    union {
        __IO uint32_t CCR4_reg;

        // bit fields
        struct {
            __IO uint32_t CCR4_L_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCR4_H_bit : 16; // bit offset=16  bit width=16  access=SVDAccessType.READ_WRITE
        } CCR4_bits;
    };

    __IO uint8_t RESERVED1[4];

