minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // DCR @ offset=0x00000048
    union {
        __IO uint32_t DCR_reg;

        // bit fields
        struct {
            __IO uint32_t DBA_bit : 5; // bit offset=0  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t DBL_bit : 5; // bit offset=8  bit width=5  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 19;
        } DCR_bits;
    };

    // DMAR @ offset=0x0000004C
    __IO uint32_t DMAR_reg;

    __IO uint8_t RESERVED2[16];

    // AF1 @ offset=0x00000060
    __IO uint32_t AF1_reg;

    __IO uint8_t RESERVED3[4];

    // TISEL @ offset=0x00000068
    union {
        __IO uint32_t TISEL_reg;

        // bit fields
        struct {
            __IO uint32_t TI1SEL_bit : 4; // bit offset=0  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 4;
            __IO uint32_t TI2SEL_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 4;
            __IO uint32_t TI3SEL_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 4;
            __IO uint32_t TI4SEL_bit : 4; // bit offset=24  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3 : 4;
        } TISEL_bits;
    };

} tim5_t;

// Peripheral TIM6 @ base_address=0x40001000
typedef struct tim6_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t CEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t URS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t ARPE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t UIFREMAP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 20;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    __IO uint32_t CR2_reg;

    __IO uint8_t RESERVED0[4];

    // DIER @ offset=0x0000000C
    union {
        __IO uint32_t DIER_reg;

        // bit fields
        struct {
            __IO uint32_t UIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t UDE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 23;
        } DIER_bits;
    };

    // SR @ offset=0x00000010
    __IO uint32_t SR_reg;

    // EGR @ offset=0x00000014
    __IO uint32_t EGR_reg;

    __IO uint8_t RESERVED1[12];

    // CNT @ offset=0x00000024
    union {
        __IO uint32_t CNT_reg;

        // bit fields
        struct {
            __IO uint32_t CNT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t UIFCPY_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CNT_bits;
    };

    // PSC @ offset=0x00000028
    __IO uint32_t PSC_reg;

    // ARR @ offset=0x0000002C
    __IO uint32_t ARR_reg;

} tim6_t;

// Peripheral TIM7 @ base_address=0x40001400
typedef struct tim7_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t CEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t URS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 3;
            __IO uint32_t ARPE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t UIFREMAP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 20;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    __IO uint32_t CR2_reg;

    __IO uint8_t RESERVED0[4];

    // DIER @ offset=0x0000000C
    union {
        __IO uint32_t DIER_reg;

        // bit fields
        struct {
            __IO uint32_t UIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 7;
            __IO uint32_t UDE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 23;
        } DIER_bits;
    };

    // SR @ offset=0x00000010
    __IO uint32_t SR_reg;

    // EGR @ offset=0x00000014
    __IO uint32_t EGR_reg;

    __IO uint8_t RESERVED1[12];

    // CNT @ offset=0x00000024
    union {
        __IO uint32_t CNT_reg;

        // bit fields
        struct {
            __IO uint32_t CNT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t UIFCPY_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_WRITE
        } CNT_bits;
    };

    // PSC @ offset=0x00000028
    __IO uint32_t PSC_reg;

    // ARR @ offset=0x0000002C
    __IO uint32_t ARR_reg;

} tim7_t;

// Peripheral TIM8 @ base_address=0x40010400
typedef struct tim8_t {

    // CR1 @ offset=0x00000000
    union {
        __IO uint32_t CR1_reg;

        // bit fields
        struct {
            __IO uint32_t CEN_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDIS_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t URS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OPM_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t DIR_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CMS_bit : 2; // bit offset=5  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ARPE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CKD_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t UIFREMAP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 20;
        } CR1_bits;
    };

    // CR2 @ offset=0x00000004
    union {
        __IO uint32_t CR2_reg;

        // bit fields
        struct {
            __IO uint32_t CCPC_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CCUS_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CCDS_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MMS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t TI1S_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS1_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS1N_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS2_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS2N_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS3_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS3N_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OIS4_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t OIS5_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2: 1;
            __IO uint32_t OIS6_bit : 1; // bit offset=18  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED3: 1;
            __IO uint32_t MMS2_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED4 : 8;
        } CR2_bits;
    };

