minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // SMCR @ offset=0x00000008
    union {
        __IO uint32_t SMCR_reg;

        // bit fields
        struct {
            __IO uint32_t SMS_bit : 3; // bit offset=0  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t TS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t MSM_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETF_bit : 4; // bit offset=8  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETPS_bit : 2; // bit offset=12  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t ECE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t ETP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SMS_3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 3;
            __IO uint32_t TS_4_3_bit : 2; // bit offset=20  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 10;
        } SMCR_bits;
    };

    // DIER @ offset=0x0000000C
    union {
        __IO uint32_t DIER_reg;

        // bit fields
        struct {
            __IO uint32_t UIE_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1IE_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2IE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3IE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4IE_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMIE_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BIE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t UDE_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1DE_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2DE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3DE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4DE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMDE_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TDE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 17;
        } DIER_bits;
    };

    // SR @ offset=0x00000010
    union {
        __IO uint32_t SR_reg;

        // bit fields
        struct {
            __IO uint32_t UIF_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1IF_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2IF_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3IF_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4IF_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t COMIF_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t TIF_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BIF_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t B2IF_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1OF_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2OF_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3OF_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4OF_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t SBIF_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t CC5IF_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC6IF_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 14;
        } SR_bits;
    };

    // EGR @ offset=0x00000014
    union {
        __IO uint32_t EGR_reg;

        // bit fields
        struct {
            __IO uint32_t UG_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC1G_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC2G_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC3G_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t CC4G_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t COMG_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t TG_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t BG_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t B2G_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.WRITE_ONLY
            __IO uint32_t RESERVED0 : 23;
        } EGR_bits;
    };

    union {
        // CCMR1_Output @ offset=0x00000018
        union {
            __IO uint32_t CCMR1_OUTPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC1S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1FE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1PE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1M_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1CE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC2S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2FE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2PE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2M_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC2CE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC1M_3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0: 7;
                __IO uint32_t OC2M_3_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED1 : 7;
            } CCMR1_OUTPUT_bits;
        };

        // CCMR1_Input @ offset=0x00000018
        union {
            __IO uint32_t CCMR1_INPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC1S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC1PSC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC1F_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC2S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC2PSC_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC2F_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0 : 16;
            } CCMR1_INPUT_bits;
        };

