minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    };

    union {
        // CCMR2_Output @ offset=0x0000001C
        union {
            __IO uint32_t CCMR2_OUTPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC3S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3FE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3PE_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3M_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3CE_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC4S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4FE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4PE_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4M_bit : 3; // bit offset=12  bit width=3  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC4CE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t OC3M_3_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0: 7;
                __IO uint32_t OC4M_4_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED1 : 7;
            } CCMR2_OUTPUT_bits;
        };

        // CCMR2_Input @ offset=0x0000001C
        union {
            __IO uint32_t CCMR2_INPUT_reg;

            // bit fields
            struct {
                __IO uint32_t CC3S_bit : 2; // bit offset=0  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC3PSC_bit : 2; // bit offset=2  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC3F_bit : 4; // bit offset=4  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t CC4S_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC4PSC_bit : 2; // bit offset=10  bit width=2  access=SVDAccessType.READ_WRITE
                __IO uint32_t IC4F_bit : 4; // bit offset=12  bit width=4  access=SVDAccessType.READ_WRITE
                __IO uint32_t RESERVED0 : 16;
            } CCMR2_INPUT_bits;
        };

    };

    // CCER @ offset=0x00000020
    union {
        __IO uint32_t CCER_reg;

        // bit fields
        struct {
            __IO uint32_t CC1E_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1P_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1NE_bit : 1; // bit offset=2  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC1NP_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2E_bit : 1; // bit offset=4  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2P_bit : 1; // bit offset=5  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2NE_bit : 1; // bit offset=6  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC2NP_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3E_bit : 1; // bit offset=8  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3P_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3NE_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC3NP_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4E_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC4P_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t CC4NP_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC5E_bit : 1; // bit offset=16  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC5P_bit : 1; // bit offset=17  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 2;
            __IO uint32_t CC6E_bit : 1; // bit offset=20  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t CC6P_bit : 1; // bit offset=21  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 10;
        } CCER_bits;
    };

    // CNT @ offset=0x00000024
    union {
        __IO uint32_t CNT_reg;

        // bit fields
        struct {
            __IO uint32_t CNT_bit : 16; // bit offset=0  bit width=16  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 15;
            __IO uint32_t UIFCPY_bit : 1; // bit offset=31  bit width=1  access=SVDAccessType.READ_ONLY
        } CNT_bits;
    };

    // PSC @ offset=0x00000028
    __IO uint32_t PSC_reg;

    // ARR @ offset=0x0000002C
    __IO uint32_t ARR_reg;

    // RCR @ offset=0x00000030
    __IO uint32_t RCR_reg;

    // CCR1 @ offset=0x00000034
    __IO uint32_t CCR1_reg;

    // CCR2 @ offset=0x00000038
    __IO uint32_t CCR2_reg;

    // CCR3 @ offset=0x0000003C
    __IO uint32_t CCR3_reg;

    // CCR4 @ offset=0x00000040
    __IO uint32_t CCR4_reg;

    // BDTR @ offset=0x00000044
    union {
        __IO uint32_t BDTR_reg;

        // bit fields
        struct {
            __IO uint32_t DTG_bit : 8; // bit offset=0  bit width=8  access=SVDAccessType.READ_WRITE
            __IO uint32_t LOCK_bit : 2; // bit offset=8  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t OSSI_bit : 1; // bit offset=10  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t OSSR_bit : 1; // bit offset=11  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKE_bit : 1; // bit offset=12  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKP_bit : 1; // bit offset=13  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t AOE_bit : 1; // bit offset=14  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t MOE_bit : 1; // bit offset=15  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BKF_bit : 4; // bit offset=16  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2F_bit : 4; // bit offset=20  bit width=4  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2E_bit : 1; // bit offset=24  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t BK2P_bit : 1; // bit offset=25  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 6;
        } BDTR_bits;
    };

