minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
    // PRESC @ offset=0x0000002C
    __IO uint32_t PRESC_reg;

} usart6_t;

// Peripheral VREFBUF @ base_address=0x58003C00
typedef struct vrefbuf_t {

    // CSR @ offset=0x00000000
    union {
        __IO uint32_t CSR_reg;

        // bit fields
        struct {
            __IO uint32_t ENVR_bit : 1; // bit offset=0  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t HIZ_bit : 1; // bit offset=1  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 1;
            __IO uint32_t VRR_bit : 1; // bit offset=3  bit width=1  access=SVDAccessType.READ_ONLY
            __IO uint32_t VRS_bit : 3; // bit offset=4  bit width=3  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1 : 25;
        } CSR_bits;
    };

    // CCR @ offset=0x00000004
    __IO uint32_t CCR_reg;

} vrefbuf_t;

// Peripheral WWDG @ base_address=0x50003000
typedef struct wwdg_t {

    // CR @ offset=0x00000000
    union {
        __IO uint32_t CR_reg;

        // bit fields
        struct {
            __IO uint32_t T_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t WDGA_bit : 1; // bit offset=7  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0 : 24;
        } CR_bits;
    };

    // CFR @ offset=0x00000004
    union {
        __IO uint32_t CFR_reg;

        // bit fields
        struct {
            __IO uint32_t W_bit : 7; // bit offset=0  bit width=7  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED0: 2;
            __IO uint32_t EWI_bit : 1; // bit offset=9  bit width=1  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED1: 1;
            __IO uint32_t WDGTB_bit : 2; // bit offset=11  bit width=2  access=SVDAccessType.READ_WRITE
            __IO uint32_t RESERVED2 : 19;
        } CFR_bits;
    };

    // SR @ offset=0x00000008
    __IO uint32_t SR_reg;

} wwdg_t;

/*------------------------ Device Macro Bit Mask/Shift Define ------*/
/*--- register ISR -------------------------------------------------*/
#define PERI_ADC1_ISR_BIT_ADRDY_SHIFT                               (0U)
#define PERI_ADC1_ISR_BIT_ADRDY_MASK                                (((1U<<1)-1) << PERI_ADC1_ISR_BIT_ADRDY_SHIFT)
#define PERI_ADC1_ISR_BIT_EOSMP_SHIFT                               (1U)
#define PERI_ADC1_ISR_BIT_EOSMP_MASK                                (((1U<<1)-1) << PERI_ADC1_ISR_BIT_EOSMP_SHIFT)
#define PERI_ADC1_ISR_BIT_EOC_SHIFT                                 (2U)
#define PERI_ADC1_ISR_BIT_EOC_MASK                                  (((1U<<1)-1) << PERI_ADC1_ISR_BIT_EOC_SHIFT)
#define PERI_ADC1_ISR_BIT_EOS_SHIFT                                 (3U)
#define PERI_ADC1_ISR_BIT_EOS_MASK                                  (((1U<<1)-1) << PERI_ADC1_ISR_BIT_EOS_SHIFT)
#define PERI_ADC1_ISR_BIT_OVR_SHIFT                                 (4U)
#define PERI_ADC1_ISR_BIT_OVR_MASK                                  (((1U<<1)-1) << PERI_ADC1_ISR_BIT_OVR_SHIFT)
#define PERI_ADC1_ISR_BIT_JEOC_SHIFT                                (5U)
#define PERI_ADC1_ISR_BIT_JEOC_MASK                                 (((1U<<1)-1) << PERI_ADC1_ISR_BIT_JEOC_SHIFT)
#define PERI_ADC1_ISR_BIT_JEOS_SHIFT                                (6U)
#define PERI_ADC1_ISR_BIT_JEOS_MASK                                 (((1U<<1)-1) << PERI_ADC1_ISR_BIT_JEOS_SHIFT)
#define PERI_ADC1_ISR_BIT_AWD1_SHIFT                                (7U)
#define PERI_ADC1_ISR_BIT_AWD1_MASK                                 (((1U<<1)-1) << PERI_ADC1_ISR_BIT_AWD1_SHIFT)
#define PERI_ADC1_ISR_BIT_AWD2_SHIFT                                (8U)
#define PERI_ADC1_ISR_BIT_AWD2_MASK                                 (((1U<<1)-1) << PERI_ADC1_ISR_BIT_AWD2_SHIFT)
#define PERI_ADC1_ISR_BIT_AWD3_SHIFT                                (9U)
#define PERI_ADC1_ISR_BIT_AWD3_MASK                                 (((1U<<1)-1) << PERI_ADC1_ISR_BIT_AWD3_SHIFT)
#define PERI_ADC1_ISR_BIT_JQOVF_SHIFT                               (10U)
#define PERI_ADC1_ISR_BIT_JQOVF_MASK                                (((1U<<1)-1) << PERI_ADC1_ISR_BIT_JQOVF_SHIFT)
#define PERI_ADC1_ISR_BIT_LDORDY_SHIFT                              (12U)
#define PERI_ADC1_ISR_BIT_LDORDY_MASK                               (((1U<<1)-1) << PERI_ADC1_ISR_BIT_LDORDY_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_ADC1_IER_BIT_ADRDYIE_SHIFT                             (0U)
#define PERI_ADC1_IER_BIT_ADRDYIE_MASK                              (((1U<<1)-1) << PERI_ADC1_IER_BIT_ADRDYIE_SHIFT)
#define PERI_ADC1_IER_BIT_EOSMPIE_SHIFT                             (1U)
#define PERI_ADC1_IER_BIT_EOSMPIE_MASK                              (((1U<<1)-1) << PERI_ADC1_IER_BIT_EOSMPIE_SHIFT)
#define PERI_ADC1_IER_BIT_EOCIE_SHIFT                               (2U)
#define PERI_ADC1_IER_BIT_EOCIE_MASK                                (((1U<<1)-1) << PERI_ADC1_IER_BIT_EOCIE_SHIFT)
#define PERI_ADC1_IER_BIT_EOSIE_SHIFT                               (3U)
#define PERI_ADC1_IER_BIT_EOSIE_MASK                                (((1U<<1)-1) << PERI_ADC1_IER_BIT_EOSIE_SHIFT)
#define PERI_ADC1_IER_BIT_OVRIE_SHIFT                               (4U)
#define PERI_ADC1_IER_BIT_OVRIE_MASK                                (((1U<<1)-1) << PERI_ADC1_IER_BIT_OVRIE_SHIFT)
#define PERI_ADC1_IER_BIT_JEOCIE_SHIFT                              (5U)
#define PERI_ADC1_IER_BIT_JEOCIE_MASK                               (((1U<<1)-1) << PERI_ADC1_IER_BIT_JEOCIE_SHIFT)
#define PERI_ADC1_IER_BIT_JEOSIE_SHIFT                              (6U)
#define PERI_ADC1_IER_BIT_JEOSIE_MASK                               (((1U<<1)-1) << PERI_ADC1_IER_BIT_JEOSIE_SHIFT)
#define PERI_ADC1_IER_BIT_AWD1IE_SHIFT                              (7U)
#define PERI_ADC1_IER_BIT_AWD1IE_MASK                               (((1U<<1)-1) << PERI_ADC1_IER_BIT_AWD1IE_SHIFT)
#define PERI_ADC1_IER_BIT_AWD2IE_SHIFT                              (8U)
#define PERI_ADC1_IER_BIT_AWD2IE_MASK                               (((1U<<1)-1) << PERI_ADC1_IER_BIT_AWD2IE_SHIFT)
#define PERI_ADC1_IER_BIT_AWD3IE_SHIFT                              (9U)
#define PERI_ADC1_IER_BIT_AWD3IE_MASK                               (((1U<<1)-1) << PERI_ADC1_IER_BIT_AWD3IE_SHIFT)
#define PERI_ADC1_IER_BIT_JQOVFIE_SHIFT                             (10U)
#define PERI_ADC1_IER_BIT_JQOVFIE_MASK                              (((1U<<1)-1) << PERI_ADC1_IER_BIT_JQOVFIE_SHIFT)

