minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_ADC2_CR_BIT_ADEN_SHIFT                                 (0U)
#define PERI_ADC2_CR_BIT_ADEN_MASK                                  (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADEN_SHIFT)
#define PERI_ADC2_CR_BIT_ADDIS_SHIFT                                (1U)
#define PERI_ADC2_CR_BIT_ADDIS_MASK                                 (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADDIS_SHIFT)
#define PERI_ADC2_CR_BIT_ADSTART_SHIFT                              (2U)
#define PERI_ADC2_CR_BIT_ADSTART_MASK                               (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADSTART_SHIFT)
#define PERI_ADC2_CR_BIT_JADSTART_SHIFT                             (3U)
#define PERI_ADC2_CR_BIT_JADSTART_MASK                              (((1U<<1)-1) << PERI_ADC2_CR_BIT_JADSTART_SHIFT)
#define PERI_ADC2_CR_BIT_ADSTP_SHIFT                                (4U)
#define PERI_ADC2_CR_BIT_ADSTP_MASK                                 (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADSTP_SHIFT)
#define PERI_ADC2_CR_BIT_JADSTP_SHIFT                               (5U)
#define PERI_ADC2_CR_BIT_JADSTP_MASK                                (((1U<<1)-1) << PERI_ADC2_CR_BIT_JADSTP_SHIFT)
#define PERI_ADC2_CR_BIT_BOOST_SHIFT                                (8U)
#define PERI_ADC2_CR_BIT_BOOST_MASK                                 (((1U<<1)-1) << PERI_ADC2_CR_BIT_BOOST_SHIFT)
#define PERI_ADC2_CR_BIT_ADCALLIN_SHIFT                             (16U)
#define PERI_ADC2_CR_BIT_ADCALLIN_MASK                              (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADCALLIN_SHIFT)
#define PERI_ADC2_CR_BIT_LINCALRDYW1_SHIFT                          (22U)
#define PERI_ADC2_CR_BIT_LINCALRDYW1_MASK                           (((1U<<1)-1) << PERI_ADC2_CR_BIT_LINCALRDYW1_SHIFT)
#define PERI_ADC2_CR_BIT_LINCALRDYW2_SHIFT                          (23U)
#define PERI_ADC2_CR_BIT_LINCALRDYW2_MASK                           (((1U<<1)-1) << PERI_ADC2_CR_BIT_LINCALRDYW2_SHIFT)
#define PERI_ADC2_CR_BIT_LINCALRDYW3_SHIFT                          (24U)
#define PERI_ADC2_CR_BIT_LINCALRDYW3_MASK                           (((1U<<1)-1) << PERI_ADC2_CR_BIT_LINCALRDYW3_SHIFT)
#define PERI_ADC2_CR_BIT_LINCALRDYW4_SHIFT                          (25U)
#define PERI_ADC2_CR_BIT_LINCALRDYW4_MASK                           (((1U<<1)-1) << PERI_ADC2_CR_BIT_LINCALRDYW4_SHIFT)
#define PERI_ADC2_CR_BIT_LINCALRDYW5_SHIFT                          (26U)
#define PERI_ADC2_CR_BIT_LINCALRDYW5_MASK                           (((1U<<1)-1) << PERI_ADC2_CR_BIT_LINCALRDYW5_SHIFT)
#define PERI_ADC2_CR_BIT_LINCALRDYW6_SHIFT                          (27U)
#define PERI_ADC2_CR_BIT_LINCALRDYW6_MASK                           (((1U<<1)-1) << PERI_ADC2_CR_BIT_LINCALRDYW6_SHIFT)
#define PERI_ADC2_CR_BIT_ADVREGEN_SHIFT                             (28U)
#define PERI_ADC2_CR_BIT_ADVREGEN_MASK                              (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADVREGEN_SHIFT)
#define PERI_ADC2_CR_BIT_DEEPPWD_SHIFT                              (29U)
#define PERI_ADC2_CR_BIT_DEEPPWD_MASK                               (((1U<<1)-1) << PERI_ADC2_CR_BIT_DEEPPWD_SHIFT)
#define PERI_ADC2_CR_BIT_ADCALDIF_SHIFT                             (30U)
#define PERI_ADC2_CR_BIT_ADCALDIF_MASK                              (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADCALDIF_SHIFT)
#define PERI_ADC2_CR_BIT_ADCAL_SHIFT                                (31U)
#define PERI_ADC2_CR_BIT_ADCAL_MASK                                 (((1U<<1)-1) << PERI_ADC2_CR_BIT_ADCAL_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_ADC2_CFGR_BIT_DMNGT_SHIFT                              (0U)
#define PERI_ADC2_CFGR_BIT_DMNGT_MASK                               (((1U<<2)-1) << PERI_ADC2_CFGR_BIT_DMNGT_SHIFT)
#define PERI_ADC2_CFGR_BIT_RES_SHIFT                                (2U)
#define PERI_ADC2_CFGR_BIT_RES_MASK                                 (((1U<<3)-1) << PERI_ADC2_CFGR_BIT_RES_SHIFT)
#define PERI_ADC2_CFGR_BIT_EXTSEL_SHIFT                             (5U)
#define PERI_ADC2_CFGR_BIT_EXTSEL_MASK                              (((1U<<5)-1) << PERI_ADC2_CFGR_BIT_EXTSEL_SHIFT)
#define PERI_ADC2_CFGR_BIT_EXTEN_SHIFT                              (10U)
#define PERI_ADC2_CFGR_BIT_EXTEN_MASK                               (((1U<<2)-1) << PERI_ADC2_CFGR_BIT_EXTEN_SHIFT)
#define PERI_ADC2_CFGR_BIT_OVRMOD_SHIFT                             (12U)
#define PERI_ADC2_CFGR_BIT_OVRMOD_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_OVRMOD_SHIFT)
#define PERI_ADC2_CFGR_BIT_CONT_SHIFT                               (13U)
#define PERI_ADC2_CFGR_BIT_CONT_MASK                                (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_CONT_SHIFT)
#define PERI_ADC2_CFGR_BIT_AUTDLY_SHIFT                             (14U)
#define PERI_ADC2_CFGR_BIT_AUTDLY_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_AUTDLY_SHIFT)
#define PERI_ADC2_CFGR_BIT_DISCEN_SHIFT                             (16U)
#define PERI_ADC2_CFGR_BIT_DISCEN_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_DISCEN_SHIFT)
#define PERI_ADC2_CFGR_BIT_DISCNUM_SHIFT                            (17U)
#define PERI_ADC2_CFGR_BIT_DISCNUM_MASK                             (((1U<<3)-1) << PERI_ADC2_CFGR_BIT_DISCNUM_SHIFT)
#define PERI_ADC2_CFGR_BIT_JDISCEN_SHIFT                            (20U)
#define PERI_ADC2_CFGR_BIT_JDISCEN_MASK                             (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_JDISCEN_SHIFT)
#define PERI_ADC2_CFGR_BIT_JQM_SHIFT                                (21U)
#define PERI_ADC2_CFGR_BIT_JQM_MASK                                 (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_JQM_SHIFT)
#define PERI_ADC2_CFGR_BIT_AWD1SGL_SHIFT                            (22U)
#define PERI_ADC2_CFGR_BIT_AWD1SGL_MASK                             (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_AWD1SGL_SHIFT)
#define PERI_ADC2_CFGR_BIT_AWD1EN_SHIFT                             (23U)
#define PERI_ADC2_CFGR_BIT_AWD1EN_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_AWD1EN_SHIFT)
#define PERI_ADC2_CFGR_BIT_JAWD1EN_SHIFT                            (24U)
#define PERI_ADC2_CFGR_BIT_JAWD1EN_MASK                             (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_JAWD1EN_SHIFT)
#define PERI_ADC2_CFGR_BIT_JAUTO_SHIFT                              (25U)
#define PERI_ADC2_CFGR_BIT_JAUTO_MASK                               (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_JAUTO_SHIFT)
#define PERI_ADC2_CFGR_BIT_AWDCH1CH_SHIFT                           (26U)
#define PERI_ADC2_CFGR_BIT_AWDCH1CH_MASK                            (((1U<<5)-1) << PERI_ADC2_CFGR_BIT_AWDCH1CH_SHIFT)
#define PERI_ADC2_CFGR_BIT_JQDIS_SHIFT                              (31U)
#define PERI_ADC2_CFGR_BIT_JQDIS_MASK                               (((1U<<1)-1) << PERI_ADC2_CFGR_BIT_JQDIS_SHIFT)

/*--- register CFGR2 -------------------------------------------------*/
#define PERI_ADC2_CFGR2_BIT_ROVSE_SHIFT                             (0U)
#define PERI_ADC2_CFGR2_BIT_ROVSE_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_ROVSE_SHIFT)
#define PERI_ADC2_CFGR2_BIT_JOVSE_SHIFT                             (1U)
#define PERI_ADC2_CFGR2_BIT_JOVSE_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_JOVSE_SHIFT)
#define PERI_ADC2_CFGR2_BIT_OVSS_SHIFT                              (5U)
#define PERI_ADC2_CFGR2_BIT_OVSS_MASK                               (((1U<<4)-1) << PERI_ADC2_CFGR2_BIT_OVSS_SHIFT)
#define PERI_ADC2_CFGR2_BIT_TROVS_SHIFT                             (9U)
#define PERI_ADC2_CFGR2_BIT_TROVS_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_TROVS_SHIFT)
#define PERI_ADC2_CFGR2_BIT_ROVSM_SHIFT                             (10U)
#define PERI_ADC2_CFGR2_BIT_ROVSM_MASK                              (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_ROVSM_SHIFT)
#define PERI_ADC2_CFGR2_BIT_RSHIFT1_SHIFT                           (11U)
#define PERI_ADC2_CFGR2_BIT_RSHIFT1_MASK                            (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_RSHIFT1_SHIFT)
#define PERI_ADC2_CFGR2_BIT_RSHIFT2_SHIFT                           (12U)
#define PERI_ADC2_CFGR2_BIT_RSHIFT2_MASK                            (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_RSHIFT2_SHIFT)
#define PERI_ADC2_CFGR2_BIT_RSHIFT3_SHIFT                           (13U)
#define PERI_ADC2_CFGR2_BIT_RSHIFT3_MASK                            (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_RSHIFT3_SHIFT)
#define PERI_ADC2_CFGR2_BIT_RSHIFT4_SHIFT                           (14U)
#define PERI_ADC2_CFGR2_BIT_RSHIFT4_MASK                            (((1U<<1)-1) << PERI_ADC2_CFGR2_BIT_RSHIFT4_SHIFT)
#define PERI_ADC2_CFGR2_BIT_OSR_SHIFT                               (16U)
#define PERI_ADC2_CFGR2_BIT_OSR_MASK                                (((1U<<10)-1) << PERI_ADC2_CFGR2_BIT_OSR_SHIFT)
#define PERI_ADC2_CFGR2_BIT_LSHIFT_SHIFT                            (28U)
#define PERI_ADC2_CFGR2_BIT_LSHIFT_MASK                             (((1U<<4)-1) << PERI_ADC2_CFGR2_BIT_LSHIFT_SHIFT)

/*--- register SMPR1 -------------------------------------------------*/
#define PERI_ADC2_SMPR1_BIT_SMP1_SHIFT                              (3U)
#define PERI_ADC2_SMPR1_BIT_SMP1_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP1_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP2_SHIFT                              (6U)
#define PERI_ADC2_SMPR1_BIT_SMP2_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP2_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP3_SHIFT                              (9U)
#define PERI_ADC2_SMPR1_BIT_SMP3_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP3_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP4_SHIFT                              (12U)
#define PERI_ADC2_SMPR1_BIT_SMP4_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP4_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP5_SHIFT                              (15U)
#define PERI_ADC2_SMPR1_BIT_SMP5_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP5_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP6_SHIFT                              (18U)
#define PERI_ADC2_SMPR1_BIT_SMP6_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP6_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP7_SHIFT                              (21U)
#define PERI_ADC2_SMPR1_BIT_SMP7_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP7_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP8_SHIFT                              (24U)
#define PERI_ADC2_SMPR1_BIT_SMP8_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP8_SHIFT)
#define PERI_ADC2_SMPR1_BIT_SMP9_SHIFT                              (27U)
#define PERI_ADC2_SMPR1_BIT_SMP9_MASK                               (((1U<<3)-1) << PERI_ADC2_SMPR1_BIT_SMP9_SHIFT)

