minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SMPR2 -------------------------------------------------*/
#define PERI_ADC2_SMPR2_BIT_SMP10_SHIFT                             (0U)
#define PERI_ADC2_SMPR2_BIT_SMP10_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP10_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP11_SHIFT                             (3U)
#define PERI_ADC2_SMPR2_BIT_SMP11_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP11_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP12_SHIFT                             (6U)
#define PERI_ADC2_SMPR2_BIT_SMP12_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP12_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP13_SHIFT                             (9U)
#define PERI_ADC2_SMPR2_BIT_SMP13_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP13_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP14_SHIFT                             (12U)
#define PERI_ADC2_SMPR2_BIT_SMP14_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP14_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP15_SHIFT                             (15U)
#define PERI_ADC2_SMPR2_BIT_SMP15_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP15_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP16_SHIFT                             (18U)
#define PERI_ADC2_SMPR2_BIT_SMP16_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP16_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP17_SHIFT                             (21U)
#define PERI_ADC2_SMPR2_BIT_SMP17_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP17_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP18_SHIFT                             (24U)
#define PERI_ADC2_SMPR2_BIT_SMP18_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP18_SHIFT)
#define PERI_ADC2_SMPR2_BIT_SMP19_SHIFT                             (27U)
#define PERI_ADC2_SMPR2_BIT_SMP19_MASK                              (((1U<<3)-1) << PERI_ADC2_SMPR2_BIT_SMP19_SHIFT)

/*--- register PCSEL -------------------------------------------------*/
#define PERI_ADC2_PCSEL_BIT_PCSEL_SHIFT                             (0U)
#define PERI_ADC2_PCSEL_BIT_PCSEL_MASK                              (((1U<<20)-1) << PERI_ADC2_PCSEL_BIT_PCSEL_SHIFT)

/*--- register LTR1 -------------------------------------------------*/
#define PERI_ADC2_LTR1_BIT_LTR1_SHIFT                               (0U)
#define PERI_ADC2_LTR1_BIT_LTR1_MASK                                (((1U<<26)-1) << PERI_ADC2_LTR1_BIT_LTR1_SHIFT)

/*--- register LHTR1 -------------------------------------------------*/
#define PERI_ADC2_LHTR1_BIT_LHTR1_SHIFT                             (0U)
#define PERI_ADC2_LHTR1_BIT_LHTR1_MASK                              (((1U<<26)-1) << PERI_ADC2_LHTR1_BIT_LHTR1_SHIFT)

/*--- register SQR1 -------------------------------------------------*/
#define PERI_ADC2_SQR1_BIT_L3_SHIFT                                 (0U)
#define PERI_ADC2_SQR1_BIT_L3_MASK                                  (((1U<<4)-1) << PERI_ADC2_SQR1_BIT_L3_SHIFT)
#define PERI_ADC2_SQR1_BIT_SQ1_SHIFT                                (6U)
#define PERI_ADC2_SQR1_BIT_SQ1_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR1_BIT_SQ1_SHIFT)
#define PERI_ADC2_SQR1_BIT_SQ2_SHIFT                                (12U)
#define PERI_ADC2_SQR1_BIT_SQ2_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR1_BIT_SQ2_SHIFT)
#define PERI_ADC2_SQR1_BIT_SQ3_SHIFT                                (18U)
#define PERI_ADC2_SQR1_BIT_SQ3_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR1_BIT_SQ3_SHIFT)
#define PERI_ADC2_SQR1_BIT_SQ4_SHIFT                                (24U)
#define PERI_ADC2_SQR1_BIT_SQ4_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR1_BIT_SQ4_SHIFT)

/*--- register SQR2 -------------------------------------------------*/
#define PERI_ADC2_SQR2_BIT_SQ5_SHIFT                                (0U)
#define PERI_ADC2_SQR2_BIT_SQ5_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR2_BIT_SQ5_SHIFT)
#define PERI_ADC2_SQR2_BIT_SQ6_SHIFT                                (6U)
#define PERI_ADC2_SQR2_BIT_SQ6_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR2_BIT_SQ6_SHIFT)
#define PERI_ADC2_SQR2_BIT_SQ7_SHIFT                                (12U)
#define PERI_ADC2_SQR2_BIT_SQ7_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR2_BIT_SQ7_SHIFT)
#define PERI_ADC2_SQR2_BIT_SQ8_SHIFT                                (18U)
#define PERI_ADC2_SQR2_BIT_SQ8_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR2_BIT_SQ8_SHIFT)
#define PERI_ADC2_SQR2_BIT_SQ9_SHIFT                                (24U)
#define PERI_ADC2_SQR2_BIT_SQ9_MASK                                 (((1U<<5)-1) << PERI_ADC2_SQR2_BIT_SQ9_SHIFT)

/*--- register SQR3 -------------------------------------------------*/
#define PERI_ADC2_SQR3_BIT_SQ10_SHIFT                               (0U)
#define PERI_ADC2_SQR3_BIT_SQ10_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR3_BIT_SQ10_SHIFT)
#define PERI_ADC2_SQR3_BIT_SQ11_SHIFT                               (6U)
#define PERI_ADC2_SQR3_BIT_SQ11_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR3_BIT_SQ11_SHIFT)
#define PERI_ADC2_SQR3_BIT_SQ12_SHIFT                               (12U)
#define PERI_ADC2_SQR3_BIT_SQ12_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR3_BIT_SQ12_SHIFT)
#define PERI_ADC2_SQR3_BIT_SQ13_SHIFT                               (18U)
#define PERI_ADC2_SQR3_BIT_SQ13_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR3_BIT_SQ13_SHIFT)
#define PERI_ADC2_SQR3_BIT_SQ14_SHIFT                               (24U)
#define PERI_ADC2_SQR3_BIT_SQ14_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR3_BIT_SQ14_SHIFT)

/*--- register SQR4 -------------------------------------------------*/
#define PERI_ADC2_SQR4_BIT_SQ15_SHIFT                               (0U)
#define PERI_ADC2_SQR4_BIT_SQ15_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR4_BIT_SQ15_SHIFT)
#define PERI_ADC2_SQR4_BIT_SQ16_SHIFT                               (6U)
#define PERI_ADC2_SQR4_BIT_SQ16_MASK                                (((1U<<5)-1) << PERI_ADC2_SQR4_BIT_SQ16_SHIFT)

/*--- register DR -------------------------------------------------*/
#define PERI_ADC2_DR_BIT_RDATA_SHIFT                                (0U)
#define PERI_ADC2_DR_BIT_RDATA_MASK                                 (((1U<<16)-1) << PERI_ADC2_DR_BIT_RDATA_SHIFT)

/*--- register JSQR -------------------------------------------------*/
#define PERI_ADC2_JSQR_BIT_JL_SHIFT                                 (0U)
#define PERI_ADC2_JSQR_BIT_JL_MASK                                  (((1U<<2)-1) << PERI_ADC2_JSQR_BIT_JL_SHIFT)
#define PERI_ADC2_JSQR_BIT_JEXTSEL_SHIFT                            (2U)
#define PERI_ADC2_JSQR_BIT_JEXTSEL_MASK                             (((1U<<5)-1) << PERI_ADC2_JSQR_BIT_JEXTSEL_SHIFT)
#define PERI_ADC2_JSQR_BIT_JEXTEN_SHIFT                             (7U)
#define PERI_ADC2_JSQR_BIT_JEXTEN_MASK                              (((1U<<2)-1) << PERI_ADC2_JSQR_BIT_JEXTEN_SHIFT)
#define PERI_ADC2_JSQR_BIT_JSQ1_SHIFT                               (9U)
#define PERI_ADC2_JSQR_BIT_JSQ1_MASK                                (((1U<<5)-1) << PERI_ADC2_JSQR_BIT_JSQ1_SHIFT)
#define PERI_ADC2_JSQR_BIT_JSQ2_SHIFT                               (15U)
#define PERI_ADC2_JSQR_BIT_JSQ2_MASK                                (((1U<<5)-1) << PERI_ADC2_JSQR_BIT_JSQ2_SHIFT)
#define PERI_ADC2_JSQR_BIT_JSQ3_SHIFT                               (21U)
#define PERI_ADC2_JSQR_BIT_JSQ3_MASK                                (((1U<<5)-1) << PERI_ADC2_JSQR_BIT_JSQ3_SHIFT)
#define PERI_ADC2_JSQR_BIT_JSQ4_SHIFT                               (27U)
#define PERI_ADC2_JSQR_BIT_JSQ4_MASK                                (((1U<<5)-1) << PERI_ADC2_JSQR_BIT_JSQ4_SHIFT)

