minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OFR1 -------------------------------------------------*/
#define PERI_ADC2_OFR1_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC2_OFR1_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC2_OFR1_BIT_OFFSET1_SHIFT)
#define PERI_ADC2_OFR1_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC2_OFR1_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC2_OFR1_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC2_OFR1_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC2_OFR1_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC2_OFR1_BIT_SSATE_SHIFT)

/*--- register OFR2 -------------------------------------------------*/
#define PERI_ADC2_OFR2_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC2_OFR2_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC2_OFR2_BIT_OFFSET1_SHIFT)
#define PERI_ADC2_OFR2_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC2_OFR2_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC2_OFR2_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC2_OFR2_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC2_OFR2_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC2_OFR2_BIT_SSATE_SHIFT)

/*--- register OFR3 -------------------------------------------------*/
#define PERI_ADC2_OFR3_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC2_OFR3_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC2_OFR3_BIT_OFFSET1_SHIFT)
#define PERI_ADC2_OFR3_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC2_OFR3_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC2_OFR3_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC2_OFR3_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC2_OFR3_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC2_OFR3_BIT_SSATE_SHIFT)

/*--- register OFR4 -------------------------------------------------*/
#define PERI_ADC2_OFR4_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC2_OFR4_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC2_OFR4_BIT_OFFSET1_SHIFT)
#define PERI_ADC2_OFR4_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC2_OFR4_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC2_OFR4_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC2_OFR4_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC2_OFR4_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC2_OFR4_BIT_SSATE_SHIFT)

/*--- register JDR1 -------------------------------------------------*/
#define PERI_ADC2_JDR1_BIT_JDATA1_SHIFT                             (0U)
#define PERI_ADC2_JDR1_BIT_JDATA1_MASK                              (((1U<<32)-1) << PERI_ADC2_JDR1_BIT_JDATA1_SHIFT)

/*--- register JDR2 -------------------------------------------------*/
#define PERI_ADC2_JDR2_BIT_JDATA2_SHIFT                             (0U)
#define PERI_ADC2_JDR2_BIT_JDATA2_MASK                              (((1U<<32)-1) << PERI_ADC2_JDR2_BIT_JDATA2_SHIFT)

/*--- register JDR3 -------------------------------------------------*/
#define PERI_ADC2_JDR3_BIT_JDATA3_SHIFT                             (0U)
#define PERI_ADC2_JDR3_BIT_JDATA3_MASK                              (((1U<<32)-1) << PERI_ADC2_JDR3_BIT_JDATA3_SHIFT)

/*--- register JDR4 -------------------------------------------------*/
#define PERI_ADC2_JDR4_BIT_JDATA4_SHIFT                             (0U)
#define PERI_ADC2_JDR4_BIT_JDATA4_MASK                              (((1U<<32)-1) << PERI_ADC2_JDR4_BIT_JDATA4_SHIFT)

/*--- register AWD2CR -------------------------------------------------*/
#define PERI_ADC2_AWD2CR_BIT_AWD2CH_SHIFT                           (0U)
#define PERI_ADC2_AWD2CR_BIT_AWD2CH_MASK                            (((1U<<20)-1) << PERI_ADC2_AWD2CR_BIT_AWD2CH_SHIFT)

/*--- register AWD3CR -------------------------------------------------*/
#define PERI_ADC2_AWD3CR_BIT_AWD3CH_SHIFT                           (1U)
#define PERI_ADC2_AWD3CR_BIT_AWD3CH_MASK                            (((1U<<20)-1) << PERI_ADC2_AWD3CR_BIT_AWD3CH_SHIFT)

/*--- register LTR2 -------------------------------------------------*/
#define PERI_ADC2_LTR2_BIT_LTR2_SHIFT                               (0U)
#define PERI_ADC2_LTR2_BIT_LTR2_MASK                                (((1U<<26)-1) << PERI_ADC2_LTR2_BIT_LTR2_SHIFT)

/*--- register HTR2 -------------------------------------------------*/
#define PERI_ADC2_HTR2_BIT_HTR2_SHIFT                               (0U)
#define PERI_ADC2_HTR2_BIT_HTR2_MASK                                (((1U<<26)-1) << PERI_ADC2_HTR2_BIT_HTR2_SHIFT)

/*--- register LTR3 -------------------------------------------------*/
#define PERI_ADC2_LTR3_BIT_LTR3_SHIFT                               (0U)
#define PERI_ADC2_LTR3_BIT_LTR3_MASK                                (((1U<<26)-1) << PERI_ADC2_LTR3_BIT_LTR3_SHIFT)

/*--- register HTR3 -------------------------------------------------*/
#define PERI_ADC2_HTR3_BIT_HTR3_SHIFT                               (0U)
#define PERI_ADC2_HTR3_BIT_HTR3_MASK                                (((1U<<26)-1) << PERI_ADC2_HTR3_BIT_HTR3_SHIFT)

/*--- register DIFSEL -------------------------------------------------*/
#define PERI_ADC2_DIFSEL_BIT_DIFSEL_SHIFT                           (0U)
#define PERI_ADC2_DIFSEL_BIT_DIFSEL_MASK                            (((1U<<20)-1) << PERI_ADC2_DIFSEL_BIT_DIFSEL_SHIFT)

/*--- register CALFACT -------------------------------------------------*/
#define PERI_ADC2_CALFACT_BIT_CALFACT_S_SHIFT                       (0U)
#define PERI_ADC2_CALFACT_BIT_CALFACT_S_MASK                        (((1U<<11)-1) << PERI_ADC2_CALFACT_BIT_CALFACT_S_SHIFT)
#define PERI_ADC2_CALFACT_BIT_CALFACT_D_SHIFT                       (16U)
#define PERI_ADC2_CALFACT_BIT_CALFACT_D_MASK                        (((1U<<11)-1) << PERI_ADC2_CALFACT_BIT_CALFACT_D_SHIFT)

/*--- register CALFACT2 -------------------------------------------------*/
#define PERI_ADC2_CALFACT2_BIT_LINCALFACT_SHIFT                     (0U)
#define PERI_ADC2_CALFACT2_BIT_LINCALFACT_MASK                      (((1U<<30)-1) << PERI_ADC2_CALFACT2_BIT_LINCALFACT_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_ADC3_ISR_BIT_ADRDY_SHIFT                               (0U)
#define PERI_ADC3_ISR_BIT_ADRDY_MASK                                (((1U<<1)-1) << PERI_ADC3_ISR_BIT_ADRDY_SHIFT)
#define PERI_ADC3_ISR_BIT_EOSMP_SHIFT                               (1U)
#define PERI_ADC3_ISR_BIT_EOSMP_MASK                                (((1U<<1)-1) << PERI_ADC3_ISR_BIT_EOSMP_SHIFT)
#define PERI_ADC3_ISR_BIT_EOC_SHIFT                                 (2U)
#define PERI_ADC3_ISR_BIT_EOC_MASK                                  (((1U<<1)-1) << PERI_ADC3_ISR_BIT_EOC_SHIFT)
#define PERI_ADC3_ISR_BIT_EOS_SHIFT                                 (3U)
#define PERI_ADC3_ISR_BIT_EOS_MASK                                  (((1U<<1)-1) << PERI_ADC3_ISR_BIT_EOS_SHIFT)
#define PERI_ADC3_ISR_BIT_OVR_SHIFT                                 (4U)
#define PERI_ADC3_ISR_BIT_OVR_MASK                                  (((1U<<1)-1) << PERI_ADC3_ISR_BIT_OVR_SHIFT)
#define PERI_ADC3_ISR_BIT_JEOC_SHIFT                                (5U)
#define PERI_ADC3_ISR_BIT_JEOC_MASK                                 (((1U<<1)-1) << PERI_ADC3_ISR_BIT_JEOC_SHIFT)
#define PERI_ADC3_ISR_BIT_JEOS_SHIFT                                (6U)
#define PERI_ADC3_ISR_BIT_JEOS_MASK                                 (((1U<<1)-1) << PERI_ADC3_ISR_BIT_JEOS_SHIFT)
#define PERI_ADC3_ISR_BIT_AWD1_SHIFT                                (7U)
#define PERI_ADC3_ISR_BIT_AWD1_MASK                                 (((1U<<1)-1) << PERI_ADC3_ISR_BIT_AWD1_SHIFT)
#define PERI_ADC3_ISR_BIT_AWD2_SHIFT                                (8U)
#define PERI_ADC3_ISR_BIT_AWD2_MASK                                 (((1U<<1)-1) << PERI_ADC3_ISR_BIT_AWD2_SHIFT)
#define PERI_ADC3_ISR_BIT_AWD3_SHIFT                                (9U)
#define PERI_ADC3_ISR_BIT_AWD3_MASK                                 (((1U<<1)-1) << PERI_ADC3_ISR_BIT_AWD3_SHIFT)
#define PERI_ADC3_ISR_BIT_JQOVF_SHIFT                               (10U)
#define PERI_ADC3_ISR_BIT_JQOVF_MASK                                (((1U<<1)-1) << PERI_ADC3_ISR_BIT_JQOVF_SHIFT)
#define PERI_ADC3_ISR_BIT_LDORDY_SHIFT                              (12U)
#define PERI_ADC3_ISR_BIT_LDORDY_MASK                               (((1U<<1)-1) << PERI_ADC3_ISR_BIT_LDORDY_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_ADC3_IER_BIT_ADRDYIE_SHIFT                             (0U)
#define PERI_ADC3_IER_BIT_ADRDYIE_MASK                              (((1U<<1)-1) << PERI_ADC3_IER_BIT_ADRDYIE_SHIFT)
#define PERI_ADC3_IER_BIT_EOSMPIE_SHIFT                             (1U)
#define PERI_ADC3_IER_BIT_EOSMPIE_MASK                              (((1U<<1)-1) << PERI_ADC3_IER_BIT_EOSMPIE_SHIFT)
#define PERI_ADC3_IER_BIT_EOCIE_SHIFT                               (2U)
#define PERI_ADC3_IER_BIT_EOCIE_MASK                                (((1U<<1)-1) << PERI_ADC3_IER_BIT_EOCIE_SHIFT)
#define PERI_ADC3_IER_BIT_EOSIE_SHIFT                               (3U)
#define PERI_ADC3_IER_BIT_EOSIE_MASK                                (((1U<<1)-1) << PERI_ADC3_IER_BIT_EOSIE_SHIFT)
#define PERI_ADC3_IER_BIT_OVRIE_SHIFT                               (4U)
#define PERI_ADC3_IER_BIT_OVRIE_MASK                                (((1U<<1)-1) << PERI_ADC3_IER_BIT_OVRIE_SHIFT)
#define PERI_ADC3_IER_BIT_JEOCIE_SHIFT                              (5U)
#define PERI_ADC3_IER_BIT_JEOCIE_MASK                               (((1U<<1)-1) << PERI_ADC3_IER_BIT_JEOCIE_SHIFT)
#define PERI_ADC3_IER_BIT_JEOSIE_SHIFT                              (6U)
#define PERI_ADC3_IER_BIT_JEOSIE_MASK                               (((1U<<1)-1) << PERI_ADC3_IER_BIT_JEOSIE_SHIFT)
#define PERI_ADC3_IER_BIT_AWD1IE_SHIFT                              (7U)
#define PERI_ADC3_IER_BIT_AWD1IE_MASK                               (((1U<<1)-1) << PERI_ADC3_IER_BIT_AWD1IE_SHIFT)
#define PERI_ADC3_IER_BIT_AWD2IE_SHIFT                              (8U)
#define PERI_ADC3_IER_BIT_AWD2IE_MASK                               (((1U<<1)-1) << PERI_ADC3_IER_BIT_AWD2IE_SHIFT)
#define PERI_ADC3_IER_BIT_AWD3IE_SHIFT                              (9U)
#define PERI_ADC3_IER_BIT_AWD3IE_MASK                               (((1U<<1)-1) << PERI_ADC3_IER_BIT_AWD3IE_SHIFT)
#define PERI_ADC3_IER_BIT_JQOVFIE_SHIFT                             (10U)
#define PERI_ADC3_IER_BIT_JQOVFIE_MASK                              (((1U<<1)-1) << PERI_ADC3_IER_BIT_JQOVFIE_SHIFT)

