minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OFR1 -------------------------------------------------*/
#define PERI_ADC3_OFR1_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC3_OFR1_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC3_OFR1_BIT_OFFSET1_SHIFT)
#define PERI_ADC3_OFR1_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC3_OFR1_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC3_OFR1_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC3_OFR1_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC3_OFR1_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC3_OFR1_BIT_SSATE_SHIFT)

/*--- register OFR2 -------------------------------------------------*/
#define PERI_ADC3_OFR2_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC3_OFR2_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC3_OFR2_BIT_OFFSET1_SHIFT)
#define PERI_ADC3_OFR2_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC3_OFR2_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC3_OFR2_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC3_OFR2_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC3_OFR2_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC3_OFR2_BIT_SSATE_SHIFT)

/*--- register OFR3 -------------------------------------------------*/
#define PERI_ADC3_OFR3_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC3_OFR3_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC3_OFR3_BIT_OFFSET1_SHIFT)
#define PERI_ADC3_OFR3_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC3_OFR3_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC3_OFR3_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC3_OFR3_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC3_OFR3_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC3_OFR3_BIT_SSATE_SHIFT)

/*--- register OFR4 -------------------------------------------------*/
#define PERI_ADC3_OFR4_BIT_OFFSET1_SHIFT                            (0U)
#define PERI_ADC3_OFR4_BIT_OFFSET1_MASK                             (((1U<<26)-1) << PERI_ADC3_OFR4_BIT_OFFSET1_SHIFT)
#define PERI_ADC3_OFR4_BIT_OFFSET1_CH_SHIFT                         (26U)
#define PERI_ADC3_OFR4_BIT_OFFSET1_CH_MASK                          (((1U<<5)-1) << PERI_ADC3_OFR4_BIT_OFFSET1_CH_SHIFT)
#define PERI_ADC3_OFR4_BIT_SSATE_SHIFT                              (31U)
#define PERI_ADC3_OFR4_BIT_SSATE_MASK                               (((1U<<1)-1) << PERI_ADC3_OFR4_BIT_SSATE_SHIFT)

/*--- register JDR1 -------------------------------------------------*/
#define PERI_ADC3_JDR1_BIT_JDATA1_SHIFT                             (0U)
#define PERI_ADC3_JDR1_BIT_JDATA1_MASK                              (((1U<<32)-1) << PERI_ADC3_JDR1_BIT_JDATA1_SHIFT)

/*--- register JDR2 -------------------------------------------------*/
#define PERI_ADC3_JDR2_BIT_JDATA2_SHIFT                             (0U)
#define PERI_ADC3_JDR2_BIT_JDATA2_MASK                              (((1U<<32)-1) << PERI_ADC3_JDR2_BIT_JDATA2_SHIFT)

/*--- register JDR3 -------------------------------------------------*/
#define PERI_ADC3_JDR3_BIT_JDATA3_SHIFT                             (0U)
#define PERI_ADC3_JDR3_BIT_JDATA3_MASK                              (((1U<<32)-1) << PERI_ADC3_JDR3_BIT_JDATA3_SHIFT)

/*--- register JDR4 -------------------------------------------------*/
#define PERI_ADC3_JDR4_BIT_JDATA4_SHIFT                             (0U)
#define PERI_ADC3_JDR4_BIT_JDATA4_MASK                              (((1U<<32)-1) << PERI_ADC3_JDR4_BIT_JDATA4_SHIFT)

/*--- register AWD2CR -------------------------------------------------*/
#define PERI_ADC3_AWD2CR_BIT_AWD2CH_SHIFT                           (0U)
#define PERI_ADC3_AWD2CR_BIT_AWD2CH_MASK                            (((1U<<20)-1) << PERI_ADC3_AWD2CR_BIT_AWD2CH_SHIFT)

/*--- register AWD3CR -------------------------------------------------*/
#define PERI_ADC3_AWD3CR_BIT_AWD3CH_SHIFT                           (1U)
#define PERI_ADC3_AWD3CR_BIT_AWD3CH_MASK                            (((1U<<20)-1) << PERI_ADC3_AWD3CR_BIT_AWD3CH_SHIFT)

/*--- register LTR2 -------------------------------------------------*/
#define PERI_ADC3_LTR2_BIT_LTR2_SHIFT                               (0U)
#define PERI_ADC3_LTR2_BIT_LTR2_MASK                                (((1U<<26)-1) << PERI_ADC3_LTR2_BIT_LTR2_SHIFT)

/*--- register HTR2 -------------------------------------------------*/
#define PERI_ADC3_HTR2_BIT_HTR2_SHIFT                               (0U)
#define PERI_ADC3_HTR2_BIT_HTR2_MASK                                (((1U<<26)-1) << PERI_ADC3_HTR2_BIT_HTR2_SHIFT)

/*--- register LTR3 -------------------------------------------------*/
#define PERI_ADC3_LTR3_BIT_LTR3_SHIFT                               (0U)
#define PERI_ADC3_LTR3_BIT_LTR3_MASK                                (((1U<<26)-1) << PERI_ADC3_LTR3_BIT_LTR3_SHIFT)

/*--- register HTR3 -------------------------------------------------*/
#define PERI_ADC3_HTR3_BIT_HTR3_SHIFT                               (0U)
#define PERI_ADC3_HTR3_BIT_HTR3_MASK                                (((1U<<26)-1) << PERI_ADC3_HTR3_BIT_HTR3_SHIFT)

/*--- register DIFSEL -------------------------------------------------*/
#define PERI_ADC3_DIFSEL_BIT_DIFSEL_SHIFT                           (0U)
#define PERI_ADC3_DIFSEL_BIT_DIFSEL_MASK                            (((1U<<20)-1) << PERI_ADC3_DIFSEL_BIT_DIFSEL_SHIFT)

/*--- register CALFACT -------------------------------------------------*/
#define PERI_ADC3_CALFACT_BIT_CALFACT_S_SHIFT                       (0U)
#define PERI_ADC3_CALFACT_BIT_CALFACT_S_MASK                        (((1U<<11)-1) << PERI_ADC3_CALFACT_BIT_CALFACT_S_SHIFT)
#define PERI_ADC3_CALFACT_BIT_CALFACT_D_SHIFT                       (16U)
#define PERI_ADC3_CALFACT_BIT_CALFACT_D_MASK                        (((1U<<11)-1) << PERI_ADC3_CALFACT_BIT_CALFACT_D_SHIFT)

/*--- register CALFACT2 -------------------------------------------------*/
#define PERI_ADC3_CALFACT2_BIT_LINCALFACT_SHIFT                     (0U)
#define PERI_ADC3_CALFACT2_BIT_LINCALFACT_MASK                      (((1U<<30)-1) << PERI_ADC3_CALFACT2_BIT_LINCALFACT_SHIFT)

/*--- register CSR -------------------------------------------------*/
#define PERI_ADC3_Common_CSR_BIT_ADRDY_MST_SHIFT                    (0U)
#define PERI_ADC3_Common_CSR_BIT_ADRDY_MST_MASK                     (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_ADRDY_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_EOSMP_MST_SHIFT                    (1U)
#define PERI_ADC3_Common_CSR_BIT_EOSMP_MST_MASK                     (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_EOSMP_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_EOC_MST_SHIFT                      (2U)
#define PERI_ADC3_Common_CSR_BIT_EOC_MST_MASK                       (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_EOC_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_EOS_MST_SHIFT                      (3U)
#define PERI_ADC3_Common_CSR_BIT_EOS_MST_MASK                       (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_EOS_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_OVR_MST_SHIFT                      (4U)
#define PERI_ADC3_Common_CSR_BIT_OVR_MST_MASK                       (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_OVR_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_JEOC_MST_SHIFT                     (5U)
#define PERI_ADC3_Common_CSR_BIT_JEOC_MST_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_JEOC_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_JEOS_MST_SHIFT                     (6U)
#define PERI_ADC3_Common_CSR_BIT_JEOS_MST_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_JEOS_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_AWD1_MST_SHIFT                     (7U)
#define PERI_ADC3_Common_CSR_BIT_AWD1_MST_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_AWD1_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_AWD2_MST_SHIFT                     (8U)
#define PERI_ADC3_Common_CSR_BIT_AWD2_MST_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_AWD2_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_AWD3_MST_SHIFT                     (9U)
#define PERI_ADC3_Common_CSR_BIT_AWD3_MST_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_AWD3_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_JQOVF_MST_SHIFT                    (10U)
#define PERI_ADC3_Common_CSR_BIT_JQOVF_MST_MASK                     (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_JQOVF_MST_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_ADRDY_SLV_SHIFT                    (16U)
#define PERI_ADC3_Common_CSR_BIT_ADRDY_SLV_MASK                     (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_ADRDY_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_EOSMP_SLV_SHIFT                    (17U)
#define PERI_ADC3_Common_CSR_BIT_EOSMP_SLV_MASK                     (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_EOSMP_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_EOC_SLV_SHIFT                      (18U)
#define PERI_ADC3_Common_CSR_BIT_EOC_SLV_MASK                       (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_EOC_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_EOS_SLV_SHIFT                      (19U)
#define PERI_ADC3_Common_CSR_BIT_EOS_SLV_MASK                       (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_EOS_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_OVR_SLV_SHIFT                      (20U)
#define PERI_ADC3_Common_CSR_BIT_OVR_SLV_MASK                       (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_OVR_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_JEOC_SLV_SHIFT                     (21U)
#define PERI_ADC3_Common_CSR_BIT_JEOC_SLV_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_JEOC_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_JEOS_SLV_SHIFT                     (22U)
#define PERI_ADC3_Common_CSR_BIT_JEOS_SLV_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_JEOS_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_AWD1_SLV_SHIFT                     (23U)
#define PERI_ADC3_Common_CSR_BIT_AWD1_SLV_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_AWD1_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_AWD2_SLV_SHIFT                     (24U)
#define PERI_ADC3_Common_CSR_BIT_AWD2_SLV_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_AWD2_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_AWD3_SLV_SHIFT                     (25U)
#define PERI_ADC3_Common_CSR_BIT_AWD3_SLV_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_AWD3_SLV_SHIFT)
#define PERI_ADC3_Common_CSR_BIT_JQOVF_SLV_SHIFT                    (26U)
#define PERI_ADC3_Common_CSR_BIT_JQOVF_SLV_MASK                     (((1U<<1)-1) << PERI_ADC3_Common_CSR_BIT_JQOVF_SLV_SHIFT)

/*--- register CCR -------------------------------------------------*/
#define PERI_ADC3_Common_CCR_BIT_DUAL_SHIFT                         (0U)
#define PERI_ADC3_Common_CCR_BIT_DUAL_MASK                          (((1U<<5)-1) << PERI_ADC3_Common_CCR_BIT_DUAL_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_DELAY_SHIFT                        (8U)
#define PERI_ADC3_Common_CCR_BIT_DELAY_MASK                         (((1U<<4)-1) << PERI_ADC3_Common_CCR_BIT_DELAY_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_DAMDF_SHIFT                        (14U)
#define PERI_ADC3_Common_CCR_BIT_DAMDF_MASK                         (((1U<<2)-1) << PERI_ADC3_Common_CCR_BIT_DAMDF_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_CKMODE_SHIFT                       (16U)
#define PERI_ADC3_Common_CCR_BIT_CKMODE_MASK                        (((1U<<2)-1) << PERI_ADC3_Common_CCR_BIT_CKMODE_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_PRESC_SHIFT                        (18U)
#define PERI_ADC3_Common_CCR_BIT_PRESC_MASK                         (((1U<<4)-1) << PERI_ADC3_Common_CCR_BIT_PRESC_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_VREFEN_SHIFT                       (22U)
#define PERI_ADC3_Common_CCR_BIT_VREFEN_MASK                        (((1U<<1)-1) << PERI_ADC3_Common_CCR_BIT_VREFEN_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_VSENSEEN_SHIFT                     (23U)
#define PERI_ADC3_Common_CCR_BIT_VSENSEEN_MASK                      (((1U<<1)-1) << PERI_ADC3_Common_CCR_BIT_VSENSEEN_SHIFT)
#define PERI_ADC3_Common_CCR_BIT_VBATEN_SHIFT                       (24U)
#define PERI_ADC3_Common_CCR_BIT_VBATEN_MASK                        (((1U<<1)-1) << PERI_ADC3_Common_CCR_BIT_VBATEN_SHIFT)

/*--- register CDR -------------------------------------------------*/
#define PERI_ADC3_Common_CDR_BIT_RDATA_MST_SHIFT                    (0U)
#define PERI_ADC3_Common_CDR_BIT_RDATA_MST_MASK                     (((1U<<16)-1) << PERI_ADC3_Common_CDR_BIT_RDATA_MST_SHIFT)
#define PERI_ADC3_Common_CDR_BIT_RDATA_SLV_SHIFT                    (16U)
#define PERI_ADC3_Common_CDR_BIT_RDATA_SLV_MASK                     (((1U<<16)-1) << PERI_ADC3_Common_CDR_BIT_RDATA_SLV_SHIFT)

/*--- register CDR2 -------------------------------------------------*/
#define PERI_ADC3_Common_CDR2_BIT_RDATA_ALT_SHIFT                   (0U)
#define PERI_ADC3_Common_CDR2_BIT_RDATA_ALT_MASK                    (((1U<<32)-1) << PERI_ADC3_Common_CDR2_BIT_RDATA_ALT_SHIFT)

/*--- register AXI_PERIPH_ID_4 -------------------------------------------------*/
#define PERI_AXI_AXI_PERIPH_ID_4_BIT_JEP106CON_SHIFT                (0U)
#define PERI_AXI_AXI_PERIPH_ID_4_BIT_JEP106CON_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_4_BIT_JEP106CON_SHIFT)
#define PERI_AXI_AXI_PERIPH_ID_4_BIT_KCOUNT4_SHIFT                  (4U)
#define PERI_AXI_AXI_PERIPH_ID_4_BIT_KCOUNT4_MASK                   (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_4_BIT_KCOUNT4_SHIFT)

