minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register AXI_PERIPH_ID_0 -------------------------------------------------*/
#define PERI_AXI_AXI_PERIPH_ID_0_BIT_PARTNUM_SHIFT                  (0U)
#define PERI_AXI_AXI_PERIPH_ID_0_BIT_PARTNUM_MASK                   (((1U<<8)-1) << PERI_AXI_AXI_PERIPH_ID_0_BIT_PARTNUM_SHIFT)

/*--- register AXI_PERIPH_ID_1 -------------------------------------------------*/
#define PERI_AXI_AXI_PERIPH_ID_1_BIT_PARTNUM_SHIFT                  (0U)
#define PERI_AXI_AXI_PERIPH_ID_1_BIT_PARTNUM_MASK                   (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_1_BIT_PARTNUM_SHIFT)
#define PERI_AXI_AXI_PERIPH_ID_1_BIT_JEP106I_SHIFT                  (4U)
#define PERI_AXI_AXI_PERIPH_ID_1_BIT_JEP106I_MASK                   (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_1_BIT_JEP106I_SHIFT)

/*--- register AXI_PERIPH_ID_2 -------------------------------------------------*/
#define PERI_AXI_AXI_PERIPH_ID_2_BIT_JEP106ID_SHIFT                 (0U)
#define PERI_AXI_AXI_PERIPH_ID_2_BIT_JEP106ID_MASK                  (((1U<<3)-1) << PERI_AXI_AXI_PERIPH_ID_2_BIT_JEP106ID_SHIFT)
#define PERI_AXI_AXI_PERIPH_ID_2_BIT_JEDEC_SHIFT                    (3U)
#define PERI_AXI_AXI_PERIPH_ID_2_BIT_JEDEC_MASK                     (((1U<<1)-1) << PERI_AXI_AXI_PERIPH_ID_2_BIT_JEDEC_SHIFT)
#define PERI_AXI_AXI_PERIPH_ID_2_BIT_REVISION_SHIFT                 (4U)
#define PERI_AXI_AXI_PERIPH_ID_2_BIT_REVISION_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_2_BIT_REVISION_SHIFT)

/*--- register AXI_PERIPH_ID_3 -------------------------------------------------*/
#define PERI_AXI_AXI_PERIPH_ID_3_BIT_CUST_MOD_NUM_SHIFT             (0U)
#define PERI_AXI_AXI_PERIPH_ID_3_BIT_CUST_MOD_NUM_MASK              (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_3_BIT_CUST_MOD_NUM_SHIFT)
#define PERI_AXI_AXI_PERIPH_ID_3_BIT_REV_AND_SHIFT                  (4U)
#define PERI_AXI_AXI_PERIPH_ID_3_BIT_REV_AND_MASK                   (((1U<<4)-1) << PERI_AXI_AXI_PERIPH_ID_3_BIT_REV_AND_SHIFT)

/*--- register AXI_COMP_ID_0 -------------------------------------------------*/
#define PERI_AXI_AXI_COMP_ID_0_BIT_PREAMBLE_SHIFT                   (0U)
#define PERI_AXI_AXI_COMP_ID_0_BIT_PREAMBLE_MASK                    (((1U<<8)-1) << PERI_AXI_AXI_COMP_ID_0_BIT_PREAMBLE_SHIFT)

/*--- register AXI_COMP_ID_1 -------------------------------------------------*/
#define PERI_AXI_AXI_COMP_ID_1_BIT_PREAMBLE_SHIFT                   (0U)
#define PERI_AXI_AXI_COMP_ID_1_BIT_PREAMBLE_MASK                    (((1U<<4)-1) << PERI_AXI_AXI_COMP_ID_1_BIT_PREAMBLE_SHIFT)
#define PERI_AXI_AXI_COMP_ID_1_BIT_CLASS_SHIFT                      (4U)
#define PERI_AXI_AXI_COMP_ID_1_BIT_CLASS_MASK                       (((1U<<4)-1) << PERI_AXI_AXI_COMP_ID_1_BIT_CLASS_SHIFT)

/*--- register AXI_COMP_ID_2 -------------------------------------------------*/
#define PERI_AXI_AXI_COMP_ID_2_BIT_PREAMBLE_SHIFT                   (0U)
#define PERI_AXI_AXI_COMP_ID_2_BIT_PREAMBLE_MASK                    (((1U<<8)-1) << PERI_AXI_AXI_COMP_ID_2_BIT_PREAMBLE_SHIFT)

/*--- register AXI_COMP_ID_3 -------------------------------------------------*/
#define PERI_AXI_AXI_COMP_ID_3_BIT_PREAMBLE_SHIFT                   (0U)
#define PERI_AXI_AXI_COMP_ID_3_BIT_PREAMBLE_MASK                    (((1U<<8)-1) << PERI_AXI_AXI_COMP_ID_3_BIT_PREAMBLE_SHIFT)

/*--- register AXI_TARG1_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG1_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG1_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG1_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG1_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG1_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG1_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG1_FN_MOD2 -------------------------------------------------*/
#define PERI_AXI_AXI_TARG1_FN_MOD2_BIT_BYPASS_MERGE_SHIFT           (0U)
#define PERI_AXI_AXI_TARG1_FN_MOD2_BIT_BYPASS_MERGE_MASK            (((1U<<1)-1) << PERI_AXI_AXI_TARG1_FN_MOD2_BIT_BYPASS_MERGE_SHIFT)

/*--- register AXI_TARG1_FN_MOD_LB -------------------------------------------------*/
#define PERI_AXI_AXI_TARG1_FN_MOD_LB_BIT_FN_MOD_LB_SHIFT            (0U)
#define PERI_AXI_AXI_TARG1_FN_MOD_LB_BIT_FN_MOD_LB_MASK             (((1U<<1)-1) << PERI_AXI_AXI_TARG1_FN_MOD_LB_BIT_FN_MOD_LB_SHIFT)

/*--- register AXI_TARG1_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_TARG1_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT       (0U)
#define PERI_AXI_AXI_TARG1_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_TARG1_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG1_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT      (1U)
#define PERI_AXI_AXI_TARG1_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_TARG1_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG2_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG2_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG2_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG2_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG2_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG2_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG2_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG2_FN_MOD2 -------------------------------------------------*/
#define PERI_AXI_AXI_TARG2_FN_MOD2_BIT_BYPASS_MERGE_SHIFT           (0U)
#define PERI_AXI_AXI_TARG2_FN_MOD2_BIT_BYPASS_MERGE_MASK            (((1U<<1)-1) << PERI_AXI_AXI_TARG2_FN_MOD2_BIT_BYPASS_MERGE_SHIFT)

/*--- register AXI_TARG2_FN_MOD_LB -------------------------------------------------*/
#define PERI_AXI_AXI_TARG2_FN_MOD_LB_BIT_FN_MOD_LB_SHIFT            (0U)
#define PERI_AXI_AXI_TARG2_FN_MOD_LB_BIT_FN_MOD_LB_MASK             (((1U<<1)-1) << PERI_AXI_AXI_TARG2_FN_MOD_LB_BIT_FN_MOD_LB_SHIFT)

/*--- register AXI_TARG2_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_TARG2_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT       (0U)
#define PERI_AXI_AXI_TARG2_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_TARG2_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG2_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT      (1U)
#define PERI_AXI_AXI_TARG2_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_TARG2_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG3_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG3_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG3_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG3_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG3_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG3_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG3_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG4_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG4_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG4_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG4_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG4_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG4_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG4_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG5_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG5_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG5_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG5_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG5_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG5_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG5_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG6_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG6_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG6_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG6_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG6_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG6_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG6_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_TARG7_FN_MOD_ISS_BM -------------------------------------------------*/
#define PERI_AXI_AXI_TARG7_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT (0U)
#define PERI_AXI_AXI_TARG7_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG7_FN_MOD_ISS_BM_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG7_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT (1U)
#define PERI_AXI_AXI_TARG7_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_MASK (((1U<<1)-1) << PERI_AXI_AXI_TARG7_FN_MOD_ISS_BM_BIT_WRITE_ISS_OVERRIDE_SHIFT)

