minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register AXI_TARG7_FN_MOD2 -------------------------------------------------*/
#define PERI_AXI_AXI_TARG7_FN_MOD2_BIT_BYPASS_MERGE_SHIFT           (0U)
#define PERI_AXI_AXI_TARG7_FN_MOD2_BIT_BYPASS_MERGE_MASK            (((1U<<1)-1) << PERI_AXI_AXI_TARG7_FN_MOD2_BIT_BYPASS_MERGE_SHIFT)

/*--- register AXI_TARG7_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_TARG7_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT       (0U)
#define PERI_AXI_AXI_TARG7_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_TARG7_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_TARG7_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT      (1U)
#define PERI_AXI_AXI_TARG7_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_TARG7_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_INI1_FN_MOD2 -------------------------------------------------*/
#define PERI_AXI_AXI_INI1_FN_MOD2_BIT_BYPASS_MERGE_SHIFT            (0U)
#define PERI_AXI_AXI_INI1_FN_MOD2_BIT_BYPASS_MERGE_MASK             (((1U<<1)-1) << PERI_AXI_AXI_INI1_FN_MOD2_BIT_BYPASS_MERGE_SHIFT)

/*--- register AXI_INI1_FN_MOD_AHB -------------------------------------------------*/
#define PERI_AXI_AXI_INI1_FN_MOD_AHB_BIT_RD_INC_OVERRIDE_SHIFT      (0U)
#define PERI_AXI_AXI_INI1_FN_MOD_AHB_BIT_RD_INC_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_INI1_FN_MOD_AHB_BIT_RD_INC_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI1_FN_MOD_AHB_BIT_WR_INC_OVERRIDE_SHIFT      (1U)
#define PERI_AXI_AXI_INI1_FN_MOD_AHB_BIT_WR_INC_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_INI1_FN_MOD_AHB_BIT_WR_INC_OVERRIDE_SHIFT)

/*--- register AXI_INI1_READ_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI1_READ_QOS_BIT_AR_QOS_SHIFT                 (0U)
#define PERI_AXI_AXI_INI1_READ_QOS_BIT_AR_QOS_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_INI1_READ_QOS_BIT_AR_QOS_SHIFT)

/*--- register AXI_INI1_WRITE_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI1_WRITE_QOS_BIT_AW_QOS_SHIFT                (0U)
#define PERI_AXI_AXI_INI1_WRITE_QOS_BIT_AW_QOS_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_INI1_WRITE_QOS_BIT_AW_QOS_SHIFT)

/*--- register AXI_INI1_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_INI1_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT        (0U)
#define PERI_AXI_AXI_INI1_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK         (((1U<<1)-1) << PERI_AXI_AXI_INI1_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI1_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT       (1U)
#define PERI_AXI_AXI_INI1_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_INI1_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_INI2_READ_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI2_READ_QOS_BIT_AR_QOS_SHIFT                 (0U)
#define PERI_AXI_AXI_INI2_READ_QOS_BIT_AR_QOS_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_INI2_READ_QOS_BIT_AR_QOS_SHIFT)

/*--- register AXI_INI2_WRITE_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI2_WRITE_QOS_BIT_AW_QOS_SHIFT                (0U)
#define PERI_AXI_AXI_INI2_WRITE_QOS_BIT_AW_QOS_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_INI2_WRITE_QOS_BIT_AW_QOS_SHIFT)

/*--- register AXI_INI2_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_INI2_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT        (0U)
#define PERI_AXI_AXI_INI2_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK         (((1U<<1)-1) << PERI_AXI_AXI_INI2_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI2_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT       (1U)
#define PERI_AXI_AXI_INI2_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_INI2_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_INI3_FN_MOD2 -------------------------------------------------*/
#define PERI_AXI_AXI_INI3_FN_MOD2_BIT_BYPASS_MERGE_SHIFT            (0U)
#define PERI_AXI_AXI_INI3_FN_MOD2_BIT_BYPASS_MERGE_MASK             (((1U<<1)-1) << PERI_AXI_AXI_INI3_FN_MOD2_BIT_BYPASS_MERGE_SHIFT)

/*--- register AXI_INI3_FN_MOD_AHB -------------------------------------------------*/
#define PERI_AXI_AXI_INI3_FN_MOD_AHB_BIT_RD_INC_OVERRIDE_SHIFT      (0U)
#define PERI_AXI_AXI_INI3_FN_MOD_AHB_BIT_RD_INC_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_INI3_FN_MOD_AHB_BIT_RD_INC_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI3_FN_MOD_AHB_BIT_WR_INC_OVERRIDE_SHIFT      (1U)
#define PERI_AXI_AXI_INI3_FN_MOD_AHB_BIT_WR_INC_OVERRIDE_MASK       (((1U<<1)-1) << PERI_AXI_AXI_INI3_FN_MOD_AHB_BIT_WR_INC_OVERRIDE_SHIFT)

/*--- register AXI_INI3_READ_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI3_READ_QOS_BIT_AR_QOS_SHIFT                 (0U)
#define PERI_AXI_AXI_INI3_READ_QOS_BIT_AR_QOS_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_INI3_READ_QOS_BIT_AR_QOS_SHIFT)

/*--- register AXI_INI3_WRITE_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI3_WRITE_QOS_BIT_AW_QOS_SHIFT                (0U)
#define PERI_AXI_AXI_INI3_WRITE_QOS_BIT_AW_QOS_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_INI3_WRITE_QOS_BIT_AW_QOS_SHIFT)

/*--- register AXI_INI3_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_INI3_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT        (0U)
#define PERI_AXI_AXI_INI3_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK         (((1U<<1)-1) << PERI_AXI_AXI_INI3_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI3_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT       (1U)
#define PERI_AXI_AXI_INI3_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_INI3_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_INI4_READ_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI4_READ_QOS_BIT_AR_QOS_SHIFT                 (0U)
#define PERI_AXI_AXI_INI4_READ_QOS_BIT_AR_QOS_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_INI4_READ_QOS_BIT_AR_QOS_SHIFT)

/*--- register AXI_INI4_WRITE_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI4_WRITE_QOS_BIT_AW_QOS_SHIFT                (0U)
#define PERI_AXI_AXI_INI4_WRITE_QOS_BIT_AW_QOS_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_INI4_WRITE_QOS_BIT_AW_QOS_SHIFT)

