minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register AXI_INI4_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_INI4_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT        (0U)
#define PERI_AXI_AXI_INI4_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK         (((1U<<1)-1) << PERI_AXI_AXI_INI4_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI4_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT       (1U)
#define PERI_AXI_AXI_INI4_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_INI4_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_INI5_READ_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI5_READ_QOS_BIT_AR_QOS_SHIFT                 (0U)
#define PERI_AXI_AXI_INI5_READ_QOS_BIT_AR_QOS_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_INI5_READ_QOS_BIT_AR_QOS_SHIFT)

/*--- register AXI_INI5_WRITE_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI5_WRITE_QOS_BIT_AW_QOS_SHIFT                (0U)
#define PERI_AXI_AXI_INI5_WRITE_QOS_BIT_AW_QOS_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_INI5_WRITE_QOS_BIT_AW_QOS_SHIFT)

/*--- register AXI_INI5_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_INI5_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT        (0U)
#define PERI_AXI_AXI_INI5_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK         (((1U<<1)-1) << PERI_AXI_AXI_INI5_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI5_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT       (1U)
#define PERI_AXI_AXI_INI5_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_INI5_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register AXI_INI6_READ_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI6_READ_QOS_BIT_AR_QOS_SHIFT                 (0U)
#define PERI_AXI_AXI_INI6_READ_QOS_BIT_AR_QOS_MASK                  (((1U<<4)-1) << PERI_AXI_AXI_INI6_READ_QOS_BIT_AR_QOS_SHIFT)

/*--- register AXI_INI6_WRITE_QOS -------------------------------------------------*/
#define PERI_AXI_AXI_INI6_WRITE_QOS_BIT_AW_QOS_SHIFT                (0U)
#define PERI_AXI_AXI_INI6_WRITE_QOS_BIT_AW_QOS_MASK                 (((1U<<4)-1) << PERI_AXI_AXI_INI6_WRITE_QOS_BIT_AW_QOS_SHIFT)

/*--- register AXI_INI6_FN_MOD -------------------------------------------------*/
#define PERI_AXI_AXI_INI6_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT        (0U)
#define PERI_AXI_AXI_INI6_FN_MOD_BIT_READ_ISS_OVERRIDE_MASK         (((1U<<1)-1) << PERI_AXI_AXI_INI6_FN_MOD_BIT_READ_ISS_OVERRIDE_SHIFT)
#define PERI_AXI_AXI_INI6_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT       (1U)
#define PERI_AXI_AXI_INI6_FN_MOD_BIT_WRITE_ISS_OVERRIDE_MASK        (((1U<<1)-1) << PERI_AXI_AXI_INI6_FN_MOD_BIT_WRITE_ISS_OVERRIDE_SHIFT)

/*--- register BDMA_ISR -------------------------------------------------*/
#define PERI_BDMA_BDMA_ISR_BIT_GIF0_SHIFT                           (0U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF0_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF0_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF0_SHIFT                          (1U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF0_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF0_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF0_SHIFT                          (2U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF0_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF0_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF0_SHIFT                          (3U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF0_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF0_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF1_SHIFT                           (4U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF1_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF1_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF1_SHIFT                          (5U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF1_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF1_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF1_SHIFT                          (6U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF1_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF1_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF1_SHIFT                          (7U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF1_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF1_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF2_SHIFT                           (8U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF2_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF2_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF2_SHIFT                          (9U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF2_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF2_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF2_SHIFT                          (10U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF2_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF2_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF2_SHIFT                          (11U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF2_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF2_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF3_SHIFT                           (12U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF3_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF3_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF3_SHIFT                          (13U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF3_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF3_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF3_SHIFT                          (14U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF3_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF3_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF3_SHIFT                          (15U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF3_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF3_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF4_SHIFT                           (16U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF4_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF4_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF4_SHIFT                          (17U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF4_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF4_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF4_SHIFT                          (18U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF4_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF4_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF4_SHIFT                          (19U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF4_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF4_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF5_SHIFT                           (20U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF5_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF5_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF5_SHIFT                          (21U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF5_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF5_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF5_SHIFT                          (22U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF5_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF5_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF5_SHIFT                          (23U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF5_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF5_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF6_SHIFT                           (24U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF6_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF6_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF6_SHIFT                          (25U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF6_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF6_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF6_SHIFT                          (26U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF6_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF6_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF6_SHIFT                          (27U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF6_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF6_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_GIF7_SHIFT                           (28U)
#define PERI_BDMA_BDMA_ISR_BIT_GIF7_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_GIF7_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF7_SHIFT                          (29U)
#define PERI_BDMA_BDMA_ISR_BIT_TCIF7_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TCIF7_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF7_SHIFT                          (30U)
#define PERI_BDMA_BDMA_ISR_BIT_HTIF7_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_HTIF7_SHIFT)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF7_SHIFT                          (31U)
#define PERI_BDMA_BDMA_ISR_BIT_TEIF7_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_ISR_BIT_TEIF7_SHIFT)

/*--- register BDMA_IFCR -------------------------------------------------*/
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF0_SHIFT                         (0U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF0_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF0_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF0_SHIFT                        (1U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF0_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF0_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF0_SHIFT                        (2U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF0_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF0_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF0_SHIFT                        (3U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF0_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF0_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF1_SHIFT                         (4U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF1_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF1_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF1_SHIFT                        (5U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF1_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF1_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF1_SHIFT                        (6U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF1_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF1_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF1_SHIFT                        (7U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF1_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF1_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF2_SHIFT                         (8U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF2_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF2_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF2_SHIFT                        (9U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF2_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF2_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF2_SHIFT                        (10U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF2_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF2_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF2_SHIFT                        (11U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF2_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF2_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF3_SHIFT                         (12U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF3_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF3_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF3_SHIFT                        (13U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF3_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF3_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF3_SHIFT                        (14U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF3_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF3_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF3_SHIFT                        (15U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF3_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF3_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF4_SHIFT                         (16U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF4_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF4_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF4_SHIFT                        (17U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF4_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF4_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF4_SHIFT                        (18U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF4_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF4_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF4_SHIFT                        (19U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF4_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF4_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF5_SHIFT                         (20U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF5_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF5_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF5_SHIFT                        (21U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF5_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF5_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF5_SHIFT                        (22U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF5_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF5_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF5_SHIFT                        (23U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF5_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF5_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF6_SHIFT                         (24U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF6_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF6_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF6_SHIFT                        (25U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF6_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF6_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF6_SHIFT                        (26U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF6_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF6_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF6_SHIFT                        (27U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF6_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF6_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF7_SHIFT                         (28U)
#define PERI_BDMA_BDMA_IFCR_BIT_CGIF7_MASK                          (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CGIF7_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF7_SHIFT                        (29U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTCIF7_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTCIF7_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF7_SHIFT                        (30U)
#define PERI_BDMA_BDMA_IFCR_BIT_CHTIF7_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CHTIF7_SHIFT)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF7_SHIFT                        (31U)
#define PERI_BDMA_BDMA_IFCR_BIT_CTEIF7_MASK                         (((1U<<1)-1) << PERI_BDMA_BDMA_IFCR_BIT_CTEIF7_SHIFT)

/*--- register BDMA_CCR0 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CCR0_BIT_EN_SHIFT                            (0U)
#define PERI_BDMA_BDMA_CCR0_BIT_EN_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_EN_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_TCIE_SHIFT                          (1U)
#define PERI_BDMA_BDMA_CCR0_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_TCIE_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_HTIE_SHIFT                          (2U)
#define PERI_BDMA_BDMA_CCR0_BIT_HTIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_HTIE_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_TEIE_SHIFT                          (3U)
#define PERI_BDMA_BDMA_CCR0_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_TEIE_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_DIR_SHIFT                           (4U)
#define PERI_BDMA_BDMA_CCR0_BIT_DIR_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_DIR_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_CIRC_SHIFT                          (5U)
#define PERI_BDMA_BDMA_CCR0_BIT_CIRC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_CIRC_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_PINC_SHIFT                          (6U)
#define PERI_BDMA_BDMA_CCR0_BIT_PINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_PINC_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_MINC_SHIFT                          (7U)
#define PERI_BDMA_BDMA_CCR0_BIT_MINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_MINC_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_PSIZE_SHIFT                         (8U)
#define PERI_BDMA_BDMA_CCR0_BIT_PSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR0_BIT_PSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_MSIZE_SHIFT                         (10U)
#define PERI_BDMA_BDMA_CCR0_BIT_MSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR0_BIT_MSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_PL_SHIFT                            (12U)
#define PERI_BDMA_BDMA_CCR0_BIT_PL_MASK                             (((1U<<2)-1) << PERI_BDMA_BDMA_CCR0_BIT_PL_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_MEM2MEM_SHIFT                       (14U)
#define PERI_BDMA_BDMA_CCR0_BIT_MEM2MEM_MASK                        (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_MEM2MEM_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_DBM_SHIFT                           (15U)
#define PERI_BDMA_BDMA_CCR0_BIT_DBM_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_DBM_SHIFT)
#define PERI_BDMA_BDMA_CCR0_BIT_CT_SHIFT                            (16U)
#define PERI_BDMA_BDMA_CCR0_BIT_CT_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR0_BIT_CT_SHIFT)

/*--- register BDMA_CNDTR0 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CNDTR0_BIT_NDT_SHIFT                         (0U)
#define PERI_BDMA_BDMA_CNDTR0_BIT_NDT_MASK                          (((1U<<16)-1) << PERI_BDMA_BDMA_CNDTR0_BIT_NDT_SHIFT)

