minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register BDMA_CM1AR2 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM1AR2_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM1AR2_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM1AR2_BIT_MA_SHIFT)

/*--- register BDMA_CCR3 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CCR3_BIT_EN_SHIFT                            (0U)
#define PERI_BDMA_BDMA_CCR3_BIT_EN_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_EN_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_TCIE_SHIFT                          (1U)
#define PERI_BDMA_BDMA_CCR3_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_TCIE_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_HTIE_SHIFT                          (2U)
#define PERI_BDMA_BDMA_CCR3_BIT_HTIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_HTIE_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_TEIE_SHIFT                          (3U)
#define PERI_BDMA_BDMA_CCR3_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_TEIE_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_DIR_SHIFT                           (4U)
#define PERI_BDMA_BDMA_CCR3_BIT_DIR_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_DIR_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_CIRC_SHIFT                          (5U)
#define PERI_BDMA_BDMA_CCR3_BIT_CIRC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_CIRC_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_PINC_SHIFT                          (6U)
#define PERI_BDMA_BDMA_CCR3_BIT_PINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_PINC_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_MINC_SHIFT                          (7U)
#define PERI_BDMA_BDMA_CCR3_BIT_MINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_MINC_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_PSIZE_SHIFT                         (8U)
#define PERI_BDMA_BDMA_CCR3_BIT_PSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR3_BIT_PSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_MSIZE_SHIFT                         (10U)
#define PERI_BDMA_BDMA_CCR3_BIT_MSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR3_BIT_MSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_PL_SHIFT                            (12U)
#define PERI_BDMA_BDMA_CCR3_BIT_PL_MASK                             (((1U<<2)-1) << PERI_BDMA_BDMA_CCR3_BIT_PL_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_MEM2MEM_SHIFT                       (14U)
#define PERI_BDMA_BDMA_CCR3_BIT_MEM2MEM_MASK                        (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_MEM2MEM_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_DBM_SHIFT                           (15U)
#define PERI_BDMA_BDMA_CCR3_BIT_DBM_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_DBM_SHIFT)
#define PERI_BDMA_BDMA_CCR3_BIT_CT_SHIFT                            (16U)
#define PERI_BDMA_BDMA_CCR3_BIT_CT_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR3_BIT_CT_SHIFT)

/*--- register BDMA_CNDTR3 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CNDTR3_BIT_NDT_SHIFT                         (0U)
#define PERI_BDMA_BDMA_CNDTR3_BIT_NDT_MASK                          (((1U<<16)-1) << PERI_BDMA_BDMA_CNDTR3_BIT_NDT_SHIFT)

/*--- register BDMA_CPAR3 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CPAR3_BIT_PA_SHIFT                           (0U)
#define PERI_BDMA_BDMA_CPAR3_BIT_PA_MASK                            (((1U<<32)-1) << PERI_BDMA_BDMA_CPAR3_BIT_PA_SHIFT)

/*--- register BDMA_CM0AR3 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM0AR3_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM0AR3_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM0AR3_BIT_MA_SHIFT)

/*--- register BDMA_CM1AR3 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM1AR3_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM1AR3_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM1AR3_BIT_MA_SHIFT)

/*--- register BDMA_CCR4 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CCR4_BIT_EN_SHIFT                            (0U)
#define PERI_BDMA_BDMA_CCR4_BIT_EN_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_EN_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_TCIE_SHIFT                          (1U)
#define PERI_BDMA_BDMA_CCR4_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_TCIE_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_HTIE_SHIFT                          (2U)
#define PERI_BDMA_BDMA_CCR4_BIT_HTIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_HTIE_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_TEIE_SHIFT                          (3U)
#define PERI_BDMA_BDMA_CCR4_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_TEIE_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_DIR_SHIFT                           (4U)
#define PERI_BDMA_BDMA_CCR4_BIT_DIR_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_DIR_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_CIRC_SHIFT                          (5U)
#define PERI_BDMA_BDMA_CCR4_BIT_CIRC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_CIRC_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_PINC_SHIFT                          (6U)
#define PERI_BDMA_BDMA_CCR4_BIT_PINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_PINC_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_MINC_SHIFT                          (7U)
#define PERI_BDMA_BDMA_CCR4_BIT_MINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_MINC_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_PSIZE_SHIFT                         (8U)
#define PERI_BDMA_BDMA_CCR4_BIT_PSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR4_BIT_PSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_MSIZE_SHIFT                         (10U)
#define PERI_BDMA_BDMA_CCR4_BIT_MSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR4_BIT_MSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_PL_SHIFT                            (12U)
#define PERI_BDMA_BDMA_CCR4_BIT_PL_MASK                             (((1U<<2)-1) << PERI_BDMA_BDMA_CCR4_BIT_PL_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_MEM2MEM_SHIFT                       (14U)
#define PERI_BDMA_BDMA_CCR4_BIT_MEM2MEM_MASK                        (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_MEM2MEM_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_DBM_SHIFT                           (15U)
#define PERI_BDMA_BDMA_CCR4_BIT_DBM_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_DBM_SHIFT)
#define PERI_BDMA_BDMA_CCR4_BIT_CT_SHIFT                            (16U)
#define PERI_BDMA_BDMA_CCR4_BIT_CT_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR4_BIT_CT_SHIFT)

