minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register BDMA_CNDTR4 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CNDTR4_BIT_NDT_SHIFT                         (0U)
#define PERI_BDMA_BDMA_CNDTR4_BIT_NDT_MASK                          (((1U<<16)-1) << PERI_BDMA_BDMA_CNDTR4_BIT_NDT_SHIFT)

/*--- register BDMA_CPAR4 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CPAR4_BIT_PA_SHIFT                           (0U)
#define PERI_BDMA_BDMA_CPAR4_BIT_PA_MASK                            (((1U<<32)-1) << PERI_BDMA_BDMA_CPAR4_BIT_PA_SHIFT)

/*--- register BDMA_CM0AR4 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM0AR4_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM0AR4_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM0AR4_BIT_MA_SHIFT)

/*--- register BDMA_CM1AR4 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM1AR4_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM1AR4_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM1AR4_BIT_MA_SHIFT)

/*--- register BDMA_CCR5 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CCR5_BIT_EN_SHIFT                            (0U)
#define PERI_BDMA_BDMA_CCR5_BIT_EN_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_EN_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_TCIE_SHIFT                          (1U)
#define PERI_BDMA_BDMA_CCR5_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_TCIE_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_HTIE_SHIFT                          (2U)
#define PERI_BDMA_BDMA_CCR5_BIT_HTIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_HTIE_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_TEIE_SHIFT                          (3U)
#define PERI_BDMA_BDMA_CCR5_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_TEIE_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_DIR_SHIFT                           (4U)
#define PERI_BDMA_BDMA_CCR5_BIT_DIR_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_DIR_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_CIRC_SHIFT                          (5U)
#define PERI_BDMA_BDMA_CCR5_BIT_CIRC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_CIRC_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_PINC_SHIFT                          (6U)
#define PERI_BDMA_BDMA_CCR5_BIT_PINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_PINC_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_MINC_SHIFT                          (7U)
#define PERI_BDMA_BDMA_CCR5_BIT_MINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_MINC_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_PSIZE_SHIFT                         (8U)
#define PERI_BDMA_BDMA_CCR5_BIT_PSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR5_BIT_PSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_MSIZE_SHIFT                         (10U)
#define PERI_BDMA_BDMA_CCR5_BIT_MSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR5_BIT_MSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_PL_SHIFT                            (12U)
#define PERI_BDMA_BDMA_CCR5_BIT_PL_MASK                             (((1U<<2)-1) << PERI_BDMA_BDMA_CCR5_BIT_PL_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_MEM2MEM_SHIFT                       (14U)
#define PERI_BDMA_BDMA_CCR5_BIT_MEM2MEM_MASK                        (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_MEM2MEM_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_DBM_SHIFT                           (15U)
#define PERI_BDMA_BDMA_CCR5_BIT_DBM_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_DBM_SHIFT)
#define PERI_BDMA_BDMA_CCR5_BIT_CT_SHIFT                            (16U)
#define PERI_BDMA_BDMA_CCR5_BIT_CT_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR5_BIT_CT_SHIFT)

/*--- register BDMA_CNDTR5 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CNDTR5_BIT_NDT_SHIFT                         (0U)
#define PERI_BDMA_BDMA_CNDTR5_BIT_NDT_MASK                          (((1U<<16)-1) << PERI_BDMA_BDMA_CNDTR5_BIT_NDT_SHIFT)

/*--- register BDMA_CPAR5 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CPAR5_BIT_PA_SHIFT                           (0U)
#define PERI_BDMA_BDMA_CPAR5_BIT_PA_MASK                            (((1U<<32)-1) << PERI_BDMA_BDMA_CPAR5_BIT_PA_SHIFT)

/*--- register BDMA_CM0AR5 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM0AR5_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM0AR5_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM0AR5_BIT_MA_SHIFT)

/*--- register BDMA_CM1AR5 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM1AR5_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM1AR5_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM1AR5_BIT_MA_SHIFT)

/*--- register BDMA_CCR6 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CCR6_BIT_EN_SHIFT                            (0U)
#define PERI_BDMA_BDMA_CCR6_BIT_EN_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_EN_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_TCIE_SHIFT                          (1U)
#define PERI_BDMA_BDMA_CCR6_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_TCIE_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_HTIE_SHIFT                          (2U)
#define PERI_BDMA_BDMA_CCR6_BIT_HTIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_HTIE_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_TEIE_SHIFT                          (3U)
#define PERI_BDMA_BDMA_CCR6_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_TEIE_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_DIR_SHIFT                           (4U)
#define PERI_BDMA_BDMA_CCR6_BIT_DIR_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_DIR_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_CIRC_SHIFT                          (5U)
#define PERI_BDMA_BDMA_CCR6_BIT_CIRC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_CIRC_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_PINC_SHIFT                          (6U)
#define PERI_BDMA_BDMA_CCR6_BIT_PINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_PINC_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_MINC_SHIFT                          (7U)
#define PERI_BDMA_BDMA_CCR6_BIT_MINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_MINC_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_PSIZE_SHIFT                         (8U)
#define PERI_BDMA_BDMA_CCR6_BIT_PSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR6_BIT_PSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_MSIZE_SHIFT                         (10U)
#define PERI_BDMA_BDMA_CCR6_BIT_MSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR6_BIT_MSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_PL_SHIFT                            (12U)
#define PERI_BDMA_BDMA_CCR6_BIT_PL_MASK                             (((1U<<2)-1) << PERI_BDMA_BDMA_CCR6_BIT_PL_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_MEM2MEM_SHIFT                       (14U)
#define PERI_BDMA_BDMA_CCR6_BIT_MEM2MEM_MASK                        (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_MEM2MEM_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_DBM_SHIFT                           (15U)
#define PERI_BDMA_BDMA_CCR6_BIT_DBM_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_DBM_SHIFT)
#define PERI_BDMA_BDMA_CCR6_BIT_CT_SHIFT                            (16U)
#define PERI_BDMA_BDMA_CCR6_BIT_CT_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR6_BIT_CT_SHIFT)

/*--- register BDMA_CNDTR6 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CNDTR6_BIT_NDT_SHIFT                         (0U)
#define PERI_BDMA_BDMA_CNDTR6_BIT_NDT_MASK                          (((1U<<16)-1) << PERI_BDMA_BDMA_CNDTR6_BIT_NDT_SHIFT)

/*--- register BDMA_CPAR6 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CPAR6_BIT_PA_SHIFT                           (0U)
#define PERI_BDMA_BDMA_CPAR6_BIT_PA_MASK                            (((1U<<32)-1) << PERI_BDMA_BDMA_CPAR6_BIT_PA_SHIFT)

/*--- register BDMA_CM0AR6 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM0AR6_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM0AR6_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM0AR6_BIT_MA_SHIFT)

/*--- register BDMA_CM1AR6 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM1AR6_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM1AR6_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM1AR6_BIT_MA_SHIFT)

/*--- register BDMA_CCR7 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CCR7_BIT_EN_SHIFT                            (0U)
#define PERI_BDMA_BDMA_CCR7_BIT_EN_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_EN_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_TCIE_SHIFT                          (1U)
#define PERI_BDMA_BDMA_CCR7_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_TCIE_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_HTIE_SHIFT                          (2U)
#define PERI_BDMA_BDMA_CCR7_BIT_HTIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_HTIE_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_TEIE_SHIFT                          (3U)
#define PERI_BDMA_BDMA_CCR7_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_TEIE_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_DIR_SHIFT                           (4U)
#define PERI_BDMA_BDMA_CCR7_BIT_DIR_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_DIR_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_CIRC_SHIFT                          (5U)
#define PERI_BDMA_BDMA_CCR7_BIT_CIRC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_CIRC_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_PINC_SHIFT                          (6U)
#define PERI_BDMA_BDMA_CCR7_BIT_PINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_PINC_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_MINC_SHIFT                          (7U)
#define PERI_BDMA_BDMA_CCR7_BIT_MINC_MASK                           (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_MINC_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_PSIZE_SHIFT                         (8U)
#define PERI_BDMA_BDMA_CCR7_BIT_PSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR7_BIT_PSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_MSIZE_SHIFT                         (10U)
#define PERI_BDMA_BDMA_CCR7_BIT_MSIZE_MASK                          (((1U<<2)-1) << PERI_BDMA_BDMA_CCR7_BIT_MSIZE_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_PL_SHIFT                            (12U)
#define PERI_BDMA_BDMA_CCR7_BIT_PL_MASK                             (((1U<<2)-1) << PERI_BDMA_BDMA_CCR7_BIT_PL_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_MEM2MEM_SHIFT                       (14U)
#define PERI_BDMA_BDMA_CCR7_BIT_MEM2MEM_MASK                        (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_MEM2MEM_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_DBM_SHIFT                           (15U)
#define PERI_BDMA_BDMA_CCR7_BIT_DBM_MASK                            (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_DBM_SHIFT)
#define PERI_BDMA_BDMA_CCR7_BIT_CT_SHIFT                            (16U)
#define PERI_BDMA_BDMA_CCR7_BIT_CT_MASK                             (((1U<<1)-1) << PERI_BDMA_BDMA_CCR7_BIT_CT_SHIFT)

/*--- register BDMA_CNDTR7 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CNDTR7_BIT_NDT_SHIFT                         (0U)
#define PERI_BDMA_BDMA_CNDTR7_BIT_NDT_MASK                          (((1U<<16)-1) << PERI_BDMA_BDMA_CNDTR7_BIT_NDT_SHIFT)

/*--- register BDMA_CPAR7 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CPAR7_BIT_PA_SHIFT                           (0U)
#define PERI_BDMA_BDMA_CPAR7_BIT_PA_MASK                            (((1U<<32)-1) << PERI_BDMA_BDMA_CPAR7_BIT_PA_SHIFT)

/*--- register BDMA_CM0AR7 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM0AR7_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM0AR7_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM0AR7_BIT_MA_SHIFT)

