minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register BDMA_CM1AR7 -------------------------------------------------*/
#define PERI_BDMA_BDMA_CM1AR7_BIT_MA_SHIFT                          (0U)
#define PERI_BDMA_BDMA_CM1AR7_BIT_MA_MASK                           (((1U<<32)-1) << PERI_BDMA_BDMA_CM1AR7_BIT_MA_SHIFT)

/*--- register CREL -------------------------------------------------*/
#define PERI_CAN_CCU_CREL_BIT_DAY_SHIFT                             (0U)
#define PERI_CAN_CCU_CREL_BIT_DAY_MASK                              (((1U<<8)-1) << PERI_CAN_CCU_CREL_BIT_DAY_SHIFT)
#define PERI_CAN_CCU_CREL_BIT_MON_SHIFT                             (8U)
#define PERI_CAN_CCU_CREL_BIT_MON_MASK                              (((1U<<8)-1) << PERI_CAN_CCU_CREL_BIT_MON_SHIFT)
#define PERI_CAN_CCU_CREL_BIT_YEAR_SHIFT                            (16U)
#define PERI_CAN_CCU_CREL_BIT_YEAR_MASK                             (((1U<<4)-1) << PERI_CAN_CCU_CREL_BIT_YEAR_SHIFT)
#define PERI_CAN_CCU_CREL_BIT_SUBSTEP_SHIFT                         (20U)
#define PERI_CAN_CCU_CREL_BIT_SUBSTEP_MASK                          (((1U<<4)-1) << PERI_CAN_CCU_CREL_BIT_SUBSTEP_SHIFT)
#define PERI_CAN_CCU_CREL_BIT_STEP_SHIFT                            (24U)
#define PERI_CAN_CCU_CREL_BIT_STEP_MASK                             (((1U<<4)-1) << PERI_CAN_CCU_CREL_BIT_STEP_SHIFT)
#define PERI_CAN_CCU_CREL_BIT_REL_SHIFT                             (28U)
#define PERI_CAN_CCU_CREL_BIT_REL_MASK                              (((1U<<4)-1) << PERI_CAN_CCU_CREL_BIT_REL_SHIFT)

/*--- register CCFG -------------------------------------------------*/
#define PERI_CAN_CCU_CCFG_BIT_TQBT_SHIFT                            (0U)
#define PERI_CAN_CCU_CCFG_BIT_TQBT_MASK                             (((1U<<5)-1) << PERI_CAN_CCU_CCFG_BIT_TQBT_SHIFT)
#define PERI_CAN_CCU_CCFG_BIT_BCC_SHIFT                             (6U)
#define PERI_CAN_CCU_CCFG_BIT_BCC_MASK                              (((1U<<1)-1) << PERI_CAN_CCU_CCFG_BIT_BCC_SHIFT)
#define PERI_CAN_CCU_CCFG_BIT_CFL_SHIFT                             (7U)
#define PERI_CAN_CCU_CCFG_BIT_CFL_MASK                              (((1U<<1)-1) << PERI_CAN_CCU_CCFG_BIT_CFL_SHIFT)
#define PERI_CAN_CCU_CCFG_BIT_OCPM_SHIFT                            (8U)
#define PERI_CAN_CCU_CCFG_BIT_OCPM_MASK                             (((1U<<8)-1) << PERI_CAN_CCU_CCFG_BIT_OCPM_SHIFT)
#define PERI_CAN_CCU_CCFG_BIT_CDIV_SHIFT                            (16U)
#define PERI_CAN_CCU_CCFG_BIT_CDIV_MASK                             (((1U<<4)-1) << PERI_CAN_CCU_CCFG_BIT_CDIV_SHIFT)
#define PERI_CAN_CCU_CCFG_BIT_SWR_SHIFT                             (31U)
#define PERI_CAN_CCU_CCFG_BIT_SWR_MASK                              (((1U<<1)-1) << PERI_CAN_CCU_CCFG_BIT_SWR_SHIFT)

/*--- register CSTAT -------------------------------------------------*/
#define PERI_CAN_CCU_CSTAT_BIT_OCPC_SHIFT                           (0U)
#define PERI_CAN_CCU_CSTAT_BIT_OCPC_MASK                            (((1U<<18)-1) << PERI_CAN_CCU_CSTAT_BIT_OCPC_SHIFT)
#define PERI_CAN_CCU_CSTAT_BIT_TQC_SHIFT                            (18U)
#define PERI_CAN_CCU_CSTAT_BIT_TQC_MASK                             (((1U<<11)-1) << PERI_CAN_CCU_CSTAT_BIT_TQC_SHIFT)
#define PERI_CAN_CCU_CSTAT_BIT_CALS_SHIFT                           (30U)
#define PERI_CAN_CCU_CSTAT_BIT_CALS_MASK                            (((1U<<2)-1) << PERI_CAN_CCU_CSTAT_BIT_CALS_SHIFT)

/*--- register CWD -------------------------------------------------*/
#define PERI_CAN_CCU_CWD_BIT_WDC_SHIFT                              (0U)
#define PERI_CAN_CCU_CWD_BIT_WDC_MASK                               (((1U<<16)-1) << PERI_CAN_CCU_CWD_BIT_WDC_SHIFT)
#define PERI_CAN_CCU_CWD_BIT_WDV_SHIFT                              (16U)
#define PERI_CAN_CCU_CWD_BIT_WDV_MASK                               (((1U<<16)-1) << PERI_CAN_CCU_CWD_BIT_WDV_SHIFT)

/*--- register IR -------------------------------------------------*/
#define PERI_CAN_CCU_IR_BIT_CWE_SHIFT                               (0U)
#define PERI_CAN_CCU_IR_BIT_CWE_MASK                                (((1U<<1)-1) << PERI_CAN_CCU_IR_BIT_CWE_SHIFT)
#define PERI_CAN_CCU_IR_BIT_CSC_SHIFT                               (1U)
#define PERI_CAN_CCU_IR_BIT_CSC_MASK                                (((1U<<1)-1) << PERI_CAN_CCU_IR_BIT_CSC_SHIFT)

/*--- register IE -------------------------------------------------*/
#define PERI_CAN_CCU_IE_BIT_CWEE_SHIFT                              (0U)
#define PERI_CAN_CCU_IE_BIT_CWEE_MASK                               (((1U<<1)-1) << PERI_CAN_CCU_IE_BIT_CWEE_SHIFT)
#define PERI_CAN_CCU_IE_BIT_CSCE_SHIFT                              (1U)
#define PERI_CAN_CCU_IE_BIT_CSCE_MASK                               (((1U<<1)-1) << PERI_CAN_CCU_IE_BIT_CSCE_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_CEC_CR_BIT_CECEN_SHIFT                                 (0U)
#define PERI_CEC_CR_BIT_CECEN_MASK                                  (((1U<<1)-1) << PERI_CEC_CR_BIT_CECEN_SHIFT)
#define PERI_CEC_CR_BIT_TXSOM_SHIFT                                 (1U)
#define PERI_CEC_CR_BIT_TXSOM_MASK                                  (((1U<<1)-1) << PERI_CEC_CR_BIT_TXSOM_SHIFT)
#define PERI_CEC_CR_BIT_TXEOM_SHIFT                                 (2U)
#define PERI_CEC_CR_BIT_TXEOM_MASK                                  (((1U<<1)-1) << PERI_CEC_CR_BIT_TXEOM_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_CEC_CFGR_BIT_SFT_SHIFT                                 (0U)
#define PERI_CEC_CFGR_BIT_SFT_MASK                                  (((1U<<3)-1) << PERI_CEC_CFGR_BIT_SFT_SHIFT)
#define PERI_CEC_CFGR_BIT_RXTOL_SHIFT                               (3U)
#define PERI_CEC_CFGR_BIT_RXTOL_MASK                                (((1U<<1)-1) << PERI_CEC_CFGR_BIT_RXTOL_SHIFT)
#define PERI_CEC_CFGR_BIT_BRESTP_SHIFT                              (4U)
#define PERI_CEC_CFGR_BIT_BRESTP_MASK                               (((1U<<1)-1) << PERI_CEC_CFGR_BIT_BRESTP_SHIFT)
#define PERI_CEC_CFGR_BIT_BREGEN_SHIFT                              (5U)
#define PERI_CEC_CFGR_BIT_BREGEN_MASK                               (((1U<<1)-1) << PERI_CEC_CFGR_BIT_BREGEN_SHIFT)
#define PERI_CEC_CFGR_BIT_LBPEGEN_SHIFT                             (6U)
#define PERI_CEC_CFGR_BIT_LBPEGEN_MASK                              (((1U<<1)-1) << PERI_CEC_CFGR_BIT_LBPEGEN_SHIFT)
#define PERI_CEC_CFGR_BIT_BRDNOGEN_SHIFT                            (7U)
#define PERI_CEC_CFGR_BIT_BRDNOGEN_MASK                             (((1U<<1)-1) << PERI_CEC_CFGR_BIT_BRDNOGEN_SHIFT)
#define PERI_CEC_CFGR_BIT_SFTOPT_SHIFT                              (8U)
#define PERI_CEC_CFGR_BIT_SFTOPT_MASK                               (((1U<<1)-1) << PERI_CEC_CFGR_BIT_SFTOPT_SHIFT)
#define PERI_CEC_CFGR_BIT_OAR_SHIFT                                 (16U)
#define PERI_CEC_CFGR_BIT_OAR_MASK                                  (((1U<<15)-1) << PERI_CEC_CFGR_BIT_OAR_SHIFT)
#define PERI_CEC_CFGR_BIT_LSTN_SHIFT                                (31U)
#define PERI_CEC_CFGR_BIT_LSTN_MASK                                 (((1U<<1)-1) << PERI_CEC_CFGR_BIT_LSTN_SHIFT)

/*--- register TXDR -------------------------------------------------*/
#define PERI_CEC_TXDR_BIT_TXD_SHIFT                                 (0U)
#define PERI_CEC_TXDR_BIT_TXD_MASK                                  (((1U<<8)-1) << PERI_CEC_TXDR_BIT_TXD_SHIFT)

/*--- register RXDR -------------------------------------------------*/
#define PERI_CEC_RXDR_BIT_RXD_SHIFT                                 (0U)
#define PERI_CEC_RXDR_BIT_RXD_MASK                                  (((1U<<8)-1) << PERI_CEC_RXDR_BIT_RXD_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_CEC_ISR_BIT_RXBR_SHIFT                                 (0U)
#define PERI_CEC_ISR_BIT_RXBR_MASK                                  (((1U<<1)-1) << PERI_CEC_ISR_BIT_RXBR_SHIFT)
#define PERI_CEC_ISR_BIT_RXEND_SHIFT                                (1U)
#define PERI_CEC_ISR_BIT_RXEND_MASK                                 (((1U<<1)-1) << PERI_CEC_ISR_BIT_RXEND_SHIFT)
#define PERI_CEC_ISR_BIT_RXOVR_SHIFT                                (2U)
#define PERI_CEC_ISR_BIT_RXOVR_MASK                                 (((1U<<1)-1) << PERI_CEC_ISR_BIT_RXOVR_SHIFT)
#define PERI_CEC_ISR_BIT_BRE_SHIFT                                  (3U)
#define PERI_CEC_ISR_BIT_BRE_MASK                                   (((1U<<1)-1) << PERI_CEC_ISR_BIT_BRE_SHIFT)
#define PERI_CEC_ISR_BIT_SBPE_SHIFT                                 (4U)
#define PERI_CEC_ISR_BIT_SBPE_MASK                                  (((1U<<1)-1) << PERI_CEC_ISR_BIT_SBPE_SHIFT)
#define PERI_CEC_ISR_BIT_LBPE_SHIFT                                 (5U)
#define PERI_CEC_ISR_BIT_LBPE_MASK                                  (((1U<<1)-1) << PERI_CEC_ISR_BIT_LBPE_SHIFT)
#define PERI_CEC_ISR_BIT_RXACKE_SHIFT                               (6U)
#define PERI_CEC_ISR_BIT_RXACKE_MASK                                (((1U<<1)-1) << PERI_CEC_ISR_BIT_RXACKE_SHIFT)
#define PERI_CEC_ISR_BIT_ARBLST_SHIFT                               (7U)
#define PERI_CEC_ISR_BIT_ARBLST_MASK                                (((1U<<1)-1) << PERI_CEC_ISR_BIT_ARBLST_SHIFT)
#define PERI_CEC_ISR_BIT_TXBR_SHIFT                                 (8U)
#define PERI_CEC_ISR_BIT_TXBR_MASK                                  (((1U<<1)-1) << PERI_CEC_ISR_BIT_TXBR_SHIFT)
#define PERI_CEC_ISR_BIT_TXEND_SHIFT                                (9U)
#define PERI_CEC_ISR_BIT_TXEND_MASK                                 (((1U<<1)-1) << PERI_CEC_ISR_BIT_TXEND_SHIFT)
#define PERI_CEC_ISR_BIT_TXUDR_SHIFT                                (10U)
#define PERI_CEC_ISR_BIT_TXUDR_MASK                                 (((1U<<1)-1) << PERI_CEC_ISR_BIT_TXUDR_SHIFT)
#define PERI_CEC_ISR_BIT_TXERR_SHIFT                                (11U)
#define PERI_CEC_ISR_BIT_TXERR_MASK                                 (((1U<<1)-1) << PERI_CEC_ISR_BIT_TXERR_SHIFT)
#define PERI_CEC_ISR_BIT_TXACKE_SHIFT                               (12U)
#define PERI_CEC_ISR_BIT_TXACKE_MASK                                (((1U<<1)-1) << PERI_CEC_ISR_BIT_TXACKE_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_CEC_IER_BIT_RXBRIE_SHIFT                               (0U)
#define PERI_CEC_IER_BIT_RXBRIE_MASK                                (((1U<<1)-1) << PERI_CEC_IER_BIT_RXBRIE_SHIFT)
#define PERI_CEC_IER_BIT_RXENDIE_SHIFT                              (1U)
#define PERI_CEC_IER_BIT_RXENDIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_RXENDIE_SHIFT)
#define PERI_CEC_IER_BIT_RXOVRIE_SHIFT                              (2U)
#define PERI_CEC_IER_BIT_RXOVRIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_RXOVRIE_SHIFT)
#define PERI_CEC_IER_BIT_BREIE_SHIFT                                (3U)
#define PERI_CEC_IER_BIT_BREIE_MASK                                 (((1U<<1)-1) << PERI_CEC_IER_BIT_BREIE_SHIFT)
#define PERI_CEC_IER_BIT_SBPEIE_SHIFT                               (4U)
#define PERI_CEC_IER_BIT_SBPEIE_MASK                                (((1U<<1)-1) << PERI_CEC_IER_BIT_SBPEIE_SHIFT)
#define PERI_CEC_IER_BIT_LBPEIE_SHIFT                               (5U)
#define PERI_CEC_IER_BIT_LBPEIE_MASK                                (((1U<<1)-1) << PERI_CEC_IER_BIT_LBPEIE_SHIFT)
#define PERI_CEC_IER_BIT_RXACKIE_SHIFT                              (6U)
#define PERI_CEC_IER_BIT_RXACKIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_RXACKIE_SHIFT)
#define PERI_CEC_IER_BIT_ARBLSTIE_SHIFT                             (7U)
#define PERI_CEC_IER_BIT_ARBLSTIE_MASK                              (((1U<<1)-1) << PERI_CEC_IER_BIT_ARBLSTIE_SHIFT)
#define PERI_CEC_IER_BIT_TXBRIE_SHIFT                               (8U)
#define PERI_CEC_IER_BIT_TXBRIE_MASK                                (((1U<<1)-1) << PERI_CEC_IER_BIT_TXBRIE_SHIFT)
#define PERI_CEC_IER_BIT_TXENDIE_SHIFT                              (9U)
#define PERI_CEC_IER_BIT_TXENDIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_TXENDIE_SHIFT)
#define PERI_CEC_IER_BIT_TXUDRIE_SHIFT                              (10U)
#define PERI_CEC_IER_BIT_TXUDRIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_TXUDRIE_SHIFT)
#define PERI_CEC_IER_BIT_TXERRIE_SHIFT                              (11U)
#define PERI_CEC_IER_BIT_TXERRIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_TXERRIE_SHIFT)
#define PERI_CEC_IER_BIT_TXACKIE_SHIFT                              (12U)
#define PERI_CEC_IER_BIT_TXACKIE_MASK                               (((1U<<1)-1) << PERI_CEC_IER_BIT_TXACKIE_SHIFT)

