minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_COMP1_SR_BIT_C1VAL_SHIFT                               (0U)
#define PERI_COMP1_SR_BIT_C1VAL_MASK                                (((1U<<1)-1) << PERI_COMP1_SR_BIT_C1VAL_SHIFT)
#define PERI_COMP1_SR_BIT_C2VAL_SHIFT                               (1U)
#define PERI_COMP1_SR_BIT_C2VAL_MASK                                (((1U<<1)-1) << PERI_COMP1_SR_BIT_C2VAL_SHIFT)
#define PERI_COMP1_SR_BIT_C1IF_SHIFT                                (16U)
#define PERI_COMP1_SR_BIT_C1IF_MASK                                 (((1U<<1)-1) << PERI_COMP1_SR_BIT_C1IF_SHIFT)
#define PERI_COMP1_SR_BIT_C2IF_SHIFT                                (17U)
#define PERI_COMP1_SR_BIT_C2IF_MASK                                 (((1U<<1)-1) << PERI_COMP1_SR_BIT_C2IF_SHIFT)

/*--- register ICFR -------------------------------------------------*/
#define PERI_COMP1_ICFR_BIT_CC1IF_SHIFT                             (16U)
#define PERI_COMP1_ICFR_BIT_CC1IF_MASK                              (((1U<<1)-1) << PERI_COMP1_ICFR_BIT_CC1IF_SHIFT)
#define PERI_COMP1_ICFR_BIT_CC2IF_SHIFT                             (17U)
#define PERI_COMP1_ICFR_BIT_CC2IF_MASK                              (((1U<<1)-1) << PERI_COMP1_ICFR_BIT_CC2IF_SHIFT)

/*--- register OR -------------------------------------------------*/
#define PERI_COMP1_OR_BIT_AFOP_SHIFT                                (0U)
#define PERI_COMP1_OR_BIT_AFOP_MASK                                 (((1U<<11)-1) << PERI_COMP1_OR_BIT_AFOP_SHIFT)
#define PERI_COMP1_OR_BIT_OR_SHIFT                                  (11U)
#define PERI_COMP1_OR_BIT_OR_MASK                                   (((1U<<21)-1) << PERI_COMP1_OR_BIT_OR_SHIFT)

/*--- register CFGR1 -------------------------------------------------*/
#define PERI_COMP1_CFGR1_BIT_EN_SHIFT                               (0U)
#define PERI_COMP1_CFGR1_BIT_EN_MASK                                (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_EN_SHIFT)
#define PERI_COMP1_CFGR1_BIT_BRGEN_SHIFT                            (1U)
#define PERI_COMP1_CFGR1_BIT_BRGEN_MASK                             (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_BRGEN_SHIFT)
#define PERI_COMP1_CFGR1_BIT_SCALEN_SHIFT                           (2U)
#define PERI_COMP1_CFGR1_BIT_SCALEN_MASK                            (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_SCALEN_SHIFT)
#define PERI_COMP1_CFGR1_BIT_POLARITY_SHIFT                         (3U)
#define PERI_COMP1_CFGR1_BIT_POLARITY_MASK                          (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_POLARITY_SHIFT)
#define PERI_COMP1_CFGR1_BIT_ITEN_SHIFT                             (6U)
#define PERI_COMP1_CFGR1_BIT_ITEN_MASK                              (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_ITEN_SHIFT)
#define PERI_COMP1_CFGR1_BIT_HYST_SHIFT                             (8U)
#define PERI_COMP1_CFGR1_BIT_HYST_MASK                              (((1U<<2)-1) << PERI_COMP1_CFGR1_BIT_HYST_SHIFT)
#define PERI_COMP1_CFGR1_BIT_PWRMODE_SHIFT                          (12U)
#define PERI_COMP1_CFGR1_BIT_PWRMODE_MASK                           (((1U<<2)-1) << PERI_COMP1_CFGR1_BIT_PWRMODE_SHIFT)
#define PERI_COMP1_CFGR1_BIT_INMSEL_SHIFT                           (16U)
#define PERI_COMP1_CFGR1_BIT_INMSEL_MASK                            (((1U<<3)-1) << PERI_COMP1_CFGR1_BIT_INMSEL_SHIFT)
#define PERI_COMP1_CFGR1_BIT_INPSEL_SHIFT                           (20U)
#define PERI_COMP1_CFGR1_BIT_INPSEL_MASK                            (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_INPSEL_SHIFT)
#define PERI_COMP1_CFGR1_BIT_BLANKING_SHIFT                         (24U)
#define PERI_COMP1_CFGR1_BIT_BLANKING_MASK                          (((1U<<4)-1) << PERI_COMP1_CFGR1_BIT_BLANKING_SHIFT)
#define PERI_COMP1_CFGR1_BIT_LOCK_SHIFT                             (31U)
#define PERI_COMP1_CFGR1_BIT_LOCK_MASK                              (((1U<<1)-1) << PERI_COMP1_CFGR1_BIT_LOCK_SHIFT)

/*--- register CFGR2 -------------------------------------------------*/
#define PERI_COMP1_CFGR2_BIT_EN_SHIFT                               (0U)
#define PERI_COMP1_CFGR2_BIT_EN_MASK                                (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_EN_SHIFT)
#define PERI_COMP1_CFGR2_BIT_BRGEN_SHIFT                            (1U)
#define PERI_COMP1_CFGR2_BIT_BRGEN_MASK                             (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_BRGEN_SHIFT)
#define PERI_COMP1_CFGR2_BIT_SCALEN_SHIFT                           (2U)
#define PERI_COMP1_CFGR2_BIT_SCALEN_MASK                            (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_SCALEN_SHIFT)
#define PERI_COMP1_CFGR2_BIT_POLARITY_SHIFT                         (3U)
#define PERI_COMP1_CFGR2_BIT_POLARITY_MASK                          (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_POLARITY_SHIFT)
#define PERI_COMP1_CFGR2_BIT_WINMODE_SHIFT                          (4U)
#define PERI_COMP1_CFGR2_BIT_WINMODE_MASK                           (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_WINMODE_SHIFT)
#define PERI_COMP1_CFGR2_BIT_ITEN_SHIFT                             (6U)
#define PERI_COMP1_CFGR2_BIT_ITEN_MASK                              (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_ITEN_SHIFT)
#define PERI_COMP1_CFGR2_BIT_HYST_SHIFT                             (8U)
#define PERI_COMP1_CFGR2_BIT_HYST_MASK                              (((1U<<2)-1) << PERI_COMP1_CFGR2_BIT_HYST_SHIFT)
#define PERI_COMP1_CFGR2_BIT_PWRMODE_SHIFT                          (12U)
#define PERI_COMP1_CFGR2_BIT_PWRMODE_MASK                           (((1U<<2)-1) << PERI_COMP1_CFGR2_BIT_PWRMODE_SHIFT)
#define PERI_COMP1_CFGR2_BIT_INMSEL_SHIFT                           (16U)
#define PERI_COMP1_CFGR2_BIT_INMSEL_MASK                            (((1U<<3)-1) << PERI_COMP1_CFGR2_BIT_INMSEL_SHIFT)
#define PERI_COMP1_CFGR2_BIT_INPSEL_SHIFT                           (20U)
#define PERI_COMP1_CFGR2_BIT_INPSEL_MASK                            (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_INPSEL_SHIFT)
#define PERI_COMP1_CFGR2_BIT_BLANKING_SHIFT                         (24U)
#define PERI_COMP1_CFGR2_BIT_BLANKING_MASK                          (((1U<<4)-1) << PERI_COMP1_CFGR2_BIT_BLANKING_SHIFT)
#define PERI_COMP1_CFGR2_BIT_LOCK_SHIFT                             (31U)
#define PERI_COMP1_CFGR2_BIT_LOCK_MASK                              (((1U<<1)-1) << PERI_COMP1_CFGR2_BIT_LOCK_SHIFT)

/*--- register DR -------------------------------------------------*/
#define PERI_CRC_DR_BIT_DR_SHIFT                                    (0U)
#define PERI_CRC_DR_BIT_DR_MASK                                     (((1U<<32)-1) << PERI_CRC_DR_BIT_DR_SHIFT)

