minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register IDR -------------------------------------------------*/
#define PERI_CRC_IDR_BIT_IDR_SHIFT                                  (0U)
#define PERI_CRC_IDR_BIT_IDR_MASK                                   (((1U<<32)-1) << PERI_CRC_IDR_BIT_IDR_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_CRC_CR_BIT_RESET_SHIFT                                 (0U)
#define PERI_CRC_CR_BIT_RESET_MASK                                  (((1U<<1)-1) << PERI_CRC_CR_BIT_RESET_SHIFT)
#define PERI_CRC_CR_BIT_POLYSIZE_SHIFT                              (3U)
#define PERI_CRC_CR_BIT_POLYSIZE_MASK                               (((1U<<2)-1) << PERI_CRC_CR_BIT_POLYSIZE_SHIFT)
#define PERI_CRC_CR_BIT_REV_IN_SHIFT                                (5U)
#define PERI_CRC_CR_BIT_REV_IN_MASK                                 (((1U<<2)-1) << PERI_CRC_CR_BIT_REV_IN_SHIFT)
#define PERI_CRC_CR_BIT_REV_OUT_SHIFT                               (7U)
#define PERI_CRC_CR_BIT_REV_OUT_MASK                                (((1U<<1)-1) << PERI_CRC_CR_BIT_REV_OUT_SHIFT)

/*--- register INIT -------------------------------------------------*/
#define PERI_CRC_INIT_BIT_CRC_INIT_SHIFT                            (0U)
#define PERI_CRC_INIT_BIT_CRC_INIT_MASK                             (((1U<<32)-1) << PERI_CRC_INIT_BIT_CRC_INIT_SHIFT)

/*--- register POL -------------------------------------------------*/
#define PERI_CRC_POL_BIT_POL_SHIFT                                  (0U)
#define PERI_CRC_POL_BIT_POL_MASK                                   (((1U<<32)-1) << PERI_CRC_POL_BIT_POL_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_CRS_CR_BIT_SYNCOKIE_SHIFT                              (0U)
#define PERI_CRS_CR_BIT_SYNCOKIE_MASK                               (((1U<<1)-1) << PERI_CRS_CR_BIT_SYNCOKIE_SHIFT)
#define PERI_CRS_CR_BIT_SYNCWARNIE_SHIFT                            (1U)
#define PERI_CRS_CR_BIT_SYNCWARNIE_MASK                             (((1U<<1)-1) << PERI_CRS_CR_BIT_SYNCWARNIE_SHIFT)
#define PERI_CRS_CR_BIT_ERRIE_SHIFT                                 (2U)
#define PERI_CRS_CR_BIT_ERRIE_MASK                                  (((1U<<1)-1) << PERI_CRS_CR_BIT_ERRIE_SHIFT)
#define PERI_CRS_CR_BIT_ESYNCIE_SHIFT                               (3U)
#define PERI_CRS_CR_BIT_ESYNCIE_MASK                                (((1U<<1)-1) << PERI_CRS_CR_BIT_ESYNCIE_SHIFT)
#define PERI_CRS_CR_BIT_CEN_SHIFT                                   (5U)
#define PERI_CRS_CR_BIT_CEN_MASK                                    (((1U<<1)-1) << PERI_CRS_CR_BIT_CEN_SHIFT)
#define PERI_CRS_CR_BIT_AUTOTRIMEN_SHIFT                            (6U)
#define PERI_CRS_CR_BIT_AUTOTRIMEN_MASK                             (((1U<<1)-1) << PERI_CRS_CR_BIT_AUTOTRIMEN_SHIFT)
#define PERI_CRS_CR_BIT_SWSYNC_SHIFT                                (7U)
#define PERI_CRS_CR_BIT_SWSYNC_MASK                                 (((1U<<1)-1) << PERI_CRS_CR_BIT_SWSYNC_SHIFT)
#define PERI_CRS_CR_BIT_TRIM_SHIFT                                  (8U)
#define PERI_CRS_CR_BIT_TRIM_MASK                                   (((1U<<6)-1) << PERI_CRS_CR_BIT_TRIM_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_CRS_CFGR_BIT_RELOAD_SHIFT                              (0U)
#define PERI_CRS_CFGR_BIT_RELOAD_MASK                               (((1U<<16)-1) << PERI_CRS_CFGR_BIT_RELOAD_SHIFT)
#define PERI_CRS_CFGR_BIT_FELIM_SHIFT                               (16U)
#define PERI_CRS_CFGR_BIT_FELIM_MASK                                (((1U<<8)-1) << PERI_CRS_CFGR_BIT_FELIM_SHIFT)
#define PERI_CRS_CFGR_BIT_SYNCDIV_SHIFT                             (24U)
#define PERI_CRS_CFGR_BIT_SYNCDIV_MASK                              (((1U<<3)-1) << PERI_CRS_CFGR_BIT_SYNCDIV_SHIFT)
#define PERI_CRS_CFGR_BIT_SYNCSRC_SHIFT                             (28U)
#define PERI_CRS_CFGR_BIT_SYNCSRC_MASK                              (((1U<<2)-1) << PERI_CRS_CFGR_BIT_SYNCSRC_SHIFT)
#define PERI_CRS_CFGR_BIT_SYNCPOL_SHIFT                             (31U)
#define PERI_CRS_CFGR_BIT_SYNCPOL_MASK                              (((1U<<1)-1) << PERI_CRS_CFGR_BIT_SYNCPOL_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_CRS_ISR_BIT_SYNCOKF_SHIFT                              (0U)
#define PERI_CRS_ISR_BIT_SYNCOKF_MASK                               (((1U<<1)-1) << PERI_CRS_ISR_BIT_SYNCOKF_SHIFT)
#define PERI_CRS_ISR_BIT_SYNCWARNF_SHIFT                            (1U)
#define PERI_CRS_ISR_BIT_SYNCWARNF_MASK                             (((1U<<1)-1) << PERI_CRS_ISR_BIT_SYNCWARNF_SHIFT)
#define PERI_CRS_ISR_BIT_ERRF_SHIFT                                 (2U)
#define PERI_CRS_ISR_BIT_ERRF_MASK                                  (((1U<<1)-1) << PERI_CRS_ISR_BIT_ERRF_SHIFT)
#define PERI_CRS_ISR_BIT_ESYNCF_SHIFT                               (3U)
#define PERI_CRS_ISR_BIT_ESYNCF_MASK                                (((1U<<1)-1) << PERI_CRS_ISR_BIT_ESYNCF_SHIFT)
#define PERI_CRS_ISR_BIT_SYNCERR_SHIFT                              (8U)
#define PERI_CRS_ISR_BIT_SYNCERR_MASK                               (((1U<<1)-1) << PERI_CRS_ISR_BIT_SYNCERR_SHIFT)
#define PERI_CRS_ISR_BIT_SYNCMISS_SHIFT                             (9U)
#define PERI_CRS_ISR_BIT_SYNCMISS_MASK                              (((1U<<1)-1) << PERI_CRS_ISR_BIT_SYNCMISS_SHIFT)
#define PERI_CRS_ISR_BIT_TRIMOVF_SHIFT                              (10U)
#define PERI_CRS_ISR_BIT_TRIMOVF_MASK                               (((1U<<1)-1) << PERI_CRS_ISR_BIT_TRIMOVF_SHIFT)
#define PERI_CRS_ISR_BIT_FEDIR_SHIFT                                (15U)
#define PERI_CRS_ISR_BIT_FEDIR_MASK                                 (((1U<<1)-1) << PERI_CRS_ISR_BIT_FEDIR_SHIFT)
#define PERI_CRS_ISR_BIT_FECAP_SHIFT                                (16U)
#define PERI_CRS_ISR_BIT_FECAP_MASK                                 (((1U<<16)-1) << PERI_CRS_ISR_BIT_FECAP_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_CRS_ICR_BIT_SYNCOKC_SHIFT                              (0U)
#define PERI_CRS_ICR_BIT_SYNCOKC_MASK                               (((1U<<1)-1) << PERI_CRS_ICR_BIT_SYNCOKC_SHIFT)
#define PERI_CRS_ICR_BIT_SYNCWARNC_SHIFT                            (1U)
#define PERI_CRS_ICR_BIT_SYNCWARNC_MASK                             (((1U<<1)-1) << PERI_CRS_ICR_BIT_SYNCWARNC_SHIFT)
#define PERI_CRS_ICR_BIT_ERRC_SHIFT                                 (2U)
#define PERI_CRS_ICR_BIT_ERRC_MASK                                  (((1U<<1)-1) << PERI_CRS_ICR_BIT_ERRC_SHIFT)
#define PERI_CRS_ICR_BIT_ESYNCC_SHIFT                               (3U)
#define PERI_CRS_ICR_BIT_ESYNCC_MASK                                (((1U<<1)-1) << PERI_CRS_ICR_BIT_ESYNCC_SHIFT)

