minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_DAC_CR_BIT_EN1_SHIFT                                   (0U)
#define PERI_DAC_CR_BIT_EN1_MASK                                    (((1U<<1)-1) << PERI_DAC_CR_BIT_EN1_SHIFT)
#define PERI_DAC_CR_BIT_TEN1_SHIFT                                  (1U)
#define PERI_DAC_CR_BIT_TEN1_MASK                                   (((1U<<1)-1) << PERI_DAC_CR_BIT_TEN1_SHIFT)
#define PERI_DAC_CR_BIT_TSEL1_SHIFT                                 (2U)
#define PERI_DAC_CR_BIT_TSEL1_MASK                                  (((1U<<3)-1) << PERI_DAC_CR_BIT_TSEL1_SHIFT)
#define PERI_DAC_CR_BIT_WAVE1_SHIFT                                 (6U)
#define PERI_DAC_CR_BIT_WAVE1_MASK                                  (((1U<<2)-1) << PERI_DAC_CR_BIT_WAVE1_SHIFT)
#define PERI_DAC_CR_BIT_MAMP1_SHIFT                                 (8U)
#define PERI_DAC_CR_BIT_MAMP1_MASK                                  (((1U<<4)-1) << PERI_DAC_CR_BIT_MAMP1_SHIFT)
#define PERI_DAC_CR_BIT_DMAEN1_SHIFT                                (12U)
#define PERI_DAC_CR_BIT_DMAEN1_MASK                                 (((1U<<1)-1) << PERI_DAC_CR_BIT_DMAEN1_SHIFT)
#define PERI_DAC_CR_BIT_DMAUDRIE1_SHIFT                             (13U)
#define PERI_DAC_CR_BIT_DMAUDRIE1_MASK                              (((1U<<1)-1) << PERI_DAC_CR_BIT_DMAUDRIE1_SHIFT)
#define PERI_DAC_CR_BIT_CEN1_SHIFT                                  (14U)
#define PERI_DAC_CR_BIT_CEN1_MASK                                   (((1U<<1)-1) << PERI_DAC_CR_BIT_CEN1_SHIFT)
#define PERI_DAC_CR_BIT_EN2_SHIFT                                   (16U)
#define PERI_DAC_CR_BIT_EN2_MASK                                    (((1U<<1)-1) << PERI_DAC_CR_BIT_EN2_SHIFT)
#define PERI_DAC_CR_BIT_TEN2_SHIFT                                  (17U)
#define PERI_DAC_CR_BIT_TEN2_MASK                                   (((1U<<1)-1) << PERI_DAC_CR_BIT_TEN2_SHIFT)
#define PERI_DAC_CR_BIT_TSEL2_SHIFT                                 (18U)
#define PERI_DAC_CR_BIT_TSEL2_MASK                                  (((1U<<3)-1) << PERI_DAC_CR_BIT_TSEL2_SHIFT)
#define PERI_DAC_CR_BIT_WAVE2_SHIFT                                 (22U)
#define PERI_DAC_CR_BIT_WAVE2_MASK                                  (((1U<<2)-1) << PERI_DAC_CR_BIT_WAVE2_SHIFT)
#define PERI_DAC_CR_BIT_MAMP2_SHIFT                                 (24U)
#define PERI_DAC_CR_BIT_MAMP2_MASK                                  (((1U<<4)-1) << PERI_DAC_CR_BIT_MAMP2_SHIFT)
#define PERI_DAC_CR_BIT_DMAEN2_SHIFT                                (28U)
#define PERI_DAC_CR_BIT_DMAEN2_MASK                                 (((1U<<1)-1) << PERI_DAC_CR_BIT_DMAEN2_SHIFT)
#define PERI_DAC_CR_BIT_DMAUDRIE2_SHIFT                             (29U)
#define PERI_DAC_CR_BIT_DMAUDRIE2_MASK                              (((1U<<1)-1) << PERI_DAC_CR_BIT_DMAUDRIE2_SHIFT)
#define PERI_DAC_CR_BIT_CEN2_SHIFT                                  (30U)
#define PERI_DAC_CR_BIT_CEN2_MASK                                   (((1U<<1)-1) << PERI_DAC_CR_BIT_CEN2_SHIFT)

/*--- register SWTRGR -------------------------------------------------*/
#define PERI_DAC_SWTRGR_BIT_SWTRIG1_SHIFT                           (0U)
#define PERI_DAC_SWTRGR_BIT_SWTRIG1_MASK                            (((1U<<1)-1) << PERI_DAC_SWTRGR_BIT_SWTRIG1_SHIFT)
#define PERI_DAC_SWTRGR_BIT_SWTRIG2_SHIFT                           (1U)
#define PERI_DAC_SWTRGR_BIT_SWTRIG2_MASK                            (((1U<<1)-1) << PERI_DAC_SWTRGR_BIT_SWTRIG2_SHIFT)

/*--- register DHR12R1 -------------------------------------------------*/
#define PERI_DAC_DHR12R1_BIT_DACC1DHR_SHIFT                         (0U)
#define PERI_DAC_DHR12R1_BIT_DACC1DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12R1_BIT_DACC1DHR_SHIFT)

/*--- register DHR12L1 -------------------------------------------------*/
#define PERI_DAC_DHR12L1_BIT_DACC1DHR_SHIFT                         (4U)
#define PERI_DAC_DHR12L1_BIT_DACC1DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12L1_BIT_DACC1DHR_SHIFT)

/*--- register DHR8R1 -------------------------------------------------*/
#define PERI_DAC_DHR8R1_BIT_DACC1DHR_SHIFT                          (0U)
#define PERI_DAC_DHR8R1_BIT_DACC1DHR_MASK                           (((1U<<8)-1) << PERI_DAC_DHR8R1_BIT_DACC1DHR_SHIFT)

/*--- register DHR12R2 -------------------------------------------------*/
#define PERI_DAC_DHR12R2_BIT_DACC2DHR_SHIFT                         (0U)
#define PERI_DAC_DHR12R2_BIT_DACC2DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12R2_BIT_DACC2DHR_SHIFT)

/*--- register DHR12L2 -------------------------------------------------*/
#define PERI_DAC_DHR12L2_BIT_DACC2DHR_SHIFT                         (4U)
#define PERI_DAC_DHR12L2_BIT_DACC2DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12L2_BIT_DACC2DHR_SHIFT)

/*--- register DHR8R2 -------------------------------------------------*/
#define PERI_DAC_DHR8R2_BIT_DACC2DHR_SHIFT                          (0U)
#define PERI_DAC_DHR8R2_BIT_DACC2DHR_MASK                           (((1U<<8)-1) << PERI_DAC_DHR8R2_BIT_DACC2DHR_SHIFT)

/*--- register DHR12RD -------------------------------------------------*/
#define PERI_DAC_DHR12RD_BIT_DACC1DHR_SHIFT                         (0U)
#define PERI_DAC_DHR12RD_BIT_DACC1DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12RD_BIT_DACC1DHR_SHIFT)
#define PERI_DAC_DHR12RD_BIT_DACC2DHR_SHIFT                         (16U)
#define PERI_DAC_DHR12RD_BIT_DACC2DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12RD_BIT_DACC2DHR_SHIFT)

/*--- register DHR12LD -------------------------------------------------*/
#define PERI_DAC_DHR12LD_BIT_DACC1DHR_SHIFT                         (4U)
#define PERI_DAC_DHR12LD_BIT_DACC1DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12LD_BIT_DACC1DHR_SHIFT)
#define PERI_DAC_DHR12LD_BIT_DACC2DHR_SHIFT                         (20U)
#define PERI_DAC_DHR12LD_BIT_DACC2DHR_MASK                          (((1U<<12)-1) << PERI_DAC_DHR12LD_BIT_DACC2DHR_SHIFT)

/*--- register DHR8RD -------------------------------------------------*/
#define PERI_DAC_DHR8RD_BIT_DACC1DHR_SHIFT                          (0U)
#define PERI_DAC_DHR8RD_BIT_DACC1DHR_MASK                           (((1U<<8)-1) << PERI_DAC_DHR8RD_BIT_DACC1DHR_SHIFT)
#define PERI_DAC_DHR8RD_BIT_DACC2DHR_SHIFT                          (8U)
#define PERI_DAC_DHR8RD_BIT_DACC2DHR_MASK                           (((1U<<8)-1) << PERI_DAC_DHR8RD_BIT_DACC2DHR_SHIFT)

