minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DOR1 -------------------------------------------------*/
#define PERI_DAC_DOR1_BIT_DACC1DOR_SHIFT                            (0U)
#define PERI_DAC_DOR1_BIT_DACC1DOR_MASK                             (((1U<<12)-1) << PERI_DAC_DOR1_BIT_DACC1DOR_SHIFT)

/*--- register DOR2 -------------------------------------------------*/
#define PERI_DAC_DOR2_BIT_DACC2DOR_SHIFT                            (0U)
#define PERI_DAC_DOR2_BIT_DACC2DOR_MASK                             (((1U<<12)-1) << PERI_DAC_DOR2_BIT_DACC2DOR_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_DAC_SR_BIT_DMAUDR1_SHIFT                               (13U)
#define PERI_DAC_SR_BIT_DMAUDR1_MASK                                (((1U<<1)-1) << PERI_DAC_SR_BIT_DMAUDR1_SHIFT)
#define PERI_DAC_SR_BIT_CAL_FLAG1_SHIFT                             (14U)
#define PERI_DAC_SR_BIT_CAL_FLAG1_MASK                              (((1U<<1)-1) << PERI_DAC_SR_BIT_CAL_FLAG1_SHIFT)
#define PERI_DAC_SR_BIT_BWST1_SHIFT                                 (15U)
#define PERI_DAC_SR_BIT_BWST1_MASK                                  (((1U<<1)-1) << PERI_DAC_SR_BIT_BWST1_SHIFT)
#define PERI_DAC_SR_BIT_DMAUDR2_SHIFT                               (29U)
#define PERI_DAC_SR_BIT_DMAUDR2_MASK                                (((1U<<1)-1) << PERI_DAC_SR_BIT_DMAUDR2_SHIFT)
#define PERI_DAC_SR_BIT_CAL_FLAG2_SHIFT                             (30U)
#define PERI_DAC_SR_BIT_CAL_FLAG2_MASK                              (((1U<<1)-1) << PERI_DAC_SR_BIT_CAL_FLAG2_SHIFT)
#define PERI_DAC_SR_BIT_BWST2_SHIFT                                 (31U)
#define PERI_DAC_SR_BIT_BWST2_MASK                                  (((1U<<1)-1) << PERI_DAC_SR_BIT_BWST2_SHIFT)

/*--- register CCR -------------------------------------------------*/
#define PERI_DAC_CCR_BIT_OTRIM1_SHIFT                               (0U)
#define PERI_DAC_CCR_BIT_OTRIM1_MASK                                (((1U<<5)-1) << PERI_DAC_CCR_BIT_OTRIM1_SHIFT)
#define PERI_DAC_CCR_BIT_OTRIM2_SHIFT                               (16U)
#define PERI_DAC_CCR_BIT_OTRIM2_MASK                                (((1U<<5)-1) << PERI_DAC_CCR_BIT_OTRIM2_SHIFT)

/*--- register MCR -------------------------------------------------*/
#define PERI_DAC_MCR_BIT_MODE1_SHIFT                                (0U)
#define PERI_DAC_MCR_BIT_MODE1_MASK                                 (((1U<<3)-1) << PERI_DAC_MCR_BIT_MODE1_SHIFT)
#define PERI_DAC_MCR_BIT_MODE2_SHIFT                                (16U)
#define PERI_DAC_MCR_BIT_MODE2_MASK                                 (((1U<<3)-1) << PERI_DAC_MCR_BIT_MODE2_SHIFT)

/*--- register SHSR1 -------------------------------------------------*/
#define PERI_DAC_SHSR1_BIT_TSAMPLE1_SHIFT                           (0U)
#define PERI_DAC_SHSR1_BIT_TSAMPLE1_MASK                            (((1U<<10)-1) << PERI_DAC_SHSR1_BIT_TSAMPLE1_SHIFT)

/*--- register SHSR2 -------------------------------------------------*/
#define PERI_DAC_SHSR2_BIT_TSAMPLE2_SHIFT                           (0U)
#define PERI_DAC_SHSR2_BIT_TSAMPLE2_MASK                            (((1U<<10)-1) << PERI_DAC_SHSR2_BIT_TSAMPLE2_SHIFT)

/*--- register SHHR -------------------------------------------------*/
#define PERI_DAC_SHHR_BIT_THOLD1_SHIFT                              (0U)
#define PERI_DAC_SHHR_BIT_THOLD1_MASK                               (((1U<<10)-1) << PERI_DAC_SHHR_BIT_THOLD1_SHIFT)
#define PERI_DAC_SHHR_BIT_THOLD2_SHIFT                              (16U)
#define PERI_DAC_SHHR_BIT_THOLD2_MASK                               (((1U<<10)-1) << PERI_DAC_SHHR_BIT_THOLD2_SHIFT)

/*--- register SHRR -------------------------------------------------*/
#define PERI_DAC_SHRR_BIT_TREFRESH1_SHIFT                           (0U)
#define PERI_DAC_SHRR_BIT_TREFRESH1_MASK                            (((1U<<8)-1) << PERI_DAC_SHRR_BIT_TREFRESH1_SHIFT)
#define PERI_DAC_SHRR_BIT_TREFRESH2_SHIFT                           (16U)
#define PERI_DAC_SHRR_BIT_TREFRESH2_MASK                            (((1U<<8)-1) << PERI_DAC_SHRR_BIT_TREFRESH2_SHIFT)

/*--- register IDC -------------------------------------------------*/
#define PERI_DBGMCU_IDC_BIT_DEV_ID_SHIFT                            (0U)
#define PERI_DBGMCU_IDC_BIT_DEV_ID_MASK                             (((1U<<12)-1) << PERI_DBGMCU_IDC_BIT_DEV_ID_SHIFT)
#define PERI_DBGMCU_IDC_BIT_REV_ID_SHIFT                            (16U)
#define PERI_DBGMCU_IDC_BIT_REV_ID_MASK                             (((1U<<16)-1) << PERI_DBGMCU_IDC_BIT_REV_ID_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_DBGMCU_CR_BIT_DBGSLEEP_D1_SHIFT                        (0U)
#define PERI_DBGMCU_CR_BIT_DBGSLEEP_D1_MASK                         (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSLEEP_D1_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSTOP_D1_SHIFT                         (1U)
#define PERI_DBGMCU_CR_BIT_DBGSTOP_D1_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSTOP_D1_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSTBY_D1_SHIFT                         (2U)
#define PERI_DBGMCU_CR_BIT_DBGSTBY_D1_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSTBY_D1_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSLEEP_D2_SHIFT                        (3U)
#define PERI_DBGMCU_CR_BIT_DBGSLEEP_D2_MASK                         (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSLEEP_D2_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSTOP_D2_SHIFT                         (4U)
#define PERI_DBGMCU_CR_BIT_DBGSTOP_D2_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSTOP_D2_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSTBY_D2_SHIFT                         (5U)
#define PERI_DBGMCU_CR_BIT_DBGSTBY_D2_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSTBY_D2_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSTOP_D3_SHIFT                         (7U)
#define PERI_DBGMCU_CR_BIT_DBGSTOP_D3_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSTOP_D3_SHIFT)
#define PERI_DBGMCU_CR_BIT_DBGSTBY_D3_SHIFT                         (8U)
#define PERI_DBGMCU_CR_BIT_DBGSTBY_D3_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_DBGSTBY_D3_SHIFT)
#define PERI_DBGMCU_CR_BIT_TRACECLKEN_SHIFT                         (20U)
#define PERI_DBGMCU_CR_BIT_TRACECLKEN_MASK                          (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_TRACECLKEN_SHIFT)
#define PERI_DBGMCU_CR_BIT_D1DBGCKEN_SHIFT                          (21U)
#define PERI_DBGMCU_CR_BIT_D1DBGCKEN_MASK                           (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_D1DBGCKEN_SHIFT)
#define PERI_DBGMCU_CR_BIT_D3DBGCKEN_SHIFT                          (22U)
#define PERI_DBGMCU_CR_BIT_D3DBGCKEN_MASK                           (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_D3DBGCKEN_SHIFT)
#define PERI_DBGMCU_CR_BIT_TRGOEN_SHIFT                             (28U)
#define PERI_DBGMCU_CR_BIT_TRGOEN_MASK                              (((1U<<1)-1) << PERI_DBGMCU_CR_BIT_TRGOEN_SHIFT)

