minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register APB3FZ1 -------------------------------------------------*/
#define PERI_DBGMCU_APB3FZ1_BIT_WWDG1_SHIFT                         (6U)
#define PERI_DBGMCU_APB3FZ1_BIT_WWDG1_MASK                          (((1U<<1)-1) << PERI_DBGMCU_APB3FZ1_BIT_WWDG1_SHIFT)

/*--- register APB1LFZ1 -------------------------------------------------*/
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM2_SHIFT                     (0U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM2_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM2_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM3_SHIFT                     (1U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM3_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM3_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM4_SHIFT                     (2U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM4_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM4_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM5_SHIFT                     (3U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM5_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM5_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM6_SHIFT                     (4U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM6_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM6_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM7_SHIFT                     (5U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM7_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM7_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM12_SHIFT                    (6U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM12_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM12_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM13_SHIFT                    (7U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM13_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM13_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM14_SHIFT                    (8U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM14_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_TIM14_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_LPTIM1_SHIFT                   (9U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_LPTIM1_MASK                    (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_LPTIM1_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C1_SHIFT                     (21U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C1_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C1_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C2_SHIFT                     (22U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C2_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C2_SHIFT)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C3_SHIFT                     (23U)
#define PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C3_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB1LFZ1_BIT_DBG_I2C3_SHIFT)

/*--- register APB2FZ1 -------------------------------------------------*/
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM1_SHIFT                      (0U)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM1_MASK                       (((1U<<1)-1) << PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM1_SHIFT)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM8_SHIFT                      (1U)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM8_MASK                       (((1U<<1)-1) << PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM8_SHIFT)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM15_SHIFT                     (16U)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM15_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM15_SHIFT)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM16_SHIFT                     (17U)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM16_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM16_SHIFT)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM17_SHIFT                     (18U)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM17_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB2FZ1_BIT_DBG_TIM17_SHIFT)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_HRTIM_SHIFT                     (29U)
#define PERI_DBGMCU_APB2FZ1_BIT_DBG_HRTIM_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB2FZ1_BIT_DBG_HRTIM_SHIFT)

/*--- register APB4FZ1 -------------------------------------------------*/
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_I2C4_SHIFT                      (7U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_I2C4_MASK                       (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_I2C4_SHIFT)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM2_SHIFT                    (9U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM2_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM2_SHIFT)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM3_SHIFT                    (10U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM3_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM3_SHIFT)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM4_SHIFT                    (11U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM4_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM4_SHIFT)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM5_SHIFT                    (12U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM5_MASK                     (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_LPTIM5_SHIFT)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_RTC_SHIFT                       (16U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_RTC_MASK                        (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_RTC_SHIFT)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_IWDG1_SHIFT                     (18U)
#define PERI_DBGMCU_APB4FZ1_BIT_DBG_IWDG1_MASK                      (((1U<<1)-1) << PERI_DBGMCU_APB4FZ1_BIT_DBG_IWDG1_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_DCMI_CR_BIT_CAPTURE_SHIFT                              (0U)
#define PERI_DCMI_CR_BIT_CAPTURE_MASK                               (((1U<<1)-1) << PERI_DCMI_CR_BIT_CAPTURE_SHIFT)
#define PERI_DCMI_CR_BIT_CM_SHIFT                                   (1U)
#define PERI_DCMI_CR_BIT_CM_MASK                                    (((1U<<1)-1) << PERI_DCMI_CR_BIT_CM_SHIFT)
#define PERI_DCMI_CR_BIT_CROP_SHIFT                                 (2U)
#define PERI_DCMI_CR_BIT_CROP_MASK                                  (((1U<<1)-1) << PERI_DCMI_CR_BIT_CROP_SHIFT)
#define PERI_DCMI_CR_BIT_JPEG_SHIFT                                 (3U)
#define PERI_DCMI_CR_BIT_JPEG_MASK                                  (((1U<<1)-1) << PERI_DCMI_CR_BIT_JPEG_SHIFT)
#define PERI_DCMI_CR_BIT_ESS_SHIFT                                  (4U)
#define PERI_DCMI_CR_BIT_ESS_MASK                                   (((1U<<1)-1) << PERI_DCMI_CR_BIT_ESS_SHIFT)
#define PERI_DCMI_CR_BIT_PCKPOL_SHIFT                               (5U)
#define PERI_DCMI_CR_BIT_PCKPOL_MASK                                (((1U<<1)-1) << PERI_DCMI_CR_BIT_PCKPOL_SHIFT)
#define PERI_DCMI_CR_BIT_HSPOL_SHIFT                                (6U)
#define PERI_DCMI_CR_BIT_HSPOL_MASK                                 (((1U<<1)-1) << PERI_DCMI_CR_BIT_HSPOL_SHIFT)
#define PERI_DCMI_CR_BIT_VSPOL_SHIFT                                (7U)
#define PERI_DCMI_CR_BIT_VSPOL_MASK                                 (((1U<<1)-1) << PERI_DCMI_CR_BIT_VSPOL_SHIFT)
#define PERI_DCMI_CR_BIT_FCRC_SHIFT                                 (8U)
#define PERI_DCMI_CR_BIT_FCRC_MASK                                  (((1U<<2)-1) << PERI_DCMI_CR_BIT_FCRC_SHIFT)
#define PERI_DCMI_CR_BIT_EDM_SHIFT                                  (10U)
#define PERI_DCMI_CR_BIT_EDM_MASK                                   (((1U<<2)-1) << PERI_DCMI_CR_BIT_EDM_SHIFT)
#define PERI_DCMI_CR_BIT_ENABLE_SHIFT                               (14U)
#define PERI_DCMI_CR_BIT_ENABLE_MASK                                (((1U<<1)-1) << PERI_DCMI_CR_BIT_ENABLE_SHIFT)
#define PERI_DCMI_CR_BIT_BSM_SHIFT                                  (16U)
#define PERI_DCMI_CR_BIT_BSM_MASK                                   (((1U<<2)-1) << PERI_DCMI_CR_BIT_BSM_SHIFT)
#define PERI_DCMI_CR_BIT_OEBS_SHIFT                                 (18U)
#define PERI_DCMI_CR_BIT_OEBS_MASK                                  (((1U<<1)-1) << PERI_DCMI_CR_BIT_OEBS_SHIFT)
#define PERI_DCMI_CR_BIT_LSM_SHIFT                                  (19U)
#define PERI_DCMI_CR_BIT_LSM_MASK                                   (((1U<<1)-1) << PERI_DCMI_CR_BIT_LSM_SHIFT)
#define PERI_DCMI_CR_BIT_OELS_SHIFT                                 (20U)
#define PERI_DCMI_CR_BIT_OELS_MASK                                  (((1U<<1)-1) << PERI_DCMI_CR_BIT_OELS_SHIFT)

