minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_DCMI_SR_BIT_HSYNC_SHIFT                                (0U)
#define PERI_DCMI_SR_BIT_HSYNC_MASK                                 (((1U<<1)-1) << PERI_DCMI_SR_BIT_HSYNC_SHIFT)
#define PERI_DCMI_SR_BIT_VSYNC_SHIFT                                (1U)
#define PERI_DCMI_SR_BIT_VSYNC_MASK                                 (((1U<<1)-1) << PERI_DCMI_SR_BIT_VSYNC_SHIFT)
#define PERI_DCMI_SR_BIT_FNE_SHIFT                                  (2U)
#define PERI_DCMI_SR_BIT_FNE_MASK                                   (((1U<<1)-1) << PERI_DCMI_SR_BIT_FNE_SHIFT)

/*--- register RIS -------------------------------------------------*/
#define PERI_DCMI_RIS_BIT_FRAME_RIS_SHIFT                           (0U)
#define PERI_DCMI_RIS_BIT_FRAME_RIS_MASK                            (((1U<<1)-1) << PERI_DCMI_RIS_BIT_FRAME_RIS_SHIFT)
#define PERI_DCMI_RIS_BIT_OVR_RIS_SHIFT                             (1U)
#define PERI_DCMI_RIS_BIT_OVR_RIS_MASK                              (((1U<<1)-1) << PERI_DCMI_RIS_BIT_OVR_RIS_SHIFT)
#define PERI_DCMI_RIS_BIT_ERR_RIS_SHIFT                             (2U)
#define PERI_DCMI_RIS_BIT_ERR_RIS_MASK                              (((1U<<1)-1) << PERI_DCMI_RIS_BIT_ERR_RIS_SHIFT)
#define PERI_DCMI_RIS_BIT_VSYNC_RIS_SHIFT                           (3U)
#define PERI_DCMI_RIS_BIT_VSYNC_RIS_MASK                            (((1U<<1)-1) << PERI_DCMI_RIS_BIT_VSYNC_RIS_SHIFT)
#define PERI_DCMI_RIS_BIT_LINE_RIS_SHIFT                            (4U)
#define PERI_DCMI_RIS_BIT_LINE_RIS_MASK                             (((1U<<1)-1) << PERI_DCMI_RIS_BIT_LINE_RIS_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_DCMI_IER_BIT_FRAME_IE_SHIFT                            (0U)
#define PERI_DCMI_IER_BIT_FRAME_IE_MASK                             (((1U<<1)-1) << PERI_DCMI_IER_BIT_FRAME_IE_SHIFT)
#define PERI_DCMI_IER_BIT_OVR_IE_SHIFT                              (1U)
#define PERI_DCMI_IER_BIT_OVR_IE_MASK                               (((1U<<1)-1) << PERI_DCMI_IER_BIT_OVR_IE_SHIFT)
#define PERI_DCMI_IER_BIT_ERR_IE_SHIFT                              (2U)
#define PERI_DCMI_IER_BIT_ERR_IE_MASK                               (((1U<<1)-1) << PERI_DCMI_IER_BIT_ERR_IE_SHIFT)
#define PERI_DCMI_IER_BIT_VSYNC_IE_SHIFT                            (3U)
#define PERI_DCMI_IER_BIT_VSYNC_IE_MASK                             (((1U<<1)-1) << PERI_DCMI_IER_BIT_VSYNC_IE_SHIFT)
#define PERI_DCMI_IER_BIT_LINE_IE_SHIFT                             (4U)
#define PERI_DCMI_IER_BIT_LINE_IE_MASK                              (((1U<<1)-1) << PERI_DCMI_IER_BIT_LINE_IE_SHIFT)

/*--- register MIS -------------------------------------------------*/
#define PERI_DCMI_MIS_BIT_FRAME_MIS_SHIFT                           (0U)
#define PERI_DCMI_MIS_BIT_FRAME_MIS_MASK                            (((1U<<1)-1) << PERI_DCMI_MIS_BIT_FRAME_MIS_SHIFT)
#define PERI_DCMI_MIS_BIT_OVR_MIS_SHIFT                             (1U)
#define PERI_DCMI_MIS_BIT_OVR_MIS_MASK                              (((1U<<1)-1) << PERI_DCMI_MIS_BIT_OVR_MIS_SHIFT)
#define PERI_DCMI_MIS_BIT_ERR_MIS_SHIFT                             (2U)
#define PERI_DCMI_MIS_BIT_ERR_MIS_MASK                              (((1U<<1)-1) << PERI_DCMI_MIS_BIT_ERR_MIS_SHIFT)
#define PERI_DCMI_MIS_BIT_VSYNC_MIS_SHIFT                           (3U)
#define PERI_DCMI_MIS_BIT_VSYNC_MIS_MASK                            (((1U<<1)-1) << PERI_DCMI_MIS_BIT_VSYNC_MIS_SHIFT)
#define PERI_DCMI_MIS_BIT_LINE_MIS_SHIFT                            (4U)
#define PERI_DCMI_MIS_BIT_LINE_MIS_MASK                             (((1U<<1)-1) << PERI_DCMI_MIS_BIT_LINE_MIS_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_DCMI_ICR_BIT_FRAME_ISC_SHIFT                           (0U)
#define PERI_DCMI_ICR_BIT_FRAME_ISC_MASK                            (((1U<<1)-1) << PERI_DCMI_ICR_BIT_FRAME_ISC_SHIFT)
#define PERI_DCMI_ICR_BIT_OVR_ISC_SHIFT                             (1U)
#define PERI_DCMI_ICR_BIT_OVR_ISC_MASK                              (((1U<<1)-1) << PERI_DCMI_ICR_BIT_OVR_ISC_SHIFT)
#define PERI_DCMI_ICR_BIT_ERR_ISC_SHIFT                             (2U)
#define PERI_DCMI_ICR_BIT_ERR_ISC_MASK                              (((1U<<1)-1) << PERI_DCMI_ICR_BIT_ERR_ISC_SHIFT)
#define PERI_DCMI_ICR_BIT_VSYNC_ISC_SHIFT                           (3U)
#define PERI_DCMI_ICR_BIT_VSYNC_ISC_MASK                            (((1U<<1)-1) << PERI_DCMI_ICR_BIT_VSYNC_ISC_SHIFT)
#define PERI_DCMI_ICR_BIT_LINE_ISC_SHIFT                            (4U)
#define PERI_DCMI_ICR_BIT_LINE_ISC_MASK                             (((1U<<1)-1) << PERI_DCMI_ICR_BIT_LINE_ISC_SHIFT)

/*--- register ESCR -------------------------------------------------*/
#define PERI_DCMI_ESCR_BIT_FSC_SHIFT                                (0U)
#define PERI_DCMI_ESCR_BIT_FSC_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESCR_BIT_FSC_SHIFT)
#define PERI_DCMI_ESCR_BIT_LSC_SHIFT                                (8U)
#define PERI_DCMI_ESCR_BIT_LSC_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESCR_BIT_LSC_SHIFT)
#define PERI_DCMI_ESCR_BIT_LEC_SHIFT                                (16U)
#define PERI_DCMI_ESCR_BIT_LEC_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESCR_BIT_LEC_SHIFT)
#define PERI_DCMI_ESCR_BIT_FEC_SHIFT                                (24U)
#define PERI_DCMI_ESCR_BIT_FEC_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESCR_BIT_FEC_SHIFT)

/*--- register ESUR -------------------------------------------------*/
#define PERI_DCMI_ESUR_BIT_FSU_SHIFT                                (0U)
#define PERI_DCMI_ESUR_BIT_FSU_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESUR_BIT_FSU_SHIFT)
#define PERI_DCMI_ESUR_BIT_LSU_SHIFT                                (8U)
#define PERI_DCMI_ESUR_BIT_LSU_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESUR_BIT_LSU_SHIFT)
#define PERI_DCMI_ESUR_BIT_LEU_SHIFT                                (16U)
#define PERI_DCMI_ESUR_BIT_LEU_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESUR_BIT_LEU_SHIFT)
#define PERI_DCMI_ESUR_BIT_FEU_SHIFT                                (24U)
#define PERI_DCMI_ESUR_BIT_FEU_MASK                                 (((1U<<8)-1) << PERI_DCMI_ESUR_BIT_FEU_SHIFT)

/*--- register CWSTRT -------------------------------------------------*/
#define PERI_DCMI_CWSTRT_BIT_HOFFCNT_SHIFT                          (0U)
#define PERI_DCMI_CWSTRT_BIT_HOFFCNT_MASK                           (((1U<<14)-1) << PERI_DCMI_CWSTRT_BIT_HOFFCNT_SHIFT)
#define PERI_DCMI_CWSTRT_BIT_VST_SHIFT                              (16U)
#define PERI_DCMI_CWSTRT_BIT_VST_MASK                               (((1U<<13)-1) << PERI_DCMI_CWSTRT_BIT_VST_SHIFT)

/*--- register CWSIZE -------------------------------------------------*/
#define PERI_DCMI_CWSIZE_BIT_CAPCNT_SHIFT                           (0U)
#define PERI_DCMI_CWSIZE_BIT_CAPCNT_MASK                            (((1U<<14)-1) << PERI_DCMI_CWSIZE_BIT_CAPCNT_SHIFT)
#define PERI_DCMI_CWSIZE_BIT_VLINE_SHIFT                            (16U)
#define PERI_DCMI_CWSIZE_BIT_VLINE_MASK                             (((1U<<14)-1) << PERI_DCMI_CWSIZE_BIT_VLINE_SHIFT)

/*--- register DR -------------------------------------------------*/
#define PERI_DCMI_DR_BIT_BYTE0_SHIFT                                (0U)
#define PERI_DCMI_DR_BIT_BYTE0_MASK                                 (((1U<<8)-1) << PERI_DCMI_DR_BIT_BYTE0_SHIFT)
#define PERI_DCMI_DR_BIT_BYTE1_SHIFT                                (8U)
#define PERI_DCMI_DR_BIT_BYTE1_MASK                                 (((1U<<8)-1) << PERI_DCMI_DR_BIT_BYTE1_SHIFT)
#define PERI_DCMI_DR_BIT_BYTE2_SHIFT                                (16U)
#define PERI_DCMI_DR_BIT_BYTE2_MASK                                 (((1U<<8)-1) << PERI_DCMI_DR_BIT_BYTE2_SHIFT)
#define PERI_DCMI_DR_BIT_BYTE3_SHIFT                                (24U)
#define PERI_DCMI_DR_BIT_BYTE3_MASK                                 (((1U<<8)-1) << PERI_DCMI_DR_BIT_BYTE3_SHIFT)

