minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_DELAY_Block_QUADSPI_CR_BIT_DEN_SHIFT                   (0U)
#define PERI_DELAY_Block_QUADSPI_CR_BIT_DEN_MASK                    (((1U<<1)-1) << PERI_DELAY_Block_QUADSPI_CR_BIT_DEN_SHIFT)
#define PERI_DELAY_Block_QUADSPI_CR_BIT_SEN_SHIFT                   (1U)
#define PERI_DELAY_Block_QUADSPI_CR_BIT_SEN_MASK                    (((1U<<1)-1) << PERI_DELAY_Block_QUADSPI_CR_BIT_SEN_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_SEL_SHIFT                 (0U)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_SEL_MASK                  (((1U<<4)-1) << PERI_DELAY_Block_QUADSPI_CFGR_BIT_SEL_SHIFT)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_UNIT_SHIFT                (8U)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_UNIT_MASK                 (((1U<<7)-1) << PERI_DELAY_Block_QUADSPI_CFGR_BIT_UNIT_SHIFT)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_LNG_SHIFT                 (16U)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_LNG_MASK                  (((1U<<12)-1) << PERI_DELAY_Block_QUADSPI_CFGR_BIT_LNG_SHIFT)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_LNGF_SHIFT                (31U)
#define PERI_DELAY_Block_QUADSPI_CFGR_BIT_LNGF_MASK                 (((1U<<1)-1) << PERI_DELAY_Block_QUADSPI_CFGR_BIT_LNGF_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_DELAY_Block_SDMMC1_CR_BIT_DEN_SHIFT                    (0U)
#define PERI_DELAY_Block_SDMMC1_CR_BIT_DEN_MASK                     (((1U<<1)-1) << PERI_DELAY_Block_SDMMC1_CR_BIT_DEN_SHIFT)
#define PERI_DELAY_Block_SDMMC1_CR_BIT_SEN_SHIFT                    (1U)
#define PERI_DELAY_Block_SDMMC1_CR_BIT_SEN_MASK                     (((1U<<1)-1) << PERI_DELAY_Block_SDMMC1_CR_BIT_SEN_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_SEL_SHIFT                  (0U)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_SEL_MASK                   (((1U<<4)-1) << PERI_DELAY_Block_SDMMC1_CFGR_BIT_SEL_SHIFT)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_UNIT_SHIFT                 (8U)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_UNIT_MASK                  (((1U<<7)-1) << PERI_DELAY_Block_SDMMC1_CFGR_BIT_UNIT_SHIFT)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_LNG_SHIFT                  (16U)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_LNG_MASK                   (((1U<<12)-1) << PERI_DELAY_Block_SDMMC1_CFGR_BIT_LNG_SHIFT)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_LNGF_SHIFT                 (31U)
#define PERI_DELAY_Block_SDMMC1_CFGR_BIT_LNGF_MASK                  (((1U<<1)-1) << PERI_DELAY_Block_SDMMC1_CFGR_BIT_LNGF_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_DELAY_Block_SDMMC2_CR_BIT_DEN_SHIFT                    (0U)
#define PERI_DELAY_Block_SDMMC2_CR_BIT_DEN_MASK                     (((1U<<1)-1) << PERI_DELAY_Block_SDMMC2_CR_BIT_DEN_SHIFT)
#define PERI_DELAY_Block_SDMMC2_CR_BIT_SEN_SHIFT                    (1U)
#define PERI_DELAY_Block_SDMMC2_CR_BIT_SEN_MASK                     (((1U<<1)-1) << PERI_DELAY_Block_SDMMC2_CR_BIT_SEN_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_SEL_SHIFT                  (0U)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_SEL_MASK                   (((1U<<4)-1) << PERI_DELAY_Block_SDMMC2_CFGR_BIT_SEL_SHIFT)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_UNIT_SHIFT                 (8U)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_UNIT_MASK                  (((1U<<7)-1) << PERI_DELAY_Block_SDMMC2_CFGR_BIT_UNIT_SHIFT)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_LNG_SHIFT                  (16U)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_LNG_MASK                   (((1U<<12)-1) << PERI_DELAY_Block_SDMMC2_CFGR_BIT_LNG_SHIFT)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_LNGF_SHIFT                 (31U)
#define PERI_DELAY_Block_SDMMC2_CFGR_BIT_LNGF_MASK                  (((1U<<1)-1) << PERI_DELAY_Block_SDMMC2_CFGR_BIT_LNGF_SHIFT)

/*--- register DFSDM_CHCFG0R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG0R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG1R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG1R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG2R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG2R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG3R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG3R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG4R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG4R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG5R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG5R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG6R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG6R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG7R1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SITP_SHIFT                    (0U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SITP_MASK                     (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SITP_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SPICKSEL_SHIFT                (2U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SPICKSEL_MASK                 (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SPICKSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SCDEN_SHIFT                   (5U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SCDEN_MASK                    (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_SCDEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKABEN_SHIFT                  (6U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKABEN_MASK                   (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKABEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CHEN_SHIFT                    (7U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CHEN_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CHEN_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CHINSEL_SHIFT                 (8U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CHINSEL_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CHINSEL_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DATMPX_SHIFT                  (12U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DATMPX_MASK                   (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DATMPX_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DATPACK_SHIFT                 (14U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DATPACK_MASK                  (((1U<<2)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DATPACK_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKOUTDIV_SHIFT                (16U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKOUTDIV_MASK                 (((1U<<8)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKOUTDIV_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKOUTSRC_SHIFT                (30U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKOUTSRC_MASK                 (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_CKOUTSRC_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DFSDMEN_SHIFT                 (31U)
#define PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DFSDMEN_MASK                  (((1U<<1)-1) << PERI_DFSDM_DFSDM_CHCFG7R1_BIT_DFSDMEN_SHIFT)

/*--- register DFSDM_CHCFG0R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG0R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG0R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG0R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG0R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG0R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG0R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_CHCFG1R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG1R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG1R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG1R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG1R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG1R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG1R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_CHCFG2R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG2R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG2R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG2R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG2R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG2R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG2R2_BIT_OFFSET_SHIFT)

