minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DFSDM_CHCFG3R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG3R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG3R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG3R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG3R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG3R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG3R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_CHCFG4R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG4R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG4R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG4R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG4R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG4R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG4R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_CHCFG5R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG5R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG5R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG5R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG5R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG5R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG5R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_CHCFG6R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG6R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG6R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG6R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG6R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG6R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG6R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_CHCFG7R2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHCFG7R2_BIT_DTRBS_SHIFT                   (3U)
#define PERI_DFSDM_DFSDM_CHCFG7R2_BIT_DTRBS_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_CHCFG7R2_BIT_DTRBS_SHIFT)
#define PERI_DFSDM_DFSDM_CHCFG7R2_BIT_OFFSET_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM_CHCFG7R2_BIT_OFFSET_MASK                   (((1U<<24)-1) << PERI_DFSDM_DFSDM_CHCFG7R2_BIT_OFFSET_SHIFT)

/*--- register DFSDM_AWSCD0R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD0R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD0R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD0R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD0R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD0R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD1R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD1R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD1R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD1R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD1R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD1R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD2R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD2R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD2R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD2R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD2R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD2R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD3R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD3R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD3R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD3R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD3R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD3R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD4R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD4R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD4R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD4R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD4R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD4R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD5R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD5R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD5R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD5R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD5R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD5R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD6R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD6R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD6R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD6R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD6R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD6R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_AWSCD7R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_SCDT_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_SCDT_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM_AWSCD7R_BIT_SCDT_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_BKSCD_SHIFT                    (12U)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_BKSCD_MASK                     (((1U<<4)-1) << PERI_DFSDM_DFSDM_AWSCD7R_BIT_BKSCD_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_AWFOSR_SHIFT                   (16U)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_AWFOSR_MASK                    (((1U<<5)-1) << PERI_DFSDM_DFSDM_AWSCD7R_BIT_AWFOSR_SHIFT)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_AWFORD_SHIFT                   (22U)
#define PERI_DFSDM_DFSDM_AWSCD7R_BIT_AWFORD_MASK                    (((1U<<2)-1) << PERI_DFSDM_DFSDM_AWSCD7R_BIT_AWFORD_SHIFT)

/*--- register DFSDM_CHWDAT0R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT0R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT0R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT0R_BIT_WDATA_SHIFT)

