minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DFSDM_CHWDAT1R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT1R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT1R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT1R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHWDAT2R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT2R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT2R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT2R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHWDAT3R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT3R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT3R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT3R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHWDAT4R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT4R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT4R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT4R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHWDAT5R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT5R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT5R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT5R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHWDAT6R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT6R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT6R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT6R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHWDAT7R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHWDAT7R_BIT_WDATA_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM_CHWDAT7R_BIT_WDATA_MASK                    (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHWDAT7R_BIT_WDATA_SHIFT)

/*--- register DFSDM_CHDATIN0R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN0R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN0R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN0R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN0R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN0R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN0R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN1R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN1R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN1R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN1R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN1R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN1R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN1R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN2R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN2R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN2R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN2R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN2R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN2R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN2R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN3R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN3R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN3R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN3R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN3R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN3R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN3R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN4R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN4R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN4R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN4R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN4R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN4R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN4R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN5R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN5R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN5R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN5R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN5R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN5R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN5R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN6R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN6R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN6R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN6R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN6R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN6R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN6R_BIT_INDAT1_SHIFT)

/*--- register DFSDM_CHDATIN7R -------------------------------------------------*/
#define PERI_DFSDM_DFSDM_CHDATIN7R_BIT_INDAT0_SHIFT                 (0U)
#define PERI_DFSDM_DFSDM_CHDATIN7R_BIT_INDAT0_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN7R_BIT_INDAT0_SHIFT)
#define PERI_DFSDM_DFSDM_CHDATIN7R_BIT_INDAT1_SHIFT                 (16U)
#define PERI_DFSDM_DFSDM_CHDATIN7R_BIT_INDAT1_MASK                  (((1U<<16)-1) << PERI_DFSDM_DFSDM_CHDATIN7R_BIT_INDAT1_SHIFT)

/*--- register DFSDM0_CR1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_CR1_BIT_DFEN_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_DFEN_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_DFEN_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JSWSTART_SHIFT                    (1U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_JSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JSYNC_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_JSYNC_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JSCAN_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JSCAN_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_JSCAN_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JDMAEN_SHIFT                      (5U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_JDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JEXTSEL_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JEXTSEL_MASK                      (((1U<<5)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_JEXTSEL_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JEXTEN_SHIFT                      (13U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_JEXTEN_MASK                       (((1U<<2)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_JEXTEN_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RSWSTART_SHIFT                    (17U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_RSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RCONT_SHIFT                       (18U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RCONT_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_RCONT_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RSYNC_SHIFT                       (19U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_RSYNC_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RDMAEN_SHIFT                      (21U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_RDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RCH_SHIFT                         (24U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_RCH_MASK                          (((1U<<3)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_RCH_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_FAST_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_FAST_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_FAST_SHIFT)
#define PERI_DFSDM_DFSDM0_CR1_BIT_AWFSEL_SHIFT                      (30U)
#define PERI_DFSDM_DFSDM0_CR1_BIT_AWFSEL_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR1_BIT_AWFSEL_SHIFT)

/*--- register DFSDM1_CR1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_CR1_BIT_DFEN_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_DFEN_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_DFEN_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JSWSTART_SHIFT                    (1U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_JSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JSYNC_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_JSYNC_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JSCAN_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JSCAN_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_JSCAN_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JDMAEN_SHIFT                      (5U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_JDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JEXTSEL_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JEXTSEL_MASK                      (((1U<<5)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_JEXTSEL_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JEXTEN_SHIFT                      (13U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_JEXTEN_MASK                       (((1U<<2)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_JEXTEN_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RSWSTART_SHIFT                    (17U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_RSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RCONT_SHIFT                       (18U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RCONT_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_RCONT_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RSYNC_SHIFT                       (19U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_RSYNC_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RDMAEN_SHIFT                      (21U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_RDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RCH_SHIFT                         (24U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_RCH_MASK                          (((1U<<3)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_RCH_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_FAST_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_FAST_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_FAST_SHIFT)
#define PERI_DFSDM_DFSDM1_CR1_BIT_AWFSEL_SHIFT                      (30U)
#define PERI_DFSDM_DFSDM1_CR1_BIT_AWFSEL_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR1_BIT_AWFSEL_SHIFT)

/*--- register DFSDM2_CR1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_CR1_BIT_DFEN_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_DFEN_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_DFEN_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JSWSTART_SHIFT                    (1U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_JSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JSYNC_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_JSYNC_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JSCAN_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JSCAN_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_JSCAN_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JDMAEN_SHIFT                      (5U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_JDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JEXTSEL_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JEXTSEL_MASK                      (((1U<<5)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_JEXTSEL_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JEXTEN_SHIFT                      (13U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_JEXTEN_MASK                       (((1U<<2)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_JEXTEN_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RSWSTART_SHIFT                    (17U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_RSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RCONT_SHIFT                       (18U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RCONT_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_RCONT_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RSYNC_SHIFT                       (19U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_RSYNC_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RDMAEN_SHIFT                      (21U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_RDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RCH_SHIFT                         (24U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_RCH_MASK                          (((1U<<3)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_RCH_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_FAST_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_FAST_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_FAST_SHIFT)
#define PERI_DFSDM_DFSDM2_CR1_BIT_AWFSEL_SHIFT                      (30U)
#define PERI_DFSDM_DFSDM2_CR1_BIT_AWFSEL_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR1_BIT_AWFSEL_SHIFT)

/*--- register DFSDM3_CR1 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_CR1_BIT_DFEN_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_DFEN_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_DFEN_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JSWSTART_SHIFT                    (1U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_JSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JSYNC_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_JSYNC_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JSCAN_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JSCAN_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_JSCAN_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JDMAEN_SHIFT                      (5U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_JDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JEXTSEL_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JEXTSEL_MASK                      (((1U<<5)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_JEXTSEL_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JEXTEN_SHIFT                      (13U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_JEXTEN_MASK                       (((1U<<2)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_JEXTEN_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RSWSTART_SHIFT                    (17U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RSWSTART_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_RSWSTART_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RCONT_SHIFT                       (18U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RCONT_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_RCONT_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RSYNC_SHIFT                       (19U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RSYNC_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_RSYNC_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RDMAEN_SHIFT                      (21U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RDMAEN_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_RDMAEN_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RCH_SHIFT                         (24U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_RCH_MASK                          (((1U<<3)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_RCH_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_FAST_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_FAST_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_FAST_SHIFT)
#define PERI_DFSDM_DFSDM3_CR1_BIT_AWFSEL_SHIFT                      (30U)
#define PERI_DFSDM_DFSDM3_CR1_BIT_AWFSEL_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR1_BIT_AWFSEL_SHIFT)

/*--- register DFSDM0_CR2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_CR2_BIT_JEOCIE_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_JEOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_JEOCIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_REOCIE_SHIFT                      (1U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_REOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_REOCIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_JOVRIE_SHIFT                      (2U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_JOVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_JOVRIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_ROVRIE_SHIFT                      (3U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_ROVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_ROVRIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_AWDIE_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_AWDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_AWDIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_SCDIE_SHIFT                       (5U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_SCDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_SCDIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_CKABIE_SHIFT                      (6U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_CKABIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_CKABIE_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_EXCH_SHIFT                        (8U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_EXCH_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_EXCH_SHIFT)
#define PERI_DFSDM_DFSDM0_CR2_BIT_AWDCH_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM0_CR2_BIT_AWDCH_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM0_CR2_BIT_AWDCH_SHIFT)

/*--- register DFSDM1_CR2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_CR2_BIT_JEOCIE_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_JEOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_JEOCIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_REOCIE_SHIFT                      (1U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_REOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_REOCIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_JOVRIE_SHIFT                      (2U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_JOVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_JOVRIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_ROVRIE_SHIFT                      (3U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_ROVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_ROVRIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_AWDIE_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_AWDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_AWDIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_SCDIE_SHIFT                       (5U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_SCDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_SCDIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_CKABIE_SHIFT                      (6U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_CKABIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_CKABIE_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_EXCH_SHIFT                        (8U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_EXCH_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_EXCH_SHIFT)
#define PERI_DFSDM_DFSDM1_CR2_BIT_AWDCH_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM1_CR2_BIT_AWDCH_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM1_CR2_BIT_AWDCH_SHIFT)

/*--- register DFSDM2_CR2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_CR2_BIT_JEOCIE_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_JEOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_JEOCIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_REOCIE_SHIFT                      (1U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_REOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_REOCIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_JOVRIE_SHIFT                      (2U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_JOVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_JOVRIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_ROVRIE_SHIFT                      (3U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_ROVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_ROVRIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_AWDIE_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_AWDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_AWDIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_SCDIE_SHIFT                       (5U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_SCDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_SCDIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_CKABIE_SHIFT                      (6U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_CKABIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_CKABIE_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_EXCH_SHIFT                        (8U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_EXCH_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_EXCH_SHIFT)
#define PERI_DFSDM_DFSDM2_CR2_BIT_AWDCH_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM2_CR2_BIT_AWDCH_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM2_CR2_BIT_AWDCH_SHIFT)

