minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DFSDM3_CR2 -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_CR2_BIT_JEOCIE_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_JEOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_JEOCIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_REOCIE_SHIFT                      (1U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_REOCIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_REOCIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_JOVRIE_SHIFT                      (2U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_JOVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_JOVRIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_ROVRIE_SHIFT                      (3U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_ROVRIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_ROVRIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_AWDIE_SHIFT                       (4U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_AWDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_AWDIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_SCDIE_SHIFT                       (5U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_SCDIE_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_SCDIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_CKABIE_SHIFT                      (6U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_CKABIE_MASK                       (((1U<<1)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_CKABIE_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_EXCH_SHIFT                        (8U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_EXCH_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_EXCH_SHIFT)
#define PERI_DFSDM_DFSDM3_CR2_BIT_AWDCH_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM3_CR2_BIT_AWDCH_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM3_CR2_BIT_AWDCH_SHIFT)

/*--- register DFSDM0_ISR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_ISR_BIT_JEOCF_SHIFT                       (0U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_JEOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_JEOCF_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_REOCF_SHIFT                       (1U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_REOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_REOCF_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_JOVRF_SHIFT                       (2U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_JOVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_JOVRF_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_ROVRF_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_ROVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_ROVRF_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_AWDF_SHIFT                        (4U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_AWDF_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_AWDF_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_JCIP_SHIFT                        (13U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_JCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_JCIP_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_RCIP_SHIFT                        (14U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_RCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_RCIP_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_CKABF_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_CKABF_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_CKABF_SHIFT)
#define PERI_DFSDM_DFSDM0_ISR_BIT_SCDF_SHIFT                        (24U)
#define PERI_DFSDM_DFSDM0_ISR_BIT_SCDF_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM0_ISR_BIT_SCDF_SHIFT)

/*--- register DFSDM1_ISR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_ISR_BIT_JEOCF_SHIFT                       (0U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_JEOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_JEOCF_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_REOCF_SHIFT                       (1U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_REOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_REOCF_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_JOVRF_SHIFT                       (2U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_JOVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_JOVRF_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_ROVRF_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_ROVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_ROVRF_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_AWDF_SHIFT                        (4U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_AWDF_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_AWDF_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_JCIP_SHIFT                        (13U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_JCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_JCIP_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_RCIP_SHIFT                        (14U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_RCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_RCIP_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_CKABF_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_CKABF_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_CKABF_SHIFT)
#define PERI_DFSDM_DFSDM1_ISR_BIT_SCDF_SHIFT                        (24U)
#define PERI_DFSDM_DFSDM1_ISR_BIT_SCDF_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM1_ISR_BIT_SCDF_SHIFT)

/*--- register DFSDM2_ISR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_ISR_BIT_JEOCF_SHIFT                       (0U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_JEOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_JEOCF_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_REOCF_SHIFT                       (1U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_REOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_REOCF_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_JOVRF_SHIFT                       (2U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_JOVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_JOVRF_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_ROVRF_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_ROVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_ROVRF_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_AWDF_SHIFT                        (4U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_AWDF_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_AWDF_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_JCIP_SHIFT                        (13U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_JCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_JCIP_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_RCIP_SHIFT                        (14U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_RCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_RCIP_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_CKABF_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_CKABF_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_CKABF_SHIFT)
#define PERI_DFSDM_DFSDM2_ISR_BIT_SCDF_SHIFT                        (24U)
#define PERI_DFSDM_DFSDM2_ISR_BIT_SCDF_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM2_ISR_BIT_SCDF_SHIFT)

/*--- register DFSDM3_ISR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_ISR_BIT_JEOCF_SHIFT                       (0U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_JEOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_JEOCF_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_REOCF_SHIFT                       (1U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_REOCF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_REOCF_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_JOVRF_SHIFT                       (2U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_JOVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_JOVRF_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_ROVRF_SHIFT                       (3U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_ROVRF_MASK                        (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_ROVRF_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_AWDF_SHIFT                        (4U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_AWDF_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_AWDF_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_JCIP_SHIFT                        (13U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_JCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_JCIP_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_RCIP_SHIFT                        (14U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_RCIP_MASK                         (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_RCIP_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_CKABF_SHIFT                       (16U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_CKABF_MASK                        (((1U<<8)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_CKABF_SHIFT)
#define PERI_DFSDM_DFSDM3_ISR_BIT_SCDF_SHIFT                        (24U)
#define PERI_DFSDM_DFSDM3_ISR_BIT_SCDF_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM3_ISR_BIT_SCDF_SHIFT)

/*--- register DFSDM0_ICR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRJOVRF_SHIFT                    (2U)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRJOVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ICR_BIT_CLRJOVRF_SHIFT)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRROVRF_SHIFT                    (3U)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRROVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM0_ICR_BIT_CLRROVRF_SHIFT)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRCKABF_SHIFT                    (16U)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRCKABF_MASK                     (((1U<<8)-1) << PERI_DFSDM_DFSDM0_ICR_BIT_CLRCKABF_SHIFT)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRSCDF_SHIFT                     (24U)
#define PERI_DFSDM_DFSDM0_ICR_BIT_CLRSCDF_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM0_ICR_BIT_CLRSCDF_SHIFT)

/*--- register DFSDM1_ICR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRJOVRF_SHIFT                    (2U)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRJOVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ICR_BIT_CLRJOVRF_SHIFT)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRROVRF_SHIFT                    (3U)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRROVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM1_ICR_BIT_CLRROVRF_SHIFT)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRCKABF_SHIFT                    (16U)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRCKABF_MASK                     (((1U<<8)-1) << PERI_DFSDM_DFSDM1_ICR_BIT_CLRCKABF_SHIFT)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRSCDF_SHIFT                     (24U)
#define PERI_DFSDM_DFSDM1_ICR_BIT_CLRSCDF_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM1_ICR_BIT_CLRSCDF_SHIFT)

/*--- register DFSDM2_ICR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRJOVRF_SHIFT                    (2U)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRJOVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ICR_BIT_CLRJOVRF_SHIFT)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRROVRF_SHIFT                    (3U)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRROVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM2_ICR_BIT_CLRROVRF_SHIFT)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRCKABF_SHIFT                    (16U)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRCKABF_MASK                     (((1U<<8)-1) << PERI_DFSDM_DFSDM2_ICR_BIT_CLRCKABF_SHIFT)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRSCDF_SHIFT                     (24U)
#define PERI_DFSDM_DFSDM2_ICR_BIT_CLRSCDF_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM2_ICR_BIT_CLRSCDF_SHIFT)

/*--- register DFSDM3_ICR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRJOVRF_SHIFT                    (2U)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRJOVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ICR_BIT_CLRJOVRF_SHIFT)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRROVRF_SHIFT                    (3U)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRROVRF_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM3_ICR_BIT_CLRROVRF_SHIFT)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRCKABF_SHIFT                    (16U)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRCKABF_MASK                     (((1U<<8)-1) << PERI_DFSDM_DFSDM3_ICR_BIT_CLRCKABF_SHIFT)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRSCDF_SHIFT                     (24U)
#define PERI_DFSDM_DFSDM3_ICR_BIT_CLRSCDF_MASK                      (((1U<<8)-1) << PERI_DFSDM_DFSDM3_ICR_BIT_CLRSCDF_SHIFT)

/*--- register DFSDM0_JCHGR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_JCHGR_BIT_JCHG_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM0_JCHGR_BIT_JCHG_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM0_JCHGR_BIT_JCHG_SHIFT)

/*--- register DFSDM1_JCHGR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_JCHGR_BIT_JCHG_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM1_JCHGR_BIT_JCHG_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM1_JCHGR_BIT_JCHG_SHIFT)

/*--- register DFSDM2_JCHGR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_JCHGR_BIT_JCHG_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM2_JCHGR_BIT_JCHG_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM2_JCHGR_BIT_JCHG_SHIFT)

