minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DFSDM3_JCHGR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_JCHGR_BIT_JCHG_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM3_JCHGR_BIT_JCHG_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM3_JCHGR_BIT_JCHG_SHIFT)

/*--- register DFSDM0_FCR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_FCR_BIT_IOSR_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM0_FCR_BIT_IOSR_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM0_FCR_BIT_IOSR_SHIFT)
#define PERI_DFSDM_DFSDM0_FCR_BIT_FOSR_SHIFT                        (16U)
#define PERI_DFSDM_DFSDM0_FCR_BIT_FOSR_MASK                         (((1U<<10)-1) << PERI_DFSDM_DFSDM0_FCR_BIT_FOSR_SHIFT)
#define PERI_DFSDM_DFSDM0_FCR_BIT_FORD_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM0_FCR_BIT_FORD_MASK                         (((1U<<3)-1) << PERI_DFSDM_DFSDM0_FCR_BIT_FORD_SHIFT)

/*--- register DFSDM1_FCR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_FCR_BIT_IOSR_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM1_FCR_BIT_IOSR_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM1_FCR_BIT_IOSR_SHIFT)
#define PERI_DFSDM_DFSDM1_FCR_BIT_FOSR_SHIFT                        (16U)
#define PERI_DFSDM_DFSDM1_FCR_BIT_FOSR_MASK                         (((1U<<10)-1) << PERI_DFSDM_DFSDM1_FCR_BIT_FOSR_SHIFT)
#define PERI_DFSDM_DFSDM1_FCR_BIT_FORD_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM1_FCR_BIT_FORD_MASK                         (((1U<<3)-1) << PERI_DFSDM_DFSDM1_FCR_BIT_FORD_SHIFT)

/*--- register DFSDM2_FCR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_FCR_BIT_IOSR_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM2_FCR_BIT_IOSR_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM2_FCR_BIT_IOSR_SHIFT)
#define PERI_DFSDM_DFSDM2_FCR_BIT_FOSR_SHIFT                        (16U)
#define PERI_DFSDM_DFSDM2_FCR_BIT_FOSR_MASK                         (((1U<<10)-1) << PERI_DFSDM_DFSDM2_FCR_BIT_FOSR_SHIFT)
#define PERI_DFSDM_DFSDM2_FCR_BIT_FORD_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM2_FCR_BIT_FORD_MASK                         (((1U<<3)-1) << PERI_DFSDM_DFSDM2_FCR_BIT_FORD_SHIFT)

/*--- register DFSDM3_FCR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_FCR_BIT_IOSR_SHIFT                        (0U)
#define PERI_DFSDM_DFSDM3_FCR_BIT_IOSR_MASK                         (((1U<<8)-1) << PERI_DFSDM_DFSDM3_FCR_BIT_IOSR_SHIFT)
#define PERI_DFSDM_DFSDM3_FCR_BIT_FOSR_SHIFT                        (16U)
#define PERI_DFSDM_DFSDM3_FCR_BIT_FOSR_MASK                         (((1U<<10)-1) << PERI_DFSDM_DFSDM3_FCR_BIT_FOSR_SHIFT)
#define PERI_DFSDM_DFSDM3_FCR_BIT_FORD_SHIFT                        (29U)
#define PERI_DFSDM_DFSDM3_FCR_BIT_FORD_MASK                         (((1U<<3)-1) << PERI_DFSDM_DFSDM3_FCR_BIT_FORD_SHIFT)

/*--- register DFSDM0_JDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_JDATAR_BIT_JDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM0_JDATAR_BIT_JDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM0_JDATAR_BIT_JDATACH_SHIFT)
#define PERI_DFSDM_DFSDM0_JDATAR_BIT_JDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM0_JDATAR_BIT_JDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM0_JDATAR_BIT_JDATA_SHIFT)

/*--- register DFSDM1_JDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_JDATAR_BIT_JDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM1_JDATAR_BIT_JDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM1_JDATAR_BIT_JDATACH_SHIFT)
#define PERI_DFSDM_DFSDM1_JDATAR_BIT_JDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM1_JDATAR_BIT_JDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM1_JDATAR_BIT_JDATA_SHIFT)

/*--- register DFSDM2_JDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_JDATAR_BIT_JDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM2_JDATAR_BIT_JDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM2_JDATAR_BIT_JDATACH_SHIFT)
#define PERI_DFSDM_DFSDM2_JDATAR_BIT_JDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM2_JDATAR_BIT_JDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM2_JDATAR_BIT_JDATA_SHIFT)

/*--- register DFSDM3_JDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_JDATAR_BIT_JDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM3_JDATAR_BIT_JDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM3_JDATAR_BIT_JDATACH_SHIFT)
#define PERI_DFSDM_DFSDM3_JDATAR_BIT_JDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM3_JDATAR_BIT_JDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM3_JDATAR_BIT_JDATA_SHIFT)

/*--- register DFSDM0_RDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_RDATAR_BIT_RDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM0_RDATAR_BIT_RDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM0_RDATAR_BIT_RDATACH_SHIFT)
#define PERI_DFSDM_DFSDM0_RDATAR_BIT_RPEND_SHIFT                    (4U)
#define PERI_DFSDM_DFSDM0_RDATAR_BIT_RPEND_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM0_RDATAR_BIT_RPEND_SHIFT)
#define PERI_DFSDM_DFSDM0_RDATAR_BIT_RDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM0_RDATAR_BIT_RDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM0_RDATAR_BIT_RDATA_SHIFT)

/*--- register DFSDM1_RDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_RDATAR_BIT_RDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM1_RDATAR_BIT_RDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM1_RDATAR_BIT_RDATACH_SHIFT)
#define PERI_DFSDM_DFSDM1_RDATAR_BIT_RPEND_SHIFT                    (4U)
#define PERI_DFSDM_DFSDM1_RDATAR_BIT_RPEND_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM1_RDATAR_BIT_RPEND_SHIFT)
#define PERI_DFSDM_DFSDM1_RDATAR_BIT_RDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM1_RDATAR_BIT_RDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM1_RDATAR_BIT_RDATA_SHIFT)

/*--- register DFSDM2_RDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_RDATAR_BIT_RDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM2_RDATAR_BIT_RDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM2_RDATAR_BIT_RDATACH_SHIFT)
#define PERI_DFSDM_DFSDM2_RDATAR_BIT_RPEND_SHIFT                    (4U)
#define PERI_DFSDM_DFSDM2_RDATAR_BIT_RPEND_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM2_RDATAR_BIT_RPEND_SHIFT)
#define PERI_DFSDM_DFSDM2_RDATAR_BIT_RDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM2_RDATAR_BIT_RDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM2_RDATAR_BIT_RDATA_SHIFT)

