minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DFSDM3_RDATAR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_RDATAR_BIT_RDATACH_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM3_RDATAR_BIT_RDATACH_MASK                   (((1U<<3)-1) << PERI_DFSDM_DFSDM3_RDATAR_BIT_RDATACH_SHIFT)
#define PERI_DFSDM_DFSDM3_RDATAR_BIT_RPEND_SHIFT                    (4U)
#define PERI_DFSDM_DFSDM3_RDATAR_BIT_RPEND_MASK                     (((1U<<1)-1) << PERI_DFSDM_DFSDM3_RDATAR_BIT_RPEND_SHIFT)
#define PERI_DFSDM_DFSDM3_RDATAR_BIT_RDATA_SHIFT                    (8U)
#define PERI_DFSDM_DFSDM3_RDATAR_BIT_RDATA_MASK                     (((1U<<24)-1) << PERI_DFSDM_DFSDM3_RDATAR_BIT_RDATA_SHIFT)

/*--- register DFSDM0_AWHTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_AWHTR_BIT_BKAWH_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM0_AWHTR_BIT_BKAWH_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM0_AWHTR_BIT_BKAWH_SHIFT)
#define PERI_DFSDM_DFSDM0_AWHTR_BIT_AWHT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM0_AWHTR_BIT_AWHT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM0_AWHTR_BIT_AWHT_SHIFT)

/*--- register DFSDM1_AWHTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_AWHTR_BIT_BKAWH_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM1_AWHTR_BIT_BKAWH_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM1_AWHTR_BIT_BKAWH_SHIFT)
#define PERI_DFSDM_DFSDM1_AWHTR_BIT_AWHT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM1_AWHTR_BIT_AWHT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM1_AWHTR_BIT_AWHT_SHIFT)

/*--- register DFSDM2_AWHTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_AWHTR_BIT_BKAWH_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM2_AWHTR_BIT_BKAWH_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM2_AWHTR_BIT_BKAWH_SHIFT)
#define PERI_DFSDM_DFSDM2_AWHTR_BIT_AWHT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM2_AWHTR_BIT_AWHT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM2_AWHTR_BIT_AWHT_SHIFT)

/*--- register DFSDM3_AWHTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_AWHTR_BIT_BKAWH_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM3_AWHTR_BIT_BKAWH_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM3_AWHTR_BIT_BKAWH_SHIFT)
#define PERI_DFSDM_DFSDM3_AWHTR_BIT_AWHT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM3_AWHTR_BIT_AWHT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM3_AWHTR_BIT_AWHT_SHIFT)

/*--- register DFSDM0_AWLTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_AWLTR_BIT_BKAWL_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM0_AWLTR_BIT_BKAWL_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM0_AWLTR_BIT_BKAWL_SHIFT)
#define PERI_DFSDM_DFSDM0_AWLTR_BIT_AWLT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM0_AWLTR_BIT_AWLT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM0_AWLTR_BIT_AWLT_SHIFT)

/*--- register DFSDM1_AWLTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_AWLTR_BIT_BKAWL_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM1_AWLTR_BIT_BKAWL_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM1_AWLTR_BIT_BKAWL_SHIFT)
#define PERI_DFSDM_DFSDM1_AWLTR_BIT_AWLT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM1_AWLTR_BIT_AWLT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM1_AWLTR_BIT_AWLT_SHIFT)

/*--- register DFSDM2_AWLTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_AWLTR_BIT_BKAWL_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM2_AWLTR_BIT_BKAWL_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM2_AWLTR_BIT_BKAWL_SHIFT)
#define PERI_DFSDM_DFSDM2_AWLTR_BIT_AWLT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM2_AWLTR_BIT_AWLT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM2_AWLTR_BIT_AWLT_SHIFT)

/*--- register DFSDM3_AWLTR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_AWLTR_BIT_BKAWL_SHIFT                     (0U)
#define PERI_DFSDM_DFSDM3_AWLTR_BIT_BKAWL_MASK                      (((1U<<4)-1) << PERI_DFSDM_DFSDM3_AWLTR_BIT_BKAWL_SHIFT)
#define PERI_DFSDM_DFSDM3_AWLTR_BIT_AWLT_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM3_AWLTR_BIT_AWLT_MASK                       (((1U<<24)-1) << PERI_DFSDM_DFSDM3_AWLTR_BIT_AWLT_SHIFT)

/*--- register DFSDM0_AWSR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_AWSR_BIT_AWLTF_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM0_AWSR_BIT_AWLTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM0_AWSR_BIT_AWLTF_SHIFT)
#define PERI_DFSDM_DFSDM0_AWSR_BIT_AWHTF_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM0_AWSR_BIT_AWHTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM0_AWSR_BIT_AWHTF_SHIFT)

/*--- register DFSDM1_AWSR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_AWSR_BIT_AWLTF_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM1_AWSR_BIT_AWLTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM1_AWSR_BIT_AWLTF_SHIFT)
#define PERI_DFSDM_DFSDM1_AWSR_BIT_AWHTF_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM1_AWSR_BIT_AWHTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM1_AWSR_BIT_AWHTF_SHIFT)

/*--- register DFSDM2_AWSR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_AWSR_BIT_AWLTF_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM2_AWSR_BIT_AWLTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM2_AWSR_BIT_AWLTF_SHIFT)
#define PERI_DFSDM_DFSDM2_AWSR_BIT_AWHTF_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM2_AWSR_BIT_AWHTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM2_AWSR_BIT_AWHTF_SHIFT)

/*--- register DFSDM3_AWSR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_AWSR_BIT_AWLTF_SHIFT                      (0U)
#define PERI_DFSDM_DFSDM3_AWSR_BIT_AWLTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM3_AWSR_BIT_AWLTF_SHIFT)
#define PERI_DFSDM_DFSDM3_AWSR_BIT_AWHTF_SHIFT                      (8U)
#define PERI_DFSDM_DFSDM3_AWSR_BIT_AWHTF_MASK                       (((1U<<8)-1) << PERI_DFSDM_DFSDM3_AWSR_BIT_AWHTF_SHIFT)

/*--- register DFSDM0_AWCFR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_AWCFR_BIT_CLRAWLTF_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM0_AWCFR_BIT_CLRAWLTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM0_AWCFR_BIT_CLRAWLTF_SHIFT)
#define PERI_DFSDM_DFSDM0_AWCFR_BIT_CLRAWHTF_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM0_AWCFR_BIT_CLRAWHTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM0_AWCFR_BIT_CLRAWHTF_SHIFT)

