minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DFSDM1_AWCFR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_AWCFR_BIT_CLRAWLTF_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM1_AWCFR_BIT_CLRAWLTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM1_AWCFR_BIT_CLRAWLTF_SHIFT)
#define PERI_DFSDM_DFSDM1_AWCFR_BIT_CLRAWHTF_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM1_AWCFR_BIT_CLRAWHTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM1_AWCFR_BIT_CLRAWHTF_SHIFT)

/*--- register DFSDM2_AWCFR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_AWCFR_BIT_CLRAWLTF_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM2_AWCFR_BIT_CLRAWLTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM2_AWCFR_BIT_CLRAWLTF_SHIFT)
#define PERI_DFSDM_DFSDM2_AWCFR_BIT_CLRAWHTF_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM2_AWCFR_BIT_CLRAWHTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM2_AWCFR_BIT_CLRAWHTF_SHIFT)

/*--- register DFSDM3_AWCFR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_AWCFR_BIT_CLRAWLTF_SHIFT                  (0U)
#define PERI_DFSDM_DFSDM3_AWCFR_BIT_CLRAWLTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM3_AWCFR_BIT_CLRAWLTF_SHIFT)
#define PERI_DFSDM_DFSDM3_AWCFR_BIT_CLRAWHTF_SHIFT                  (8U)
#define PERI_DFSDM_DFSDM3_AWCFR_BIT_CLRAWHTF_MASK                   (((1U<<8)-1) << PERI_DFSDM_DFSDM3_AWCFR_BIT_CLRAWHTF_SHIFT)

/*--- register DFSDM0_EXMAX -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_EXMAX_BIT_EXMAXCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM0_EXMAX_BIT_EXMAXCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM0_EXMAX_BIT_EXMAXCH_SHIFT)
#define PERI_DFSDM_DFSDM0_EXMAX_BIT_EXMAX_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM0_EXMAX_BIT_EXMAX_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM0_EXMAX_BIT_EXMAX_SHIFT)

/*--- register DFSDM1_EXMAX -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_EXMAX_BIT_EXMAXCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM1_EXMAX_BIT_EXMAXCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM1_EXMAX_BIT_EXMAXCH_SHIFT)
#define PERI_DFSDM_DFSDM1_EXMAX_BIT_EXMAX_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM1_EXMAX_BIT_EXMAX_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM1_EXMAX_BIT_EXMAX_SHIFT)

/*--- register DFSDM2_EXMAX -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_EXMAX_BIT_EXMAXCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM2_EXMAX_BIT_EXMAXCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM2_EXMAX_BIT_EXMAXCH_SHIFT)
#define PERI_DFSDM_DFSDM2_EXMAX_BIT_EXMAX_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM2_EXMAX_BIT_EXMAX_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM2_EXMAX_BIT_EXMAX_SHIFT)

/*--- register DFSDM3_EXMAX -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_EXMAX_BIT_EXMAXCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM3_EXMAX_BIT_EXMAXCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM3_EXMAX_BIT_EXMAXCH_SHIFT)
#define PERI_DFSDM_DFSDM3_EXMAX_BIT_EXMAX_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM3_EXMAX_BIT_EXMAX_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM3_EXMAX_BIT_EXMAX_SHIFT)

/*--- register DFSDM0_EXMIN -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_EXMIN_BIT_EXMINCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM0_EXMIN_BIT_EXMINCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM0_EXMIN_BIT_EXMINCH_SHIFT)
#define PERI_DFSDM_DFSDM0_EXMIN_BIT_EXMIN_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM0_EXMIN_BIT_EXMIN_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM0_EXMIN_BIT_EXMIN_SHIFT)

/*--- register DFSDM1_EXMIN -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_EXMIN_BIT_EXMINCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM1_EXMIN_BIT_EXMINCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM1_EXMIN_BIT_EXMINCH_SHIFT)
#define PERI_DFSDM_DFSDM1_EXMIN_BIT_EXMIN_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM1_EXMIN_BIT_EXMIN_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM1_EXMIN_BIT_EXMIN_SHIFT)

/*--- register DFSDM2_EXMIN -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_EXMIN_BIT_EXMINCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM2_EXMIN_BIT_EXMINCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM2_EXMIN_BIT_EXMINCH_SHIFT)
#define PERI_DFSDM_DFSDM2_EXMIN_BIT_EXMIN_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM2_EXMIN_BIT_EXMIN_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM2_EXMIN_BIT_EXMIN_SHIFT)

/*--- register DFSDM3_EXMIN -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_EXMIN_BIT_EXMINCH_SHIFT                   (0U)
#define PERI_DFSDM_DFSDM3_EXMIN_BIT_EXMINCH_MASK                    (((1U<<3)-1) << PERI_DFSDM_DFSDM3_EXMIN_BIT_EXMINCH_SHIFT)
#define PERI_DFSDM_DFSDM3_EXMIN_BIT_EXMIN_SHIFT                     (8U)
#define PERI_DFSDM_DFSDM3_EXMIN_BIT_EXMIN_MASK                      (((1U<<24)-1) << PERI_DFSDM_DFSDM3_EXMIN_BIT_EXMIN_SHIFT)

/*--- register DFSDM0_CNVTIMR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM0_CNVTIMR_BIT_CNVCNT_SHIFT                  (4U)
#define PERI_DFSDM_DFSDM0_CNVTIMR_BIT_CNVCNT_MASK                   (((1U<<28)-1) << PERI_DFSDM_DFSDM0_CNVTIMR_BIT_CNVCNT_SHIFT)

/*--- register DFSDM1_CNVTIMR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM1_CNVTIMR_BIT_CNVCNT_SHIFT                  (4U)
#define PERI_DFSDM_DFSDM1_CNVTIMR_BIT_CNVCNT_MASK                   (((1U<<28)-1) << PERI_DFSDM_DFSDM1_CNVTIMR_BIT_CNVCNT_SHIFT)

/*--- register DFSDM2_CNVTIMR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM2_CNVTIMR_BIT_CNVCNT_SHIFT                  (4U)
#define PERI_DFSDM_DFSDM2_CNVTIMR_BIT_CNVCNT_MASK                   (((1U<<28)-1) << PERI_DFSDM_DFSDM2_CNVTIMR_BIT_CNVCNT_SHIFT)

/*--- register DFSDM3_CNVTIMR -------------------------------------------------*/
#define PERI_DFSDM_DFSDM3_CNVTIMR_BIT_CNVCNT_SHIFT                  (4U)
#define PERI_DFSDM_DFSDM3_CNVTIMR_BIT_CNVCNT_MASK                   (((1U<<28)-1) << PERI_DFSDM_DFSDM3_CNVTIMR_BIT_CNVCNT_SHIFT)

/*--- register LISR -------------------------------------------------*/
#define PERI_DMA1_LISR_BIT_FEIF0_SHIFT                              (0U)
#define PERI_DMA1_LISR_BIT_FEIF0_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_FEIF0_SHIFT)
#define PERI_DMA1_LISR_BIT_DMEIF0_SHIFT                             (2U)
#define PERI_DMA1_LISR_BIT_DMEIF0_MASK                              (((1U<<1)-1) << PERI_DMA1_LISR_BIT_DMEIF0_SHIFT)
#define PERI_DMA1_LISR_BIT_TEIF0_SHIFT                              (3U)
#define PERI_DMA1_LISR_BIT_TEIF0_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TEIF0_SHIFT)
#define PERI_DMA1_LISR_BIT_HTIF0_SHIFT                              (4U)
#define PERI_DMA1_LISR_BIT_HTIF0_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_HTIF0_SHIFT)
#define PERI_DMA1_LISR_BIT_TCIF0_SHIFT                              (5U)
#define PERI_DMA1_LISR_BIT_TCIF0_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TCIF0_SHIFT)
#define PERI_DMA1_LISR_BIT_FEIF1_SHIFT                              (6U)
#define PERI_DMA1_LISR_BIT_FEIF1_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_FEIF1_SHIFT)
#define PERI_DMA1_LISR_BIT_DMEIF1_SHIFT                             (8U)
#define PERI_DMA1_LISR_BIT_DMEIF1_MASK                              (((1U<<1)-1) << PERI_DMA1_LISR_BIT_DMEIF1_SHIFT)
#define PERI_DMA1_LISR_BIT_TEIF1_SHIFT                              (9U)
#define PERI_DMA1_LISR_BIT_TEIF1_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TEIF1_SHIFT)
#define PERI_DMA1_LISR_BIT_HTIF1_SHIFT                              (10U)
#define PERI_DMA1_LISR_BIT_HTIF1_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_HTIF1_SHIFT)
#define PERI_DMA1_LISR_BIT_TCIF1_SHIFT                              (11U)
#define PERI_DMA1_LISR_BIT_TCIF1_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TCIF1_SHIFT)
#define PERI_DMA1_LISR_BIT_FEIF2_SHIFT                              (16U)
#define PERI_DMA1_LISR_BIT_FEIF2_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_FEIF2_SHIFT)
#define PERI_DMA1_LISR_BIT_DMEIF2_SHIFT                             (18U)
#define PERI_DMA1_LISR_BIT_DMEIF2_MASK                              (((1U<<1)-1) << PERI_DMA1_LISR_BIT_DMEIF2_SHIFT)
#define PERI_DMA1_LISR_BIT_TEIF2_SHIFT                              (19U)
#define PERI_DMA1_LISR_BIT_TEIF2_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TEIF2_SHIFT)
#define PERI_DMA1_LISR_BIT_HTIF2_SHIFT                              (20U)
#define PERI_DMA1_LISR_BIT_HTIF2_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_HTIF2_SHIFT)
#define PERI_DMA1_LISR_BIT_TCIF2_SHIFT                              (21U)
#define PERI_DMA1_LISR_BIT_TCIF2_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TCIF2_SHIFT)
#define PERI_DMA1_LISR_BIT_FEIF3_SHIFT                              (22U)
#define PERI_DMA1_LISR_BIT_FEIF3_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_FEIF3_SHIFT)
#define PERI_DMA1_LISR_BIT_DMEIF3_SHIFT                             (24U)
#define PERI_DMA1_LISR_BIT_DMEIF3_MASK                              (((1U<<1)-1) << PERI_DMA1_LISR_BIT_DMEIF3_SHIFT)
#define PERI_DMA1_LISR_BIT_TEIF3_SHIFT                              (25U)
#define PERI_DMA1_LISR_BIT_TEIF3_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TEIF3_SHIFT)
#define PERI_DMA1_LISR_BIT_HTIF3_SHIFT                              (26U)
#define PERI_DMA1_LISR_BIT_HTIF3_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_HTIF3_SHIFT)
#define PERI_DMA1_LISR_BIT_TCIF3_SHIFT                              (27U)
#define PERI_DMA1_LISR_BIT_TCIF3_MASK                               (((1U<<1)-1) << PERI_DMA1_LISR_BIT_TCIF3_SHIFT)

/*--- register HISR -------------------------------------------------*/
#define PERI_DMA1_HISR_BIT_FEIF4_SHIFT                              (0U)
#define PERI_DMA1_HISR_BIT_FEIF4_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_FEIF4_SHIFT)
#define PERI_DMA1_HISR_BIT_DMEIF4_SHIFT                             (2U)
#define PERI_DMA1_HISR_BIT_DMEIF4_MASK                              (((1U<<1)-1) << PERI_DMA1_HISR_BIT_DMEIF4_SHIFT)
#define PERI_DMA1_HISR_BIT_TEIF4_SHIFT                              (3U)
#define PERI_DMA1_HISR_BIT_TEIF4_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TEIF4_SHIFT)
#define PERI_DMA1_HISR_BIT_HTIF4_SHIFT                              (4U)
#define PERI_DMA1_HISR_BIT_HTIF4_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_HTIF4_SHIFT)
#define PERI_DMA1_HISR_BIT_TCIF4_SHIFT                              (5U)
#define PERI_DMA1_HISR_BIT_TCIF4_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TCIF4_SHIFT)
#define PERI_DMA1_HISR_BIT_FEIF5_SHIFT                              (6U)
#define PERI_DMA1_HISR_BIT_FEIF5_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_FEIF5_SHIFT)
#define PERI_DMA1_HISR_BIT_DMEIF5_SHIFT                             (8U)
#define PERI_DMA1_HISR_BIT_DMEIF5_MASK                              (((1U<<1)-1) << PERI_DMA1_HISR_BIT_DMEIF5_SHIFT)
#define PERI_DMA1_HISR_BIT_TEIF5_SHIFT                              (9U)
#define PERI_DMA1_HISR_BIT_TEIF5_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TEIF5_SHIFT)
#define PERI_DMA1_HISR_BIT_HTIF5_SHIFT                              (10U)
#define PERI_DMA1_HISR_BIT_HTIF5_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_HTIF5_SHIFT)
#define PERI_DMA1_HISR_BIT_TCIF5_SHIFT                              (11U)
#define PERI_DMA1_HISR_BIT_TCIF5_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TCIF5_SHIFT)
#define PERI_DMA1_HISR_BIT_FEIF6_SHIFT                              (16U)
#define PERI_DMA1_HISR_BIT_FEIF6_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_FEIF6_SHIFT)
#define PERI_DMA1_HISR_BIT_DMEIF6_SHIFT                             (18U)
#define PERI_DMA1_HISR_BIT_DMEIF6_MASK                              (((1U<<1)-1) << PERI_DMA1_HISR_BIT_DMEIF6_SHIFT)
#define PERI_DMA1_HISR_BIT_TEIF6_SHIFT                              (19U)
#define PERI_DMA1_HISR_BIT_TEIF6_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TEIF6_SHIFT)
#define PERI_DMA1_HISR_BIT_HTIF6_SHIFT                              (20U)
#define PERI_DMA1_HISR_BIT_HTIF6_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_HTIF6_SHIFT)
#define PERI_DMA1_HISR_BIT_TCIF6_SHIFT                              (21U)
#define PERI_DMA1_HISR_BIT_TCIF6_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TCIF6_SHIFT)
#define PERI_DMA1_HISR_BIT_FEIF7_SHIFT                              (22U)
#define PERI_DMA1_HISR_BIT_FEIF7_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_FEIF7_SHIFT)
#define PERI_DMA1_HISR_BIT_DMEIF7_SHIFT                             (24U)
#define PERI_DMA1_HISR_BIT_DMEIF7_MASK                              (((1U<<1)-1) << PERI_DMA1_HISR_BIT_DMEIF7_SHIFT)
#define PERI_DMA1_HISR_BIT_TEIF7_SHIFT                              (25U)
#define PERI_DMA1_HISR_BIT_TEIF7_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TEIF7_SHIFT)
#define PERI_DMA1_HISR_BIT_HTIF7_SHIFT                              (26U)
#define PERI_DMA1_HISR_BIT_HTIF7_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_HTIF7_SHIFT)
#define PERI_DMA1_HISR_BIT_TCIF7_SHIFT                              (27U)
#define PERI_DMA1_HISR_BIT_TCIF7_MASK                               (((1U<<1)-1) << PERI_DMA1_HISR_BIT_TCIF7_SHIFT)

/*--- register LIFCR -------------------------------------------------*/
#define PERI_DMA1_LIFCR_BIT_CFEIF0_SHIFT                            (0U)
#define PERI_DMA1_LIFCR_BIT_CFEIF0_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CFEIF0_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CDMEIF0_SHIFT                           (2U)
#define PERI_DMA1_LIFCR_BIT_CDMEIF0_MASK                            (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CDMEIF0_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTEIF0_SHIFT                            (3U)
#define PERI_DMA1_LIFCR_BIT_CTEIF0_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTEIF0_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CHTIF0_SHIFT                            (4U)
#define PERI_DMA1_LIFCR_BIT_CHTIF0_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CHTIF0_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTCIF0_SHIFT                            (5U)
#define PERI_DMA1_LIFCR_BIT_CTCIF0_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTCIF0_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CFEIF1_SHIFT                            (6U)
#define PERI_DMA1_LIFCR_BIT_CFEIF1_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CFEIF1_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CDMEIF1_SHIFT                           (8U)
#define PERI_DMA1_LIFCR_BIT_CDMEIF1_MASK                            (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CDMEIF1_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTEIF1_SHIFT                            (9U)
#define PERI_DMA1_LIFCR_BIT_CTEIF1_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTEIF1_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CHTIF1_SHIFT                            (10U)
#define PERI_DMA1_LIFCR_BIT_CHTIF1_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CHTIF1_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTCIF1_SHIFT                            (11U)
#define PERI_DMA1_LIFCR_BIT_CTCIF1_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTCIF1_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CFEIF2_SHIFT                            (16U)
#define PERI_DMA1_LIFCR_BIT_CFEIF2_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CFEIF2_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CDMEIF2_SHIFT                           (18U)
#define PERI_DMA1_LIFCR_BIT_CDMEIF2_MASK                            (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CDMEIF2_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTEIF2_SHIFT                            (19U)
#define PERI_DMA1_LIFCR_BIT_CTEIF2_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTEIF2_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CHTIF2_SHIFT                            (20U)
#define PERI_DMA1_LIFCR_BIT_CHTIF2_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CHTIF2_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTCIF2_SHIFT                            (21U)
#define PERI_DMA1_LIFCR_BIT_CTCIF2_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTCIF2_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CFEIF3_SHIFT                            (22U)
#define PERI_DMA1_LIFCR_BIT_CFEIF3_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CFEIF3_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CDMEIF3_SHIFT                           (24U)
#define PERI_DMA1_LIFCR_BIT_CDMEIF3_MASK                            (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CDMEIF3_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTEIF3_SHIFT                            (25U)
#define PERI_DMA1_LIFCR_BIT_CTEIF3_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTEIF3_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CHTIF3_SHIFT                            (26U)
#define PERI_DMA1_LIFCR_BIT_CHTIF3_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CHTIF3_SHIFT)
#define PERI_DMA1_LIFCR_BIT_CTCIF3_SHIFT                            (27U)
#define PERI_DMA1_LIFCR_BIT_CTCIF3_MASK                             (((1U<<1)-1) << PERI_DMA1_LIFCR_BIT_CTCIF3_SHIFT)

/*--- register HIFCR -------------------------------------------------*/
#define PERI_DMA1_HIFCR_BIT_CFEIF4_SHIFT                            (0U)
#define PERI_DMA1_HIFCR_BIT_CFEIF4_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CFEIF4_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CDMEIF4_SHIFT                           (2U)
#define PERI_DMA1_HIFCR_BIT_CDMEIF4_MASK                            (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CDMEIF4_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTEIF4_SHIFT                            (3U)
#define PERI_DMA1_HIFCR_BIT_CTEIF4_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTEIF4_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CHTIF4_SHIFT                            (4U)
#define PERI_DMA1_HIFCR_BIT_CHTIF4_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CHTIF4_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTCIF4_SHIFT                            (5U)
#define PERI_DMA1_HIFCR_BIT_CTCIF4_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTCIF4_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CFEIF5_SHIFT                            (6U)
#define PERI_DMA1_HIFCR_BIT_CFEIF5_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CFEIF5_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CDMEIF5_SHIFT                           (8U)
#define PERI_DMA1_HIFCR_BIT_CDMEIF5_MASK                            (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CDMEIF5_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTEIF5_SHIFT                            (9U)
#define PERI_DMA1_HIFCR_BIT_CTEIF5_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTEIF5_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CHTIF5_SHIFT                            (10U)
#define PERI_DMA1_HIFCR_BIT_CHTIF5_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CHTIF5_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTCIF5_SHIFT                            (11U)
#define PERI_DMA1_HIFCR_BIT_CTCIF5_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTCIF5_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CFEIF6_SHIFT                            (16U)
#define PERI_DMA1_HIFCR_BIT_CFEIF6_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CFEIF6_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CDMEIF6_SHIFT                           (18U)
#define PERI_DMA1_HIFCR_BIT_CDMEIF6_MASK                            (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CDMEIF6_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTEIF6_SHIFT                            (19U)
#define PERI_DMA1_HIFCR_BIT_CTEIF6_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTEIF6_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CHTIF6_SHIFT                            (20U)
#define PERI_DMA1_HIFCR_BIT_CHTIF6_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CHTIF6_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTCIF6_SHIFT                            (21U)
#define PERI_DMA1_HIFCR_BIT_CTCIF6_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTCIF6_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CFEIF7_SHIFT                            (22U)
#define PERI_DMA1_HIFCR_BIT_CFEIF7_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CFEIF7_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CDMEIF7_SHIFT                           (24U)
#define PERI_DMA1_HIFCR_BIT_CDMEIF7_MASK                            (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CDMEIF7_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTEIF7_SHIFT                            (25U)
#define PERI_DMA1_HIFCR_BIT_CTEIF7_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTEIF7_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CHTIF7_SHIFT                            (26U)
#define PERI_DMA1_HIFCR_BIT_CHTIF7_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CHTIF7_SHIFT)
#define PERI_DMA1_HIFCR_BIT_CTCIF7_SHIFT                            (27U)
#define PERI_DMA1_HIFCR_BIT_CTCIF7_MASK                             (((1U<<1)-1) << PERI_DMA1_HIFCR_BIT_CTCIF7_SHIFT)

