minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register S5FCR -------------------------------------------------*/
#define PERI_DMA1_S5FCR_BIT_FTH_SHIFT                               (0U)
#define PERI_DMA1_S5FCR_BIT_FTH_MASK                                (((1U<<2)-1) << PERI_DMA1_S5FCR_BIT_FTH_SHIFT)
#define PERI_DMA1_S5FCR_BIT_DMDIS_SHIFT                             (2U)
#define PERI_DMA1_S5FCR_BIT_DMDIS_MASK                              (((1U<<1)-1) << PERI_DMA1_S5FCR_BIT_DMDIS_SHIFT)
#define PERI_DMA1_S5FCR_BIT_FS_SHIFT                                (3U)
#define PERI_DMA1_S5FCR_BIT_FS_MASK                                 (((1U<<3)-1) << PERI_DMA1_S5FCR_BIT_FS_SHIFT)
#define PERI_DMA1_S5FCR_BIT_FEIE_SHIFT                              (7U)
#define PERI_DMA1_S5FCR_BIT_FEIE_MASK                               (((1U<<1)-1) << PERI_DMA1_S5FCR_BIT_FEIE_SHIFT)

/*--- register S6CR -------------------------------------------------*/
#define PERI_DMA1_S6CR_BIT_EN_SHIFT                                 (0U)
#define PERI_DMA1_S6CR_BIT_EN_MASK                                  (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_EN_SHIFT)
#define PERI_DMA1_S6CR_BIT_DMEIE_SHIFT                              (1U)
#define PERI_DMA1_S6CR_BIT_DMEIE_MASK                               (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_DMEIE_SHIFT)
#define PERI_DMA1_S6CR_BIT_TEIE_SHIFT                               (2U)
#define PERI_DMA1_S6CR_BIT_TEIE_MASK                                (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_TEIE_SHIFT)
#define PERI_DMA1_S6CR_BIT_HTIE_SHIFT                               (3U)
#define PERI_DMA1_S6CR_BIT_HTIE_MASK                                (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_HTIE_SHIFT)
#define PERI_DMA1_S6CR_BIT_TCIE_SHIFT                               (4U)
#define PERI_DMA1_S6CR_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_TCIE_SHIFT)
#define PERI_DMA1_S6CR_BIT_PFCTRL_SHIFT                             (5U)
#define PERI_DMA1_S6CR_BIT_PFCTRL_MASK                              (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_PFCTRL_SHIFT)
#define PERI_DMA1_S6CR_BIT_DIR_SHIFT                                (6U)
#define PERI_DMA1_S6CR_BIT_DIR_MASK                                 (((1U<<2)-1) << PERI_DMA1_S6CR_BIT_DIR_SHIFT)
#define PERI_DMA1_S6CR_BIT_CIRC_SHIFT                               (8U)
#define PERI_DMA1_S6CR_BIT_CIRC_MASK                                (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_CIRC_SHIFT)
#define PERI_DMA1_S6CR_BIT_PINC_SHIFT                               (9U)
#define PERI_DMA1_S6CR_BIT_PINC_MASK                                (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_PINC_SHIFT)
#define PERI_DMA1_S6CR_BIT_MINC_SHIFT                               (10U)
#define PERI_DMA1_S6CR_BIT_MINC_MASK                                (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_MINC_SHIFT)
#define PERI_DMA1_S6CR_BIT_PSIZE_SHIFT                              (11U)
#define PERI_DMA1_S6CR_BIT_PSIZE_MASK                               (((1U<<2)-1) << PERI_DMA1_S6CR_BIT_PSIZE_SHIFT)
#define PERI_DMA1_S6CR_BIT_MSIZE_SHIFT                              (13U)
#define PERI_DMA1_S6CR_BIT_MSIZE_MASK                               (((1U<<2)-1) << PERI_DMA1_S6CR_BIT_MSIZE_SHIFT)
#define PERI_DMA1_S6CR_BIT_PINCOS_SHIFT                             (15U)
#define PERI_DMA1_S6CR_BIT_PINCOS_MASK                              (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_PINCOS_SHIFT)
#define PERI_DMA1_S6CR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA1_S6CR_BIT_PL_MASK                                  (((1U<<2)-1) << PERI_DMA1_S6CR_BIT_PL_SHIFT)
#define PERI_DMA1_S6CR_BIT_DBM_SHIFT                                (18U)
#define PERI_DMA1_S6CR_BIT_DBM_MASK                                 (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_DBM_SHIFT)
#define PERI_DMA1_S6CR_BIT_CT_SHIFT                                 (19U)
#define PERI_DMA1_S6CR_BIT_CT_MASK                                  (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_CT_SHIFT)
#define PERI_DMA1_S6CR_BIT_ACK_SHIFT                                (20U)
#define PERI_DMA1_S6CR_BIT_ACK_MASK                                 (((1U<<1)-1) << PERI_DMA1_S6CR_BIT_ACK_SHIFT)
#define PERI_DMA1_S6CR_BIT_PBURST_SHIFT                             (21U)
#define PERI_DMA1_S6CR_BIT_PBURST_MASK                              (((1U<<2)-1) << PERI_DMA1_S6CR_BIT_PBURST_SHIFT)
#define PERI_DMA1_S6CR_BIT_MBURST_SHIFT                             (23U)
#define PERI_DMA1_S6CR_BIT_MBURST_MASK                              (((1U<<2)-1) << PERI_DMA1_S6CR_BIT_MBURST_SHIFT)

/*--- register S6NDTR -------------------------------------------------*/
#define PERI_DMA1_S6NDTR_BIT_NDT_SHIFT                              (0U)
#define PERI_DMA1_S6NDTR_BIT_NDT_MASK                               (((1U<<16)-1) << PERI_DMA1_S6NDTR_BIT_NDT_SHIFT)

/*--- register S6PAR -------------------------------------------------*/
#define PERI_DMA1_S6PAR_BIT_PA_SHIFT                                (0U)
#define PERI_DMA1_S6PAR_BIT_PA_MASK                                 (((1U<<32)-1) << PERI_DMA1_S6PAR_BIT_PA_SHIFT)

/*--- register S6M0AR -------------------------------------------------*/
#define PERI_DMA1_S6M0AR_BIT_M0A_SHIFT                              (0U)
#define PERI_DMA1_S6M0AR_BIT_M0A_MASK                               (((1U<<32)-1) << PERI_DMA1_S6M0AR_BIT_M0A_SHIFT)

/*--- register S6M1AR -------------------------------------------------*/
#define PERI_DMA1_S6M1AR_BIT_M1A_SHIFT                              (0U)
#define PERI_DMA1_S6M1AR_BIT_M1A_MASK                               (((1U<<32)-1) << PERI_DMA1_S6M1AR_BIT_M1A_SHIFT)

/*--- register S6FCR -------------------------------------------------*/
#define PERI_DMA1_S6FCR_BIT_FTH_SHIFT                               (0U)
#define PERI_DMA1_S6FCR_BIT_FTH_MASK                                (((1U<<2)-1) << PERI_DMA1_S6FCR_BIT_FTH_SHIFT)
#define PERI_DMA1_S6FCR_BIT_DMDIS_SHIFT                             (2U)
#define PERI_DMA1_S6FCR_BIT_DMDIS_MASK                              (((1U<<1)-1) << PERI_DMA1_S6FCR_BIT_DMDIS_SHIFT)
#define PERI_DMA1_S6FCR_BIT_FS_SHIFT                                (3U)
#define PERI_DMA1_S6FCR_BIT_FS_MASK                                 (((1U<<3)-1) << PERI_DMA1_S6FCR_BIT_FS_SHIFT)
#define PERI_DMA1_S6FCR_BIT_FEIE_SHIFT                              (7U)
#define PERI_DMA1_S6FCR_BIT_FEIE_MASK                               (((1U<<1)-1) << PERI_DMA1_S6FCR_BIT_FEIE_SHIFT)

/*--- register S7CR -------------------------------------------------*/
#define PERI_DMA1_S7CR_BIT_EN_SHIFT                                 (0U)
#define PERI_DMA1_S7CR_BIT_EN_MASK                                  (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_EN_SHIFT)
#define PERI_DMA1_S7CR_BIT_DMEIE_SHIFT                              (1U)
#define PERI_DMA1_S7CR_BIT_DMEIE_MASK                               (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_DMEIE_SHIFT)
#define PERI_DMA1_S7CR_BIT_TEIE_SHIFT                               (2U)
#define PERI_DMA1_S7CR_BIT_TEIE_MASK                                (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_TEIE_SHIFT)
#define PERI_DMA1_S7CR_BIT_HTIE_SHIFT                               (3U)
#define PERI_DMA1_S7CR_BIT_HTIE_MASK                                (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_HTIE_SHIFT)
#define PERI_DMA1_S7CR_BIT_TCIE_SHIFT                               (4U)
#define PERI_DMA1_S7CR_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_TCIE_SHIFT)
#define PERI_DMA1_S7CR_BIT_PFCTRL_SHIFT                             (5U)
#define PERI_DMA1_S7CR_BIT_PFCTRL_MASK                              (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_PFCTRL_SHIFT)
#define PERI_DMA1_S7CR_BIT_DIR_SHIFT                                (6U)
#define PERI_DMA1_S7CR_BIT_DIR_MASK                                 (((1U<<2)-1) << PERI_DMA1_S7CR_BIT_DIR_SHIFT)
#define PERI_DMA1_S7CR_BIT_CIRC_SHIFT                               (8U)
#define PERI_DMA1_S7CR_BIT_CIRC_MASK                                (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_CIRC_SHIFT)
#define PERI_DMA1_S7CR_BIT_PINC_SHIFT                               (9U)
#define PERI_DMA1_S7CR_BIT_PINC_MASK                                (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_PINC_SHIFT)
#define PERI_DMA1_S7CR_BIT_MINC_SHIFT                               (10U)
#define PERI_DMA1_S7CR_BIT_MINC_MASK                                (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_MINC_SHIFT)
#define PERI_DMA1_S7CR_BIT_PSIZE_SHIFT                              (11U)
#define PERI_DMA1_S7CR_BIT_PSIZE_MASK                               (((1U<<2)-1) << PERI_DMA1_S7CR_BIT_PSIZE_SHIFT)
#define PERI_DMA1_S7CR_BIT_MSIZE_SHIFT                              (13U)
#define PERI_DMA1_S7CR_BIT_MSIZE_MASK                               (((1U<<2)-1) << PERI_DMA1_S7CR_BIT_MSIZE_SHIFT)
#define PERI_DMA1_S7CR_BIT_PINCOS_SHIFT                             (15U)
#define PERI_DMA1_S7CR_BIT_PINCOS_MASK                              (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_PINCOS_SHIFT)
#define PERI_DMA1_S7CR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA1_S7CR_BIT_PL_MASK                                  (((1U<<2)-1) << PERI_DMA1_S7CR_BIT_PL_SHIFT)
#define PERI_DMA1_S7CR_BIT_DBM_SHIFT                                (18U)
#define PERI_DMA1_S7CR_BIT_DBM_MASK                                 (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_DBM_SHIFT)
#define PERI_DMA1_S7CR_BIT_CT_SHIFT                                 (19U)
#define PERI_DMA1_S7CR_BIT_CT_MASK                                  (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_CT_SHIFT)
#define PERI_DMA1_S7CR_BIT_ACK_SHIFT                                (20U)
#define PERI_DMA1_S7CR_BIT_ACK_MASK                                 (((1U<<1)-1) << PERI_DMA1_S7CR_BIT_ACK_SHIFT)
#define PERI_DMA1_S7CR_BIT_PBURST_SHIFT                             (21U)
#define PERI_DMA1_S7CR_BIT_PBURST_MASK                              (((1U<<2)-1) << PERI_DMA1_S7CR_BIT_PBURST_SHIFT)
#define PERI_DMA1_S7CR_BIT_MBURST_SHIFT                             (23U)
#define PERI_DMA1_S7CR_BIT_MBURST_MASK                              (((1U<<2)-1) << PERI_DMA1_S7CR_BIT_MBURST_SHIFT)

/*--- register S7NDTR -------------------------------------------------*/
#define PERI_DMA1_S7NDTR_BIT_NDT_SHIFT                              (0U)
#define PERI_DMA1_S7NDTR_BIT_NDT_MASK                               (((1U<<16)-1) << PERI_DMA1_S7NDTR_BIT_NDT_SHIFT)

/*--- register S7PAR -------------------------------------------------*/
#define PERI_DMA1_S7PAR_BIT_PA_SHIFT                                (0U)
#define PERI_DMA1_S7PAR_BIT_PA_MASK                                 (((1U<<32)-1) << PERI_DMA1_S7PAR_BIT_PA_SHIFT)

/*--- register S7M0AR -------------------------------------------------*/
#define PERI_DMA1_S7M0AR_BIT_M0A_SHIFT                              (0U)
#define PERI_DMA1_S7M0AR_BIT_M0A_MASK                               (((1U<<32)-1) << PERI_DMA1_S7M0AR_BIT_M0A_SHIFT)

/*--- register S7M1AR -------------------------------------------------*/
#define PERI_DMA1_S7M1AR_BIT_M1A_SHIFT                              (0U)
#define PERI_DMA1_S7M1AR_BIT_M1A_MASK                               (((1U<<32)-1) << PERI_DMA1_S7M1AR_BIT_M1A_SHIFT)

/*--- register S7FCR -------------------------------------------------*/
#define PERI_DMA1_S7FCR_BIT_FTH_SHIFT                               (0U)
#define PERI_DMA1_S7FCR_BIT_FTH_MASK                                (((1U<<2)-1) << PERI_DMA1_S7FCR_BIT_FTH_SHIFT)
#define PERI_DMA1_S7FCR_BIT_DMDIS_SHIFT                             (2U)
#define PERI_DMA1_S7FCR_BIT_DMDIS_MASK                              (((1U<<1)-1) << PERI_DMA1_S7FCR_BIT_DMDIS_SHIFT)
#define PERI_DMA1_S7FCR_BIT_FS_SHIFT                                (3U)
#define PERI_DMA1_S7FCR_BIT_FS_MASK                                 (((1U<<3)-1) << PERI_DMA1_S7FCR_BIT_FS_SHIFT)
#define PERI_DMA1_S7FCR_BIT_FEIE_SHIFT                              (7U)
#define PERI_DMA1_S7FCR_BIT_FEIE_MASK                               (((1U<<1)-1) << PERI_DMA1_S7FCR_BIT_FEIE_SHIFT)

/*--- register LISR -------------------------------------------------*/
#define PERI_DMA2_LISR_BIT_FEIF0_SHIFT                              (0U)
#define PERI_DMA2_LISR_BIT_FEIF0_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_FEIF0_SHIFT)
#define PERI_DMA2_LISR_BIT_DMEIF0_SHIFT                             (2U)
#define PERI_DMA2_LISR_BIT_DMEIF0_MASK                              (((1U<<1)-1) << PERI_DMA2_LISR_BIT_DMEIF0_SHIFT)
#define PERI_DMA2_LISR_BIT_TEIF0_SHIFT                              (3U)
#define PERI_DMA2_LISR_BIT_TEIF0_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TEIF0_SHIFT)
#define PERI_DMA2_LISR_BIT_HTIF0_SHIFT                              (4U)
#define PERI_DMA2_LISR_BIT_HTIF0_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_HTIF0_SHIFT)
#define PERI_DMA2_LISR_BIT_TCIF0_SHIFT                              (5U)
#define PERI_DMA2_LISR_BIT_TCIF0_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TCIF0_SHIFT)
#define PERI_DMA2_LISR_BIT_FEIF1_SHIFT                              (6U)
#define PERI_DMA2_LISR_BIT_FEIF1_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_FEIF1_SHIFT)
#define PERI_DMA2_LISR_BIT_DMEIF1_SHIFT                             (8U)
#define PERI_DMA2_LISR_BIT_DMEIF1_MASK                              (((1U<<1)-1) << PERI_DMA2_LISR_BIT_DMEIF1_SHIFT)
#define PERI_DMA2_LISR_BIT_TEIF1_SHIFT                              (9U)
#define PERI_DMA2_LISR_BIT_TEIF1_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TEIF1_SHIFT)
#define PERI_DMA2_LISR_BIT_HTIF1_SHIFT                              (10U)
#define PERI_DMA2_LISR_BIT_HTIF1_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_HTIF1_SHIFT)
#define PERI_DMA2_LISR_BIT_TCIF1_SHIFT                              (11U)
#define PERI_DMA2_LISR_BIT_TCIF1_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TCIF1_SHIFT)
#define PERI_DMA2_LISR_BIT_FEIF2_SHIFT                              (16U)
#define PERI_DMA2_LISR_BIT_FEIF2_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_FEIF2_SHIFT)
#define PERI_DMA2_LISR_BIT_DMEIF2_SHIFT                             (18U)
#define PERI_DMA2_LISR_BIT_DMEIF2_MASK                              (((1U<<1)-1) << PERI_DMA2_LISR_BIT_DMEIF2_SHIFT)
#define PERI_DMA2_LISR_BIT_TEIF2_SHIFT                              (19U)
#define PERI_DMA2_LISR_BIT_TEIF2_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TEIF2_SHIFT)
#define PERI_DMA2_LISR_BIT_HTIF2_SHIFT                              (20U)
#define PERI_DMA2_LISR_BIT_HTIF2_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_HTIF2_SHIFT)
#define PERI_DMA2_LISR_BIT_TCIF2_SHIFT                              (21U)
#define PERI_DMA2_LISR_BIT_TCIF2_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TCIF2_SHIFT)
#define PERI_DMA2_LISR_BIT_FEIF3_SHIFT                              (22U)
#define PERI_DMA2_LISR_BIT_FEIF3_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_FEIF3_SHIFT)
#define PERI_DMA2_LISR_BIT_DMEIF3_SHIFT                             (24U)
#define PERI_DMA2_LISR_BIT_DMEIF3_MASK                              (((1U<<1)-1) << PERI_DMA2_LISR_BIT_DMEIF3_SHIFT)
#define PERI_DMA2_LISR_BIT_TEIF3_SHIFT                              (25U)
#define PERI_DMA2_LISR_BIT_TEIF3_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TEIF3_SHIFT)
#define PERI_DMA2_LISR_BIT_HTIF3_SHIFT                              (26U)
#define PERI_DMA2_LISR_BIT_HTIF3_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_HTIF3_SHIFT)
#define PERI_DMA2_LISR_BIT_TCIF3_SHIFT                              (27U)
#define PERI_DMA2_LISR_BIT_TCIF3_MASK                               (((1U<<1)-1) << PERI_DMA2_LISR_BIT_TCIF3_SHIFT)

/*--- register HISR -------------------------------------------------*/
#define PERI_DMA2_HISR_BIT_FEIF4_SHIFT                              (0U)
#define PERI_DMA2_HISR_BIT_FEIF4_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_FEIF4_SHIFT)
#define PERI_DMA2_HISR_BIT_DMEIF4_SHIFT                             (2U)
#define PERI_DMA2_HISR_BIT_DMEIF4_MASK                              (((1U<<1)-1) << PERI_DMA2_HISR_BIT_DMEIF4_SHIFT)
#define PERI_DMA2_HISR_BIT_TEIF4_SHIFT                              (3U)
#define PERI_DMA2_HISR_BIT_TEIF4_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TEIF4_SHIFT)
#define PERI_DMA2_HISR_BIT_HTIF4_SHIFT                              (4U)
#define PERI_DMA2_HISR_BIT_HTIF4_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_HTIF4_SHIFT)
#define PERI_DMA2_HISR_BIT_TCIF4_SHIFT                              (5U)
#define PERI_DMA2_HISR_BIT_TCIF4_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TCIF4_SHIFT)
#define PERI_DMA2_HISR_BIT_FEIF5_SHIFT                              (6U)
#define PERI_DMA2_HISR_BIT_FEIF5_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_FEIF5_SHIFT)
#define PERI_DMA2_HISR_BIT_DMEIF5_SHIFT                             (8U)
#define PERI_DMA2_HISR_BIT_DMEIF5_MASK                              (((1U<<1)-1) << PERI_DMA2_HISR_BIT_DMEIF5_SHIFT)
#define PERI_DMA2_HISR_BIT_TEIF5_SHIFT                              (9U)
#define PERI_DMA2_HISR_BIT_TEIF5_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TEIF5_SHIFT)
#define PERI_DMA2_HISR_BIT_HTIF5_SHIFT                              (10U)
#define PERI_DMA2_HISR_BIT_HTIF5_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_HTIF5_SHIFT)
#define PERI_DMA2_HISR_BIT_TCIF5_SHIFT                              (11U)
#define PERI_DMA2_HISR_BIT_TCIF5_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TCIF5_SHIFT)
#define PERI_DMA2_HISR_BIT_FEIF6_SHIFT                              (16U)
#define PERI_DMA2_HISR_BIT_FEIF6_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_FEIF6_SHIFT)
#define PERI_DMA2_HISR_BIT_DMEIF6_SHIFT                             (18U)
#define PERI_DMA2_HISR_BIT_DMEIF6_MASK                              (((1U<<1)-1) << PERI_DMA2_HISR_BIT_DMEIF6_SHIFT)
#define PERI_DMA2_HISR_BIT_TEIF6_SHIFT                              (19U)
#define PERI_DMA2_HISR_BIT_TEIF6_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TEIF6_SHIFT)
#define PERI_DMA2_HISR_BIT_HTIF6_SHIFT                              (20U)
#define PERI_DMA2_HISR_BIT_HTIF6_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_HTIF6_SHIFT)
#define PERI_DMA2_HISR_BIT_TCIF6_SHIFT                              (21U)
#define PERI_DMA2_HISR_BIT_TCIF6_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TCIF6_SHIFT)
#define PERI_DMA2_HISR_BIT_FEIF7_SHIFT                              (22U)
#define PERI_DMA2_HISR_BIT_FEIF7_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_FEIF7_SHIFT)
#define PERI_DMA2_HISR_BIT_DMEIF7_SHIFT                             (24U)
#define PERI_DMA2_HISR_BIT_DMEIF7_MASK                              (((1U<<1)-1) << PERI_DMA2_HISR_BIT_DMEIF7_SHIFT)
#define PERI_DMA2_HISR_BIT_TEIF7_SHIFT                              (25U)
#define PERI_DMA2_HISR_BIT_TEIF7_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TEIF7_SHIFT)
#define PERI_DMA2_HISR_BIT_HTIF7_SHIFT                              (26U)
#define PERI_DMA2_HISR_BIT_HTIF7_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_HTIF7_SHIFT)
#define PERI_DMA2_HISR_BIT_TCIF7_SHIFT                              (27U)
#define PERI_DMA2_HISR_BIT_TCIF7_MASK                               (((1U<<1)-1) << PERI_DMA2_HISR_BIT_TCIF7_SHIFT)

/*--- register LIFCR -------------------------------------------------*/
#define PERI_DMA2_LIFCR_BIT_CFEIF0_SHIFT                            (0U)
#define PERI_DMA2_LIFCR_BIT_CFEIF0_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CFEIF0_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CDMEIF0_SHIFT                           (2U)
#define PERI_DMA2_LIFCR_BIT_CDMEIF0_MASK                            (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CDMEIF0_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTEIF0_SHIFT                            (3U)
#define PERI_DMA2_LIFCR_BIT_CTEIF0_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTEIF0_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CHTIF0_SHIFT                            (4U)
#define PERI_DMA2_LIFCR_BIT_CHTIF0_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CHTIF0_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTCIF0_SHIFT                            (5U)
#define PERI_DMA2_LIFCR_BIT_CTCIF0_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTCIF0_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CFEIF1_SHIFT                            (6U)
#define PERI_DMA2_LIFCR_BIT_CFEIF1_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CFEIF1_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CDMEIF1_SHIFT                           (8U)
#define PERI_DMA2_LIFCR_BIT_CDMEIF1_MASK                            (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CDMEIF1_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTEIF1_SHIFT                            (9U)
#define PERI_DMA2_LIFCR_BIT_CTEIF1_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTEIF1_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CHTIF1_SHIFT                            (10U)
#define PERI_DMA2_LIFCR_BIT_CHTIF1_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CHTIF1_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTCIF1_SHIFT                            (11U)
#define PERI_DMA2_LIFCR_BIT_CTCIF1_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTCIF1_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CFEIF2_SHIFT                            (16U)
#define PERI_DMA2_LIFCR_BIT_CFEIF2_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CFEIF2_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CDMEIF2_SHIFT                           (18U)
#define PERI_DMA2_LIFCR_BIT_CDMEIF2_MASK                            (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CDMEIF2_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTEIF2_SHIFT                            (19U)
#define PERI_DMA2_LIFCR_BIT_CTEIF2_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTEIF2_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CHTIF2_SHIFT                            (20U)
#define PERI_DMA2_LIFCR_BIT_CHTIF2_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CHTIF2_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTCIF2_SHIFT                            (21U)
#define PERI_DMA2_LIFCR_BIT_CTCIF2_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTCIF2_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CFEIF3_SHIFT                            (22U)
#define PERI_DMA2_LIFCR_BIT_CFEIF3_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CFEIF3_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CDMEIF3_SHIFT                           (24U)
#define PERI_DMA2_LIFCR_BIT_CDMEIF3_MASK                            (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CDMEIF3_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTEIF3_SHIFT                            (25U)
#define PERI_DMA2_LIFCR_BIT_CTEIF3_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTEIF3_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CHTIF3_SHIFT                            (26U)
#define PERI_DMA2_LIFCR_BIT_CHTIF3_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CHTIF3_SHIFT)
#define PERI_DMA2_LIFCR_BIT_CTCIF3_SHIFT                            (27U)
#define PERI_DMA2_LIFCR_BIT_CTCIF3_MASK                             (((1U<<1)-1) << PERI_DMA2_LIFCR_BIT_CTCIF3_SHIFT)

