minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register HIFCR -------------------------------------------------*/
#define PERI_DMA2_HIFCR_BIT_CFEIF4_SHIFT                            (0U)
#define PERI_DMA2_HIFCR_BIT_CFEIF4_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CFEIF4_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CDMEIF4_SHIFT                           (2U)
#define PERI_DMA2_HIFCR_BIT_CDMEIF4_MASK                            (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CDMEIF4_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTEIF4_SHIFT                            (3U)
#define PERI_DMA2_HIFCR_BIT_CTEIF4_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTEIF4_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CHTIF4_SHIFT                            (4U)
#define PERI_DMA2_HIFCR_BIT_CHTIF4_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CHTIF4_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTCIF4_SHIFT                            (5U)
#define PERI_DMA2_HIFCR_BIT_CTCIF4_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTCIF4_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CFEIF5_SHIFT                            (6U)
#define PERI_DMA2_HIFCR_BIT_CFEIF5_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CFEIF5_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CDMEIF5_SHIFT                           (8U)
#define PERI_DMA2_HIFCR_BIT_CDMEIF5_MASK                            (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CDMEIF5_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTEIF5_SHIFT                            (9U)
#define PERI_DMA2_HIFCR_BIT_CTEIF5_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTEIF5_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CHTIF5_SHIFT                            (10U)
#define PERI_DMA2_HIFCR_BIT_CHTIF5_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CHTIF5_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTCIF5_SHIFT                            (11U)
#define PERI_DMA2_HIFCR_BIT_CTCIF5_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTCIF5_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CFEIF6_SHIFT                            (16U)
#define PERI_DMA2_HIFCR_BIT_CFEIF6_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CFEIF6_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CDMEIF6_SHIFT                           (18U)
#define PERI_DMA2_HIFCR_BIT_CDMEIF6_MASK                            (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CDMEIF6_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTEIF6_SHIFT                            (19U)
#define PERI_DMA2_HIFCR_BIT_CTEIF6_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTEIF6_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CHTIF6_SHIFT                            (20U)
#define PERI_DMA2_HIFCR_BIT_CHTIF6_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CHTIF6_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTCIF6_SHIFT                            (21U)
#define PERI_DMA2_HIFCR_BIT_CTCIF6_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTCIF6_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CFEIF7_SHIFT                            (22U)
#define PERI_DMA2_HIFCR_BIT_CFEIF7_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CFEIF7_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CDMEIF7_SHIFT                           (24U)
#define PERI_DMA2_HIFCR_BIT_CDMEIF7_MASK                            (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CDMEIF7_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTEIF7_SHIFT                            (25U)
#define PERI_DMA2_HIFCR_BIT_CTEIF7_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTEIF7_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CHTIF7_SHIFT                            (26U)
#define PERI_DMA2_HIFCR_BIT_CHTIF7_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CHTIF7_SHIFT)
#define PERI_DMA2_HIFCR_BIT_CTCIF7_SHIFT                            (27U)
#define PERI_DMA2_HIFCR_BIT_CTCIF7_MASK                             (((1U<<1)-1) << PERI_DMA2_HIFCR_BIT_CTCIF7_SHIFT)

/*--- register S0CR -------------------------------------------------*/
#define PERI_DMA2_S0CR_BIT_EN_SHIFT                                 (0U)
#define PERI_DMA2_S0CR_BIT_EN_MASK                                  (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_EN_SHIFT)
#define PERI_DMA2_S0CR_BIT_DMEIE_SHIFT                              (1U)
#define PERI_DMA2_S0CR_BIT_DMEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_DMEIE_SHIFT)
#define PERI_DMA2_S0CR_BIT_TEIE_SHIFT                               (2U)
#define PERI_DMA2_S0CR_BIT_TEIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_TEIE_SHIFT)
#define PERI_DMA2_S0CR_BIT_HTIE_SHIFT                               (3U)
#define PERI_DMA2_S0CR_BIT_HTIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_HTIE_SHIFT)
#define PERI_DMA2_S0CR_BIT_TCIE_SHIFT                               (4U)
#define PERI_DMA2_S0CR_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_TCIE_SHIFT)
#define PERI_DMA2_S0CR_BIT_PFCTRL_SHIFT                             (5U)
#define PERI_DMA2_S0CR_BIT_PFCTRL_MASK                              (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_PFCTRL_SHIFT)
#define PERI_DMA2_S0CR_BIT_DIR_SHIFT                                (6U)
#define PERI_DMA2_S0CR_BIT_DIR_MASK                                 (((1U<<2)-1) << PERI_DMA2_S0CR_BIT_DIR_SHIFT)
#define PERI_DMA2_S0CR_BIT_CIRC_SHIFT                               (8U)
#define PERI_DMA2_S0CR_BIT_CIRC_MASK                                (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_CIRC_SHIFT)
#define PERI_DMA2_S0CR_BIT_PINC_SHIFT                               (9U)
#define PERI_DMA2_S0CR_BIT_PINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_PINC_SHIFT)
#define PERI_DMA2_S0CR_BIT_MINC_SHIFT                               (10U)
#define PERI_DMA2_S0CR_BIT_MINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_MINC_SHIFT)
#define PERI_DMA2_S0CR_BIT_PSIZE_SHIFT                              (11U)
#define PERI_DMA2_S0CR_BIT_PSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S0CR_BIT_PSIZE_SHIFT)
#define PERI_DMA2_S0CR_BIT_MSIZE_SHIFT                              (13U)
#define PERI_DMA2_S0CR_BIT_MSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S0CR_BIT_MSIZE_SHIFT)
#define PERI_DMA2_S0CR_BIT_PINCOS_SHIFT                             (15U)
#define PERI_DMA2_S0CR_BIT_PINCOS_MASK                              (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_PINCOS_SHIFT)
#define PERI_DMA2_S0CR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA2_S0CR_BIT_PL_MASK                                  (((1U<<2)-1) << PERI_DMA2_S0CR_BIT_PL_SHIFT)
#define PERI_DMA2_S0CR_BIT_DBM_SHIFT                                (18U)
#define PERI_DMA2_S0CR_BIT_DBM_MASK                                 (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_DBM_SHIFT)
#define PERI_DMA2_S0CR_BIT_CT_SHIFT                                 (19U)
#define PERI_DMA2_S0CR_BIT_CT_MASK                                  (((1U<<1)-1) << PERI_DMA2_S0CR_BIT_CT_SHIFT)
#define PERI_DMA2_S0CR_BIT_PBURST_SHIFT                             (21U)
#define PERI_DMA2_S0CR_BIT_PBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S0CR_BIT_PBURST_SHIFT)
#define PERI_DMA2_S0CR_BIT_MBURST_SHIFT                             (23U)
#define PERI_DMA2_S0CR_BIT_MBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S0CR_BIT_MBURST_SHIFT)

/*--- register S0NDTR -------------------------------------------------*/
#define PERI_DMA2_S0NDTR_BIT_NDT_SHIFT                              (0U)
#define PERI_DMA2_S0NDTR_BIT_NDT_MASK                               (((1U<<16)-1) << PERI_DMA2_S0NDTR_BIT_NDT_SHIFT)

