minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register S1FCR -------------------------------------------------*/
#define PERI_DMA2_S1FCR_BIT_FTH_SHIFT                               (0U)
#define PERI_DMA2_S1FCR_BIT_FTH_MASK                                (((1U<<2)-1) << PERI_DMA2_S1FCR_BIT_FTH_SHIFT)
#define PERI_DMA2_S1FCR_BIT_DMDIS_SHIFT                             (2U)
#define PERI_DMA2_S1FCR_BIT_DMDIS_MASK                              (((1U<<1)-1) << PERI_DMA2_S1FCR_BIT_DMDIS_SHIFT)
#define PERI_DMA2_S1FCR_BIT_FS_SHIFT                                (3U)
#define PERI_DMA2_S1FCR_BIT_FS_MASK                                 (((1U<<3)-1) << PERI_DMA2_S1FCR_BIT_FS_SHIFT)
#define PERI_DMA2_S1FCR_BIT_FEIE_SHIFT                              (7U)
#define PERI_DMA2_S1FCR_BIT_FEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S1FCR_BIT_FEIE_SHIFT)

/*--- register S2CR -------------------------------------------------*/
#define PERI_DMA2_S2CR_BIT_EN_SHIFT                                 (0U)
#define PERI_DMA2_S2CR_BIT_EN_MASK                                  (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_EN_SHIFT)
#define PERI_DMA2_S2CR_BIT_DMEIE_SHIFT                              (1U)
#define PERI_DMA2_S2CR_BIT_DMEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_DMEIE_SHIFT)
#define PERI_DMA2_S2CR_BIT_TEIE_SHIFT                               (2U)
#define PERI_DMA2_S2CR_BIT_TEIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_TEIE_SHIFT)
#define PERI_DMA2_S2CR_BIT_HTIE_SHIFT                               (3U)
#define PERI_DMA2_S2CR_BIT_HTIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_HTIE_SHIFT)
#define PERI_DMA2_S2CR_BIT_TCIE_SHIFT                               (4U)
#define PERI_DMA2_S2CR_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_TCIE_SHIFT)
#define PERI_DMA2_S2CR_BIT_PFCTRL_SHIFT                             (5U)
#define PERI_DMA2_S2CR_BIT_PFCTRL_MASK                              (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_PFCTRL_SHIFT)
#define PERI_DMA2_S2CR_BIT_DIR_SHIFT                                (6U)
#define PERI_DMA2_S2CR_BIT_DIR_MASK                                 (((1U<<2)-1) << PERI_DMA2_S2CR_BIT_DIR_SHIFT)
#define PERI_DMA2_S2CR_BIT_CIRC_SHIFT                               (8U)
#define PERI_DMA2_S2CR_BIT_CIRC_MASK                                (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_CIRC_SHIFT)
#define PERI_DMA2_S2CR_BIT_PINC_SHIFT                               (9U)
#define PERI_DMA2_S2CR_BIT_PINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_PINC_SHIFT)
#define PERI_DMA2_S2CR_BIT_MINC_SHIFT                               (10U)
#define PERI_DMA2_S2CR_BIT_MINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_MINC_SHIFT)
#define PERI_DMA2_S2CR_BIT_PSIZE_SHIFT                              (11U)
#define PERI_DMA2_S2CR_BIT_PSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S2CR_BIT_PSIZE_SHIFT)
#define PERI_DMA2_S2CR_BIT_MSIZE_SHIFT                              (13U)
#define PERI_DMA2_S2CR_BIT_MSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S2CR_BIT_MSIZE_SHIFT)
#define PERI_DMA2_S2CR_BIT_PINCOS_SHIFT                             (15U)
#define PERI_DMA2_S2CR_BIT_PINCOS_MASK                              (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_PINCOS_SHIFT)
#define PERI_DMA2_S2CR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA2_S2CR_BIT_PL_MASK                                  (((1U<<2)-1) << PERI_DMA2_S2CR_BIT_PL_SHIFT)
#define PERI_DMA2_S2CR_BIT_DBM_SHIFT                                (18U)
#define PERI_DMA2_S2CR_BIT_DBM_MASK                                 (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_DBM_SHIFT)
#define PERI_DMA2_S2CR_BIT_CT_SHIFT                                 (19U)
#define PERI_DMA2_S2CR_BIT_CT_MASK                                  (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_CT_SHIFT)
#define PERI_DMA2_S2CR_BIT_ACK_SHIFT                                (20U)
#define PERI_DMA2_S2CR_BIT_ACK_MASK                                 (((1U<<1)-1) << PERI_DMA2_S2CR_BIT_ACK_SHIFT)
#define PERI_DMA2_S2CR_BIT_PBURST_SHIFT                             (21U)
#define PERI_DMA2_S2CR_BIT_PBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S2CR_BIT_PBURST_SHIFT)
#define PERI_DMA2_S2CR_BIT_MBURST_SHIFT                             (23U)
#define PERI_DMA2_S2CR_BIT_MBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S2CR_BIT_MBURST_SHIFT)

/*--- register S2NDTR -------------------------------------------------*/
#define PERI_DMA2_S2NDTR_BIT_NDT_SHIFT                              (0U)
#define PERI_DMA2_S2NDTR_BIT_NDT_MASK                               (((1U<<16)-1) << PERI_DMA2_S2NDTR_BIT_NDT_SHIFT)

/*--- register S2PAR -------------------------------------------------*/
#define PERI_DMA2_S2PAR_BIT_PA_SHIFT                                (0U)
#define PERI_DMA2_S2PAR_BIT_PA_MASK                                 (((1U<<32)-1) << PERI_DMA2_S2PAR_BIT_PA_SHIFT)

/*--- register S2M0AR -------------------------------------------------*/
#define PERI_DMA2_S2M0AR_BIT_M0A_SHIFT                              (0U)
#define PERI_DMA2_S2M0AR_BIT_M0A_MASK                               (((1U<<32)-1) << PERI_DMA2_S2M0AR_BIT_M0A_SHIFT)

/*--- register S2M1AR -------------------------------------------------*/
#define PERI_DMA2_S2M1AR_BIT_M1A_SHIFT                              (0U)
#define PERI_DMA2_S2M1AR_BIT_M1A_MASK                               (((1U<<32)-1) << PERI_DMA2_S2M1AR_BIT_M1A_SHIFT)

/*--- register S2FCR -------------------------------------------------*/
#define PERI_DMA2_S2FCR_BIT_FTH_SHIFT                               (0U)
#define PERI_DMA2_S2FCR_BIT_FTH_MASK                                (((1U<<2)-1) << PERI_DMA2_S2FCR_BIT_FTH_SHIFT)
#define PERI_DMA2_S2FCR_BIT_DMDIS_SHIFT                             (2U)
#define PERI_DMA2_S2FCR_BIT_DMDIS_MASK                              (((1U<<1)-1) << PERI_DMA2_S2FCR_BIT_DMDIS_SHIFT)
#define PERI_DMA2_S2FCR_BIT_FS_SHIFT                                (3U)
#define PERI_DMA2_S2FCR_BIT_FS_MASK                                 (((1U<<3)-1) << PERI_DMA2_S2FCR_BIT_FS_SHIFT)
#define PERI_DMA2_S2FCR_BIT_FEIE_SHIFT                              (7U)
#define PERI_DMA2_S2FCR_BIT_FEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S2FCR_BIT_FEIE_SHIFT)

/*--- register S3CR -------------------------------------------------*/
#define PERI_DMA2_S3CR_BIT_EN_SHIFT                                 (0U)
#define PERI_DMA2_S3CR_BIT_EN_MASK                                  (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_EN_SHIFT)
#define PERI_DMA2_S3CR_BIT_DMEIE_SHIFT                              (1U)
#define PERI_DMA2_S3CR_BIT_DMEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_DMEIE_SHIFT)
#define PERI_DMA2_S3CR_BIT_TEIE_SHIFT                               (2U)
#define PERI_DMA2_S3CR_BIT_TEIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_TEIE_SHIFT)
#define PERI_DMA2_S3CR_BIT_HTIE_SHIFT                               (3U)
#define PERI_DMA2_S3CR_BIT_HTIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_HTIE_SHIFT)
#define PERI_DMA2_S3CR_BIT_TCIE_SHIFT                               (4U)
#define PERI_DMA2_S3CR_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_TCIE_SHIFT)
#define PERI_DMA2_S3CR_BIT_PFCTRL_SHIFT                             (5U)
#define PERI_DMA2_S3CR_BIT_PFCTRL_MASK                              (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_PFCTRL_SHIFT)
#define PERI_DMA2_S3CR_BIT_DIR_SHIFT                                (6U)
#define PERI_DMA2_S3CR_BIT_DIR_MASK                                 (((1U<<2)-1) << PERI_DMA2_S3CR_BIT_DIR_SHIFT)
#define PERI_DMA2_S3CR_BIT_CIRC_SHIFT                               (8U)
#define PERI_DMA2_S3CR_BIT_CIRC_MASK                                (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_CIRC_SHIFT)
#define PERI_DMA2_S3CR_BIT_PINC_SHIFT                               (9U)
#define PERI_DMA2_S3CR_BIT_PINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_PINC_SHIFT)
#define PERI_DMA2_S3CR_BIT_MINC_SHIFT                               (10U)
#define PERI_DMA2_S3CR_BIT_MINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_MINC_SHIFT)
#define PERI_DMA2_S3CR_BIT_PSIZE_SHIFT                              (11U)
#define PERI_DMA2_S3CR_BIT_PSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S3CR_BIT_PSIZE_SHIFT)
#define PERI_DMA2_S3CR_BIT_MSIZE_SHIFT                              (13U)
#define PERI_DMA2_S3CR_BIT_MSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S3CR_BIT_MSIZE_SHIFT)
#define PERI_DMA2_S3CR_BIT_PINCOS_SHIFT                             (15U)
#define PERI_DMA2_S3CR_BIT_PINCOS_MASK                              (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_PINCOS_SHIFT)
#define PERI_DMA2_S3CR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA2_S3CR_BIT_PL_MASK                                  (((1U<<2)-1) << PERI_DMA2_S3CR_BIT_PL_SHIFT)
#define PERI_DMA2_S3CR_BIT_DBM_SHIFT                                (18U)
#define PERI_DMA2_S3CR_BIT_DBM_MASK                                 (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_DBM_SHIFT)
#define PERI_DMA2_S3CR_BIT_CT_SHIFT                                 (19U)
#define PERI_DMA2_S3CR_BIT_CT_MASK                                  (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_CT_SHIFT)
#define PERI_DMA2_S3CR_BIT_ACK_SHIFT                                (20U)
#define PERI_DMA2_S3CR_BIT_ACK_MASK                                 (((1U<<1)-1) << PERI_DMA2_S3CR_BIT_ACK_SHIFT)
#define PERI_DMA2_S3CR_BIT_PBURST_SHIFT                             (21U)
#define PERI_DMA2_S3CR_BIT_PBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S3CR_BIT_PBURST_SHIFT)
#define PERI_DMA2_S3CR_BIT_MBURST_SHIFT                             (23U)
#define PERI_DMA2_S3CR_BIT_MBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S3CR_BIT_MBURST_SHIFT)

/*--- register S3NDTR -------------------------------------------------*/
#define PERI_DMA2_S3NDTR_BIT_NDT_SHIFT                              (0U)
#define PERI_DMA2_S3NDTR_BIT_NDT_MASK                               (((1U<<16)-1) << PERI_DMA2_S3NDTR_BIT_NDT_SHIFT)

/*--- register S3PAR -------------------------------------------------*/
#define PERI_DMA2_S3PAR_BIT_PA_SHIFT                                (0U)
#define PERI_DMA2_S3PAR_BIT_PA_MASK                                 (((1U<<32)-1) << PERI_DMA2_S3PAR_BIT_PA_SHIFT)

/*--- register S3M0AR -------------------------------------------------*/
#define PERI_DMA2_S3M0AR_BIT_M0A_SHIFT                              (0U)
#define PERI_DMA2_S3M0AR_BIT_M0A_MASK                               (((1U<<32)-1) << PERI_DMA2_S3M0AR_BIT_M0A_SHIFT)

/*--- register S3M1AR -------------------------------------------------*/
#define PERI_DMA2_S3M1AR_BIT_M1A_SHIFT                              (0U)
#define PERI_DMA2_S3M1AR_BIT_M1A_MASK                               (((1U<<32)-1) << PERI_DMA2_S3M1AR_BIT_M1A_SHIFT)

/*--- register S3FCR -------------------------------------------------*/
#define PERI_DMA2_S3FCR_BIT_FTH_SHIFT                               (0U)
#define PERI_DMA2_S3FCR_BIT_FTH_MASK                                (((1U<<2)-1) << PERI_DMA2_S3FCR_BIT_FTH_SHIFT)
#define PERI_DMA2_S3FCR_BIT_DMDIS_SHIFT                             (2U)
#define PERI_DMA2_S3FCR_BIT_DMDIS_MASK                              (((1U<<1)-1) << PERI_DMA2_S3FCR_BIT_DMDIS_SHIFT)
#define PERI_DMA2_S3FCR_BIT_FS_SHIFT                                (3U)
#define PERI_DMA2_S3FCR_BIT_FS_MASK                                 (((1U<<3)-1) << PERI_DMA2_S3FCR_BIT_FS_SHIFT)
#define PERI_DMA2_S3FCR_BIT_FEIE_SHIFT                              (7U)
#define PERI_DMA2_S3FCR_BIT_FEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S3FCR_BIT_FEIE_SHIFT)

/*--- register S4CR -------------------------------------------------*/
#define PERI_DMA2_S4CR_BIT_EN_SHIFT                                 (0U)
#define PERI_DMA2_S4CR_BIT_EN_MASK                                  (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_EN_SHIFT)
#define PERI_DMA2_S4CR_BIT_DMEIE_SHIFT                              (1U)
#define PERI_DMA2_S4CR_BIT_DMEIE_MASK                               (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_DMEIE_SHIFT)
#define PERI_DMA2_S4CR_BIT_TEIE_SHIFT                               (2U)
#define PERI_DMA2_S4CR_BIT_TEIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_TEIE_SHIFT)
#define PERI_DMA2_S4CR_BIT_HTIE_SHIFT                               (3U)
#define PERI_DMA2_S4CR_BIT_HTIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_HTIE_SHIFT)
#define PERI_DMA2_S4CR_BIT_TCIE_SHIFT                               (4U)
#define PERI_DMA2_S4CR_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_TCIE_SHIFT)
#define PERI_DMA2_S4CR_BIT_PFCTRL_SHIFT                             (5U)
#define PERI_DMA2_S4CR_BIT_PFCTRL_MASK                              (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_PFCTRL_SHIFT)
#define PERI_DMA2_S4CR_BIT_DIR_SHIFT                                (6U)
#define PERI_DMA2_S4CR_BIT_DIR_MASK                                 (((1U<<2)-1) << PERI_DMA2_S4CR_BIT_DIR_SHIFT)
#define PERI_DMA2_S4CR_BIT_CIRC_SHIFT                               (8U)
#define PERI_DMA2_S4CR_BIT_CIRC_MASK                                (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_CIRC_SHIFT)
#define PERI_DMA2_S4CR_BIT_PINC_SHIFT                               (9U)
#define PERI_DMA2_S4CR_BIT_PINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_PINC_SHIFT)
#define PERI_DMA2_S4CR_BIT_MINC_SHIFT                               (10U)
#define PERI_DMA2_S4CR_BIT_MINC_MASK                                (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_MINC_SHIFT)
#define PERI_DMA2_S4CR_BIT_PSIZE_SHIFT                              (11U)
#define PERI_DMA2_S4CR_BIT_PSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S4CR_BIT_PSIZE_SHIFT)
#define PERI_DMA2_S4CR_BIT_MSIZE_SHIFT                              (13U)
#define PERI_DMA2_S4CR_BIT_MSIZE_MASK                               (((1U<<2)-1) << PERI_DMA2_S4CR_BIT_MSIZE_SHIFT)
#define PERI_DMA2_S4CR_BIT_PINCOS_SHIFT                             (15U)
#define PERI_DMA2_S4CR_BIT_PINCOS_MASK                              (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_PINCOS_SHIFT)
#define PERI_DMA2_S4CR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA2_S4CR_BIT_PL_MASK                                  (((1U<<2)-1) << PERI_DMA2_S4CR_BIT_PL_SHIFT)
#define PERI_DMA2_S4CR_BIT_DBM_SHIFT                                (18U)
#define PERI_DMA2_S4CR_BIT_DBM_MASK                                 (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_DBM_SHIFT)
#define PERI_DMA2_S4CR_BIT_CT_SHIFT                                 (19U)
#define PERI_DMA2_S4CR_BIT_CT_MASK                                  (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_CT_SHIFT)
#define PERI_DMA2_S4CR_BIT_ACK_SHIFT                                (20U)
#define PERI_DMA2_S4CR_BIT_ACK_MASK                                 (((1U<<1)-1) << PERI_DMA2_S4CR_BIT_ACK_SHIFT)
#define PERI_DMA2_S4CR_BIT_PBURST_SHIFT                             (21U)
#define PERI_DMA2_S4CR_BIT_PBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S4CR_BIT_PBURST_SHIFT)
#define PERI_DMA2_S4CR_BIT_MBURST_SHIFT                             (23U)
#define PERI_DMA2_S4CR_BIT_MBURST_MASK                              (((1U<<2)-1) << PERI_DMA2_S4CR_BIT_MBURST_SHIFT)

/*--- register S4NDTR -------------------------------------------------*/
#define PERI_DMA2_S4NDTR_BIT_NDT_SHIFT                              (0U)
#define PERI_DMA2_S4NDTR_BIT_NDT_MASK                               (((1U<<16)-1) << PERI_DMA2_S4NDTR_BIT_NDT_SHIFT)

