minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_DMA2D_CR_BIT_START_SHIFT                               (0U)
#define PERI_DMA2D_CR_BIT_START_MASK                                (((1U<<1)-1) << PERI_DMA2D_CR_BIT_START_SHIFT)
#define PERI_DMA2D_CR_BIT_SUSP_SHIFT                                (1U)
#define PERI_DMA2D_CR_BIT_SUSP_MASK                                 (((1U<<1)-1) << PERI_DMA2D_CR_BIT_SUSP_SHIFT)
#define PERI_DMA2D_CR_BIT_ABORT_SHIFT                               (2U)
#define PERI_DMA2D_CR_BIT_ABORT_MASK                                (((1U<<1)-1) << PERI_DMA2D_CR_BIT_ABORT_SHIFT)
#define PERI_DMA2D_CR_BIT_TEIE_SHIFT                                (8U)
#define PERI_DMA2D_CR_BIT_TEIE_MASK                                 (((1U<<1)-1) << PERI_DMA2D_CR_BIT_TEIE_SHIFT)
#define PERI_DMA2D_CR_BIT_TCIE_SHIFT                                (9U)
#define PERI_DMA2D_CR_BIT_TCIE_MASK                                 (((1U<<1)-1) << PERI_DMA2D_CR_BIT_TCIE_SHIFT)
#define PERI_DMA2D_CR_BIT_TWIE_SHIFT                                (10U)
#define PERI_DMA2D_CR_BIT_TWIE_MASK                                 (((1U<<1)-1) << PERI_DMA2D_CR_BIT_TWIE_SHIFT)
#define PERI_DMA2D_CR_BIT_CAEIE_SHIFT                               (11U)
#define PERI_DMA2D_CR_BIT_CAEIE_MASK                                (((1U<<1)-1) << PERI_DMA2D_CR_BIT_CAEIE_SHIFT)
#define PERI_DMA2D_CR_BIT_CTCIE_SHIFT                               (12U)
#define PERI_DMA2D_CR_BIT_CTCIE_MASK                                (((1U<<1)-1) << PERI_DMA2D_CR_BIT_CTCIE_SHIFT)
#define PERI_DMA2D_CR_BIT_CEIE_SHIFT                                (13U)
#define PERI_DMA2D_CR_BIT_CEIE_MASK                                 (((1U<<1)-1) << PERI_DMA2D_CR_BIT_CEIE_SHIFT)
#define PERI_DMA2D_CR_BIT_MODE_SHIFT                                (16U)
#define PERI_DMA2D_CR_BIT_MODE_MASK                                 (((1U<<2)-1) << PERI_DMA2D_CR_BIT_MODE_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_DMA2D_ISR_BIT_TEIF_SHIFT                               (0U)
#define PERI_DMA2D_ISR_BIT_TEIF_MASK                                (((1U<<1)-1) << PERI_DMA2D_ISR_BIT_TEIF_SHIFT)
#define PERI_DMA2D_ISR_BIT_TCIF_SHIFT                               (1U)
#define PERI_DMA2D_ISR_BIT_TCIF_MASK                                (((1U<<1)-1) << PERI_DMA2D_ISR_BIT_TCIF_SHIFT)
#define PERI_DMA2D_ISR_BIT_TWIF_SHIFT                               (2U)
#define PERI_DMA2D_ISR_BIT_TWIF_MASK                                (((1U<<1)-1) << PERI_DMA2D_ISR_BIT_TWIF_SHIFT)
#define PERI_DMA2D_ISR_BIT_CAEIF_SHIFT                              (3U)
#define PERI_DMA2D_ISR_BIT_CAEIF_MASK                               (((1U<<1)-1) << PERI_DMA2D_ISR_BIT_CAEIF_SHIFT)
#define PERI_DMA2D_ISR_BIT_CTCIF_SHIFT                              (4U)
#define PERI_DMA2D_ISR_BIT_CTCIF_MASK                               (((1U<<1)-1) << PERI_DMA2D_ISR_BIT_CTCIF_SHIFT)
#define PERI_DMA2D_ISR_BIT_CEIF_SHIFT                               (5U)
#define PERI_DMA2D_ISR_BIT_CEIF_MASK                                (((1U<<1)-1) << PERI_DMA2D_ISR_BIT_CEIF_SHIFT)

/*--- register IFCR -------------------------------------------------*/
#define PERI_DMA2D_IFCR_BIT_CTEIF_SHIFT                             (0U)
#define PERI_DMA2D_IFCR_BIT_CTEIF_MASK                              (((1U<<1)-1) << PERI_DMA2D_IFCR_BIT_CTEIF_SHIFT)
#define PERI_DMA2D_IFCR_BIT_CTCIF_SHIFT                             (1U)
#define PERI_DMA2D_IFCR_BIT_CTCIF_MASK                              (((1U<<1)-1) << PERI_DMA2D_IFCR_BIT_CTCIF_SHIFT)
#define PERI_DMA2D_IFCR_BIT_CTWIF_SHIFT                             (2U)
#define PERI_DMA2D_IFCR_BIT_CTWIF_MASK                              (((1U<<1)-1) << PERI_DMA2D_IFCR_BIT_CTWIF_SHIFT)
#define PERI_DMA2D_IFCR_BIT_CAECIF_SHIFT                            (3U)
#define PERI_DMA2D_IFCR_BIT_CAECIF_MASK                             (((1U<<1)-1) << PERI_DMA2D_IFCR_BIT_CAECIF_SHIFT)
#define PERI_DMA2D_IFCR_BIT_CCTCIF_SHIFT                            (4U)
#define PERI_DMA2D_IFCR_BIT_CCTCIF_MASK                             (((1U<<1)-1) << PERI_DMA2D_IFCR_BIT_CCTCIF_SHIFT)
#define PERI_DMA2D_IFCR_BIT_CCEIF_SHIFT                             (5U)
#define PERI_DMA2D_IFCR_BIT_CCEIF_MASK                              (((1U<<1)-1) << PERI_DMA2D_IFCR_BIT_CCEIF_SHIFT)

/*--- register FGMAR -------------------------------------------------*/
#define PERI_DMA2D_FGMAR_BIT_MA_SHIFT                               (0U)
#define PERI_DMA2D_FGMAR_BIT_MA_MASK                                (((1U<<32)-1) << PERI_DMA2D_FGMAR_BIT_MA_SHIFT)

/*--- register FGOR -------------------------------------------------*/
#define PERI_DMA2D_FGOR_BIT_LO_SHIFT                                (0U)
#define PERI_DMA2D_FGOR_BIT_LO_MASK                                 (((1U<<14)-1) << PERI_DMA2D_FGOR_BIT_LO_SHIFT)

/*--- register BGMAR -------------------------------------------------*/
#define PERI_DMA2D_BGMAR_BIT_MA_SHIFT                               (0U)
#define PERI_DMA2D_BGMAR_BIT_MA_MASK                                (((1U<<32)-1) << PERI_DMA2D_BGMAR_BIT_MA_SHIFT)

/*--- register BGOR -------------------------------------------------*/
#define PERI_DMA2D_BGOR_BIT_LO_SHIFT                                (0U)
#define PERI_DMA2D_BGOR_BIT_LO_MASK                                 (((1U<<14)-1) << PERI_DMA2D_BGOR_BIT_LO_SHIFT)

/*--- register FGPFCCR -------------------------------------------------*/
#define PERI_DMA2D_FGPFCCR_BIT_CM_SHIFT                             (0U)
#define PERI_DMA2D_FGPFCCR_BIT_CM_MASK                              (((1U<<4)-1) << PERI_DMA2D_FGPFCCR_BIT_CM_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_CCM_SHIFT                            (4U)
#define PERI_DMA2D_FGPFCCR_BIT_CCM_MASK                             (((1U<<1)-1) << PERI_DMA2D_FGPFCCR_BIT_CCM_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_START_SHIFT                          (5U)
#define PERI_DMA2D_FGPFCCR_BIT_START_MASK                           (((1U<<1)-1) << PERI_DMA2D_FGPFCCR_BIT_START_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_CS_SHIFT                             (8U)
#define PERI_DMA2D_FGPFCCR_BIT_CS_MASK                              (((1U<<8)-1) << PERI_DMA2D_FGPFCCR_BIT_CS_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_AM_SHIFT                             (16U)
#define PERI_DMA2D_FGPFCCR_BIT_AM_MASK                              (((1U<<2)-1) << PERI_DMA2D_FGPFCCR_BIT_AM_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_CSS_SHIFT                            (18U)
#define PERI_DMA2D_FGPFCCR_BIT_CSS_MASK                             (((1U<<2)-1) << PERI_DMA2D_FGPFCCR_BIT_CSS_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_AI_SHIFT                             (20U)
#define PERI_DMA2D_FGPFCCR_BIT_AI_MASK                              (((1U<<1)-1) << PERI_DMA2D_FGPFCCR_BIT_AI_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_RBS_SHIFT                            (21U)
#define PERI_DMA2D_FGPFCCR_BIT_RBS_MASK                             (((1U<<1)-1) << PERI_DMA2D_FGPFCCR_BIT_RBS_SHIFT)
#define PERI_DMA2D_FGPFCCR_BIT_ALPHA_SHIFT                          (24U)
#define PERI_DMA2D_FGPFCCR_BIT_ALPHA_MASK                           (((1U<<8)-1) << PERI_DMA2D_FGPFCCR_BIT_ALPHA_SHIFT)

/*--- register FGCOLR -------------------------------------------------*/
#define PERI_DMA2D_FGCOLR_BIT_BLUE_SHIFT                            (0U)
#define PERI_DMA2D_FGCOLR_BIT_BLUE_MASK                             (((1U<<8)-1) << PERI_DMA2D_FGCOLR_BIT_BLUE_SHIFT)
#define PERI_DMA2D_FGCOLR_BIT_GREEN_SHIFT                           (8U)
#define PERI_DMA2D_FGCOLR_BIT_GREEN_MASK                            (((1U<<8)-1) << PERI_DMA2D_FGCOLR_BIT_GREEN_SHIFT)
#define PERI_DMA2D_FGCOLR_BIT_RED_SHIFT                             (16U)
#define PERI_DMA2D_FGCOLR_BIT_RED_MASK                              (((1U<<8)-1) << PERI_DMA2D_FGCOLR_BIT_RED_SHIFT)

/*--- register BGPFCCR -------------------------------------------------*/
#define PERI_DMA2D_BGPFCCR_BIT_CM_SHIFT                             (0U)
#define PERI_DMA2D_BGPFCCR_BIT_CM_MASK                              (((1U<<4)-1) << PERI_DMA2D_BGPFCCR_BIT_CM_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_CCM_SHIFT                            (4U)
#define PERI_DMA2D_BGPFCCR_BIT_CCM_MASK                             (((1U<<1)-1) << PERI_DMA2D_BGPFCCR_BIT_CCM_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_START_SHIFT                          (5U)
#define PERI_DMA2D_BGPFCCR_BIT_START_MASK                           (((1U<<1)-1) << PERI_DMA2D_BGPFCCR_BIT_START_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_CS_SHIFT                             (8U)
#define PERI_DMA2D_BGPFCCR_BIT_CS_MASK                              (((1U<<8)-1) << PERI_DMA2D_BGPFCCR_BIT_CS_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_AM_SHIFT                             (16U)
#define PERI_DMA2D_BGPFCCR_BIT_AM_MASK                              (((1U<<2)-1) << PERI_DMA2D_BGPFCCR_BIT_AM_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_AI_SHIFT                             (20U)
#define PERI_DMA2D_BGPFCCR_BIT_AI_MASK                              (((1U<<1)-1) << PERI_DMA2D_BGPFCCR_BIT_AI_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_RBS_SHIFT                            (21U)
#define PERI_DMA2D_BGPFCCR_BIT_RBS_MASK                             (((1U<<1)-1) << PERI_DMA2D_BGPFCCR_BIT_RBS_SHIFT)
#define PERI_DMA2D_BGPFCCR_BIT_ALPHA_SHIFT                          (24U)
#define PERI_DMA2D_BGPFCCR_BIT_ALPHA_MASK                           (((1U<<8)-1) << PERI_DMA2D_BGPFCCR_BIT_ALPHA_SHIFT)

/*--- register BGCOLR -------------------------------------------------*/
#define PERI_DMA2D_BGCOLR_BIT_BLUE_SHIFT                            (0U)
#define PERI_DMA2D_BGCOLR_BIT_BLUE_MASK                             (((1U<<8)-1) << PERI_DMA2D_BGCOLR_BIT_BLUE_SHIFT)
#define PERI_DMA2D_BGCOLR_BIT_GREEN_SHIFT                           (8U)
#define PERI_DMA2D_BGCOLR_BIT_GREEN_MASK                            (((1U<<8)-1) << PERI_DMA2D_BGCOLR_BIT_GREEN_SHIFT)
#define PERI_DMA2D_BGCOLR_BIT_RED_SHIFT                             (16U)
#define PERI_DMA2D_BGCOLR_BIT_RED_MASK                              (((1U<<8)-1) << PERI_DMA2D_BGCOLR_BIT_RED_SHIFT)

