minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FGCMAR -------------------------------------------------*/
#define PERI_DMA2D_FGCMAR_BIT_MA_SHIFT                              (0U)
#define PERI_DMA2D_FGCMAR_BIT_MA_MASK                               (((1U<<32)-1) << PERI_DMA2D_FGCMAR_BIT_MA_SHIFT)

/*--- register BGCMAR -------------------------------------------------*/
#define PERI_DMA2D_BGCMAR_BIT_MA_SHIFT                              (0U)
#define PERI_DMA2D_BGCMAR_BIT_MA_MASK                               (((1U<<32)-1) << PERI_DMA2D_BGCMAR_BIT_MA_SHIFT)

/*--- register OPFCCR -------------------------------------------------*/
#define PERI_DMA2D_OPFCCR_BIT_CM_SHIFT                              (0U)
#define PERI_DMA2D_OPFCCR_BIT_CM_MASK                               (((1U<<3)-1) << PERI_DMA2D_OPFCCR_BIT_CM_SHIFT)
#define PERI_DMA2D_OPFCCR_BIT_AI_SHIFT                              (20U)
#define PERI_DMA2D_OPFCCR_BIT_AI_MASK                               (((1U<<1)-1) << PERI_DMA2D_OPFCCR_BIT_AI_SHIFT)
#define PERI_DMA2D_OPFCCR_BIT_RBS_SHIFT                             (21U)
#define PERI_DMA2D_OPFCCR_BIT_RBS_MASK                              (((1U<<1)-1) << PERI_DMA2D_OPFCCR_BIT_RBS_SHIFT)

/*--- register OCOLR -------------------------------------------------*/
#define PERI_DMA2D_OCOLR_BIT_BLUE_SHIFT                             (0U)
#define PERI_DMA2D_OCOLR_BIT_BLUE_MASK                              (((1U<<8)-1) << PERI_DMA2D_OCOLR_BIT_BLUE_SHIFT)
#define PERI_DMA2D_OCOLR_BIT_GREEN_SHIFT                            (8U)
#define PERI_DMA2D_OCOLR_BIT_GREEN_MASK                             (((1U<<8)-1) << PERI_DMA2D_OCOLR_BIT_GREEN_SHIFT)
#define PERI_DMA2D_OCOLR_BIT_RED_SHIFT                              (16U)
#define PERI_DMA2D_OCOLR_BIT_RED_MASK                               (((1U<<8)-1) << PERI_DMA2D_OCOLR_BIT_RED_SHIFT)
#define PERI_DMA2D_OCOLR_BIT_ALPHA_SHIFT                            (24U)
#define PERI_DMA2D_OCOLR_BIT_ALPHA_MASK                             (((1U<<8)-1) << PERI_DMA2D_OCOLR_BIT_ALPHA_SHIFT)

/*--- register OMAR -------------------------------------------------*/
#define PERI_DMA2D_OMAR_BIT_MA_SHIFT                                (0U)
#define PERI_DMA2D_OMAR_BIT_MA_MASK                                 (((1U<<32)-1) << PERI_DMA2D_OMAR_BIT_MA_SHIFT)

/*--- register OOR -------------------------------------------------*/
#define PERI_DMA2D_OOR_BIT_LO_SHIFT                                 (0U)
#define PERI_DMA2D_OOR_BIT_LO_MASK                                  (((1U<<14)-1) << PERI_DMA2D_OOR_BIT_LO_SHIFT)

/*--- register NLR -------------------------------------------------*/
#define PERI_DMA2D_NLR_BIT_NL_SHIFT                                 (0U)
#define PERI_DMA2D_NLR_BIT_NL_MASK                                  (((1U<<16)-1) << PERI_DMA2D_NLR_BIT_NL_SHIFT)
#define PERI_DMA2D_NLR_BIT_PL_SHIFT                                 (16U)
#define PERI_DMA2D_NLR_BIT_PL_MASK                                  (((1U<<14)-1) << PERI_DMA2D_NLR_BIT_PL_SHIFT)

/*--- register LWR -------------------------------------------------*/
#define PERI_DMA2D_LWR_BIT_LW_SHIFT                                 (0U)
#define PERI_DMA2D_LWR_BIT_LW_MASK                                  (((1U<<16)-1) << PERI_DMA2D_LWR_BIT_LW_SHIFT)

/*--- register AMTCR -------------------------------------------------*/
#define PERI_DMA2D_AMTCR_BIT_EN_SHIFT                               (0U)
#define PERI_DMA2D_AMTCR_BIT_EN_MASK                                (((1U<<1)-1) << PERI_DMA2D_AMTCR_BIT_EN_SHIFT)
#define PERI_DMA2D_AMTCR_BIT_DT_SHIFT                               (8U)
#define PERI_DMA2D_AMTCR_BIT_DT_MASK                                (((1U<<8)-1) << PERI_DMA2D_AMTCR_BIT_DT_SHIFT)

/*--- register DMAMUX_C0CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C0CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C0CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C1CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C1CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C1CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C2CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C2CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C2CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C3CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C3CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C3CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C4CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C4CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C4CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C5CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C5CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C5CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C6CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C6CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C6CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C7CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C7CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C7CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C8CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C8CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C8CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C9CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_DMAREQ_ID_SHIFT                (0U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_DMAREQ_ID_MASK                 (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SOIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SOIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_EGE_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_EGE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SE_SHIFT                       (16U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SE_MASK                        (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SPOL_SHIFT                     (17U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SPOL_MASK                      (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_NBREQ_SHIFT                    (19U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_NBREQ_MASK                     (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SYNC_ID_SHIFT                  (24U)
#define PERI_DMAMUX1_DMAMUX_C9CR_BIT_SYNC_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C9CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C10CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_DMAREQ_ID_SHIFT               (0U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_DMAREQ_ID_MASK                (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SOIE_SHIFT                    (8U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SOIE_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_EGE_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_EGE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_NBREQ_SHIFT                   (19U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_NBREQ_MASK                    (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SYNC_ID_SHIFT                 (24U)
#define PERI_DMAMUX1_DMAMUX_C10CR_BIT_SYNC_ID_MASK                  (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C10CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C11CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_DMAREQ_ID_SHIFT               (0U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_DMAREQ_ID_MASK                (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SOIE_SHIFT                    (8U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SOIE_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_EGE_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_EGE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_NBREQ_SHIFT                   (19U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_NBREQ_MASK                    (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SYNC_ID_SHIFT                 (24U)
#define PERI_DMAMUX1_DMAMUX_C11CR_BIT_SYNC_ID_MASK                  (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C11CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C12CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_DMAREQ_ID_SHIFT               (0U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_DMAREQ_ID_MASK                (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SOIE_SHIFT                    (8U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SOIE_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_EGE_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_EGE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_NBREQ_SHIFT                   (19U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_NBREQ_MASK                    (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SYNC_ID_SHIFT                 (24U)
#define PERI_DMAMUX1_DMAMUX_C12CR_BIT_SYNC_ID_MASK                  (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C12CR_BIT_SYNC_ID_SHIFT)

