minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DMAMUX_C13CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_DMAREQ_ID_SHIFT               (0U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_DMAREQ_ID_MASK                (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SOIE_SHIFT                    (8U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SOIE_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_EGE_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_EGE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_NBREQ_SHIFT                   (19U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_NBREQ_MASK                    (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SYNC_ID_SHIFT                 (24U)
#define PERI_DMAMUX1_DMAMUX_C13CR_BIT_SYNC_ID_MASK                  (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C13CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C14CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_DMAREQ_ID_SHIFT               (0U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_DMAREQ_ID_MASK                (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SOIE_SHIFT                    (8U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SOIE_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_EGE_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_EGE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_NBREQ_SHIFT                   (19U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_NBREQ_MASK                    (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SYNC_ID_SHIFT                 (24U)
#define PERI_DMAMUX1_DMAMUX_C14CR_BIT_SYNC_ID_MASK                  (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C14CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_C15CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_DMAREQ_ID_SHIFT               (0U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_DMAREQ_ID_MASK                (((1U<<7)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SOIE_SHIFT                    (8U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SOIE_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_EGE_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_EGE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_SE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_NBREQ_SHIFT                   (19U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_NBREQ_MASK                    (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SYNC_ID_SHIFT                 (24U)
#define PERI_DMAMUX1_DMAMUX_C15CR_BIT_SYNC_ID_MASK                  (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_C15CR_BIT_SYNC_ID_SHIFT)

/*--- register DMAMUX_CSR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF0_SHIFT                      (0U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF0_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF0_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF1_SHIFT                      (1U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF1_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF1_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF2_SHIFT                      (2U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF2_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF2_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF3_SHIFT                      (3U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF3_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF3_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF4_SHIFT                      (4U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF4_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF4_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF5_SHIFT                      (5U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF5_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF5_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF6_SHIFT                      (6U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF6_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF6_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF7_SHIFT                      (7U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF7_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF7_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF8_SHIFT                      (8U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF8_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF8_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF9_SHIFT                      (9U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF9_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF9_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF10_SHIFT                     (10U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF10_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF10_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF11_SHIFT                     (11U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF11_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF11_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF12_SHIFT                     (12U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF12_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF12_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF13_SHIFT                     (13U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF13_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF13_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF14_SHIFT                     (14U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF14_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF14_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF15_SHIFT                     (15U)
#define PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF15_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CSR_BIT_SOF15_SHIFT)

/*--- register DMAMUX_CFR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF0_SHIFT                     (0U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF0_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF0_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF1_SHIFT                     (1U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF1_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF1_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF2_SHIFT                     (2U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF2_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF2_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF3_SHIFT                     (3U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF3_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF3_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF4_SHIFT                     (4U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF4_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF4_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF5_SHIFT                     (5U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF5_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF5_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF6_SHIFT                     (6U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF6_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF6_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF7_SHIFT                     (7U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF7_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF7_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF8_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF8_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF8_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF9_SHIFT                     (9U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF9_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF9_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF10_SHIFT                    (10U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF10_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF10_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF11_SHIFT                    (11U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF11_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF11_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF12_SHIFT                    (12U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF12_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF12_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF13_SHIFT                    (13U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF13_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF13_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF14_SHIFT                    (14U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF14_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF14_SHIFT)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF15_SHIFT                    (15U)
#define PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF15_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_CFR_BIT_CSOF15_SHIFT)

/*--- register DMAMUX_RG0CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG0CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG0CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG0CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG1CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG1CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG1CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG1CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG2CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG2CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG2CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG2CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG3CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG3CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG3CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG3CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG4CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG4CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG4CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG4CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG5CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG5CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG5CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG5CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG6CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG6CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG6CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG6CR_BIT_GNBREQ_SHIFT)

/*--- register DMAMUX_RG7CR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_SIG_ID_SHIFT                  (0U)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_SIG_ID_MASK                   (((1U<<3)-1) << PERI_DMAMUX1_DMAMUX_RG7CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_OIE_SHIFT                     (8U)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_OIE_MASK                      (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG7CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GE_SHIFT                      (16U)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GE_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GE_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GPOL_SHIFT                    (17U)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GPOL_MASK                     (((1U<<2)-1) << PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GNBREQ_SHIFT                  (19U)
#define PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GNBREQ_MASK                   (((1U<<5)-1) << PERI_DMAMUX1_DMAMUX_RG7CR_BIT_GNBREQ_SHIFT)

