minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DMAMUX_RGSR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF0_SHIFT                      (0U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF0_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF0_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF1_SHIFT                      (1U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF1_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF1_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF2_SHIFT                      (2U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF2_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF2_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF3_SHIFT                      (3U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF3_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF3_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF4_SHIFT                      (4U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF4_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF4_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF5_SHIFT                      (5U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF5_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF5_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF6_SHIFT                      (6U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF6_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF6_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF7_SHIFT                      (7U)
#define PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF7_MASK                       (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGSR_BIT_OF7_SHIFT)

/*--- register DMAMUX_RGCFR -------------------------------------------------*/
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF0_SHIFT                    (0U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF0_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF0_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF1_SHIFT                    (1U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF1_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF1_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF2_SHIFT                    (2U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF2_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF2_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF3_SHIFT                    (3U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF3_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF3_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF4_SHIFT                    (4U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF4_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF4_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF5_SHIFT                    (5U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF5_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF5_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF6_SHIFT                    (6U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF6_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF6_SHIFT)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF7_SHIFT                    (7U)
#define PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF7_MASK                     (((1U<<1)-1) << PERI_DMAMUX1_DMAMUX_RGCFR_BIT_COF7_SHIFT)

/*--- register C0CR -------------------------------------------------*/
#define PERI_DMAMUX2_C0CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C0CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C0CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C0CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C0CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C0CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C0CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C0CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C0CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C0CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C0CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C0CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C0CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C0CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C0CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C0CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C0CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C0CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C0CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C0CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C0CR_BIT_SYNC_ID_SHIFT)

/*--- register C1CR -------------------------------------------------*/
#define PERI_DMAMUX2_C1CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C1CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C1CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C1CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C1CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C1CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C1CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C1CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C1CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C1CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C1CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C1CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C1CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C1CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C1CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C1CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C1CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C1CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C1CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C1CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C1CR_BIT_SYNC_ID_SHIFT)

/*--- register C2CR -------------------------------------------------*/
#define PERI_DMAMUX2_C2CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C2CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C2CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C2CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C2CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C2CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C2CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C2CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C2CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C2CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C2CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C2CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C2CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C2CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C2CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C2CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C2CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C2CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C2CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C2CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C2CR_BIT_SYNC_ID_SHIFT)

/*--- register C3CR -------------------------------------------------*/
#define PERI_DMAMUX2_C3CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C3CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C3CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C3CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C3CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C3CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C3CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C3CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C3CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C3CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C3CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C3CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C3CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C3CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C3CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C3CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C3CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C3CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C3CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C3CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C3CR_BIT_SYNC_ID_SHIFT)

/*--- register C4CR -------------------------------------------------*/
#define PERI_DMAMUX2_C4CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C4CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C4CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C4CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C4CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C4CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C4CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C4CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C4CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C4CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C4CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C4CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C4CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C4CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C4CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C4CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C4CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C4CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C4CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C4CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C4CR_BIT_SYNC_ID_SHIFT)

/*--- register C5CR -------------------------------------------------*/
#define PERI_DMAMUX2_C5CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C5CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C5CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C5CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C5CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C5CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C5CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C5CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C5CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C5CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C5CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C5CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C5CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C5CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C5CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C5CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C5CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C5CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C5CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C5CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C5CR_BIT_SYNC_ID_SHIFT)

/*--- register C6CR -------------------------------------------------*/
#define PERI_DMAMUX2_C6CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C6CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C6CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C6CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C6CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C6CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C6CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C6CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C6CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C6CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C6CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C6CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C6CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C6CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C6CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C6CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C6CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C6CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C6CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C6CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C6CR_BIT_SYNC_ID_SHIFT)

/*--- register C7CR -------------------------------------------------*/
#define PERI_DMAMUX2_C7CR_BIT_DMAREQ_ID_SHIFT                       (0U)
#define PERI_DMAMUX2_C7CR_BIT_DMAREQ_ID_MASK                        (((1U<<5)-1) << PERI_DMAMUX2_C7CR_BIT_DMAREQ_ID_SHIFT)
#define PERI_DMAMUX2_C7CR_BIT_SOIE_SHIFT                            (8U)
#define PERI_DMAMUX2_C7CR_BIT_SOIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_C7CR_BIT_SOIE_SHIFT)
#define PERI_DMAMUX2_C7CR_BIT_EGE_SHIFT                             (9U)
#define PERI_DMAMUX2_C7CR_BIT_EGE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_C7CR_BIT_EGE_SHIFT)
#define PERI_DMAMUX2_C7CR_BIT_SE_SHIFT                              (16U)
#define PERI_DMAMUX2_C7CR_BIT_SE_MASK                               (((1U<<1)-1) << PERI_DMAMUX2_C7CR_BIT_SE_SHIFT)
#define PERI_DMAMUX2_C7CR_BIT_SPOL_SHIFT                            (17U)
#define PERI_DMAMUX2_C7CR_BIT_SPOL_MASK                             (((1U<<2)-1) << PERI_DMAMUX2_C7CR_BIT_SPOL_SHIFT)
#define PERI_DMAMUX2_C7CR_BIT_NBREQ_SHIFT                           (19U)
#define PERI_DMAMUX2_C7CR_BIT_NBREQ_MASK                            (((1U<<5)-1) << PERI_DMAMUX2_C7CR_BIT_NBREQ_SHIFT)
#define PERI_DMAMUX2_C7CR_BIT_SYNC_ID_SHIFT                         (24U)
#define PERI_DMAMUX2_C7CR_BIT_SYNC_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_C7CR_BIT_SYNC_ID_SHIFT)

/*--- register CSR -------------------------------------------------*/
#define PERI_DMAMUX2_CSR_BIT_SOF0_SHIFT                             (0U)
#define PERI_DMAMUX2_CSR_BIT_SOF0_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF0_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF1_SHIFT                             (1U)
#define PERI_DMAMUX2_CSR_BIT_SOF1_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF1_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF2_SHIFT                             (2U)
#define PERI_DMAMUX2_CSR_BIT_SOF2_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF2_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF3_SHIFT                             (3U)
#define PERI_DMAMUX2_CSR_BIT_SOF3_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF3_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF4_SHIFT                             (4U)
#define PERI_DMAMUX2_CSR_BIT_SOF4_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF4_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF5_SHIFT                             (5U)
#define PERI_DMAMUX2_CSR_BIT_SOF5_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF5_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF6_SHIFT                             (6U)
#define PERI_DMAMUX2_CSR_BIT_SOF6_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF6_SHIFT)
#define PERI_DMAMUX2_CSR_BIT_SOF7_SHIFT                             (7U)
#define PERI_DMAMUX2_CSR_BIT_SOF7_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_CSR_BIT_SOF7_SHIFT)

/*--- register CFR -------------------------------------------------*/
#define PERI_DMAMUX2_CFR_BIT_CSOF0_SHIFT                            (0U)
#define PERI_DMAMUX2_CFR_BIT_CSOF0_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF0_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF1_SHIFT                            (1U)
#define PERI_DMAMUX2_CFR_BIT_CSOF1_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF1_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF2_SHIFT                            (2U)
#define PERI_DMAMUX2_CFR_BIT_CSOF2_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF2_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF3_SHIFT                            (3U)
#define PERI_DMAMUX2_CFR_BIT_CSOF3_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF3_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF4_SHIFT                            (4U)
#define PERI_DMAMUX2_CFR_BIT_CSOF4_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF4_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF5_SHIFT                            (5U)
#define PERI_DMAMUX2_CFR_BIT_CSOF5_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF5_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF6_SHIFT                            (6U)
#define PERI_DMAMUX2_CFR_BIT_CSOF6_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF6_SHIFT)
#define PERI_DMAMUX2_CFR_BIT_CSOF7_SHIFT                            (7U)
#define PERI_DMAMUX2_CFR_BIT_CSOF7_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_CFR_BIT_CSOF7_SHIFT)

/*--- register RG0CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG0CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG0CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG0CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG0CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG0CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG0CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG0CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG0CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG0CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG0CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG0CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG0CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG0CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG0CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG0CR_BIT_GNBREQ_SHIFT)

/*--- register RG1CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG1CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG1CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG1CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG1CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG1CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG1CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG1CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG1CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG1CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG1CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG1CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG1CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG1CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG1CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG1CR_BIT_GNBREQ_SHIFT)

/*--- register RG2CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG2CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG2CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG2CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG2CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG2CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG2CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG2CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG2CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG2CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG2CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG2CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG2CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG2CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG2CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG2CR_BIT_GNBREQ_SHIFT)

/*--- register RG3CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG3CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG3CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG3CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG3CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG3CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG3CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG3CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG3CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG3CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG3CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG3CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG3CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG3CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG3CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG3CR_BIT_GNBREQ_SHIFT)

/*--- register RG4CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG4CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG4CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG4CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG4CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG4CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG4CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG4CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG4CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG4CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG4CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG4CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG4CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG4CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG4CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG4CR_BIT_GNBREQ_SHIFT)

