minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RG5CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG5CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG5CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG5CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG5CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG5CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG5CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG5CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG5CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG5CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG5CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG5CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG5CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG5CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG5CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG5CR_BIT_GNBREQ_SHIFT)

/*--- register RG6CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG6CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG6CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG6CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG6CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG6CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG6CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG6CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG6CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG6CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG6CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG6CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG6CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG6CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG6CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG6CR_BIT_GNBREQ_SHIFT)

/*--- register RG7CR -------------------------------------------------*/
#define PERI_DMAMUX2_RG7CR_BIT_SIG_ID_SHIFT                         (0U)
#define PERI_DMAMUX2_RG7CR_BIT_SIG_ID_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG7CR_BIT_SIG_ID_SHIFT)
#define PERI_DMAMUX2_RG7CR_BIT_OIE_SHIFT                            (8U)
#define PERI_DMAMUX2_RG7CR_BIT_OIE_MASK                             (((1U<<1)-1) << PERI_DMAMUX2_RG7CR_BIT_OIE_SHIFT)
#define PERI_DMAMUX2_RG7CR_BIT_GE_SHIFT                             (16U)
#define PERI_DMAMUX2_RG7CR_BIT_GE_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RG7CR_BIT_GE_SHIFT)
#define PERI_DMAMUX2_RG7CR_BIT_GPOL_SHIFT                           (17U)
#define PERI_DMAMUX2_RG7CR_BIT_GPOL_MASK                            (((1U<<2)-1) << PERI_DMAMUX2_RG7CR_BIT_GPOL_SHIFT)
#define PERI_DMAMUX2_RG7CR_BIT_GNBREQ_SHIFT                         (19U)
#define PERI_DMAMUX2_RG7CR_BIT_GNBREQ_MASK                          (((1U<<5)-1) << PERI_DMAMUX2_RG7CR_BIT_GNBREQ_SHIFT)

/*--- register RGSR -------------------------------------------------*/
#define PERI_DMAMUX2_RGSR_BIT_OF0_SHIFT                             (0U)
#define PERI_DMAMUX2_RGSR_BIT_OF0_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF0_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF1_SHIFT                             (1U)
#define PERI_DMAMUX2_RGSR_BIT_OF1_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF1_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF2_SHIFT                             (2U)
#define PERI_DMAMUX2_RGSR_BIT_OF2_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF2_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF3_SHIFT                             (3U)
#define PERI_DMAMUX2_RGSR_BIT_OF3_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF3_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF4_SHIFT                             (4U)
#define PERI_DMAMUX2_RGSR_BIT_OF4_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF4_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF5_SHIFT                             (5U)
#define PERI_DMAMUX2_RGSR_BIT_OF5_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF5_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF6_SHIFT                             (6U)
#define PERI_DMAMUX2_RGSR_BIT_OF6_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF6_SHIFT)
#define PERI_DMAMUX2_RGSR_BIT_OF7_SHIFT                             (7U)
#define PERI_DMAMUX2_RGSR_BIT_OF7_MASK                              (((1U<<1)-1) << PERI_DMAMUX2_RGSR_BIT_OF7_SHIFT)

/*--- register RGCFR -------------------------------------------------*/
#define PERI_DMAMUX2_RGCFR_BIT_COF0_SHIFT                           (0U)
#define PERI_DMAMUX2_RGCFR_BIT_COF0_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF0_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF1_SHIFT                           (1U)
#define PERI_DMAMUX2_RGCFR_BIT_COF1_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF1_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF2_SHIFT                           (2U)
#define PERI_DMAMUX2_RGCFR_BIT_COF2_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF2_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF3_SHIFT                           (3U)
#define PERI_DMAMUX2_RGCFR_BIT_COF3_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF3_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF4_SHIFT                           (4U)
#define PERI_DMAMUX2_RGCFR_BIT_COF4_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF4_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF5_SHIFT                           (5U)
#define PERI_DMAMUX2_RGCFR_BIT_COF5_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF5_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF6_SHIFT                           (6U)
#define PERI_DMAMUX2_RGCFR_BIT_COF6_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF6_SHIFT)
#define PERI_DMAMUX2_RGCFR_BIT_COF7_SHIFT                           (7U)
#define PERI_DMAMUX2_RGCFR_BIT_COF7_MASK                            (((1U<<1)-1) << PERI_DMAMUX2_RGCFR_BIT_COF7_SHIFT)

/*--- register RTSR1 -------------------------------------------------*/
#define PERI_EXTI_RTSR1_BIT_TR0_SHIFT                               (0U)
#define PERI_EXTI_RTSR1_BIT_TR0_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR0_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR1_SHIFT                               (1U)
#define PERI_EXTI_RTSR1_BIT_TR1_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR1_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR2_SHIFT                               (2U)
#define PERI_EXTI_RTSR1_BIT_TR2_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR2_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR3_SHIFT                               (3U)
#define PERI_EXTI_RTSR1_BIT_TR3_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR3_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR4_SHIFT                               (4U)
#define PERI_EXTI_RTSR1_BIT_TR4_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR4_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR5_SHIFT                               (5U)
#define PERI_EXTI_RTSR1_BIT_TR5_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR5_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR6_SHIFT                               (6U)
#define PERI_EXTI_RTSR1_BIT_TR6_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR6_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR7_SHIFT                               (7U)
#define PERI_EXTI_RTSR1_BIT_TR7_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR7_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR8_SHIFT                               (8U)
#define PERI_EXTI_RTSR1_BIT_TR8_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR8_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR9_SHIFT                               (9U)
#define PERI_EXTI_RTSR1_BIT_TR9_MASK                                (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR9_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR10_SHIFT                              (10U)
#define PERI_EXTI_RTSR1_BIT_TR10_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR10_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR11_SHIFT                              (11U)
#define PERI_EXTI_RTSR1_BIT_TR11_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR11_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR12_SHIFT                              (12U)
#define PERI_EXTI_RTSR1_BIT_TR12_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR12_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR13_SHIFT                              (13U)
#define PERI_EXTI_RTSR1_BIT_TR13_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR13_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR14_SHIFT                              (14U)
#define PERI_EXTI_RTSR1_BIT_TR14_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR14_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR15_SHIFT                              (15U)
#define PERI_EXTI_RTSR1_BIT_TR15_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR15_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR16_SHIFT                              (16U)
#define PERI_EXTI_RTSR1_BIT_TR16_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR16_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR17_SHIFT                              (17U)
#define PERI_EXTI_RTSR1_BIT_TR17_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR17_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR18_SHIFT                              (18U)
#define PERI_EXTI_RTSR1_BIT_TR18_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR18_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR19_SHIFT                              (19U)
#define PERI_EXTI_RTSR1_BIT_TR19_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR19_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR20_SHIFT                              (20U)
#define PERI_EXTI_RTSR1_BIT_TR20_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR20_SHIFT)
#define PERI_EXTI_RTSR1_BIT_TR21_SHIFT                              (21U)
#define PERI_EXTI_RTSR1_BIT_TR21_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR1_BIT_TR21_SHIFT)

