minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FTSR1 -------------------------------------------------*/
#define PERI_EXTI_FTSR1_BIT_TR0_SHIFT                               (0U)
#define PERI_EXTI_FTSR1_BIT_TR0_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR0_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR1_SHIFT                               (1U)
#define PERI_EXTI_FTSR1_BIT_TR1_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR1_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR2_SHIFT                               (2U)
#define PERI_EXTI_FTSR1_BIT_TR2_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR2_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR3_SHIFT                               (3U)
#define PERI_EXTI_FTSR1_BIT_TR3_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR3_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR4_SHIFT                               (4U)
#define PERI_EXTI_FTSR1_BIT_TR4_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR4_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR5_SHIFT                               (5U)
#define PERI_EXTI_FTSR1_BIT_TR5_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR5_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR6_SHIFT                               (6U)
#define PERI_EXTI_FTSR1_BIT_TR6_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR6_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR7_SHIFT                               (7U)
#define PERI_EXTI_FTSR1_BIT_TR7_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR7_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR8_SHIFT                               (8U)
#define PERI_EXTI_FTSR1_BIT_TR8_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR8_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR9_SHIFT                               (9U)
#define PERI_EXTI_FTSR1_BIT_TR9_MASK                                (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR9_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR10_SHIFT                              (10U)
#define PERI_EXTI_FTSR1_BIT_TR10_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR10_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR11_SHIFT                              (11U)
#define PERI_EXTI_FTSR1_BIT_TR11_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR11_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR12_SHIFT                              (12U)
#define PERI_EXTI_FTSR1_BIT_TR12_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR12_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR13_SHIFT                              (13U)
#define PERI_EXTI_FTSR1_BIT_TR13_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR13_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR14_SHIFT                              (14U)
#define PERI_EXTI_FTSR1_BIT_TR14_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR14_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR15_SHIFT                              (15U)
#define PERI_EXTI_FTSR1_BIT_TR15_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR15_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR16_SHIFT                              (16U)
#define PERI_EXTI_FTSR1_BIT_TR16_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR16_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR17_SHIFT                              (17U)
#define PERI_EXTI_FTSR1_BIT_TR17_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR17_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR18_SHIFT                              (18U)
#define PERI_EXTI_FTSR1_BIT_TR18_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR18_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR19_SHIFT                              (19U)
#define PERI_EXTI_FTSR1_BIT_TR19_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR19_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR20_SHIFT                              (20U)
#define PERI_EXTI_FTSR1_BIT_TR20_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR20_SHIFT)
#define PERI_EXTI_FTSR1_BIT_TR21_SHIFT                              (21U)
#define PERI_EXTI_FTSR1_BIT_TR21_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR1_BIT_TR21_SHIFT)

/*--- register SWIER1 -------------------------------------------------*/
#define PERI_EXTI_SWIER1_BIT_SWIER0_SHIFT                           (0U)
#define PERI_EXTI_SWIER1_BIT_SWIER0_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER0_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER1_SHIFT                           (1U)
#define PERI_EXTI_SWIER1_BIT_SWIER1_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER1_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER2_SHIFT                           (2U)
#define PERI_EXTI_SWIER1_BIT_SWIER2_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER2_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER3_SHIFT                           (3U)
#define PERI_EXTI_SWIER1_BIT_SWIER3_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER3_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER4_SHIFT                           (4U)
#define PERI_EXTI_SWIER1_BIT_SWIER4_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER4_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER5_SHIFT                           (5U)
#define PERI_EXTI_SWIER1_BIT_SWIER5_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER5_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER6_SHIFT                           (6U)
#define PERI_EXTI_SWIER1_BIT_SWIER6_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER6_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER7_SHIFT                           (7U)
#define PERI_EXTI_SWIER1_BIT_SWIER7_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER7_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER8_SHIFT                           (8U)
#define PERI_EXTI_SWIER1_BIT_SWIER8_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER8_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER9_SHIFT                           (9U)
#define PERI_EXTI_SWIER1_BIT_SWIER9_MASK                            (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER9_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER10_SHIFT                          (10U)
#define PERI_EXTI_SWIER1_BIT_SWIER10_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER10_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER11_SHIFT                          (11U)
#define PERI_EXTI_SWIER1_BIT_SWIER11_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER11_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER12_SHIFT                          (12U)
#define PERI_EXTI_SWIER1_BIT_SWIER12_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER12_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER13_SHIFT                          (13U)
#define PERI_EXTI_SWIER1_BIT_SWIER13_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER13_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER14_SHIFT                          (14U)
#define PERI_EXTI_SWIER1_BIT_SWIER14_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER14_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER15_SHIFT                          (15U)
#define PERI_EXTI_SWIER1_BIT_SWIER15_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER15_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER16_SHIFT                          (16U)
#define PERI_EXTI_SWIER1_BIT_SWIER16_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER16_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER17_SHIFT                          (17U)
#define PERI_EXTI_SWIER1_BIT_SWIER17_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER17_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER18_SHIFT                          (18U)
#define PERI_EXTI_SWIER1_BIT_SWIER18_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER18_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER19_SHIFT                          (19U)
#define PERI_EXTI_SWIER1_BIT_SWIER19_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER19_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER20_SHIFT                          (20U)
#define PERI_EXTI_SWIER1_BIT_SWIER20_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER20_SHIFT)
#define PERI_EXTI_SWIER1_BIT_SWIER21_SHIFT                          (21U)
#define PERI_EXTI_SWIER1_BIT_SWIER21_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER1_BIT_SWIER21_SHIFT)

/*--- register D3PMR1 -------------------------------------------------*/
#define PERI_EXTI_D3PMR1_BIT_MR0_SHIFT                              (0U)
#define PERI_EXTI_D3PMR1_BIT_MR0_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR0_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR1_SHIFT                              (1U)
#define PERI_EXTI_D3PMR1_BIT_MR1_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR1_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR2_SHIFT                              (2U)
#define PERI_EXTI_D3PMR1_BIT_MR2_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR2_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR3_SHIFT                              (3U)
#define PERI_EXTI_D3PMR1_BIT_MR3_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR3_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR4_SHIFT                              (4U)
#define PERI_EXTI_D3PMR1_BIT_MR4_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR4_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR5_SHIFT                              (5U)
#define PERI_EXTI_D3PMR1_BIT_MR5_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR5_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR6_SHIFT                              (6U)
#define PERI_EXTI_D3PMR1_BIT_MR6_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR6_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR7_SHIFT                              (7U)
#define PERI_EXTI_D3PMR1_BIT_MR7_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR7_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR8_SHIFT                              (8U)
#define PERI_EXTI_D3PMR1_BIT_MR8_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR8_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR9_SHIFT                              (9U)
#define PERI_EXTI_D3PMR1_BIT_MR9_MASK                               (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR9_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR10_SHIFT                             (10U)
#define PERI_EXTI_D3PMR1_BIT_MR10_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR10_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR11_SHIFT                             (11U)
#define PERI_EXTI_D3PMR1_BIT_MR11_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR11_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR12_SHIFT                             (12U)
#define PERI_EXTI_D3PMR1_BIT_MR12_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR12_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR13_SHIFT                             (13U)
#define PERI_EXTI_D3PMR1_BIT_MR13_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR13_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR14_SHIFT                             (14U)
#define PERI_EXTI_D3PMR1_BIT_MR14_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR14_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR15_SHIFT                             (15U)
#define PERI_EXTI_D3PMR1_BIT_MR15_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR15_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR19_SHIFT                             (19U)
#define PERI_EXTI_D3PMR1_BIT_MR19_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR19_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR20_SHIFT                             (20U)
#define PERI_EXTI_D3PMR1_BIT_MR20_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR20_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR21_SHIFT                             (21U)
#define PERI_EXTI_D3PMR1_BIT_MR21_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR21_SHIFT)
#define PERI_EXTI_D3PMR1_BIT_MR25_SHIFT                             (25U)
#define PERI_EXTI_D3PMR1_BIT_MR25_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR1_BIT_MR25_SHIFT)

/*--- register D3PCR1L -------------------------------------------------*/
#define PERI_EXTI_D3PCR1L_BIT_PCS0_SHIFT                            (0U)
#define PERI_EXTI_D3PCR1L_BIT_PCS0_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS0_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS1_SHIFT                            (2U)
#define PERI_EXTI_D3PCR1L_BIT_PCS1_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS1_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS2_SHIFT                            (4U)
#define PERI_EXTI_D3PCR1L_BIT_PCS2_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS2_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS3_SHIFT                            (6U)
#define PERI_EXTI_D3PCR1L_BIT_PCS3_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS3_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS4_SHIFT                            (8U)
#define PERI_EXTI_D3PCR1L_BIT_PCS4_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS4_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS5_SHIFT                            (10U)
#define PERI_EXTI_D3PCR1L_BIT_PCS5_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS5_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS6_SHIFT                            (12U)
#define PERI_EXTI_D3PCR1L_BIT_PCS6_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS6_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS7_SHIFT                            (14U)
#define PERI_EXTI_D3PCR1L_BIT_PCS7_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS7_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS8_SHIFT                            (16U)
#define PERI_EXTI_D3PCR1L_BIT_PCS8_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS8_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS9_SHIFT                            (18U)
#define PERI_EXTI_D3PCR1L_BIT_PCS9_MASK                             (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS9_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS10_SHIFT                           (20U)
#define PERI_EXTI_D3PCR1L_BIT_PCS10_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS10_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS11_SHIFT                           (22U)
#define PERI_EXTI_D3PCR1L_BIT_PCS11_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS11_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS12_SHIFT                           (24U)
#define PERI_EXTI_D3PCR1L_BIT_PCS12_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS12_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS13_SHIFT                           (26U)
#define PERI_EXTI_D3PCR1L_BIT_PCS13_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS13_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS14_SHIFT                           (28U)
#define PERI_EXTI_D3PCR1L_BIT_PCS14_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS14_SHIFT)
#define PERI_EXTI_D3PCR1L_BIT_PCS15_SHIFT                           (30U)
#define PERI_EXTI_D3PCR1L_BIT_PCS15_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1L_BIT_PCS15_SHIFT)

/*--- register D3PCR1H -------------------------------------------------*/
#define PERI_EXTI_D3PCR1H_BIT_PCS19_SHIFT                           (6U)
#define PERI_EXTI_D3PCR1H_BIT_PCS19_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1H_BIT_PCS19_SHIFT)
#define PERI_EXTI_D3PCR1H_BIT_PCS20_SHIFT                           (8U)
#define PERI_EXTI_D3PCR1H_BIT_PCS20_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1H_BIT_PCS20_SHIFT)
#define PERI_EXTI_D3PCR1H_BIT_PCS21_SHIFT                           (10U)
#define PERI_EXTI_D3PCR1H_BIT_PCS21_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1H_BIT_PCS21_SHIFT)
#define PERI_EXTI_D3PCR1H_BIT_PCS25_SHIFT                           (18U)
#define PERI_EXTI_D3PCR1H_BIT_PCS25_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR1H_BIT_PCS25_SHIFT)

/*--- register RTSR2 -------------------------------------------------*/
#define PERI_EXTI_RTSR2_BIT_TR49_SHIFT                              (17U)
#define PERI_EXTI_RTSR2_BIT_TR49_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR2_BIT_TR49_SHIFT)
#define PERI_EXTI_RTSR2_BIT_TR51_SHIFT                              (19U)
#define PERI_EXTI_RTSR2_BIT_TR51_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR2_BIT_TR51_SHIFT)

/*--- register FTSR2 -------------------------------------------------*/
#define PERI_EXTI_FTSR2_BIT_TR49_SHIFT                              (17U)
#define PERI_EXTI_FTSR2_BIT_TR49_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR2_BIT_TR49_SHIFT)
#define PERI_EXTI_FTSR2_BIT_TR51_SHIFT                              (19U)
#define PERI_EXTI_FTSR2_BIT_TR51_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR2_BIT_TR51_SHIFT)

/*--- register SWIER2 -------------------------------------------------*/
#define PERI_EXTI_SWIER2_BIT_SWIER49_SHIFT                          (17U)
#define PERI_EXTI_SWIER2_BIT_SWIER49_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER2_BIT_SWIER49_SHIFT)
#define PERI_EXTI_SWIER2_BIT_SWIER51_SHIFT                          (19U)
#define PERI_EXTI_SWIER2_BIT_SWIER51_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER2_BIT_SWIER51_SHIFT)

