minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register D3PMR2 -------------------------------------------------*/
#define PERI_EXTI_D3PMR2_BIT_MR34_SHIFT                             (2U)
#define PERI_EXTI_D3PMR2_BIT_MR34_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR34_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR35_SHIFT                             (3U)
#define PERI_EXTI_D3PMR2_BIT_MR35_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR35_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR41_SHIFT                             (9U)
#define PERI_EXTI_D3PMR2_BIT_MR41_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR41_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR48_SHIFT                             (16U)
#define PERI_EXTI_D3PMR2_BIT_MR48_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR48_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR49_SHIFT                             (17U)
#define PERI_EXTI_D3PMR2_BIT_MR49_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR49_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR50_SHIFT                             (18U)
#define PERI_EXTI_D3PMR2_BIT_MR50_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR50_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR51_SHIFT                             (19U)
#define PERI_EXTI_D3PMR2_BIT_MR51_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR51_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR52_SHIFT                             (20U)
#define PERI_EXTI_D3PMR2_BIT_MR52_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR52_SHIFT)
#define PERI_EXTI_D3PMR2_BIT_MR53_SHIFT                             (21U)
#define PERI_EXTI_D3PMR2_BIT_MR53_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR2_BIT_MR53_SHIFT)

/*--- register D3PCR2L -------------------------------------------------*/
#define PERI_EXTI_D3PCR2L_BIT_PCS34_SHIFT                           (4U)
#define PERI_EXTI_D3PCR2L_BIT_PCS34_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2L_BIT_PCS34_SHIFT)
#define PERI_EXTI_D3PCR2L_BIT_PCS35_SHIFT                           (6U)
#define PERI_EXTI_D3PCR2L_BIT_PCS35_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2L_BIT_PCS35_SHIFT)
#define PERI_EXTI_D3PCR2L_BIT_PCS41_SHIFT                           (18U)
#define PERI_EXTI_D3PCR2L_BIT_PCS41_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2L_BIT_PCS41_SHIFT)

/*--- register D3PCR2H -------------------------------------------------*/
#define PERI_EXTI_D3PCR2H_BIT_PCS48_SHIFT                           (0U)
#define PERI_EXTI_D3PCR2H_BIT_PCS48_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2H_BIT_PCS48_SHIFT)
#define PERI_EXTI_D3PCR2H_BIT_PCS49_SHIFT                           (2U)
#define PERI_EXTI_D3PCR2H_BIT_PCS49_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2H_BIT_PCS49_SHIFT)
#define PERI_EXTI_D3PCR2H_BIT_PCS50_SHIFT                           (4U)
#define PERI_EXTI_D3PCR2H_BIT_PCS50_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2H_BIT_PCS50_SHIFT)
#define PERI_EXTI_D3PCR2H_BIT_PCS51_SHIFT                           (6U)
#define PERI_EXTI_D3PCR2H_BIT_PCS51_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2H_BIT_PCS51_SHIFT)
#define PERI_EXTI_D3PCR2H_BIT_PCS52_SHIFT                           (8U)
#define PERI_EXTI_D3PCR2H_BIT_PCS52_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2H_BIT_PCS52_SHIFT)
#define PERI_EXTI_D3PCR2H_BIT_PCS53_SHIFT                           (10U)
#define PERI_EXTI_D3PCR2H_BIT_PCS53_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR2H_BIT_PCS53_SHIFT)

/*--- register RTSR3 -------------------------------------------------*/
#define PERI_EXTI_RTSR3_BIT_TR82_SHIFT                              (18U)
#define PERI_EXTI_RTSR3_BIT_TR82_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR3_BIT_TR82_SHIFT)
#define PERI_EXTI_RTSR3_BIT_TR84_SHIFT                              (20U)
#define PERI_EXTI_RTSR3_BIT_TR84_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR3_BIT_TR84_SHIFT)
#define PERI_EXTI_RTSR3_BIT_TR85_SHIFT                              (21U)
#define PERI_EXTI_RTSR3_BIT_TR85_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR3_BIT_TR85_SHIFT)
#define PERI_EXTI_RTSR3_BIT_TR86_SHIFT                              (22U)
#define PERI_EXTI_RTSR3_BIT_TR86_MASK                               (((1U<<1)-1) << PERI_EXTI_RTSR3_BIT_TR86_SHIFT)

/*--- register FTSR3 -------------------------------------------------*/
#define PERI_EXTI_FTSR3_BIT_TR82_SHIFT                              (18U)
#define PERI_EXTI_FTSR3_BIT_TR82_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR3_BIT_TR82_SHIFT)
#define PERI_EXTI_FTSR3_BIT_TR84_SHIFT                              (20U)
#define PERI_EXTI_FTSR3_BIT_TR84_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR3_BIT_TR84_SHIFT)
#define PERI_EXTI_FTSR3_BIT_TR85_SHIFT                              (21U)
#define PERI_EXTI_FTSR3_BIT_TR85_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR3_BIT_TR85_SHIFT)
#define PERI_EXTI_FTSR3_BIT_TR86_SHIFT                              (22U)
#define PERI_EXTI_FTSR3_BIT_TR86_MASK                               (((1U<<1)-1) << PERI_EXTI_FTSR3_BIT_TR86_SHIFT)

/*--- register SWIER3 -------------------------------------------------*/
#define PERI_EXTI_SWIER3_BIT_SWIER82_SHIFT                          (18U)
#define PERI_EXTI_SWIER3_BIT_SWIER82_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER3_BIT_SWIER82_SHIFT)
#define PERI_EXTI_SWIER3_BIT_SWIER84_SHIFT                          (20U)
#define PERI_EXTI_SWIER3_BIT_SWIER84_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER3_BIT_SWIER84_SHIFT)
#define PERI_EXTI_SWIER3_BIT_SWIER85_SHIFT                          (21U)
#define PERI_EXTI_SWIER3_BIT_SWIER85_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER3_BIT_SWIER85_SHIFT)
#define PERI_EXTI_SWIER3_BIT_SWIER86_SHIFT                          (22U)
#define PERI_EXTI_SWIER3_BIT_SWIER86_MASK                           (((1U<<1)-1) << PERI_EXTI_SWIER3_BIT_SWIER86_SHIFT)

/*--- register D3PMR3 -------------------------------------------------*/
#define PERI_EXTI_D3PMR3_BIT_MR88_SHIFT                             (24U)
#define PERI_EXTI_D3PMR3_BIT_MR88_MASK                              (((1U<<1)-1) << PERI_EXTI_D3PMR3_BIT_MR88_SHIFT)

/*--- register D3PCR3H -------------------------------------------------*/
#define PERI_EXTI_D3PCR3H_BIT_PCS88_SHIFT                           (18U)
#define PERI_EXTI_D3PCR3H_BIT_PCS88_MASK                            (((1U<<2)-1) << PERI_EXTI_D3PCR3H_BIT_PCS88_SHIFT)

/*--- register CPUIMR1 -------------------------------------------------*/
#define PERI_EXTI_CPUIMR1_BIT_MR0_SHIFT                             (0U)
#define PERI_EXTI_CPUIMR1_BIT_MR0_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR0_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR1_SHIFT                             (1U)
#define PERI_EXTI_CPUIMR1_BIT_MR1_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR1_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR2_SHIFT                             (2U)
#define PERI_EXTI_CPUIMR1_BIT_MR2_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR2_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR3_SHIFT                             (3U)
#define PERI_EXTI_CPUIMR1_BIT_MR3_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR3_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR4_SHIFT                             (4U)
#define PERI_EXTI_CPUIMR1_BIT_MR4_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR4_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR5_SHIFT                             (5U)
#define PERI_EXTI_CPUIMR1_BIT_MR5_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR5_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR6_SHIFT                             (6U)
#define PERI_EXTI_CPUIMR1_BIT_MR6_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR6_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR7_SHIFT                             (7U)
#define PERI_EXTI_CPUIMR1_BIT_MR7_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR7_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR8_SHIFT                             (8U)
#define PERI_EXTI_CPUIMR1_BIT_MR8_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR8_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR9_SHIFT                             (9U)
#define PERI_EXTI_CPUIMR1_BIT_MR9_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR9_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR10_SHIFT                            (10U)
#define PERI_EXTI_CPUIMR1_BIT_MR10_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR10_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR11_SHIFT                            (11U)
#define PERI_EXTI_CPUIMR1_BIT_MR11_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR11_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR12_SHIFT                            (12U)
#define PERI_EXTI_CPUIMR1_BIT_MR12_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR12_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR13_SHIFT                            (13U)
#define PERI_EXTI_CPUIMR1_BIT_MR13_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR13_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR14_SHIFT                            (14U)
#define PERI_EXTI_CPUIMR1_BIT_MR14_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR14_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR15_SHIFT                            (15U)
#define PERI_EXTI_CPUIMR1_BIT_MR15_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR15_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR16_SHIFT                            (16U)
#define PERI_EXTI_CPUIMR1_BIT_MR16_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR16_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR17_SHIFT                            (17U)
#define PERI_EXTI_CPUIMR1_BIT_MR17_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR17_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR18_SHIFT                            (18U)
#define PERI_EXTI_CPUIMR1_BIT_MR18_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR18_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR19_SHIFT                            (19U)
#define PERI_EXTI_CPUIMR1_BIT_MR19_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR19_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR20_SHIFT                            (20U)
#define PERI_EXTI_CPUIMR1_BIT_MR20_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR20_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR21_SHIFT                            (21U)
#define PERI_EXTI_CPUIMR1_BIT_MR21_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR21_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR22_SHIFT                            (22U)
#define PERI_EXTI_CPUIMR1_BIT_MR22_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR22_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR23_SHIFT                            (23U)
#define PERI_EXTI_CPUIMR1_BIT_MR23_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR23_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR24_SHIFT                            (24U)
#define PERI_EXTI_CPUIMR1_BIT_MR24_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR24_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR25_SHIFT                            (25U)
#define PERI_EXTI_CPUIMR1_BIT_MR25_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR25_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR26_SHIFT                            (26U)
#define PERI_EXTI_CPUIMR1_BIT_MR26_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR26_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR27_SHIFT                            (27U)
#define PERI_EXTI_CPUIMR1_BIT_MR27_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR27_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR28_SHIFT                            (28U)
#define PERI_EXTI_CPUIMR1_BIT_MR28_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR28_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR29_SHIFT                            (29U)
#define PERI_EXTI_CPUIMR1_BIT_MR29_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR29_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR30_SHIFT                            (30U)
#define PERI_EXTI_CPUIMR1_BIT_MR30_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR30_SHIFT)
#define PERI_EXTI_CPUIMR1_BIT_MR31_SHIFT                            (31U)
#define PERI_EXTI_CPUIMR1_BIT_MR31_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR1_BIT_MR31_SHIFT)

/*--- register CPUEMR1 -------------------------------------------------*/
#define PERI_EXTI_CPUEMR1_BIT_MR0_SHIFT                             (0U)
#define PERI_EXTI_CPUEMR1_BIT_MR0_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR0_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR1_SHIFT                             (1U)
#define PERI_EXTI_CPUEMR1_BIT_MR1_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR1_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR2_SHIFT                             (2U)
#define PERI_EXTI_CPUEMR1_BIT_MR2_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR2_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR3_SHIFT                             (3U)
#define PERI_EXTI_CPUEMR1_BIT_MR3_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR3_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR4_SHIFT                             (4U)
#define PERI_EXTI_CPUEMR1_BIT_MR4_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR4_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR5_SHIFT                             (5U)
#define PERI_EXTI_CPUEMR1_BIT_MR5_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR5_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR6_SHIFT                             (6U)
#define PERI_EXTI_CPUEMR1_BIT_MR6_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR6_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR7_SHIFT                             (7U)
#define PERI_EXTI_CPUEMR1_BIT_MR7_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR7_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR8_SHIFT                             (8U)
#define PERI_EXTI_CPUEMR1_BIT_MR8_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR8_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR9_SHIFT                             (9U)
#define PERI_EXTI_CPUEMR1_BIT_MR9_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR9_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR10_SHIFT                            (10U)
#define PERI_EXTI_CPUEMR1_BIT_MR10_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR10_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR11_SHIFT                            (11U)
#define PERI_EXTI_CPUEMR1_BIT_MR11_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR11_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR12_SHIFT                            (12U)
#define PERI_EXTI_CPUEMR1_BIT_MR12_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR12_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR13_SHIFT                            (13U)
#define PERI_EXTI_CPUEMR1_BIT_MR13_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR13_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR14_SHIFT                            (14U)
#define PERI_EXTI_CPUEMR1_BIT_MR14_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR14_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR15_SHIFT                            (15U)
#define PERI_EXTI_CPUEMR1_BIT_MR15_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR15_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR16_SHIFT                            (16U)
#define PERI_EXTI_CPUEMR1_BIT_MR16_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR16_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR17_SHIFT                            (17U)
#define PERI_EXTI_CPUEMR1_BIT_MR17_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR17_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR18_SHIFT                            (18U)
#define PERI_EXTI_CPUEMR1_BIT_MR18_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR18_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR19_SHIFT                            (19U)
#define PERI_EXTI_CPUEMR1_BIT_MR19_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR19_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR20_SHIFT                            (20U)
#define PERI_EXTI_CPUEMR1_BIT_MR20_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR20_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR21_SHIFT                            (21U)
#define PERI_EXTI_CPUEMR1_BIT_MR21_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR21_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR22_SHIFT                            (22U)
#define PERI_EXTI_CPUEMR1_BIT_MR22_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR22_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR23_SHIFT                            (23U)
#define PERI_EXTI_CPUEMR1_BIT_MR23_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR23_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR24_SHIFT                            (24U)
#define PERI_EXTI_CPUEMR1_BIT_MR24_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR24_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR25_SHIFT                            (25U)
#define PERI_EXTI_CPUEMR1_BIT_MR25_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR25_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR26_SHIFT                            (26U)
#define PERI_EXTI_CPUEMR1_BIT_MR26_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR26_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR27_SHIFT                            (27U)
#define PERI_EXTI_CPUEMR1_BIT_MR27_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR27_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR28_SHIFT                            (28U)
#define PERI_EXTI_CPUEMR1_BIT_MR28_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR28_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR29_SHIFT                            (29U)
#define PERI_EXTI_CPUEMR1_BIT_MR29_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR29_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR30_SHIFT                            (30U)
#define PERI_EXTI_CPUEMR1_BIT_MR30_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR30_SHIFT)
#define PERI_EXTI_CPUEMR1_BIT_MR31_SHIFT                            (31U)
#define PERI_EXTI_CPUEMR1_BIT_MR31_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR1_BIT_MR31_SHIFT)

/*--- register CPUPR1 -------------------------------------------------*/
#define PERI_EXTI_CPUPR1_BIT_PR0_SHIFT                              (0U)
#define PERI_EXTI_CPUPR1_BIT_PR0_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR0_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR1_SHIFT                              (1U)
#define PERI_EXTI_CPUPR1_BIT_PR1_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR1_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR2_SHIFT                              (2U)
#define PERI_EXTI_CPUPR1_BIT_PR2_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR2_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR3_SHIFT                              (3U)
#define PERI_EXTI_CPUPR1_BIT_PR3_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR3_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR4_SHIFT                              (4U)
#define PERI_EXTI_CPUPR1_BIT_PR4_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR4_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR5_SHIFT                              (5U)
#define PERI_EXTI_CPUPR1_BIT_PR5_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR5_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR6_SHIFT                              (6U)
#define PERI_EXTI_CPUPR1_BIT_PR6_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR6_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR7_SHIFT                              (7U)
#define PERI_EXTI_CPUPR1_BIT_PR7_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR7_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR8_SHIFT                              (8U)
#define PERI_EXTI_CPUPR1_BIT_PR8_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR8_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR9_SHIFT                              (9U)
#define PERI_EXTI_CPUPR1_BIT_PR9_MASK                               (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR9_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR10_SHIFT                             (10U)
#define PERI_EXTI_CPUPR1_BIT_PR10_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR10_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR11_SHIFT                             (11U)
#define PERI_EXTI_CPUPR1_BIT_PR11_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR11_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR12_SHIFT                             (12U)
#define PERI_EXTI_CPUPR1_BIT_PR12_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR12_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR13_SHIFT                             (13U)
#define PERI_EXTI_CPUPR1_BIT_PR13_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR13_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR14_SHIFT                             (14U)
#define PERI_EXTI_CPUPR1_BIT_PR14_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR14_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR15_SHIFT                             (15U)
#define PERI_EXTI_CPUPR1_BIT_PR15_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR15_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR16_SHIFT                             (16U)
#define PERI_EXTI_CPUPR1_BIT_PR16_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR16_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR17_SHIFT                             (17U)
#define PERI_EXTI_CPUPR1_BIT_PR17_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR17_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR18_SHIFT                             (18U)
#define PERI_EXTI_CPUPR1_BIT_PR18_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR18_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR19_SHIFT                             (19U)
#define PERI_EXTI_CPUPR1_BIT_PR19_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR19_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR20_SHIFT                             (20U)
#define PERI_EXTI_CPUPR1_BIT_PR20_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR20_SHIFT)
#define PERI_EXTI_CPUPR1_BIT_PR21_SHIFT                             (21U)
#define PERI_EXTI_CPUPR1_BIT_PR21_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR1_BIT_PR21_SHIFT)

