minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CPUIMR2 -------------------------------------------------*/
#define PERI_EXTI_CPUIMR2_BIT_MR0_SHIFT                             (0U)
#define PERI_EXTI_CPUIMR2_BIT_MR0_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR0_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR1_SHIFT                             (1U)
#define PERI_EXTI_CPUIMR2_BIT_MR1_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR1_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR2_SHIFT                             (2U)
#define PERI_EXTI_CPUIMR2_BIT_MR2_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR2_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR3_SHIFT                             (3U)
#define PERI_EXTI_CPUIMR2_BIT_MR3_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR3_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR4_SHIFT                             (4U)
#define PERI_EXTI_CPUIMR2_BIT_MR4_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR4_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR5_SHIFT                             (5U)
#define PERI_EXTI_CPUIMR2_BIT_MR5_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR5_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR6_SHIFT                             (6U)
#define PERI_EXTI_CPUIMR2_BIT_MR6_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR6_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR7_SHIFT                             (7U)
#define PERI_EXTI_CPUIMR2_BIT_MR7_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR7_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR8_SHIFT                             (8U)
#define PERI_EXTI_CPUIMR2_BIT_MR8_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR8_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR9_SHIFT                             (9U)
#define PERI_EXTI_CPUIMR2_BIT_MR9_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR9_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR10_SHIFT                            (10U)
#define PERI_EXTI_CPUIMR2_BIT_MR10_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR10_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR11_SHIFT                            (11U)
#define PERI_EXTI_CPUIMR2_BIT_MR11_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR11_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR12_SHIFT                            (12U)
#define PERI_EXTI_CPUIMR2_BIT_MR12_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR12_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR14_SHIFT                            (14U)
#define PERI_EXTI_CPUIMR2_BIT_MR14_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR14_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR15_SHIFT                            (15U)
#define PERI_EXTI_CPUIMR2_BIT_MR15_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR15_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR16_SHIFT                            (16U)
#define PERI_EXTI_CPUIMR2_BIT_MR16_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR16_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR17_SHIFT                            (17U)
#define PERI_EXTI_CPUIMR2_BIT_MR17_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR17_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR18_SHIFT                            (18U)
#define PERI_EXTI_CPUIMR2_BIT_MR18_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR18_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR19_SHIFT                            (19U)
#define PERI_EXTI_CPUIMR2_BIT_MR19_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR19_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR20_SHIFT                            (20U)
#define PERI_EXTI_CPUIMR2_BIT_MR20_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR20_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR21_SHIFT                            (21U)
#define PERI_EXTI_CPUIMR2_BIT_MR21_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR21_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR22_SHIFT                            (22U)
#define PERI_EXTI_CPUIMR2_BIT_MR22_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR22_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR23_SHIFT                            (23U)
#define PERI_EXTI_CPUIMR2_BIT_MR23_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR23_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR24_SHIFT                            (24U)
#define PERI_EXTI_CPUIMR2_BIT_MR24_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR24_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR25_SHIFT                            (25U)
#define PERI_EXTI_CPUIMR2_BIT_MR25_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR25_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR26_SHIFT                            (26U)
#define PERI_EXTI_CPUIMR2_BIT_MR26_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR26_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR27_SHIFT                            (27U)
#define PERI_EXTI_CPUIMR2_BIT_MR27_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR27_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR28_SHIFT                            (28U)
#define PERI_EXTI_CPUIMR2_BIT_MR28_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR28_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR29_SHIFT                            (29U)
#define PERI_EXTI_CPUIMR2_BIT_MR29_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR29_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR30_SHIFT                            (30U)
#define PERI_EXTI_CPUIMR2_BIT_MR30_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR30_SHIFT)
#define PERI_EXTI_CPUIMR2_BIT_MR31_SHIFT                            (31U)
#define PERI_EXTI_CPUIMR2_BIT_MR31_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR2_BIT_MR31_SHIFT)

