minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CPUEMR2 -------------------------------------------------*/
#define PERI_EXTI_CPUEMR2_BIT_MR32_SHIFT                            (0U)
#define PERI_EXTI_CPUEMR2_BIT_MR32_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR32_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR33_SHIFT                            (1U)
#define PERI_EXTI_CPUEMR2_BIT_MR33_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR33_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR34_SHIFT                            (2U)
#define PERI_EXTI_CPUEMR2_BIT_MR34_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR34_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR35_SHIFT                            (3U)
#define PERI_EXTI_CPUEMR2_BIT_MR35_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR35_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR36_SHIFT                            (4U)
#define PERI_EXTI_CPUEMR2_BIT_MR36_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR36_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR37_SHIFT                            (5U)
#define PERI_EXTI_CPUEMR2_BIT_MR37_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR37_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR38_SHIFT                            (6U)
#define PERI_EXTI_CPUEMR2_BIT_MR38_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR38_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR39_SHIFT                            (7U)
#define PERI_EXTI_CPUEMR2_BIT_MR39_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR39_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR40_SHIFT                            (8U)
#define PERI_EXTI_CPUEMR2_BIT_MR40_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR40_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR41_SHIFT                            (9U)
#define PERI_EXTI_CPUEMR2_BIT_MR41_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR41_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR42_SHIFT                            (10U)
#define PERI_EXTI_CPUEMR2_BIT_MR42_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR42_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR43_SHIFT                            (11U)
#define PERI_EXTI_CPUEMR2_BIT_MR43_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR43_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR44_SHIFT                            (12U)
#define PERI_EXTI_CPUEMR2_BIT_MR44_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR44_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR46_SHIFT                            (14U)
#define PERI_EXTI_CPUEMR2_BIT_MR46_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR46_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR47_SHIFT                            (15U)
#define PERI_EXTI_CPUEMR2_BIT_MR47_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR47_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR48_SHIFT                            (16U)
#define PERI_EXTI_CPUEMR2_BIT_MR48_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR48_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR49_SHIFT                            (17U)
#define PERI_EXTI_CPUEMR2_BIT_MR49_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR49_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR50_SHIFT                            (18U)
#define PERI_EXTI_CPUEMR2_BIT_MR50_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR50_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR51_SHIFT                            (19U)
#define PERI_EXTI_CPUEMR2_BIT_MR51_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR51_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR52_SHIFT                            (20U)
#define PERI_EXTI_CPUEMR2_BIT_MR52_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR52_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR53_SHIFT                            (21U)
#define PERI_EXTI_CPUEMR2_BIT_MR53_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR53_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR54_SHIFT                            (22U)
#define PERI_EXTI_CPUEMR2_BIT_MR54_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR54_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR55_SHIFT                            (23U)
#define PERI_EXTI_CPUEMR2_BIT_MR55_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR55_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR56_SHIFT                            (24U)
#define PERI_EXTI_CPUEMR2_BIT_MR56_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR56_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR57_SHIFT                            (25U)
#define PERI_EXTI_CPUEMR2_BIT_MR57_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR57_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR58_SHIFT                            (26U)
#define PERI_EXTI_CPUEMR2_BIT_MR58_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR58_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR59_SHIFT                            (27U)
#define PERI_EXTI_CPUEMR2_BIT_MR59_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR59_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR60_SHIFT                            (28U)
#define PERI_EXTI_CPUEMR2_BIT_MR60_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR60_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR61_SHIFT                            (29U)
#define PERI_EXTI_CPUEMR2_BIT_MR61_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR61_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR62_SHIFT                            (30U)
#define PERI_EXTI_CPUEMR2_BIT_MR62_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR62_SHIFT)
#define PERI_EXTI_CPUEMR2_BIT_MR63_SHIFT                            (31U)
#define PERI_EXTI_CPUEMR2_BIT_MR63_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR2_BIT_MR63_SHIFT)

/*--- register CPUPR2 -------------------------------------------------*/
#define PERI_EXTI_CPUPR2_BIT_PR49_SHIFT                             (17U)
#define PERI_EXTI_CPUPR2_BIT_PR49_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR2_BIT_PR49_SHIFT)
#define PERI_EXTI_CPUPR2_BIT_PR51_SHIFT                             (19U)
#define PERI_EXTI_CPUPR2_BIT_PR51_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR2_BIT_PR51_SHIFT)

/*--- register CPUIMR3 -------------------------------------------------*/
#define PERI_EXTI_CPUIMR3_BIT_MR64_SHIFT                            (0U)
#define PERI_EXTI_CPUIMR3_BIT_MR64_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR64_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR65_SHIFT                            (1U)
#define PERI_EXTI_CPUIMR3_BIT_MR65_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR65_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR66_SHIFT                            (2U)
#define PERI_EXTI_CPUIMR3_BIT_MR66_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR66_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR67_SHIFT                            (3U)
#define PERI_EXTI_CPUIMR3_BIT_MR67_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR67_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR68_SHIFT                            (4U)
#define PERI_EXTI_CPUIMR3_BIT_MR68_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR68_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR69_SHIFT                            (5U)
#define PERI_EXTI_CPUIMR3_BIT_MR69_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR69_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR70_SHIFT                            (6U)
#define PERI_EXTI_CPUIMR3_BIT_MR70_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR70_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR71_SHIFT                            (7U)
#define PERI_EXTI_CPUIMR3_BIT_MR71_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR71_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR72_SHIFT                            (8U)
#define PERI_EXTI_CPUIMR3_BIT_MR72_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR72_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR73_SHIFT                            (9U)
#define PERI_EXTI_CPUIMR3_BIT_MR73_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR73_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR74_SHIFT                            (10U)
#define PERI_EXTI_CPUIMR3_BIT_MR74_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR74_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR75_SHIFT                            (11U)
#define PERI_EXTI_CPUIMR3_BIT_MR75_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR75_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR76_SHIFT                            (12U)
#define PERI_EXTI_CPUIMR3_BIT_MR76_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR76_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR77_SHIFT                            (13U)
#define PERI_EXTI_CPUIMR3_BIT_MR77_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR77_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR78_SHIFT                            (14U)
#define PERI_EXTI_CPUIMR3_BIT_MR78_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR78_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR79_SHIFT                            (15U)
#define PERI_EXTI_CPUIMR3_BIT_MR79_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR79_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR80_SHIFT                            (16U)
#define PERI_EXTI_CPUIMR3_BIT_MR80_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR80_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR82_SHIFT                            (18U)
#define PERI_EXTI_CPUIMR3_BIT_MR82_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR82_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR84_SHIFT                            (20U)
#define PERI_EXTI_CPUIMR3_BIT_MR84_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR84_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR85_SHIFT                            (21U)
#define PERI_EXTI_CPUIMR3_BIT_MR85_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR85_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR86_SHIFT                            (22U)
#define PERI_EXTI_CPUIMR3_BIT_MR86_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR86_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR87_SHIFT                            (23U)
#define PERI_EXTI_CPUIMR3_BIT_MR87_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR87_SHIFT)
#define PERI_EXTI_CPUIMR3_BIT_MR88_SHIFT                            (24U)
#define PERI_EXTI_CPUIMR3_BIT_MR88_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUIMR3_BIT_MR88_SHIFT)

/*--- register CPUEMR3 -------------------------------------------------*/
#define PERI_EXTI_CPUEMR3_BIT_MR64_SHIFT                            (0U)
#define PERI_EXTI_CPUEMR3_BIT_MR64_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR64_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR65_SHIFT                            (1U)
#define PERI_EXTI_CPUEMR3_BIT_MR65_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR65_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR66_SHIFT                            (2U)
#define PERI_EXTI_CPUEMR3_BIT_MR66_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR66_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR67_SHIFT                            (3U)
#define PERI_EXTI_CPUEMR3_BIT_MR67_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR67_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR68_SHIFT                            (4U)
#define PERI_EXTI_CPUEMR3_BIT_MR68_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR68_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR69_SHIFT                            (5U)
#define PERI_EXTI_CPUEMR3_BIT_MR69_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR69_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR70_SHIFT                            (6U)
#define PERI_EXTI_CPUEMR3_BIT_MR70_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR70_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR71_SHIFT                            (7U)
#define PERI_EXTI_CPUEMR3_BIT_MR71_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR71_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR72_SHIFT                            (8U)
#define PERI_EXTI_CPUEMR3_BIT_MR72_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR72_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR73_SHIFT                            (9U)
#define PERI_EXTI_CPUEMR3_BIT_MR73_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR73_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR74_SHIFT                            (10U)
#define PERI_EXTI_CPUEMR3_BIT_MR74_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR74_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR75_SHIFT                            (11U)
#define PERI_EXTI_CPUEMR3_BIT_MR75_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR75_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR76_SHIFT                            (12U)
#define PERI_EXTI_CPUEMR3_BIT_MR76_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR76_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR77_SHIFT                            (13U)
#define PERI_EXTI_CPUEMR3_BIT_MR77_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR77_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR78_SHIFT                            (14U)
#define PERI_EXTI_CPUEMR3_BIT_MR78_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR78_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR79_SHIFT                            (15U)
#define PERI_EXTI_CPUEMR3_BIT_MR79_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR79_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR80_SHIFT                            (16U)
#define PERI_EXTI_CPUEMR3_BIT_MR80_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR80_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR82_SHIFT                            (18U)
#define PERI_EXTI_CPUEMR3_BIT_MR82_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR82_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR84_SHIFT                            (20U)
#define PERI_EXTI_CPUEMR3_BIT_MR84_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR84_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR85_SHIFT                            (21U)
#define PERI_EXTI_CPUEMR3_BIT_MR85_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR85_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR86_SHIFT                            (22U)
#define PERI_EXTI_CPUEMR3_BIT_MR86_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR86_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR87_SHIFT                            (23U)
#define PERI_EXTI_CPUEMR3_BIT_MR87_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR87_SHIFT)
#define PERI_EXTI_CPUEMR3_BIT_MR88_SHIFT                            (24U)
#define PERI_EXTI_CPUEMR3_BIT_MR88_MASK                             (((1U<<1)-1) << PERI_EXTI_CPUEMR3_BIT_MR88_SHIFT)

/*--- register CPUPR3 -------------------------------------------------*/
#define PERI_EXTI_CPUPR3_BIT_PR82_SHIFT                             (18U)
#define PERI_EXTI_CPUPR3_BIT_PR82_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR3_BIT_PR82_SHIFT)
#define PERI_EXTI_CPUPR3_BIT_PR84_SHIFT                             (20U)
#define PERI_EXTI_CPUPR3_BIT_PR84_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR3_BIT_PR84_SHIFT)
#define PERI_EXTI_CPUPR3_BIT_PR85_SHIFT                             (21U)
#define PERI_EXTI_CPUPR3_BIT_PR85_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR3_BIT_PR85_SHIFT)
#define PERI_EXTI_CPUPR3_BIT_PR86_SHIFT                             (22U)
#define PERI_EXTI_CPUPR3_BIT_PR86_MASK                              (((1U<<1)-1) << PERI_EXTI_CPUPR3_BIT_PR86_SHIFT)

/*--- register DMAMR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMAMR_BIT_SWR_SHIFT                       (0U)
#define PERI_Ethernet_DMA_DMAMR_BIT_SWR_MASK                        (((1U<<1)-1) << PERI_Ethernet_DMA_DMAMR_BIT_SWR_SHIFT)
#define PERI_Ethernet_DMA_DMAMR_BIT_DA_SHIFT                        (1U)
#define PERI_Ethernet_DMA_DMAMR_BIT_DA_MASK                         (((1U<<1)-1) << PERI_Ethernet_DMA_DMAMR_BIT_DA_SHIFT)
#define PERI_Ethernet_DMA_DMAMR_BIT_TXPR_SHIFT                      (11U)
#define PERI_Ethernet_DMA_DMAMR_BIT_TXPR_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMAMR_BIT_TXPR_SHIFT)
#define PERI_Ethernet_DMA_DMAMR_BIT_PR_SHIFT                        (12U)
#define PERI_Ethernet_DMA_DMAMR_BIT_PR_MASK                         (((1U<<3)-1) << PERI_Ethernet_DMA_DMAMR_BIT_PR_SHIFT)
#define PERI_Ethernet_DMA_DMAMR_BIT_INTM_SHIFT                      (16U)
#define PERI_Ethernet_DMA_DMAMR_BIT_INTM_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMAMR_BIT_INTM_SHIFT)

/*--- register DMASBMR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMASBMR_BIT_FB_SHIFT                      (0U)
#define PERI_Ethernet_DMA_DMASBMR_BIT_FB_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMASBMR_BIT_FB_SHIFT)
#define PERI_Ethernet_DMA_DMASBMR_BIT_AAL_SHIFT                     (12U)
#define PERI_Ethernet_DMA_DMASBMR_BIT_AAL_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMASBMR_BIT_AAL_SHIFT)
#define PERI_Ethernet_DMA_DMASBMR_BIT_MB_SHIFT                      (14U)
#define PERI_Ethernet_DMA_DMASBMR_BIT_MB_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMASBMR_BIT_MB_SHIFT)
#define PERI_Ethernet_DMA_DMASBMR_BIT_RB_SHIFT                      (15U)
#define PERI_Ethernet_DMA_DMASBMR_BIT_RB_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMASBMR_BIT_RB_SHIFT)

