minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DMAISR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMAISR_BIT_DC0IS_SHIFT                    (0U)
#define PERI_Ethernet_DMA_DMAISR_BIT_DC0IS_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMAISR_BIT_DC0IS_SHIFT)
#define PERI_Ethernet_DMA_DMAISR_BIT_MTLIS_SHIFT                    (16U)
#define PERI_Ethernet_DMA_DMAISR_BIT_MTLIS_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMAISR_BIT_MTLIS_SHIFT)
#define PERI_Ethernet_DMA_DMAISR_BIT_MACIS_SHIFT                    (17U)
#define PERI_Ethernet_DMA_DMAISR_BIT_MACIS_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMAISR_BIT_MACIS_SHIFT)

/*--- register DMADSR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMADSR_BIT_AXWHSTS_SHIFT                  (0U)
#define PERI_Ethernet_DMA_DMADSR_BIT_AXWHSTS_MASK                   (((1U<<1)-1) << PERI_Ethernet_DMA_DMADSR_BIT_AXWHSTS_SHIFT)
#define PERI_Ethernet_DMA_DMADSR_BIT_RPS0_SHIFT                     (8U)
#define PERI_Ethernet_DMA_DMADSR_BIT_RPS0_MASK                      (((1U<<4)-1) << PERI_Ethernet_DMA_DMADSR_BIT_RPS0_SHIFT)
#define PERI_Ethernet_DMA_DMADSR_BIT_TPS0_SHIFT                     (12U)
#define PERI_Ethernet_DMA_DMADSR_BIT_TPS0_MASK                      (((1U<<4)-1) << PERI_Ethernet_DMA_DMADSR_BIT_TPS0_SHIFT)

/*--- register DMACCR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACCR_BIT_MSS_SHIFT                      (0U)
#define PERI_Ethernet_DMA_DMACCR_BIT_MSS_MASK                       (((1U<<14)-1) << PERI_Ethernet_DMA_DMACCR_BIT_MSS_SHIFT)
#define PERI_Ethernet_DMA_DMACCR_BIT_PBLX8_SHIFT                    (16U)
#define PERI_Ethernet_DMA_DMACCR_BIT_PBLX8_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACCR_BIT_PBLX8_SHIFT)
#define PERI_Ethernet_DMA_DMACCR_BIT_DSL_SHIFT                      (18U)
#define PERI_Ethernet_DMA_DMACCR_BIT_DSL_MASK                       (((1U<<3)-1) << PERI_Ethernet_DMA_DMACCR_BIT_DSL_SHIFT)

/*--- register DMACTxCR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACTXCR_BIT_ST_SHIFT                     (0U)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_ST_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACTXCR_BIT_ST_SHIFT)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_OSF_SHIFT                    (4U)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_OSF_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACTXCR_BIT_OSF_SHIFT)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_TSE_SHIFT                    (12U)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_TSE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACTXCR_BIT_TSE_SHIFT)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_TXPBL_SHIFT                  (16U)
#define PERI_Ethernet_DMA_DMACTXCR_BIT_TXPBL_MASK                   (((1U<<6)-1) << PERI_Ethernet_DMA_DMACTXCR_BIT_TXPBL_SHIFT)

/*--- register DMACRxCR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACRXCR_BIT_SR_SHIFT                     (0U)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_SR_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACRXCR_BIT_SR_SHIFT)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_RBSZ_SHIFT                   (1U)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_RBSZ_MASK                    (((1U<<14)-1) << PERI_Ethernet_DMA_DMACRXCR_BIT_RBSZ_SHIFT)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_RXPBL_SHIFT                  (16U)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_RXPBL_MASK                   (((1U<<6)-1) << PERI_Ethernet_DMA_DMACRXCR_BIT_RXPBL_SHIFT)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_RPF_SHIFT                    (31U)
#define PERI_Ethernet_DMA_DMACRXCR_BIT_RPF_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACRXCR_BIT_RPF_SHIFT)

/*--- register DMACTxDLAR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACTXDLAR_BIT_TDESLA_SHIFT               (2U)
#define PERI_Ethernet_DMA_DMACTXDLAR_BIT_TDESLA_MASK                (((1U<<30)-1) << PERI_Ethernet_DMA_DMACTXDLAR_BIT_TDESLA_SHIFT)

/*--- register DMACRxDLAR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACRXDLAR_BIT_RDESLA_SHIFT               (2U)
#define PERI_Ethernet_DMA_DMACRXDLAR_BIT_RDESLA_MASK                (((1U<<30)-1) << PERI_Ethernet_DMA_DMACRXDLAR_BIT_RDESLA_SHIFT)

/*--- register DMACTxDTPR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACTXDTPR_BIT_TDT_SHIFT                  (2U)
#define PERI_Ethernet_DMA_DMACTXDTPR_BIT_TDT_MASK                   (((1U<<30)-1) << PERI_Ethernet_DMA_DMACTXDTPR_BIT_TDT_SHIFT)

/*--- register DMACRxDTPR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACRXDTPR_BIT_RDT_SHIFT                  (2U)
#define PERI_Ethernet_DMA_DMACRXDTPR_BIT_RDT_MASK                   (((1U<<30)-1) << PERI_Ethernet_DMA_DMACRXDTPR_BIT_RDT_SHIFT)

/*--- register DMACTxRLR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACTXRLR_BIT_TDRL_SHIFT                  (0U)
#define PERI_Ethernet_DMA_DMACTXRLR_BIT_TDRL_MASK                   (((1U<<10)-1) << PERI_Ethernet_DMA_DMACTXRLR_BIT_TDRL_SHIFT)

/*--- register DMACRxRLR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACRXRLR_BIT_RDRL_SHIFT                  (0U)
#define PERI_Ethernet_DMA_DMACRXRLR_BIT_RDRL_MASK                   (((1U<<10)-1) << PERI_Ethernet_DMA_DMACRXRLR_BIT_RDRL_SHIFT)

/*--- register DMACIER -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACIER_BIT_TIE_SHIFT                     (0U)
#define PERI_Ethernet_DMA_DMACIER_BIT_TIE_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_TIE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_TXSE_SHIFT                    (1U)
#define PERI_Ethernet_DMA_DMACIER_BIT_TXSE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_TXSE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_TBUE_SHIFT                    (2U)
#define PERI_Ethernet_DMA_DMACIER_BIT_TBUE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_TBUE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_RIE_SHIFT                     (6U)
#define PERI_Ethernet_DMA_DMACIER_BIT_RIE_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_RIE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_RBUE_SHIFT                    (7U)
#define PERI_Ethernet_DMA_DMACIER_BIT_RBUE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_RBUE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_RSE_SHIFT                     (8U)
#define PERI_Ethernet_DMA_DMACIER_BIT_RSE_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_RSE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_RWTE_SHIFT                    (9U)
#define PERI_Ethernet_DMA_DMACIER_BIT_RWTE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_RWTE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_ETIE_SHIFT                    (10U)
#define PERI_Ethernet_DMA_DMACIER_BIT_ETIE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_ETIE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_ERIE_SHIFT                    (11U)
#define PERI_Ethernet_DMA_DMACIER_BIT_ERIE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_ERIE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_FBEE_SHIFT                    (12U)
#define PERI_Ethernet_DMA_DMACIER_BIT_FBEE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_FBEE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_CDEE_SHIFT                    (13U)
#define PERI_Ethernet_DMA_DMACIER_BIT_CDEE_MASK                     (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_CDEE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_AIE_SHIFT                     (14U)
#define PERI_Ethernet_DMA_DMACIER_BIT_AIE_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_AIE_SHIFT)
#define PERI_Ethernet_DMA_DMACIER_BIT_NIE_SHIFT                     (15U)
#define PERI_Ethernet_DMA_DMACIER_BIT_NIE_MASK                      (((1U<<1)-1) << PERI_Ethernet_DMA_DMACIER_BIT_NIE_SHIFT)

/*--- register DMACRxIWTR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACRXIWTR_BIT_RWT_SHIFT                  (0U)
#define PERI_Ethernet_DMA_DMACRXIWTR_BIT_RWT_MASK                   (((1U<<8)-1) << PERI_Ethernet_DMA_DMACRXIWTR_BIT_RWT_SHIFT)

/*--- register DMACCATxDR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACCATXDR_BIT_CURTDESAPTR_SHIFT          (0U)
#define PERI_Ethernet_DMA_DMACCATXDR_BIT_CURTDESAPTR_MASK           (((1U<<32)-1) << PERI_Ethernet_DMA_DMACCATXDR_BIT_CURTDESAPTR_SHIFT)

