minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DMACCARxDR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACCARXDR_BIT_CURRDESAPTR_SHIFT          (0U)
#define PERI_Ethernet_DMA_DMACCARXDR_BIT_CURRDESAPTR_MASK           (((1U<<32)-1) << PERI_Ethernet_DMA_DMACCARXDR_BIT_CURRDESAPTR_SHIFT)

/*--- register DMACCATxBR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACCATXBR_BIT_CURTBUFAPTR_SHIFT          (0U)
#define PERI_Ethernet_DMA_DMACCATXBR_BIT_CURTBUFAPTR_MASK           (((1U<<32)-1) << PERI_Ethernet_DMA_DMACCATXBR_BIT_CURTBUFAPTR_SHIFT)

/*--- register DMACCARxBR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACCARXBR_BIT_CURRBUFAPTR_SHIFT          (0U)
#define PERI_Ethernet_DMA_DMACCARXBR_BIT_CURRBUFAPTR_MASK           (((1U<<32)-1) << PERI_Ethernet_DMA_DMACCARXBR_BIT_CURRBUFAPTR_SHIFT)

/*--- register DMACSR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACSR_BIT_TI_SHIFT                       (0U)
#define PERI_Ethernet_DMA_DMACSR_BIT_TI_MASK                        (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_TI_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_TPS_SHIFT                      (1U)
#define PERI_Ethernet_DMA_DMACSR_BIT_TPS_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_TPS_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_TBU_SHIFT                      (2U)
#define PERI_Ethernet_DMA_DMACSR_BIT_TBU_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_TBU_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_RI_SHIFT                       (6U)
#define PERI_Ethernet_DMA_DMACSR_BIT_RI_MASK                        (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_RI_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_RBU_SHIFT                      (7U)
#define PERI_Ethernet_DMA_DMACSR_BIT_RBU_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_RBU_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_RPS_SHIFT                      (8U)
#define PERI_Ethernet_DMA_DMACSR_BIT_RPS_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_RPS_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_RWT_SHIFT                      (9U)
#define PERI_Ethernet_DMA_DMACSR_BIT_RWT_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_RWT_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_ET_SHIFT                       (10U)
#define PERI_Ethernet_DMA_DMACSR_BIT_ET_MASK                        (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_ET_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_ER_SHIFT                       (11U)
#define PERI_Ethernet_DMA_DMACSR_BIT_ER_MASK                        (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_ER_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_FBE_SHIFT                      (12U)
#define PERI_Ethernet_DMA_DMACSR_BIT_FBE_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_FBE_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_CDE_SHIFT                      (13U)
#define PERI_Ethernet_DMA_DMACSR_BIT_CDE_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_CDE_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_AIS_SHIFT                      (14U)
#define PERI_Ethernet_DMA_DMACSR_BIT_AIS_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_AIS_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_NIS_SHIFT                      (15U)
#define PERI_Ethernet_DMA_DMACSR_BIT_NIS_MASK                       (((1U<<1)-1) << PERI_Ethernet_DMA_DMACSR_BIT_NIS_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_TEB_SHIFT                      (16U)
#define PERI_Ethernet_DMA_DMACSR_BIT_TEB_MASK                       (((1U<<3)-1) << PERI_Ethernet_DMA_DMACSR_BIT_TEB_SHIFT)
#define PERI_Ethernet_DMA_DMACSR_BIT_REB_SHIFT                      (19U)
#define PERI_Ethernet_DMA_DMACSR_BIT_REB_MASK                       (((1U<<3)-1) << PERI_Ethernet_DMA_DMACSR_BIT_REB_SHIFT)

/*--- register DMACMFCR -------------------------------------------------*/
#define PERI_Ethernet_DMA_DMACMFCR_BIT_MFC_SHIFT                    (0U)
#define PERI_Ethernet_DMA_DMACMFCR_BIT_MFC_MASK                     (((1U<<11)-1) << PERI_Ethernet_DMA_DMACMFCR_BIT_MFC_SHIFT)
#define PERI_Ethernet_DMA_DMACMFCR_BIT_MFCO_SHIFT                   (15U)
#define PERI_Ethernet_DMA_DMACMFCR_BIT_MFCO_MASK                    (((1U<<1)-1) << PERI_Ethernet_DMA_DMACMFCR_BIT_MFCO_SHIFT)

/*--- register MACCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACCR_BIT_RE_SHIFT                        (0U)
#define PERI_Ethernet_MAC_MACCR_BIT_RE_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_RE_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_TE_SHIFT                        (1U)
#define PERI_Ethernet_MAC_MACCR_BIT_TE_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_TE_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_PRELEN_SHIFT                    (2U)
#define PERI_Ethernet_MAC_MACCR_BIT_PRELEN_MASK                     (((1U<<2)-1) << PERI_Ethernet_MAC_MACCR_BIT_PRELEN_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_DC_SHIFT                        (4U)
#define PERI_Ethernet_MAC_MACCR_BIT_DC_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_DC_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_BL_SHIFT                        (5U)
#define PERI_Ethernet_MAC_MACCR_BIT_BL_MASK                         (((1U<<2)-1) << PERI_Ethernet_MAC_MACCR_BIT_BL_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_DR_SHIFT                        (8U)
#define PERI_Ethernet_MAC_MACCR_BIT_DR_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_DR_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_DCRS_SHIFT                      (9U)
#define PERI_Ethernet_MAC_MACCR_BIT_DCRS_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_DCRS_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_DO_SHIFT                        (10U)
#define PERI_Ethernet_MAC_MACCR_BIT_DO_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_DO_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_ECRSFD_SHIFT                    (11U)
#define PERI_Ethernet_MAC_MACCR_BIT_ECRSFD_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_ECRSFD_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_LM_SHIFT                        (12U)
#define PERI_Ethernet_MAC_MACCR_BIT_LM_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_LM_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_DM_SHIFT                        (13U)
#define PERI_Ethernet_MAC_MACCR_BIT_DM_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_DM_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_FES_SHIFT                       (14U)
#define PERI_Ethernet_MAC_MACCR_BIT_FES_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_FES_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_JE_SHIFT                        (16U)
#define PERI_Ethernet_MAC_MACCR_BIT_JE_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_JE_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_JD_SHIFT                        (17U)
#define PERI_Ethernet_MAC_MACCR_BIT_JD_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_JD_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_WD_SHIFT                        (19U)
#define PERI_Ethernet_MAC_MACCR_BIT_WD_MASK                         (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_WD_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_ACS_SHIFT                       (20U)
#define PERI_Ethernet_MAC_MACCR_BIT_ACS_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_ACS_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_CST_SHIFT                       (21U)
#define PERI_Ethernet_MAC_MACCR_BIT_CST_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_CST_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_S2KP_SHIFT                      (22U)
#define PERI_Ethernet_MAC_MACCR_BIT_S2KP_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_S2KP_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_GPSLCE_SHIFT                    (23U)
#define PERI_Ethernet_MAC_MACCR_BIT_GPSLCE_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_GPSLCE_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_IPG_SHIFT                       (24U)
#define PERI_Ethernet_MAC_MACCR_BIT_IPG_MASK                        (((1U<<3)-1) << PERI_Ethernet_MAC_MACCR_BIT_IPG_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_IPC_SHIFT                       (27U)
#define PERI_Ethernet_MAC_MACCR_BIT_IPC_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_IPC_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_SARC_SHIFT                      (28U)
#define PERI_Ethernet_MAC_MACCR_BIT_SARC_MASK                       (((1U<<3)-1) << PERI_Ethernet_MAC_MACCR_BIT_SARC_SHIFT)
#define PERI_Ethernet_MAC_MACCR_BIT_ARPEN_SHIFT                     (31U)
#define PERI_Ethernet_MAC_MACCR_BIT_ARPEN_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACCR_BIT_ARPEN_SHIFT)

/*--- register MACECR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACECR_BIT_GPSL_SHIFT                     (0U)
#define PERI_Ethernet_MAC_MACECR_BIT_GPSL_MASK                      (((1U<<14)-1) << PERI_Ethernet_MAC_MACECR_BIT_GPSL_SHIFT)
#define PERI_Ethernet_MAC_MACECR_BIT_DCRCC_SHIFT                    (16U)
#define PERI_Ethernet_MAC_MACECR_BIT_DCRCC_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACECR_BIT_DCRCC_SHIFT)
#define PERI_Ethernet_MAC_MACECR_BIT_SPEN_SHIFT                     (17U)
#define PERI_Ethernet_MAC_MACECR_BIT_SPEN_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACECR_BIT_SPEN_SHIFT)
#define PERI_Ethernet_MAC_MACECR_BIT_USP_SHIFT                      (18U)
#define PERI_Ethernet_MAC_MACECR_BIT_USP_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACECR_BIT_USP_SHIFT)
#define PERI_Ethernet_MAC_MACECR_BIT_EIPGEN_SHIFT                   (24U)
#define PERI_Ethernet_MAC_MACECR_BIT_EIPGEN_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACECR_BIT_EIPGEN_SHIFT)
#define PERI_Ethernet_MAC_MACECR_BIT_EIPG_SHIFT                     (25U)
#define PERI_Ethernet_MAC_MACECR_BIT_EIPG_MASK                      (((1U<<5)-1) << PERI_Ethernet_MAC_MACECR_BIT_EIPG_SHIFT)

/*--- register MACPFR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPFR_BIT_PR_SHIFT                       (0U)
#define PERI_Ethernet_MAC_MACPFR_BIT_PR_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_PR_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_HUC_SHIFT                      (1U)
#define PERI_Ethernet_MAC_MACPFR_BIT_HUC_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_HUC_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_HMC_SHIFT                      (2U)
#define PERI_Ethernet_MAC_MACPFR_BIT_HMC_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_HMC_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_DAIF_SHIFT                     (3U)
#define PERI_Ethernet_MAC_MACPFR_BIT_DAIF_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_DAIF_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_PM_SHIFT                       (4U)
#define PERI_Ethernet_MAC_MACPFR_BIT_PM_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_PM_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_DBF_SHIFT                      (5U)
#define PERI_Ethernet_MAC_MACPFR_BIT_DBF_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_DBF_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_PCF_SHIFT                      (6U)
#define PERI_Ethernet_MAC_MACPFR_BIT_PCF_MASK                       (((1U<<2)-1) << PERI_Ethernet_MAC_MACPFR_BIT_PCF_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_SAIF_SHIFT                     (8U)
#define PERI_Ethernet_MAC_MACPFR_BIT_SAIF_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_SAIF_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_SAF_SHIFT                      (9U)
#define PERI_Ethernet_MAC_MACPFR_BIT_SAF_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_SAF_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_HPF_SHIFT                      (10U)
#define PERI_Ethernet_MAC_MACPFR_BIT_HPF_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_HPF_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_VTFE_SHIFT                     (16U)
#define PERI_Ethernet_MAC_MACPFR_BIT_VTFE_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_VTFE_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_IPFE_SHIFT                     (20U)
#define PERI_Ethernet_MAC_MACPFR_BIT_IPFE_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_IPFE_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_DNTU_SHIFT                     (21U)
#define PERI_Ethernet_MAC_MACPFR_BIT_DNTU_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_DNTU_SHIFT)
#define PERI_Ethernet_MAC_MACPFR_BIT_RA_SHIFT                       (31U)
#define PERI_Ethernet_MAC_MACPFR_BIT_RA_MASK                        (((1U<<1)-1) << PERI_Ethernet_MAC_MACPFR_BIT_RA_SHIFT)

/*--- register MACWTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACWTR_BIT_WTO_SHIFT                      (0U)
#define PERI_Ethernet_MAC_MACWTR_BIT_WTO_MASK                       (((1U<<4)-1) << PERI_Ethernet_MAC_MACWTR_BIT_WTO_SHIFT)
#define PERI_Ethernet_MAC_MACWTR_BIT_PWE_SHIFT                      (8U)
#define PERI_Ethernet_MAC_MACWTR_BIT_PWE_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACWTR_BIT_PWE_SHIFT)

/*--- register MACHT0R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACHT0R_BIT_HT31T0_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACHT0R_BIT_HT31T0_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACHT0R_BIT_HT31T0_SHIFT)

