minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MACHT1R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACHT1R_BIT_HT63T32_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACHT1R_BIT_HT63T32_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACHT1R_BIT_HT63T32_SHIFT)

/*--- register MACVTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACVTR_BIT_VL_SHIFT                       (0U)
#define PERI_Ethernet_MAC_MACVTR_BIT_VL_MASK                        (((1U<<16)-1) << PERI_Ethernet_MAC_MACVTR_BIT_VL_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_ETV_SHIFT                      (16U)
#define PERI_Ethernet_MAC_MACVTR_BIT_ETV_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_ETV_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_VTIM_SHIFT                     (17U)
#define PERI_Ethernet_MAC_MACVTR_BIT_VTIM_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_VTIM_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_ESVL_SHIFT                     (18U)
#define PERI_Ethernet_MAC_MACVTR_BIT_ESVL_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_ESVL_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_ERSVLM_SHIFT                   (19U)
#define PERI_Ethernet_MAC_MACVTR_BIT_ERSVLM_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_ERSVLM_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_DOVLTC_SHIFT                   (20U)
#define PERI_Ethernet_MAC_MACVTR_BIT_DOVLTC_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_DOVLTC_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_EVLS_SHIFT                     (21U)
#define PERI_Ethernet_MAC_MACVTR_BIT_EVLS_MASK                      (((1U<<2)-1) << PERI_Ethernet_MAC_MACVTR_BIT_EVLS_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_EVLRXS_SHIFT                   (24U)
#define PERI_Ethernet_MAC_MACVTR_BIT_EVLRXS_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_EVLRXS_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_VTHM_SHIFT                     (25U)
#define PERI_Ethernet_MAC_MACVTR_BIT_VTHM_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_VTHM_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_EDVLP_SHIFT                    (26U)
#define PERI_Ethernet_MAC_MACVTR_BIT_EDVLP_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_EDVLP_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_ERIVLT_SHIFT                   (27U)
#define PERI_Ethernet_MAC_MACVTR_BIT_ERIVLT_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_ERIVLT_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_EIVLS_SHIFT                    (28U)
#define PERI_Ethernet_MAC_MACVTR_BIT_EIVLS_MASK                     (((1U<<2)-1) << PERI_Ethernet_MAC_MACVTR_BIT_EIVLS_SHIFT)
#define PERI_Ethernet_MAC_MACVTR_BIT_EIVLRXS_SHIFT                  (31U)
#define PERI_Ethernet_MAC_MACVTR_BIT_EIVLRXS_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACVTR_BIT_EIVLRXS_SHIFT)

/*--- register MACVHTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACVHTR_BIT_VLHT_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACVHTR_BIT_VLHT_MASK                     (((1U<<16)-1) << PERI_Ethernet_MAC_MACVHTR_BIT_VLHT_SHIFT)

/*--- register MACVIR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACVIR_BIT_VLT_SHIFT                      (0U)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLT_MASK                       (((1U<<16)-1) << PERI_Ethernet_MAC_MACVIR_BIT_VLT_SHIFT)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLC_SHIFT                      (16U)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLC_MASK                       (((1U<<2)-1) << PERI_Ethernet_MAC_MACVIR_BIT_VLC_SHIFT)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLP_SHIFT                      (18U)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLP_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACVIR_BIT_VLP_SHIFT)
#define PERI_Ethernet_MAC_MACVIR_BIT_CSVL_SHIFT                     (19U)
#define PERI_Ethernet_MAC_MACVIR_BIT_CSVL_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACVIR_BIT_CSVL_SHIFT)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLTI_SHIFT                     (20U)
#define PERI_Ethernet_MAC_MACVIR_BIT_VLTI_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACVIR_BIT_VLTI_SHIFT)

/*--- register MACIVIR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLT_SHIFT                     (0U)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLT_MASK                      (((1U<<16)-1) << PERI_Ethernet_MAC_MACIVIR_BIT_VLT_SHIFT)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLC_SHIFT                     (16U)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLC_MASK                      (((1U<<2)-1) << PERI_Ethernet_MAC_MACIVIR_BIT_VLC_SHIFT)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLP_SHIFT                     (18U)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLP_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACIVIR_BIT_VLP_SHIFT)
#define PERI_Ethernet_MAC_MACIVIR_BIT_CSVL_SHIFT                    (19U)
#define PERI_Ethernet_MAC_MACIVIR_BIT_CSVL_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACIVIR_BIT_CSVL_SHIFT)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLTI_SHIFT                    (20U)
#define PERI_Ethernet_MAC_MACIVIR_BIT_VLTI_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACIVIR_BIT_VLTI_SHIFT)

/*--- register MACQTxFCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_FCB_BPA_SHIFT               (0U)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_FCB_BPA_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACQTXFCR_BIT_FCB_BPA_SHIFT)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_TFE_SHIFT                   (1U)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_TFE_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACQTXFCR_BIT_TFE_SHIFT)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_PLT_SHIFT                   (4U)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_PLT_MASK                    (((1U<<3)-1) << PERI_Ethernet_MAC_MACQTXFCR_BIT_PLT_SHIFT)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_DZPQ_SHIFT                  (7U)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_DZPQ_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACQTXFCR_BIT_DZPQ_SHIFT)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_PT_SHIFT                    (16U)
#define PERI_Ethernet_MAC_MACQTXFCR_BIT_PT_MASK                     (((1U<<16)-1) << PERI_Ethernet_MAC_MACQTXFCR_BIT_PT_SHIFT)

/*--- register MACRxFCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACRXFCR_BIT_RFE_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACRXFCR_BIT_RFE_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXFCR_BIT_RFE_SHIFT)
#define PERI_Ethernet_MAC_MACRXFCR_BIT_UP_SHIFT                     (1U)
#define PERI_Ethernet_MAC_MACRXFCR_BIT_UP_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXFCR_BIT_UP_SHIFT)

/*--- register MACISR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACISR_BIT_PHYIS_SHIFT                    (3U)
#define PERI_Ethernet_MAC_MACISR_BIT_PHYIS_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_PHYIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_PMTIS_SHIFT                    (4U)
#define PERI_Ethernet_MAC_MACISR_BIT_PMTIS_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_PMTIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_LPIIS_SHIFT                    (5U)
#define PERI_Ethernet_MAC_MACISR_BIT_LPIIS_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_LPIIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_MMCIS_SHIFT                    (8U)
#define PERI_Ethernet_MAC_MACISR_BIT_MMCIS_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_MMCIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_MMCRXIS_SHIFT                  (9U)
#define PERI_Ethernet_MAC_MACISR_BIT_MMCRXIS_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_MMCRXIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_MMCTXIS_SHIFT                  (10U)
#define PERI_Ethernet_MAC_MACISR_BIT_MMCTXIS_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_MMCTXIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_TSIS_SHIFT                     (12U)
#define PERI_Ethernet_MAC_MACISR_BIT_TSIS_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_TSIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_TXSTSIS_SHIFT                  (13U)
#define PERI_Ethernet_MAC_MACISR_BIT_TXSTSIS_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_TXSTSIS_SHIFT)
#define PERI_Ethernet_MAC_MACISR_BIT_RXSTSIS_SHIFT                  (14U)
#define PERI_Ethernet_MAC_MACISR_BIT_RXSTSIS_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACISR_BIT_RXSTSIS_SHIFT)

/*--- register MACIER -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACIER_BIT_PHYIE_SHIFT                    (3U)
#define PERI_Ethernet_MAC_MACIER_BIT_PHYIE_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACIER_BIT_PHYIE_SHIFT)
#define PERI_Ethernet_MAC_MACIER_BIT_PMTIE_SHIFT                    (4U)
#define PERI_Ethernet_MAC_MACIER_BIT_PMTIE_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACIER_BIT_PMTIE_SHIFT)
#define PERI_Ethernet_MAC_MACIER_BIT_LPIIE_SHIFT                    (5U)
#define PERI_Ethernet_MAC_MACIER_BIT_LPIIE_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACIER_BIT_LPIIE_SHIFT)
#define PERI_Ethernet_MAC_MACIER_BIT_TSIE_SHIFT                     (12U)
#define PERI_Ethernet_MAC_MACIER_BIT_TSIE_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACIER_BIT_TSIE_SHIFT)
#define PERI_Ethernet_MAC_MACIER_BIT_TXSTSIE_SHIFT                  (13U)
#define PERI_Ethernet_MAC_MACIER_BIT_TXSTSIE_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACIER_BIT_TXSTSIE_SHIFT)
#define PERI_Ethernet_MAC_MACIER_BIT_RXSTSIE_SHIFT                  (14U)
#define PERI_Ethernet_MAC_MACIER_BIT_RXSTSIE_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACIER_BIT_RXSTSIE_SHIFT)

