minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MACRxTxSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_TJT_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_TJT_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_TJT_SHIFT)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_NCARR_SHIFT                 (1U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_NCARR_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_NCARR_SHIFT)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_LCARR_SHIFT                 (2U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_LCARR_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_LCARR_SHIFT)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_EXDEF_SHIFT                 (3U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_EXDEF_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_EXDEF_SHIFT)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_LCOL_SHIFT                  (4U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_LCOL_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_LCOL_SHIFT)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_EXCOL_SHIFT                 (5U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_EXCOL_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_EXCOL_SHIFT)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_RWT_SHIFT                   (8U)
#define PERI_Ethernet_MAC_MACRXTXSR_BIT_RWT_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACRXTXSR_BIT_RWT_SHIFT)

/*--- register MACPCSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPCSR_BIT_PWRDWN_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_PWRDWN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_PWRDWN_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_MGKPKTEN_SHIFT                (1U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_MGKPKTEN_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_MGKPKTEN_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPKTEN_SHIFT                (2U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPKTEN_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_RWKPKTEN_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_MGKPRCVD_SHIFT                (5U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_MGKPRCVD_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_MGKPRCVD_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPRCVD_SHIFT                (6U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPRCVD_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_RWKPRCVD_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_GLBLUCAST_SHIFT               (9U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_GLBLUCAST_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_GLBLUCAST_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPFE_SHIFT                  (10U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPFE_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_RWKPFE_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPTR_SHIFT                  (24U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKPTR_MASK                   (((1U<<5)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_RWKPTR_SHIFT)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKFILTRST_SHIFT              (31U)
#define PERI_Ethernet_MAC_MACPCSR_BIT_RWKFILTRST_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACPCSR_BIT_RWKFILTRST_SHIFT)

/*--- register MACRWKPFR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACRWKPFR_BIT_MACRWKPFR_SHIFT             (0U)
#define PERI_Ethernet_MAC_MACRWKPFR_BIT_MACRWKPFR_MASK              (((1U<<32)-1) << PERI_Ethernet_MAC_MACRWKPFR_BIT_MACRWKPFR_SHIFT)

/*--- register MACLCSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACLCSR_BIT_TLPIEN_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_TLPIEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_TLPIEN_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_TLPIEX_SHIFT                  (1U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_TLPIEX_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_TLPIEX_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_RLPIEN_SHIFT                  (2U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_RLPIEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_RLPIEN_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_RLPIEX_SHIFT                  (3U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_RLPIEX_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_RLPIEX_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_TLPIST_SHIFT                  (8U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_TLPIST_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_TLPIST_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_RLPIST_SHIFT                  (9U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_RLPIST_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_RLPIST_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_LPIEN_SHIFT                   (16U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_LPIEN_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_LPIEN_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_PLS_SHIFT                     (17U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_PLS_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_PLS_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_PLSEN_SHIFT                   (18U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_PLSEN_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_PLSEN_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_LPITXA_SHIFT                  (19U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_LPITXA_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_LPITXA_SHIFT)
#define PERI_Ethernet_MAC_MACLCSR_BIT_LPITE_SHIFT                   (20U)
#define PERI_Ethernet_MAC_MACLCSR_BIT_LPITE_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACLCSR_BIT_LPITE_SHIFT)

/*--- register MACLTCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACLTCR_BIT_TWT_SHIFT                     (0U)
#define PERI_Ethernet_MAC_MACLTCR_BIT_TWT_MASK                      (((1U<<16)-1) << PERI_Ethernet_MAC_MACLTCR_BIT_TWT_SHIFT)
#define PERI_Ethernet_MAC_MACLTCR_BIT_LST_SHIFT                     (16U)
#define PERI_Ethernet_MAC_MACLTCR_BIT_LST_MASK                      (((1U<<10)-1) << PERI_Ethernet_MAC_MACLTCR_BIT_LST_SHIFT)

/*--- register MACLETR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACLETR_BIT_LPIET_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACLETR_BIT_LPIET_MASK                    (((1U<<17)-1) << PERI_Ethernet_MAC_MACLETR_BIT_LPIET_SHIFT)

