minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MAC1USTCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MAC1USTCR_BIT_TIC_1US_CNTR_SHIFT          (0U)
#define PERI_Ethernet_MAC_MAC1USTCR_BIT_TIC_1US_CNTR_MASK           (((1U<<12)-1) << PERI_Ethernet_MAC_MAC1USTCR_BIT_TIC_1US_CNTR_SHIFT)

/*--- register MACVR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACVR_BIT_SNPSVER_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACVR_BIT_SNPSVER_MASK                    (((1U<<8)-1) << PERI_Ethernet_MAC_MACVR_BIT_SNPSVER_SHIFT)
#define PERI_Ethernet_MAC_MACVR_BIT_USERVER_SHIFT                   (8U)
#define PERI_Ethernet_MAC_MACVR_BIT_USERVER_MASK                    (((1U<<8)-1) << PERI_Ethernet_MAC_MACVR_BIT_USERVER_SHIFT)

/*--- register MACDR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACDR_BIT_RPESTS_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACDR_BIT_RPESTS_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACDR_BIT_RPESTS_SHIFT)
#define PERI_Ethernet_MAC_MACDR_BIT_RFCFCSTS_SHIFT                  (1U)
#define PERI_Ethernet_MAC_MACDR_BIT_RFCFCSTS_MASK                   (((1U<<2)-1) << PERI_Ethernet_MAC_MACDR_BIT_RFCFCSTS_SHIFT)
#define PERI_Ethernet_MAC_MACDR_BIT_TPESTS_SHIFT                    (16U)
#define PERI_Ethernet_MAC_MACDR_BIT_TPESTS_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACDR_BIT_TPESTS_SHIFT)
#define PERI_Ethernet_MAC_MACDR_BIT_TFCSTS_SHIFT                    (17U)
#define PERI_Ethernet_MAC_MACDR_BIT_TFCSTS_MASK                     (((1U<<2)-1) << PERI_Ethernet_MAC_MACDR_BIT_TFCSTS_SHIFT)

/*--- register MACHWF1R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACHWF1R_BIT_RXFIFOSIZE_SHIFT             (0U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_RXFIFOSIZE_MASK              (((1U<<5)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_RXFIFOSIZE_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_TXFIFOSIZE_SHIFT             (6U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_TXFIFOSIZE_MASK              (((1U<<5)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_TXFIFOSIZE_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_OSTEN_SHIFT                  (11U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_OSTEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_OSTEN_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_PTOEN_SHIFT                  (12U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_PTOEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_PTOEN_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_ADVTHWORD_SHIFT              (13U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_ADVTHWORD_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_ADVTHWORD_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_ADDR64_SHIFT                 (14U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_ADDR64_MASK                  (((1U<<2)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_ADDR64_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_DCBEN_SHIFT                  (16U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_DCBEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_DCBEN_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_SPHEN_SHIFT                  (17U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_SPHEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_SPHEN_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_TSOEN_SHIFT                  (18U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_TSOEN_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_TSOEN_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_DBGMEMA_SHIFT                (19U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_DBGMEMA_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_DBGMEMA_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_AVSEL_SHIFT                  (20U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_AVSEL_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_AVSEL_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_HASHTBLSZ_SHIFT              (24U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_HASHTBLSZ_MASK               (((1U<<2)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_HASHTBLSZ_SHIFT)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_L3L4FNUM_SHIFT               (27U)
#define PERI_Ethernet_MAC_MACHWF1R_BIT_L3L4FNUM_MASK                (((1U<<4)-1) << PERI_Ethernet_MAC_MACHWF1R_BIT_L3L4FNUM_SHIFT)

/*--- register MACHWF2R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACHWF2R_BIT_RXQCNT_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_RXQCNT_MASK                  (((1U<<4)-1) << PERI_Ethernet_MAC_MACHWF2R_BIT_RXQCNT_SHIFT)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_TXQCNT_SHIFT                 (6U)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_TXQCNT_MASK                  (((1U<<4)-1) << PERI_Ethernet_MAC_MACHWF2R_BIT_TXQCNT_SHIFT)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_RXCHCNT_SHIFT                (12U)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_RXCHCNT_MASK                 (((1U<<4)-1) << PERI_Ethernet_MAC_MACHWF2R_BIT_RXCHCNT_SHIFT)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_TXCHCNT_SHIFT                (18U)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_TXCHCNT_MASK                 (((1U<<4)-1) << PERI_Ethernet_MAC_MACHWF2R_BIT_TXCHCNT_SHIFT)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_PPSOUTNUM_SHIFT              (24U)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_PPSOUTNUM_MASK               (((1U<<3)-1) << PERI_Ethernet_MAC_MACHWF2R_BIT_PPSOUTNUM_SHIFT)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_AUXSNAPNUM_SHIFT             (28U)
#define PERI_Ethernet_MAC_MACHWF2R_BIT_AUXSNAPNUM_MASK              (((1U<<3)-1) << PERI_Ethernet_MAC_MACHWF2R_BIT_AUXSNAPNUM_SHIFT)

/*--- register MACMDIOAR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_MB_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_MB_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_MB_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_C45E_SHIFT                  (1U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_C45E_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_C45E_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_GOC_SHIFT                   (2U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_GOC_MASK                    (((1U<<2)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_GOC_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_SKAP_SHIFT                  (4U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_SKAP_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_SKAP_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_CR_SHIFT                    (8U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_CR_MASK                     (((1U<<4)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_CR_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_NTC_SHIFT                   (12U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_NTC_MASK                    (((1U<<3)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_NTC_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_RDA_SHIFT                   (16U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_RDA_MASK                    (((1U<<5)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_RDA_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_PA_SHIFT                    (21U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_PA_MASK                     (((1U<<5)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_PA_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_BTB_SHIFT                   (26U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_BTB_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_BTB_SHIFT)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_PSE_SHIFT                   (27U)
#define PERI_Ethernet_MAC_MACMDIOAR_BIT_PSE_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACMDIOAR_BIT_PSE_SHIFT)

/*--- register MACMDIODR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACMDIODR_BIT_MD_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACMDIODR_BIT_MD_MASK                     (((1U<<16)-1) << PERI_Ethernet_MAC_MACMDIODR_BIT_MD_SHIFT)
#define PERI_Ethernet_MAC_MACMDIODR_BIT_RA_SHIFT                    (16U)
#define PERI_Ethernet_MAC_MACMDIODR_BIT_RA_MASK                     (((1U<<16)-1) << PERI_Ethernet_MAC_MACMDIODR_BIT_RA_SHIFT)

/*--- register MACA0HR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA0HR_BIT_ADDRHI_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA0HR_BIT_ADDRHI_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACA0HR_BIT_ADDRHI_SHIFT)
#define PERI_Ethernet_MAC_MACA0HR_BIT_AE_SHIFT                      (31U)
#define PERI_Ethernet_MAC_MACA0HR_BIT_AE_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA0HR_BIT_AE_SHIFT)

/*--- register MACA0LR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA0LR_BIT_ADDRLO_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA0LR_BIT_ADDRLO_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACA0LR_BIT_ADDRLO_SHIFT)

/*--- register MACA1HR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA1HR_BIT_ADDRHI_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA1HR_BIT_ADDRHI_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACA1HR_BIT_ADDRHI_SHIFT)
#define PERI_Ethernet_MAC_MACA1HR_BIT_MBC_SHIFT                     (24U)
#define PERI_Ethernet_MAC_MACA1HR_BIT_MBC_MASK                      (((1U<<6)-1) << PERI_Ethernet_MAC_MACA1HR_BIT_MBC_SHIFT)
#define PERI_Ethernet_MAC_MACA1HR_BIT_SA_SHIFT                      (30U)
#define PERI_Ethernet_MAC_MACA1HR_BIT_SA_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA1HR_BIT_SA_SHIFT)
#define PERI_Ethernet_MAC_MACA1HR_BIT_AE_SHIFT                      (31U)
#define PERI_Ethernet_MAC_MACA1HR_BIT_AE_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA1HR_BIT_AE_SHIFT)

/*--- register MACA1LR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA1LR_BIT_ADDRLO_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA1LR_BIT_ADDRLO_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACA1LR_BIT_ADDRLO_SHIFT)

/*--- register MACA2HR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA2HR_BIT_ADDRHI_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA2HR_BIT_ADDRHI_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACA2HR_BIT_ADDRHI_SHIFT)
#define PERI_Ethernet_MAC_MACA2HR_BIT_MBC_SHIFT                     (24U)
#define PERI_Ethernet_MAC_MACA2HR_BIT_MBC_MASK                      (((1U<<6)-1) << PERI_Ethernet_MAC_MACA2HR_BIT_MBC_SHIFT)
#define PERI_Ethernet_MAC_MACA2HR_BIT_SA_SHIFT                      (30U)
#define PERI_Ethernet_MAC_MACA2HR_BIT_SA_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA2HR_BIT_SA_SHIFT)
#define PERI_Ethernet_MAC_MACA2HR_BIT_AE_SHIFT                      (31U)
#define PERI_Ethernet_MAC_MACA2HR_BIT_AE_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA2HR_BIT_AE_SHIFT)

/*--- register MACA2LR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA2LR_BIT_ADDRLO_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA2LR_BIT_ADDRLO_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACA2LR_BIT_ADDRLO_SHIFT)

/*--- register MACA3HR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA3HR_BIT_ADDRHI_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA3HR_BIT_ADDRHI_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACA3HR_BIT_ADDRHI_SHIFT)
#define PERI_Ethernet_MAC_MACA3HR_BIT_MBC_SHIFT                     (24U)
#define PERI_Ethernet_MAC_MACA3HR_BIT_MBC_MASK                      (((1U<<6)-1) << PERI_Ethernet_MAC_MACA3HR_BIT_MBC_SHIFT)
#define PERI_Ethernet_MAC_MACA3HR_BIT_SA_SHIFT                      (30U)
#define PERI_Ethernet_MAC_MACA3HR_BIT_SA_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA3HR_BIT_SA_SHIFT)
#define PERI_Ethernet_MAC_MACA3HR_BIT_AE_SHIFT                      (31U)
#define PERI_Ethernet_MAC_MACA3HR_BIT_AE_MASK                       (((1U<<1)-1) << PERI_Ethernet_MAC_MACA3HR_BIT_AE_SHIFT)

/*--- register MACA3LR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACA3LR_BIT_ADDRLO_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACA3LR_BIT_ADDRLO_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACA3LR_BIT_ADDRLO_SHIFT)

