minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MMC_CONTROL -------------------------------------------------*/
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTRST_SHIFT              (0U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTRST_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTRST_SHIFT)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTSTOPRO_SHIFT           (1U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTSTOPRO_MASK            (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTSTOPRO_SHIFT)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_RSTONRD_SHIFT             (2U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_RSTONRD_MASK              (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_RSTONRD_SHIFT)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTFREEZ_SHIFT            (3U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTFREEZ_MASK             (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTFREEZ_SHIFT)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTPRST_SHIFT             (4U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTPRST_MASK              (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTPRST_SHIFT)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTPRSTLVL_SHIFT          (5U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTPRSTLVL_MASK           (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_CNTPRSTLVL_SHIFT)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_UCDBC_SHIFT               (8U)
#define PERI_Ethernet_MAC_MMC_CONTROL_BIT_UCDBC_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_CONTROL_BIT_UCDBC_SHIFT)

/*--- register MMC_RX_INTERRUPT -------------------------------------------------*/
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXCRCERPIS_SHIFT     (5U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXCRCERPIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXCRCERPIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXALGNERPIS_SHIFT    (6U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXALGNERPIS_MASK     (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXALGNERPIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXUCGPIS_SHIFT       (17U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXUCGPIS_MASK        (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXUCGPIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXLPIUSCIS_SHIFT     (26U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXLPIUSCIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXLPIUSCIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXLPITRCIS_SHIFT     (27U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXLPITRCIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_BIT_RXLPITRCIS_SHIFT)

/*--- register MMC_TX_INTERRUPT -------------------------------------------------*/
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXSCOLGPIS_SHIFT     (14U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXSCOLGPIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXSCOLGPIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXMCOLGPIS_SHIFT     (15U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXMCOLGPIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXMCOLGPIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXGPKTIS_SHIFT       (21U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXGPKTIS_MASK        (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXGPKTIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXLPIUSCIS_SHIFT     (26U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXLPIUSCIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXLPIUSCIS_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXLPITRCIS_SHIFT     (27U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXLPITRCIS_MASK      (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_BIT_TXLPITRCIS_SHIFT)

/*--- register MMC_RX_INTERRUPT_MASK -------------------------------------------------*/
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXCRCERPIM_SHIFT (5U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXCRCERPIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXCRCERPIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXALGNERPIM_SHIFT (6U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXALGNERPIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXALGNERPIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXUCGPIM_SHIFT  (17U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXUCGPIM_MASK   (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXUCGPIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXLPIUSCIM_SHIFT (26U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXLPIUSCIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXLPIUSCIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXLPITRCIM_SHIFT (27U)
#define PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXLPITRCIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_RX_INTERRUPT_MASK_BIT_RXLPITRCIM_SHIFT)

/*--- register MMC_TX_INTERRUPT_MASK -------------------------------------------------*/
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXSCOLGPIM_SHIFT (14U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXSCOLGPIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXSCOLGPIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXMCOLGPIM_SHIFT (15U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXMCOLGPIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXMCOLGPIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXGPKTIM_SHIFT  (21U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXGPKTIM_MASK   (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXGPKTIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXLPIUSCIM_SHIFT (26U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXLPIUSCIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXLPIUSCIM_SHIFT)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXLPITRCIM_SHIFT (27U)
#define PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXLPITRCIM_MASK (((1U<<1)-1) << PERI_Ethernet_MAC_MMC_TX_INTERRUPT_MASK_BIT_TXLPITRCIM_SHIFT)

/*--- register TX_SINGLE_COLLISION_GOOD_PACKETS -------------------------------------------------*/
#define PERI_Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_BIT_TXSNGLCOLG_SHIFT (0U)
#define PERI_Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_BIT_TXSNGLCOLG_MASK (((1U<<32)-1) << PERI_Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_BIT_TXSNGLCOLG_SHIFT)

/*--- register TX_MULTIPLE_COLLISION_GOOD_PACKETS -------------------------------------------------*/
#define PERI_Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_BIT_TXMULTCOLG_SHIFT (0U)
#define PERI_Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_BIT_TXMULTCOLG_MASK (((1U<<32)-1) << PERI_Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_BIT_TXMULTCOLG_SHIFT)

/*--- register TX_PACKET_COUNT_GOOD -------------------------------------------------*/
#define PERI_Ethernet_MAC_TX_PACKET_COUNT_GOOD_BIT_TXPKTG_SHIFT     (0U)
#define PERI_Ethernet_MAC_TX_PACKET_COUNT_GOOD_BIT_TXPKTG_MASK      (((1U<<32)-1) << PERI_Ethernet_MAC_TX_PACKET_COUNT_GOOD_BIT_TXPKTG_SHIFT)

/*--- register RX_CRC_ERROR_PACKETS -------------------------------------------------*/
#define PERI_Ethernet_MAC_RX_CRC_ERROR_PACKETS_BIT_RXCRCERR_SHIFT   (0U)
#define PERI_Ethernet_MAC_RX_CRC_ERROR_PACKETS_BIT_RXCRCERR_MASK    (((1U<<32)-1) << PERI_Ethernet_MAC_RX_CRC_ERROR_PACKETS_BIT_RXCRCERR_SHIFT)

