minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RX_ALIGNMENT_ERROR_PACKETS -------------------------------------------------*/
#define PERI_Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_BIT_RXALGNERR_SHIFT (0U)
#define PERI_Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_BIT_RXALGNERR_MASK (((1U<<32)-1) << PERI_Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_BIT_RXALGNERR_SHIFT)

/*--- register RX_UNICAST_PACKETS_GOOD -------------------------------------------------*/
#define PERI_Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_BIT_RXUCASTG_SHIFT (0U)
#define PERI_Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_BIT_RXUCASTG_MASK (((1U<<32)-1) << PERI_Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_BIT_RXUCASTG_SHIFT)

/*--- register TX_LPI_USEC_CNTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_TX_LPI_USEC_CNTR_BIT_TXLPIUSC_SHIFT       (0U)
#define PERI_Ethernet_MAC_TX_LPI_USEC_CNTR_BIT_TXLPIUSC_MASK        (((1U<<32)-1) << PERI_Ethernet_MAC_TX_LPI_USEC_CNTR_BIT_TXLPIUSC_SHIFT)

/*--- register TX_LPI_TRAN_CNTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_TX_LPI_TRAN_CNTR_BIT_TXLPITRC_SHIFT       (0U)
#define PERI_Ethernet_MAC_TX_LPI_TRAN_CNTR_BIT_TXLPITRC_MASK        (((1U<<32)-1) << PERI_Ethernet_MAC_TX_LPI_TRAN_CNTR_BIT_TXLPITRC_SHIFT)

/*--- register RX_LPI_USEC_CNTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_RX_LPI_USEC_CNTR_BIT_RXLPIUSC_SHIFT       (0U)
#define PERI_Ethernet_MAC_RX_LPI_USEC_CNTR_BIT_RXLPIUSC_MASK        (((1U<<32)-1) << PERI_Ethernet_MAC_RX_LPI_USEC_CNTR_BIT_RXLPIUSC_SHIFT)

/*--- register RX_LPI_TRAN_CNTR -------------------------------------------------*/
#define PERI_Ethernet_MAC_RX_LPI_TRAN_CNTR_BIT_RXLPITRC_SHIFT       (0U)
#define PERI_Ethernet_MAC_RX_LPI_TRAN_CNTR_BIT_RXLPITRC_MASK        (((1U<<32)-1) << PERI_Ethernet_MAC_RX_LPI_TRAN_CNTR_BIT_RXLPITRC_SHIFT)

/*--- register MACL3L4C0R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3PEN0_SHIFT               (0U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3PEN0_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3PEN0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3SAM0_SHIFT               (2U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3SAM0_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3SAM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3SAIM0_SHIFT              (3U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3SAIM0_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3SAIM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3DAM0_SHIFT               (4U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3DAM0_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3DAM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3DAIM0_SHIFT              (5U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3DAIM0_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3DAIM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3HSBM0_SHIFT              (6U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3HSBM0_MASK               (((1U<<5)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3HSBM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3HDBM0_SHIFT              (11U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3HDBM0_MASK               (((1U<<5)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L3HDBM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4PEN0_SHIFT               (16U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4PEN0_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4PEN0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4SPM0_SHIFT               (18U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4SPM0_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4SPM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4SPIM0_SHIFT              (19U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4SPIM0_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4SPIM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4DPM0_SHIFT               (20U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4DPM0_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4DPM0_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4DPIM0_SHIFT              (21U)
#define PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4DPIM0_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C0R_BIT_L4DPIM0_SHIFT)

/*--- register MACL4A0R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL4A0R_BIT_L4SP0_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACL4A0R_BIT_L4SP0_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACL4A0R_BIT_L4SP0_SHIFT)
#define PERI_Ethernet_MAC_MACL4A0R_BIT_L4DP0_SHIFT                  (16U)
#define PERI_Ethernet_MAC_MACL4A0R_BIT_L4DP0_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACL4A0R_BIT_L4DP0_SHIFT)

/*--- register MACL3A00R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A00R_BIT_L3A00_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACL3A00R_BIT_L3A00_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A00R_BIT_L3A00_SHIFT)

/*--- register MACL3A10R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A10R_BIT_L3A10_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACL3A10R_BIT_L3A10_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A10R_BIT_L3A10_SHIFT)

/*--- register MACL3A20 -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A20_BIT_L3A20_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACL3A20_BIT_L3A20_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A20_BIT_L3A20_SHIFT)

/*--- register MACL3A30 -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A30_BIT_L3A30_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACL3A30_BIT_L3A30_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A30_BIT_L3A30_SHIFT)

/*--- register MACL3L4C1R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3PEN1_SHIFT               (0U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3PEN1_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3PEN1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3SAM1_SHIFT               (2U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3SAM1_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3SAM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3SAIM1_SHIFT              (3U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3SAIM1_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3SAIM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3DAM1_SHIFT               (4U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3DAM1_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3DAM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3DAIM1_SHIFT              (5U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3DAIM1_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3DAIM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3HSBM1_SHIFT              (6U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3HSBM1_MASK               (((1U<<5)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3HSBM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3HDBM1_SHIFT              (11U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3HDBM1_MASK               (((1U<<5)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L3HDBM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4PEN1_SHIFT               (16U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4PEN1_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4PEN1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4SPM1_SHIFT               (18U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4SPM1_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4SPM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4SPIM1_SHIFT              (19U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4SPIM1_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4SPIM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4DPM1_SHIFT               (20U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4DPM1_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4DPM1_SHIFT)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4DPIM1_SHIFT              (21U)
#define PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4DPIM1_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACL3L4C1R_BIT_L4DPIM1_SHIFT)

/*--- register MACL4A1R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL4A1R_BIT_L4SP1_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACL4A1R_BIT_L4SP1_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACL4A1R_BIT_L4SP1_SHIFT)
#define PERI_Ethernet_MAC_MACL4A1R_BIT_L4DP1_SHIFT                  (16U)
#define PERI_Ethernet_MAC_MACL4A1R_BIT_L4DP1_MASK                   (((1U<<16)-1) << PERI_Ethernet_MAC_MACL4A1R_BIT_L4DP1_SHIFT)

/*--- register MACL3A01R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A01R_BIT_L3A01_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACL3A01R_BIT_L3A01_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A01R_BIT_L3A01_SHIFT)

/*--- register MACL3A11R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A11R_BIT_L3A11_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACL3A11R_BIT_L3A11_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A11R_BIT_L3A11_SHIFT)

/*--- register MACL3A21R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A21R_BIT_L3A21_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACL3A21R_BIT_L3A21_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A21R_BIT_L3A21_SHIFT)

/*--- register MACL3A31R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACL3A31R_BIT_L3A31_SHIFT                 (0U)
#define PERI_Ethernet_MAC_MACL3A31R_BIT_L3A31_MASK                  (((1U<<32)-1) << PERI_Ethernet_MAC_MACL3A31R_BIT_L3A31_SHIFT)

/*--- register MACARPAR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACARPAR_BIT_ARPPA_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACARPAR_BIT_ARPPA_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACARPAR_BIT_ARPPA_SHIFT)

/*--- register MACTSCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSENA_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSENA_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSCFUPDT_SHIFT                (1U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSCFUPDT_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSCFUPDT_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSINIT_SHIFT                  (2U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSINIT_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSINIT_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSUPDT_SHIFT                  (3U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSUPDT_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSUPDT_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSADDREG_SHIFT                (5U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSADDREG_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSADDREG_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSENALL_SHIFT                 (8U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSENALL_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSENALL_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSCTRLSSR_SHIFT               (9U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSCTRLSSR_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSCTRLSSR_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSVER2ENA_SHIFT               (10U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSVER2ENA_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSVER2ENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSIPENA_SHIFT                 (11U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSIPENA_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSIPENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSIPV6ENA_SHIFT               (12U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSIPV6ENA_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSIPV6ENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSIPV4ENA_SHIFT               (13U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSIPV4ENA_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSIPV4ENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSEVNTENA_SHIFT               (14U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSEVNTENA_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSEVNTENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSMSTRENA_SHIFT               (15U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSMSTRENA_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSMSTRENA_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_SNAPTYPSEL_SHIFT              (16U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_SNAPTYPSEL_MASK               (((1U<<2)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_SNAPTYPSEL_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSENMACADDR_SHIFT             (18U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TSENMACADDR_MASK              (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TSENMACADDR_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_CSC_SHIFT                     (19U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_CSC_MASK                      (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_CSC_SHIFT)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TXTSSTSM_SHIFT                (24U)
#define PERI_Ethernet_MAC_MACTSCR_BIT_TXTSSTSM_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSCR_BIT_TXTSSTSM_SHIFT)

