minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MACSSIR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSSIR_BIT_SNSINC_SHIFT                  (8U)
#define PERI_Ethernet_MAC_MACSSIR_BIT_SNSINC_MASK                   (((1U<<8)-1) << PERI_Ethernet_MAC_MACSSIR_BIT_SNSINC_SHIFT)
#define PERI_Ethernet_MAC_MACSSIR_BIT_SSINC_SHIFT                   (16U)
#define PERI_Ethernet_MAC_MACSSIR_BIT_SSINC_MASK                    (((1U<<8)-1) << PERI_Ethernet_MAC_MACSSIR_BIT_SSINC_SHIFT)

/*--- register MACSTSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSTSR_BIT_TSS_SHIFT                     (0U)
#define PERI_Ethernet_MAC_MACSTSR_BIT_TSS_MASK                      (((1U<<32)-1) << PERI_Ethernet_MAC_MACSTSR_BIT_TSS_SHIFT)

/*--- register MACSTNR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSTNR_BIT_TSSS_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACSTNR_BIT_TSSS_MASK                     (((1U<<31)-1) << PERI_Ethernet_MAC_MACSTNR_BIT_TSSS_SHIFT)

/*--- register MACSTSUR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSTSUR_BIT_TSS_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACSTSUR_BIT_TSS_MASK                     (((1U<<32)-1) << PERI_Ethernet_MAC_MACSTSUR_BIT_TSS_SHIFT)

/*--- register MACSTNUR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSTNUR_BIT_TSSS_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACSTNUR_BIT_TSSS_MASK                    (((1U<<31)-1) << PERI_Ethernet_MAC_MACSTNUR_BIT_TSSS_SHIFT)
#define PERI_Ethernet_MAC_MACSTNUR_BIT_ADDSUB_SHIFT                 (31U)
#define PERI_Ethernet_MAC_MACSTNUR_BIT_ADDSUB_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACSTNUR_BIT_ADDSUB_SHIFT)

/*--- register MACTSAR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSAR_BIT_TSAR_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACTSAR_BIT_TSAR_MASK                     (((1U<<32)-1) << PERI_Ethernet_MAC_MACTSAR_BIT_TSAR_SHIFT)

/*--- register MACTSSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSSR_BIT_TSSOVF_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TSSOVF_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_TSSOVF_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TSTARGT0_SHIFT                (1U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TSTARGT0_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_TSTARGT0_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_AUXTSTRIG_SHIFT               (2U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_AUXTSTRIG_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_AUXTSTRIG_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TSTRGTERR0_SHIFT              (3U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TSTRGTERR0_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_TSTRGTERR0_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TXTSSIS_SHIFT                 (15U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_TXTSSIS_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_TXTSSIS_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_ATSSTN_SHIFT                  (16U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_ATSSTN_MASK                   (((1U<<4)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_ATSSTN_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_ATSSTM_SHIFT                  (24U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_ATSSTM_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_ATSSTM_SHIFT)
#define PERI_Ethernet_MAC_MACTSSR_BIT_ATSNS_SHIFT                   (25U)
#define PERI_Ethernet_MAC_MACTSSR_BIT_ATSNS_MASK                    (((1U<<5)-1) << PERI_Ethernet_MAC_MACTSSR_BIT_ATSNS_SHIFT)

/*--- register MACTxTSSNR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTXTSSNR_BIT_TXTSSLO_SHIFT              (0U)
#define PERI_Ethernet_MAC_MACTXTSSNR_BIT_TXTSSLO_MASK               (((1U<<31)-1) << PERI_Ethernet_MAC_MACTXTSSNR_BIT_TXTSSLO_SHIFT)
#define PERI_Ethernet_MAC_MACTXTSSNR_BIT_TXTSSMIS_SHIFT             (31U)
#define PERI_Ethernet_MAC_MACTXTSSNR_BIT_TXTSSMIS_MASK              (((1U<<1)-1) << PERI_Ethernet_MAC_MACTXTSSNR_BIT_TXTSSMIS_SHIFT)

/*--- register MACTxTSSSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTXTSSSR_BIT_TXTSSHI_SHIFT              (0U)
#define PERI_Ethernet_MAC_MACTXTSSSR_BIT_TXTSSHI_MASK               (((1U<<32)-1) << PERI_Ethernet_MAC_MACTXTSSSR_BIT_TXTSSHI_SHIFT)

/*--- register MACACR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACACR_BIT_ATSFC_SHIFT                    (0U)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSFC_MASK                     (((1U<<1)-1) << PERI_Ethernet_MAC_MACACR_BIT_ATSFC_SHIFT)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN0_SHIFT                   (4U)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN0_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACACR_BIT_ATSEN0_SHIFT)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN1_SHIFT                   (5U)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN1_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACACR_BIT_ATSEN1_SHIFT)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN2_SHIFT                   (6U)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN2_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACACR_BIT_ATSEN2_SHIFT)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN3_SHIFT                   (7U)
#define PERI_Ethernet_MAC_MACACR_BIT_ATSEN3_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACACR_BIT_ATSEN3_SHIFT)

/*--- register MACATSNR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACATSNR_BIT_AUXTSLO_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACATSNR_BIT_AUXTSLO_MASK                 (((1U<<31)-1) << PERI_Ethernet_MAC_MACATSNR_BIT_AUXTSLO_SHIFT)

/*--- register MACATSSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACATSSR_BIT_AUXTSHI_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACATSSR_BIT_AUXTSHI_MASK                 (((1U<<32)-1) << PERI_Ethernet_MAC_MACATSSR_BIT_AUXTSHI_SHIFT)

/*--- register MACTSIACR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSIACR_BIT_OSTIAC_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACTSIACR_BIT_OSTIAC_MASK                 (((1U<<32)-1) << PERI_Ethernet_MAC_MACTSIACR_BIT_OSTIAC_SHIFT)

/*--- register MACTSEACR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSEACR_BIT_OSTEAC_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACTSEACR_BIT_OSTEAC_MASK                 (((1U<<32)-1) << PERI_Ethernet_MAC_MACTSEACR_BIT_OSTEAC_SHIFT)

/*--- register MACTSICNR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSICNR_BIT_TSIC_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACTSICNR_BIT_TSIC_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACTSICNR_BIT_TSIC_SHIFT)

/*--- register MACTSECNR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACTSECNR_BIT_TSEC_SHIFT                  (0U)
#define PERI_Ethernet_MAC_MACTSECNR_BIT_TSEC_MASK                   (((1U<<32)-1) << PERI_Ethernet_MAC_MACTSECNR_BIT_TSEC_SHIFT)

/*--- register MACPPSCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPPSCR_BIT_PPSCTRL_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACPPSCR_BIT_PPSCTRL_MASK                 (((1U<<4)-1) << PERI_Ethernet_MAC_MACPPSCR_BIT_PPSCTRL_SHIFT)
#define PERI_Ethernet_MAC_MACPPSCR_BIT_PPSEN0_SHIFT                 (4U)
#define PERI_Ethernet_MAC_MACPPSCR_BIT_PPSEN0_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACPPSCR_BIT_PPSEN0_SHIFT)
#define PERI_Ethernet_MAC_MACPPSCR_BIT_TRGTMODSEL0_SHIFT            (5U)
#define PERI_Ethernet_MAC_MACPPSCR_BIT_TRGTMODSEL0_MASK             (((1U<<2)-1) << PERI_Ethernet_MAC_MACPPSCR_BIT_TRGTMODSEL0_SHIFT)

