minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MACPPSTTSR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPPSTTSR_BIT_TSTRH0_SHIFT               (0U)
#define PERI_Ethernet_MAC_MACPPSTTSR_BIT_TSTRH0_MASK                (((1U<<31)-1) << PERI_Ethernet_MAC_MACPPSTTSR_BIT_TSTRH0_SHIFT)

/*--- register MACPPSTTNR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPPSTTNR_BIT_TTSL0_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACPPSTTNR_BIT_TTSL0_MASK                 (((1U<<31)-1) << PERI_Ethernet_MAC_MACPPSTTNR_BIT_TTSL0_SHIFT)
#define PERI_Ethernet_MAC_MACPPSTTNR_BIT_TRGTBUSY0_SHIFT            (31U)
#define PERI_Ethernet_MAC_MACPPSTTNR_BIT_TRGTBUSY0_MASK             (((1U<<1)-1) << PERI_Ethernet_MAC_MACPPSTTNR_BIT_TRGTBUSY0_SHIFT)

/*--- register MACPPSIR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPPSIR_BIT_PPSINT0_SHIFT                (0U)
#define PERI_Ethernet_MAC_MACPPSIR_BIT_PPSINT0_MASK                 (((1U<<32)-1) << PERI_Ethernet_MAC_MACPPSIR_BIT_PPSINT0_SHIFT)

/*--- register MACPPSWR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPPSWR_BIT_PPSWIDTH0_SHIFT              (0U)
#define PERI_Ethernet_MAC_MACPPSWR_BIT_PPSWIDTH0_MASK               (((1U<<32)-1) << PERI_Ethernet_MAC_MACPPSWR_BIT_PPSWIDTH0_SHIFT)

/*--- register MACPOCR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACPOCR_BIT_PTOEN_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_PTOEN_MASK                    (((1U<<1)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_PTOEN_SHIFT)
#define PERI_Ethernet_MAC_MACPOCR_BIT_ASYNCEN_SHIFT                 (1U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_ASYNCEN_MASK                  (((1U<<1)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_ASYNCEN_SHIFT)
#define PERI_Ethernet_MAC_MACPOCR_BIT_APDREQEN_SHIFT                (2U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_APDREQEN_MASK                 (((1U<<1)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_APDREQEN_SHIFT)
#define PERI_Ethernet_MAC_MACPOCR_BIT_ASYNCTRIG_SHIFT               (4U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_ASYNCTRIG_MASK                (((1U<<1)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_ASYNCTRIG_SHIFT)
#define PERI_Ethernet_MAC_MACPOCR_BIT_APDREQTRIG_SHIFT              (5U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_APDREQTRIG_MASK               (((1U<<1)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_APDREQTRIG_SHIFT)
#define PERI_Ethernet_MAC_MACPOCR_BIT_DRRDIS_SHIFT                  (6U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_DRRDIS_MASK                   (((1U<<1)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_DRRDIS_SHIFT)
#define PERI_Ethernet_MAC_MACPOCR_BIT_DN_SHIFT                      (8U)
#define PERI_Ethernet_MAC_MACPOCR_BIT_DN_MASK                       (((1U<<8)-1) << PERI_Ethernet_MAC_MACPOCR_BIT_DN_SHIFT)

/*--- register MACSPI0R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSPI0R_BIT_SPI0_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACSPI0R_BIT_SPI0_MASK                    (((1U<<32)-1) << PERI_Ethernet_MAC_MACSPI0R_BIT_SPI0_SHIFT)

/*--- register MACSPI1R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSPI1R_BIT_SPI1_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACSPI1R_BIT_SPI1_MASK                    (((1U<<32)-1) << PERI_Ethernet_MAC_MACSPI1R_BIT_SPI1_SHIFT)

/*--- register MACSPI2R -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACSPI2R_BIT_SPI2_SHIFT                   (0U)
#define PERI_Ethernet_MAC_MACSPI2R_BIT_SPI2_MASK                    (((1U<<16)-1) << PERI_Ethernet_MAC_MACSPI2R_BIT_SPI2_SHIFT)

/*--- register MACLMIR -------------------------------------------------*/
#define PERI_Ethernet_MAC_MACLMIR_BIT_LSI_SHIFT                     (0U)
#define PERI_Ethernet_MAC_MACLMIR_BIT_LSI_MASK                      (((1U<<8)-1) << PERI_Ethernet_MAC_MACLMIR_BIT_LSI_SHIFT)
#define PERI_Ethernet_MAC_MACLMIR_BIT_DRSYNCR_SHIFT                 (8U)
#define PERI_Ethernet_MAC_MACLMIR_BIT_DRSYNCR_MASK                  (((1U<<3)-1) << PERI_Ethernet_MAC_MACLMIR_BIT_DRSYNCR_SHIFT)
#define PERI_Ethernet_MAC_MACLMIR_BIT_LMPDRI_SHIFT                  (24U)
#define PERI_Ethernet_MAC_MACLMIR_BIT_LMPDRI_MASK                   (((1U<<8)-1) << PERI_Ethernet_MAC_MACLMIR_BIT_LMPDRI_SHIFT)

/*--- register MTLOMR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLOMR_BIT_DTXSTS_SHIFT                   (1U)
#define PERI_Ethernet_MTL_MTLOMR_BIT_DTXSTS_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLOMR_BIT_DTXSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLOMR_BIT_CNTPRST_SHIFT                  (8U)
#define PERI_Ethernet_MTL_MTLOMR_BIT_CNTPRST_MASK                   (((1U<<1)-1) << PERI_Ethernet_MTL_MTLOMR_BIT_CNTPRST_SHIFT)
#define PERI_Ethernet_MTL_MTLOMR_BIT_CNTCLR_SHIFT                   (9U)
#define PERI_Ethernet_MTL_MTLOMR_BIT_CNTCLR_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLOMR_BIT_CNTCLR_SHIFT)

/*--- register MTLISR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLISR_BIT_Q0IS_SHIFT                     (0U)
#define PERI_Ethernet_MTL_MTLISR_BIT_Q0IS_MASK                      (((1U<<1)-1) << PERI_Ethernet_MTL_MTLISR_BIT_Q0IS_SHIFT)

/*--- register MTLTxQOMR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_FTQ_SHIFT                   (0U)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_FTQ_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQOMR_BIT_FTQ_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TSF_SHIFT                   (1U)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TSF_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQOMR_BIT_TSF_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TXQEN_SHIFT                 (2U)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TXQEN_MASK                  (((1U<<2)-1) << PERI_Ethernet_MTL_MTLTXQOMR_BIT_TXQEN_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TTC_SHIFT                   (4U)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TTC_MASK                    (((1U<<3)-1) << PERI_Ethernet_MTL_MTLTXQOMR_BIT_TTC_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TQS_SHIFT                   (16U)
#define PERI_Ethernet_MTL_MTLTXQOMR_BIT_TQS_MASK                    (((1U<<3)-1) << PERI_Ethernet_MTL_MTLTXQOMR_BIT_TQS_SHIFT)

/*--- register MTLTxQUR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLTXQUR_BIT_UFFRMCNT_SHIFT               (0U)
#define PERI_Ethernet_MTL_MTLTXQUR_BIT_UFFRMCNT_MASK                (((1U<<11)-1) << PERI_Ethernet_MTL_MTLTXQUR_BIT_UFFRMCNT_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQUR_BIT_UFCNTOVF_SHIFT               (11U)
#define PERI_Ethernet_MTL_MTLTXQUR_BIT_UFCNTOVF_MASK                (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQUR_BIT_UFCNTOVF_SHIFT)

