minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MTLTxQDR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TXQPAUSED_SHIFT              (0U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TXQPAUSED_MASK               (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_TXQPAUSED_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TRCSTS_SHIFT                 (1U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TRCSTS_MASK                  (((1U<<2)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_TRCSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TWCSTS_SHIFT                 (3U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TWCSTS_MASK                  (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_TWCSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TXQSTS_SHIFT                 (4U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TXQSTS_MASK                  (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_TXQSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TXSTSFSTS_SHIFT              (5U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_TXSTSFSTS_MASK               (((1U<<1)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_TXSTSFSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_PTXQ_SHIFT                   (16U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_PTXQ_MASK                    (((1U<<3)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_PTXQ_SHIFT)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_STXSTSF_SHIFT                (20U)
#define PERI_Ethernet_MTL_MTLTXQDR_BIT_STXSTSF_MASK                 (((1U<<3)-1) << PERI_Ethernet_MTL_MTLTXQDR_BIT_STXSTSF_SHIFT)

/*--- register MTLQICSR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLQICSR_BIT_TXUNFIS_SHIFT                (0U)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_TXUNFIS_MASK                 (((1U<<1)-1) << PERI_Ethernet_MTL_MTLQICSR_BIT_TXUNFIS_SHIFT)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_TXUIE_SHIFT                  (8U)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_TXUIE_MASK                   (((1U<<1)-1) << PERI_Ethernet_MTL_MTLQICSR_BIT_TXUIE_SHIFT)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_RXOVFIS_SHIFT                (16U)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_RXOVFIS_MASK                 (((1U<<1)-1) << PERI_Ethernet_MTL_MTLQICSR_BIT_RXOVFIS_SHIFT)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_RXOIE_SHIFT                  (24U)
#define PERI_Ethernet_MTL_MTLQICSR_BIT_RXOIE_MASK                   (((1U<<1)-1) << PERI_Ethernet_MTL_MTLQICSR_BIT_RXOIE_SHIFT)

/*--- register MTLRxQOMR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RTC_SHIFT                   (0U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RTC_MASK                    (((1U<<2)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_RTC_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_FUP_SHIFT                   (3U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_FUP_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_FUP_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_FEP_SHIFT                   (4U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_FEP_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_FEP_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RSF_SHIFT                   (5U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RSF_MASK                    (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_RSF_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_DIS_TCP_EF_SHIFT            (6U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_DIS_TCP_EF_MASK             (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_DIS_TCP_EF_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_EHFC_SHIFT                  (7U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_EHFC_MASK                   (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_EHFC_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RFA_SHIFT                   (8U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RFA_MASK                    (((1U<<3)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_RFA_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RFD_SHIFT                   (14U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RFD_MASK                    (((1U<<3)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_RFD_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RQS_SHIFT                   (20U)
#define PERI_Ethernet_MTL_MTLRXQOMR_BIT_RQS_MASK                    (((1U<<3)-1) << PERI_Ethernet_MTL_MTLRXQOMR_BIT_RQS_SHIFT)

/*--- register MTLRxQMPOCR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_OVFPKTCNT_SHIFT           (0U)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_OVFPKTCNT_MASK            (((1U<<11)-1) << PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_OVFPKTCNT_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_OVFCNTOVF_SHIFT           (11U)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_OVFCNTOVF_MASK            (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_OVFCNTOVF_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_MISPKTCNT_SHIFT           (16U)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_MISPKTCNT_MASK            (((1U<<11)-1) << PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_MISPKTCNT_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_MISCNTOVF_SHIFT           (27U)
#define PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_MISCNTOVF_MASK            (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQMPOCR_BIT_MISCNTOVF_SHIFT)

/*--- register MTLRxQDR -------------------------------------------------*/
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_RWCSTS_SHIFT                 (0U)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_RWCSTS_MASK                  (((1U<<1)-1) << PERI_Ethernet_MTL_MTLRXQDR_BIT_RWCSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_RRCSTS_SHIFT                 (1U)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_RRCSTS_MASK                  (((1U<<2)-1) << PERI_Ethernet_MTL_MTLRXQDR_BIT_RRCSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_RXQSTS_SHIFT                 (4U)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_RXQSTS_MASK                  (((1U<<2)-1) << PERI_Ethernet_MTL_MTLRXQDR_BIT_RXQSTS_SHIFT)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_PRXQ_SHIFT                   (16U)
#define PERI_Ethernet_MTL_MTLRXQDR_BIT_PRXQ_MASK                    (((1U<<14)-1) << PERI_Ethernet_MTL_MTLRXQDR_BIT_PRXQ_SHIFT)

/*--- register FDCAN_CREL -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_CREL_BIT_DAY_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_CREL_BIT_DAY_MASK                         (((1U<<8)-1) << PERI_FDCAN1_FDCAN_CREL_BIT_DAY_SHIFT)
#define PERI_FDCAN1_FDCAN_CREL_BIT_MON_SHIFT                        (8U)
#define PERI_FDCAN1_FDCAN_CREL_BIT_MON_MASK                         (((1U<<8)-1) << PERI_FDCAN1_FDCAN_CREL_BIT_MON_SHIFT)
#define PERI_FDCAN1_FDCAN_CREL_BIT_YEAR_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_CREL_BIT_YEAR_MASK                        (((1U<<4)-1) << PERI_FDCAN1_FDCAN_CREL_BIT_YEAR_SHIFT)
#define PERI_FDCAN1_FDCAN_CREL_BIT_SUBSTEP_SHIFT                    (20U)
#define PERI_FDCAN1_FDCAN_CREL_BIT_SUBSTEP_MASK                     (((1U<<4)-1) << PERI_FDCAN1_FDCAN_CREL_BIT_SUBSTEP_SHIFT)
#define PERI_FDCAN1_FDCAN_CREL_BIT_STEP_SHIFT                       (24U)
#define PERI_FDCAN1_FDCAN_CREL_BIT_STEP_MASK                        (((1U<<4)-1) << PERI_FDCAN1_FDCAN_CREL_BIT_STEP_SHIFT)
#define PERI_FDCAN1_FDCAN_CREL_BIT_REL_SHIFT                        (28U)
#define PERI_FDCAN1_FDCAN_CREL_BIT_REL_MASK                         (((1U<<4)-1) << PERI_FDCAN1_FDCAN_CREL_BIT_REL_SHIFT)

/*--- register FDCAN_ENDN -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_ENDN_BIT_ETV_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_ENDN_BIT_ETV_MASK                         (((1U<<32)-1) << PERI_FDCAN1_FDCAN_ENDN_BIT_ETV_SHIFT)

