minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_DBTP -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DSJW_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DSJW_MASK                        (((1U<<4)-1) << PERI_FDCAN1_FDCAN_DBTP_BIT_DSJW_SHIFT)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DTSEG2_SHIFT                     (4U)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DTSEG2_MASK                      (((1U<<4)-1) << PERI_FDCAN1_FDCAN_DBTP_BIT_DTSEG2_SHIFT)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DTSEG1_SHIFT                     (8U)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DTSEG1_MASK                      (((1U<<5)-1) << PERI_FDCAN1_FDCAN_DBTP_BIT_DTSEG1_SHIFT)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DBRP_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_DBRP_MASK                        (((1U<<5)-1) << PERI_FDCAN1_FDCAN_DBTP_BIT_DBRP_SHIFT)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_TDC_SHIFT                        (23U)
#define PERI_FDCAN1_FDCAN_DBTP_BIT_TDC_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_DBTP_BIT_TDC_SHIFT)

/*--- register FDCAN_TEST -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TEST_BIT_LBCK_SHIFT                       (4U)
#define PERI_FDCAN1_FDCAN_TEST_BIT_LBCK_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TEST_BIT_LBCK_SHIFT)
#define PERI_FDCAN1_FDCAN_TEST_BIT_TX_SHIFT                         (5U)
#define PERI_FDCAN1_FDCAN_TEST_BIT_TX_MASK                          (((1U<<2)-1) << PERI_FDCAN1_FDCAN_TEST_BIT_TX_SHIFT)
#define PERI_FDCAN1_FDCAN_TEST_BIT_RX_SHIFT                         (7U)
#define PERI_FDCAN1_FDCAN_TEST_BIT_RX_MASK                          (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TEST_BIT_RX_SHIFT)

/*--- register FDCAN_RWD -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_RWD_BIT_WDC_SHIFT                         (0U)
#define PERI_FDCAN1_FDCAN_RWD_BIT_WDC_MASK                          (((1U<<8)-1) << PERI_FDCAN1_FDCAN_RWD_BIT_WDC_SHIFT)
#define PERI_FDCAN1_FDCAN_RWD_BIT_WDV_SHIFT                         (8U)
#define PERI_FDCAN1_FDCAN_RWD_BIT_WDV_MASK                          (((1U<<8)-1) << PERI_FDCAN1_FDCAN_RWD_BIT_WDV_SHIFT)

/*--- register FDCAN_CCCR -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_CCCR_BIT_INIT_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_INIT_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_INIT_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_CCE_SHIFT                        (1U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_CCE_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_CCE_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_ASM_SHIFT                        (2U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_ASM_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_ASM_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_CSA_SHIFT                        (3U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_CSA_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_CSA_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_CSR_SHIFT                        (4U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_CSR_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_CSR_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_MON_SHIFT                        (5U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_MON_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_MON_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_DAR_SHIFT                        (6U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_DAR_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_DAR_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_TEST_SHIFT                       (7U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_TEST_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_TEST_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_FDOE_SHIFT                       (8U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_FDOE_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_FDOE_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_BSE_SHIFT                        (9U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_BSE_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_BSE_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_PXHD_SHIFT                       (12U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_PXHD_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_PXHD_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_EFBI_SHIFT                       (13U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_EFBI_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_EFBI_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_TXP_SHIFT                        (14U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_TXP_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_TXP_SHIFT)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_NISO_SHIFT                       (15U)
#define PERI_FDCAN1_FDCAN_CCCR_BIT_NISO_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_CCCR_BIT_NISO_SHIFT)

/*--- register FDCAN_NBTP -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_NBTP_BIT_TSEG2_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_TSEG2_MASK                       (((1U<<7)-1) << PERI_FDCAN1_FDCAN_NBTP_BIT_TSEG2_SHIFT)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_NTSEG1_SHIFT                     (8U)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_NTSEG1_MASK                      (((1U<<8)-1) << PERI_FDCAN1_FDCAN_NBTP_BIT_NTSEG1_SHIFT)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_NBRP_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_NBRP_MASK                        (((1U<<9)-1) << PERI_FDCAN1_FDCAN_NBTP_BIT_NBRP_SHIFT)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_NSJW_SHIFT                       (25U)
#define PERI_FDCAN1_FDCAN_NBTP_BIT_NSJW_MASK                        (((1U<<7)-1) << PERI_FDCAN1_FDCAN_NBTP_BIT_NSJW_SHIFT)

/*--- register FDCAN_TSCC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TSCC_BIT_TSS_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TSCC_BIT_TSS_MASK                         (((1U<<2)-1) << PERI_FDCAN1_FDCAN_TSCC_BIT_TSS_SHIFT)
#define PERI_FDCAN1_FDCAN_TSCC_BIT_TCP_SHIFT                        (16U)
#define PERI_FDCAN1_FDCAN_TSCC_BIT_TCP_MASK                         (((1U<<4)-1) << PERI_FDCAN1_FDCAN_TSCC_BIT_TCP_SHIFT)

/*--- register FDCAN_TSCV -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TSCV_BIT_TSC_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TSCV_BIT_TSC_MASK                         (((1U<<16)-1) << PERI_FDCAN1_FDCAN_TSCV_BIT_TSC_SHIFT)

/*--- register FDCAN_TOCC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TOCC_BIT_ETOC_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_TOCC_BIT_ETOC_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TOCC_BIT_ETOC_SHIFT)
#define PERI_FDCAN1_FDCAN_TOCC_BIT_TOS_SHIFT                        (1U)
#define PERI_FDCAN1_FDCAN_TOCC_BIT_TOS_MASK                         (((1U<<2)-1) << PERI_FDCAN1_FDCAN_TOCC_BIT_TOS_SHIFT)
#define PERI_FDCAN1_FDCAN_TOCC_BIT_TOP_SHIFT                        (16U)
#define PERI_FDCAN1_FDCAN_TOCC_BIT_TOP_MASK                         (((1U<<16)-1) << PERI_FDCAN1_FDCAN_TOCC_BIT_TOP_SHIFT)

/*--- register FDCAN_TOCV -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TOCV_BIT_TOC_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TOCV_BIT_TOC_MASK                         (((1U<<16)-1) << PERI_FDCAN1_FDCAN_TOCV_BIT_TOC_SHIFT)

/*--- register FDCAN_ECR -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_ECR_BIT_TEC_SHIFT                         (0U)
#define PERI_FDCAN1_FDCAN_ECR_BIT_TEC_MASK                          (((1U<<8)-1) << PERI_FDCAN1_FDCAN_ECR_BIT_TEC_SHIFT)
#define PERI_FDCAN1_FDCAN_ECR_BIT_TREC_SHIFT                        (8U)
#define PERI_FDCAN1_FDCAN_ECR_BIT_TREC_MASK                         (((1U<<7)-1) << PERI_FDCAN1_FDCAN_ECR_BIT_TREC_SHIFT)
#define PERI_FDCAN1_FDCAN_ECR_BIT_RP_SHIFT                          (15U)
#define PERI_FDCAN1_FDCAN_ECR_BIT_RP_MASK                           (((1U<<1)-1) << PERI_FDCAN1_FDCAN_ECR_BIT_RP_SHIFT)
#define PERI_FDCAN1_FDCAN_ECR_BIT_CEL_SHIFT                         (16U)
#define PERI_FDCAN1_FDCAN_ECR_BIT_CEL_MASK                          (((1U<<8)-1) << PERI_FDCAN1_FDCAN_ECR_BIT_CEL_SHIFT)

