minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_GFC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_GFC_BIT_RRFE_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_GFC_BIT_RRFE_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_GFC_BIT_RRFE_SHIFT)
#define PERI_FDCAN1_FDCAN_GFC_BIT_RRFS_SHIFT                        (1U)
#define PERI_FDCAN1_FDCAN_GFC_BIT_RRFS_MASK                         (((1U<<1)-1) << PERI_FDCAN1_FDCAN_GFC_BIT_RRFS_SHIFT)
#define PERI_FDCAN1_FDCAN_GFC_BIT_ANFE_SHIFT                        (2U)
#define PERI_FDCAN1_FDCAN_GFC_BIT_ANFE_MASK                         (((1U<<2)-1) << PERI_FDCAN1_FDCAN_GFC_BIT_ANFE_SHIFT)
#define PERI_FDCAN1_FDCAN_GFC_BIT_ANFS_SHIFT                        (4U)
#define PERI_FDCAN1_FDCAN_GFC_BIT_ANFS_MASK                         (((1U<<2)-1) << PERI_FDCAN1_FDCAN_GFC_BIT_ANFS_SHIFT)

/*--- register FDCAN_SIDFC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_SIDFC_BIT_FLSSA_SHIFT                     (2U)
#define PERI_FDCAN1_FDCAN_SIDFC_BIT_FLSSA_MASK                      (((1U<<14)-1) << PERI_FDCAN1_FDCAN_SIDFC_BIT_FLSSA_SHIFT)
#define PERI_FDCAN1_FDCAN_SIDFC_BIT_LSS_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_SIDFC_BIT_LSS_MASK                        (((1U<<8)-1) << PERI_FDCAN1_FDCAN_SIDFC_BIT_LSS_SHIFT)

/*--- register FDCAN_XIDFC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_XIDFC_BIT_FLESA_SHIFT                     (2U)
#define PERI_FDCAN1_FDCAN_XIDFC_BIT_FLESA_MASK                      (((1U<<14)-1) << PERI_FDCAN1_FDCAN_XIDFC_BIT_FLESA_SHIFT)
#define PERI_FDCAN1_FDCAN_XIDFC_BIT_LSE_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_XIDFC_BIT_LSE_MASK                        (((1U<<8)-1) << PERI_FDCAN1_FDCAN_XIDFC_BIT_LSE_SHIFT)

/*--- register FDCAN_XIDAM -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_XIDAM_BIT_EIDM_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_XIDAM_BIT_EIDM_MASK                       (((1U<<29)-1) << PERI_FDCAN1_FDCAN_XIDAM_BIT_EIDM_SHIFT)

/*--- register FDCAN_HPMS -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_HPMS_BIT_BIDX_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_BIDX_MASK                        (((1U<<6)-1) << PERI_FDCAN1_FDCAN_HPMS_BIT_BIDX_SHIFT)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_MSI_SHIFT                        (6U)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_MSI_MASK                         (((1U<<2)-1) << PERI_FDCAN1_FDCAN_HPMS_BIT_MSI_SHIFT)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_FIDX_SHIFT                       (8U)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_FIDX_MASK                        (((1U<<7)-1) << PERI_FDCAN1_FDCAN_HPMS_BIT_FIDX_SHIFT)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_FLST_SHIFT                       (15U)
#define PERI_FDCAN1_FDCAN_HPMS_BIT_FLST_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_HPMS_BIT_FLST_SHIFT)

/*--- register FDCAN_NDAT1 -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND0_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND0_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND0_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND1_SHIFT                       (1U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND1_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND1_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND2_SHIFT                       (2U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND2_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND2_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND3_SHIFT                       (3U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND3_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND3_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND4_SHIFT                       (4U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND4_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND4_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND5_SHIFT                       (5U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND5_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND5_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND6_SHIFT                       (6U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND6_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND6_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND7_SHIFT                       (7U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND7_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND7_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND8_SHIFT                       (8U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND8_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND8_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND9_SHIFT                       (9U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND9_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND9_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND10_SHIFT                      (10U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND10_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND10_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND11_SHIFT                      (11U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND11_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND11_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND12_SHIFT                      (12U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND12_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND12_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND13_SHIFT                      (13U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND13_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND13_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND14_SHIFT                      (14U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND14_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND14_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND15_SHIFT                      (15U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND15_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND15_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND16_SHIFT                      (16U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND16_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND16_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND17_SHIFT                      (17U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND17_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND17_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND18_SHIFT                      (18U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND18_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND18_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND19_SHIFT                      (19U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND19_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND19_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND20_SHIFT                      (20U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND20_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND20_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND21_SHIFT                      (21U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND21_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND21_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND22_SHIFT                      (22U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND22_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND22_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND23_SHIFT                      (23U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND23_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND23_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND24_SHIFT                      (24U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND24_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND24_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND25_SHIFT                      (25U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND25_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND25_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND26_SHIFT                      (26U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND26_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND26_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND27_SHIFT                      (27U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND27_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND27_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND28_SHIFT                      (28U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND28_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND28_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND29_SHIFT                      (29U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND29_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND29_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND30_SHIFT                      (30U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND30_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND30_SHIFT)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND31_SHIFT                      (31U)
#define PERI_FDCAN1_FDCAN_NDAT1_BIT_ND31_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_NDAT1_BIT_ND31_SHIFT)

