minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_TXBC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBC_BIT_TBSA_SHIFT                       (2U)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_TBSA_MASK                        (((1U<<14)-1) << PERI_FDCAN1_FDCAN_TXBC_BIT_TBSA_SHIFT)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_NDTB_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_NDTB_MASK                        (((1U<<6)-1) << PERI_FDCAN1_FDCAN_TXBC_BIT_NDTB_SHIFT)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_TFQS_SHIFT                       (24U)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_TFQS_MASK                        (((1U<<6)-1) << PERI_FDCAN1_FDCAN_TXBC_BIT_TFQS_SHIFT)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_TFQM_SHIFT                       (30U)
#define PERI_FDCAN1_FDCAN_TXBC_BIT_TFQM_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TXBC_BIT_TFQM_SHIFT)

/*--- register FDCAN_TXFQS -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFFL_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFFL_MASK                       (((1U<<6)-1) << PERI_FDCAN1_FDCAN_TXFQS_BIT_TFFL_SHIFT)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFGI_SHIFT                      (8U)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFGI_MASK                       (((1U<<5)-1) << PERI_FDCAN1_FDCAN_TXFQS_BIT_TFGI_SHIFT)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFQPI_SHIFT                     (16U)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFQPI_MASK                      (((1U<<5)-1) << PERI_FDCAN1_FDCAN_TXFQS_BIT_TFQPI_SHIFT)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFQF_SHIFT                      (21U)
#define PERI_FDCAN1_FDCAN_TXFQS_BIT_TFQF_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TXFQS_BIT_TFQF_SHIFT)

/*--- register FDCAN_TXESC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXESC_BIT_TBDS_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_TXESC_BIT_TBDS_MASK                       (((1U<<3)-1) << PERI_FDCAN1_FDCAN_TXESC_BIT_TBDS_SHIFT)

/*--- register FDCAN_TXBRP -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBRP_BIT_TRP_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_TXBRP_BIT_TRP_MASK                        (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBRP_BIT_TRP_SHIFT)

/*--- register FDCAN_TXBAR -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBAR_BIT_AR_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TXBAR_BIT_AR_MASK                         (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBAR_BIT_AR_SHIFT)

/*--- register FDCAN_TXBCR -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBCR_BIT_CR_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TXBCR_BIT_CR_MASK                         (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBCR_BIT_CR_SHIFT)

/*--- register FDCAN_TXBTO -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBTO_BIT_TO_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TXBTO_BIT_TO_MASK                         (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBTO_BIT_TO_SHIFT)

/*--- register FDCAN_TXBCF -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBCF_BIT_CF_SHIFT                        (0U)
#define PERI_FDCAN1_FDCAN_TXBCF_BIT_CF_MASK                         (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBCF_BIT_CF_SHIFT)

/*--- register FDCAN_TXBTIE -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBTIE_BIT_TIE_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_TXBTIE_BIT_TIE_MASK                       (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBTIE_BIT_TIE_SHIFT)

/*--- register FDCAN_TXBCIE -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXBCIE_BIT_CF_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_TXBCIE_BIT_CF_MASK                        (((1U<<32)-1) << PERI_FDCAN1_FDCAN_TXBCIE_BIT_CF_SHIFT)

/*--- register FDCAN_TXEFC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXEFC_BIT_EFSA_SHIFT                      (2U)
#define PERI_FDCAN1_FDCAN_TXEFC_BIT_EFSA_MASK                       (((1U<<14)-1) << PERI_FDCAN1_FDCAN_TXEFC_BIT_EFSA_SHIFT)
#define PERI_FDCAN1_FDCAN_TXEFC_BIT_EFS_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_TXEFC_BIT_EFS_MASK                        (((1U<<6)-1) << PERI_FDCAN1_FDCAN_TXEFC_BIT_EFS_SHIFT)
#define PERI_FDCAN1_FDCAN_TXEFC_BIT_EFWM_SHIFT                      (24U)
#define PERI_FDCAN1_FDCAN_TXEFC_BIT_EFWM_MASK                       (((1U<<6)-1) << PERI_FDCAN1_FDCAN_TXEFC_BIT_EFWM_SHIFT)

/*--- register FDCAN_TXEFS -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFFL_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFFL_MASK                       (((1U<<6)-1) << PERI_FDCAN1_FDCAN_TXEFS_BIT_EFFL_SHIFT)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFGI_SHIFT                      (8U)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFGI_MASK                       (((1U<<5)-1) << PERI_FDCAN1_FDCAN_TXEFS_BIT_EFGI_SHIFT)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFPI_SHIFT                      (16U)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFPI_MASK                       (((1U<<5)-1) << PERI_FDCAN1_FDCAN_TXEFS_BIT_EFPI_SHIFT)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFF_SHIFT                       (24U)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_EFF_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TXEFS_BIT_EFF_SHIFT)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_TEFL_SHIFT                      (25U)
#define PERI_FDCAN1_FDCAN_TXEFS_BIT_TEFL_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TXEFS_BIT_TEFL_SHIFT)

/*--- register FDCAN_TXEFA -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TXEFA_BIT_EFAI_SHIFT                      (0U)
#define PERI_FDCAN1_FDCAN_TXEFA_BIT_EFAI_MASK                       (((1U<<5)-1) << PERI_FDCAN1_FDCAN_TXEFA_BIT_EFAI_SHIFT)

/*--- register FDCAN_TTTMC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TTTMC_BIT_TMSA_SHIFT                      (2U)
#define PERI_FDCAN1_FDCAN_TTTMC_BIT_TMSA_MASK                       (((1U<<14)-1) << PERI_FDCAN1_FDCAN_TTTMC_BIT_TMSA_SHIFT)
#define PERI_FDCAN1_FDCAN_TTTMC_BIT_TME_SHIFT                       (16U)
#define PERI_FDCAN1_FDCAN_TTTMC_BIT_TME_MASK                        (((1U<<7)-1) << PERI_FDCAN1_FDCAN_TTTMC_BIT_TME_SHIFT)

/*--- register FDCAN_TTRMC -------------------------------------------------*/
#define PERI_FDCAN1_FDCAN_TTRMC_BIT_RID_SHIFT                       (0U)
#define PERI_FDCAN1_FDCAN_TTRMC_BIT_RID_MASK                        (((1U<<29)-1) << PERI_FDCAN1_FDCAN_TTRMC_BIT_RID_SHIFT)
#define PERI_FDCAN1_FDCAN_TTRMC_BIT_XTD_SHIFT                       (30U)
#define PERI_FDCAN1_FDCAN_TTRMC_BIT_XTD_MASK                        (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TTRMC_BIT_XTD_SHIFT)
#define PERI_FDCAN1_FDCAN_TTRMC_BIT_RMPS_SHIFT                      (31U)
#define PERI_FDCAN1_FDCAN_TTRMC_BIT_RMPS_MASK                       (((1U<<1)-1) << PERI_FDCAN1_FDCAN_TTRMC_BIT_RMPS_SHIFT)

