minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_PSR -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_PSR_BIT_LEC_SHIFT                         (0U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_LEC_MASK                          (((1U<<3)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_LEC_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_ACT_SHIFT                         (3U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_ACT_MASK                          (((1U<<2)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_ACT_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_EP_SHIFT                          (5U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_EP_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_EP_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_EW_SHIFT                          (6U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_EW_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_EW_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_BO_SHIFT                          (7U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_BO_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_BO_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_DLEC_SHIFT                        (8U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_DLEC_MASK                         (((1U<<3)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_DLEC_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_RESI_SHIFT                        (11U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_RESI_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_RESI_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_RBRS_SHIFT                        (12U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_RBRS_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_RBRS_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_REDL_SHIFT                        (13U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_REDL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_REDL_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_PXE_SHIFT                         (14U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_PXE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_PXE_SHIFT)
#define PERI_FDCAN2_FDCAN_PSR_BIT_TDCV_SHIFT                        (16U)
#define PERI_FDCAN2_FDCAN_PSR_BIT_TDCV_MASK                         (((1U<<7)-1) << PERI_FDCAN2_FDCAN_PSR_BIT_TDCV_SHIFT)

/*--- register FDCAN_TDCR -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TDCR_BIT_TDCF_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TDCR_BIT_TDCF_MASK                        (((1U<<7)-1) << PERI_FDCAN2_FDCAN_TDCR_BIT_TDCF_SHIFT)
#define PERI_FDCAN2_FDCAN_TDCR_BIT_TDCO_SHIFT                       (8U)
#define PERI_FDCAN2_FDCAN_TDCR_BIT_TDCO_MASK                        (((1U<<7)-1) << PERI_FDCAN2_FDCAN_TDCR_BIT_TDCO_SHIFT)

/*--- register FDCAN_IR -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0N_SHIFT                         (0U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0N_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF0N_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0W_SHIFT                         (1U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0W_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF0W_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0F_SHIFT                         (2U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0F_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF0F_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0L_SHIFT                         (3U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF0L_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF0L_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1N_SHIFT                         (4U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1N_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF1N_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1W_SHIFT                         (5U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1W_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF1W_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1F_SHIFT                         (6U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1F_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF1F_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1L_SHIFT                         (7U)
#define PERI_FDCAN2_FDCAN_IR_BIT_RF1L_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_RF1L_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_HPM_SHIFT                          (8U)
#define PERI_FDCAN2_FDCAN_IR_BIT_HPM_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_HPM_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TC_SHIFT                           (9U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TC_MASK                            (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TC_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TCF_SHIFT                          (10U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TCF_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TCF_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEF_SHIFT                          (11U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEF_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TEF_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFN_SHIFT                         (12U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFN_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TEFN_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFW_SHIFT                         (13U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFW_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TEFW_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFF_SHIFT                         (14U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFF_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TEFF_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFL_SHIFT                         (15U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TEFL_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TEFL_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TSW_SHIFT                          (16U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TSW_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TSW_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_MRAF_SHIFT                         (17U)
#define PERI_FDCAN2_FDCAN_IR_BIT_MRAF_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_MRAF_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_TOO_SHIFT                          (18U)
#define PERI_FDCAN2_FDCAN_IR_BIT_TOO_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_TOO_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_DRX_SHIFT                          (19U)
#define PERI_FDCAN2_FDCAN_IR_BIT_DRX_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_DRX_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_ELO_SHIFT                          (22U)
#define PERI_FDCAN2_FDCAN_IR_BIT_ELO_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_ELO_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_EP_SHIFT                           (23U)
#define PERI_FDCAN2_FDCAN_IR_BIT_EP_MASK                            (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_EP_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_EW_SHIFT                           (24U)
#define PERI_FDCAN2_FDCAN_IR_BIT_EW_MASK                            (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_EW_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_BO_SHIFT                           (25U)
#define PERI_FDCAN2_FDCAN_IR_BIT_BO_MASK                            (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_BO_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_WDI_SHIFT                          (26U)
#define PERI_FDCAN2_FDCAN_IR_BIT_WDI_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_WDI_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_PEA_SHIFT                          (27U)
#define PERI_FDCAN2_FDCAN_IR_BIT_PEA_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_PEA_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_PED_SHIFT                          (28U)
#define PERI_FDCAN2_FDCAN_IR_BIT_PED_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_PED_SHIFT)
#define PERI_FDCAN2_FDCAN_IR_BIT_ARA_SHIFT                          (29U)
#define PERI_FDCAN2_FDCAN_IR_BIT_ARA_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IR_BIT_ARA_SHIFT)

/*--- register FDCAN_IE -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0NE_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0NE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF0NE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0WE_SHIFT                        (1U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0WE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF0WE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0FE_SHIFT                        (2U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0FE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF0FE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0LE_SHIFT                        (3U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF0LE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF0LE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1NE_SHIFT                        (4U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1NE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF1NE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1WE_SHIFT                        (5U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1WE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF1WE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1FE_SHIFT                        (6U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1FE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF1FE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1LE_SHIFT                        (7U)
#define PERI_FDCAN2_FDCAN_IE_BIT_RF1LE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_RF1LE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_HPME_SHIFT                         (8U)
#define PERI_FDCAN2_FDCAN_IE_BIT_HPME_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_HPME_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TCE_SHIFT                          (9U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TCE_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TCE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TCFE_SHIFT                         (10U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TCFE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TCFE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFE_SHIFT                         (11U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TEFE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFNE_SHIFT                        (12U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFNE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TEFNE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFWE_SHIFT                        (13U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFWE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TEFWE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFFE_SHIFT                        (14U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFFE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TEFFE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFLE_SHIFT                        (15U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TEFLE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TEFLE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TSWE_SHIFT                         (16U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TSWE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TSWE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_MRAFE_SHIFT                        (17U)
#define PERI_FDCAN2_FDCAN_IE_BIT_MRAFE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_MRAFE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_TOOE_SHIFT                         (18U)
#define PERI_FDCAN2_FDCAN_IE_BIT_TOOE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_TOOE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_DRXE_SHIFT                         (19U)
#define PERI_FDCAN2_FDCAN_IE_BIT_DRXE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_DRXE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_BECE_SHIFT                         (20U)
#define PERI_FDCAN2_FDCAN_IE_BIT_BECE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_BECE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_BEUE_SHIFT                         (21U)
#define PERI_FDCAN2_FDCAN_IE_BIT_BEUE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_BEUE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_ELOE_SHIFT                         (22U)
#define PERI_FDCAN2_FDCAN_IE_BIT_ELOE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_ELOE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_EPE_SHIFT                          (23U)
#define PERI_FDCAN2_FDCAN_IE_BIT_EPE_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_EPE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_EWE_SHIFT                          (24U)
#define PERI_FDCAN2_FDCAN_IE_BIT_EWE_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_EWE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_BOE_SHIFT                          (25U)
#define PERI_FDCAN2_FDCAN_IE_BIT_BOE_MASK                           (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_BOE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_WDIE_SHIFT                         (26U)
#define PERI_FDCAN2_FDCAN_IE_BIT_WDIE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_WDIE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_PEAE_SHIFT                         (27U)
#define PERI_FDCAN2_FDCAN_IE_BIT_PEAE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_PEAE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_PEDE_SHIFT                         (28U)
#define PERI_FDCAN2_FDCAN_IE_BIT_PEDE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_PEDE_SHIFT)
#define PERI_FDCAN2_FDCAN_IE_BIT_ARAE_SHIFT                         (29U)
#define PERI_FDCAN2_FDCAN_IE_BIT_ARAE_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_IE_BIT_ARAE_SHIFT)

/*--- register FDCAN_ILS -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0NL_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0NL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF0NL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0WL_SHIFT                       (1U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0WL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF0WL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0FL_SHIFT                       (2U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0FL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF0FL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0LL_SHIFT                       (3U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF0LL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF0LL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1NL_SHIFT                       (4U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1NL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF1NL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1WL_SHIFT                       (5U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1WL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF1WL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1FL_SHIFT                       (6U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1FL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF1FL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1LL_SHIFT                       (7U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_RF1LL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_RF1LL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_HPML_SHIFT                        (8U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_HPML_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_HPML_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TCL_SHIFT                         (9U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TCL_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TCL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TCFL_SHIFT                        (10U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TCFL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TCFL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFL_SHIFT                        (11U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TEFL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFNL_SHIFT                       (12U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFNL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TEFNL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFWL_SHIFT                       (13U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFWL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TEFWL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFFL_SHIFT                       (14U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFFL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TEFFL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFLL_SHIFT                       (15U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TEFLL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TEFLL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TSWL_SHIFT                        (16U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TSWL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TSWL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_MRAFL_SHIFT                       (17U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_MRAFL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_MRAFL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TOOL_SHIFT                        (18U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_TOOL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_TOOL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_DRXL_SHIFT                        (19U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_DRXL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_DRXL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_BECL_SHIFT                        (20U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_BECL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_BECL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_BEUL_SHIFT                        (21U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_BEUL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_BEUL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_ELOL_SHIFT                        (22U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_ELOL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_ELOL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_EPL_SHIFT                         (23U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_EPL_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_EPL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_EWL_SHIFT                         (24U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_EWL_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_EWL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_BOL_SHIFT                         (25U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_BOL_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_BOL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_WDIL_SHIFT                        (26U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_WDIL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_WDIL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_PEAL_SHIFT                        (27U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_PEAL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_PEAL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_PEDL_SHIFT                        (28U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_PEDL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_PEDL_SHIFT)
#define PERI_FDCAN2_FDCAN_ILS_BIT_ARAL_SHIFT                        (29U)
#define PERI_FDCAN2_FDCAN_ILS_BIT_ARAL_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILS_BIT_ARAL_SHIFT)

/*--- register FDCAN_ILE -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_ILE_BIT_EINT0_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_ILE_BIT_EINT0_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILE_BIT_EINT0_SHIFT)
#define PERI_FDCAN2_FDCAN_ILE_BIT_EINT1_SHIFT                       (1U)
#define PERI_FDCAN2_FDCAN_ILE_BIT_EINT1_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_ILE_BIT_EINT1_SHIFT)

