minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_NDAT2 -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND32_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND32_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND32_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND33_SHIFT                      (1U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND33_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND33_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND34_SHIFT                      (2U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND34_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND34_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND35_SHIFT                      (3U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND35_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND35_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND36_SHIFT                      (4U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND36_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND36_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND37_SHIFT                      (5U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND37_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND37_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND38_SHIFT                      (6U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND38_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND38_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND39_SHIFT                      (7U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND39_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND39_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND40_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND40_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND40_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND41_SHIFT                      (9U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND41_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND41_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND42_SHIFT                      (10U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND42_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND42_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND43_SHIFT                      (11U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND43_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND43_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND44_SHIFT                      (12U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND44_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND44_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND45_SHIFT                      (13U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND45_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND45_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND46_SHIFT                      (14U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND46_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND46_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND47_SHIFT                      (15U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND47_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND47_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND48_SHIFT                      (16U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND48_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND48_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND49_SHIFT                      (17U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND49_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND49_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND50_SHIFT                      (18U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND50_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND50_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND51_SHIFT                      (19U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND51_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND51_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND52_SHIFT                      (20U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND52_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND52_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND53_SHIFT                      (21U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND53_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND53_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND54_SHIFT                      (22U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND54_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND54_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND55_SHIFT                      (23U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND55_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND55_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND56_SHIFT                      (24U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND56_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND56_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND57_SHIFT                      (25U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND57_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND57_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND58_SHIFT                      (26U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND58_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND58_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND59_SHIFT                      (27U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND59_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND59_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND60_SHIFT                      (28U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND60_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND60_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND61_SHIFT                      (29U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND61_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND61_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND62_SHIFT                      (30U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND62_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND62_SHIFT)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND63_SHIFT                      (31U)
#define PERI_FDCAN2_FDCAN_NDAT2_BIT_ND63_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_NDAT2_BIT_ND63_SHIFT)

/*--- register FDCAN_RXF0C -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXF0C_BIT_F0SA_SHIFT                      (2U)
#define PERI_FDCAN2_FDCAN_RXF0C_BIT_F0SA_MASK                       (((1U<<14)-1) << PERI_FDCAN2_FDCAN_RXF0C_BIT_F0SA_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF0C_BIT_F0S_SHIFT                       (16U)
#define PERI_FDCAN2_FDCAN_RXF0C_BIT_F0S_MASK                        (((1U<<8)-1) << PERI_FDCAN2_FDCAN_RXF0C_BIT_F0S_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF0C_BIT_F0WM_SHIFT                      (24U)
#define PERI_FDCAN2_FDCAN_RXF0C_BIT_F0WM_MASK                       (((1U<<8)-1) << PERI_FDCAN2_FDCAN_RXF0C_BIT_F0WM_SHIFT)

/*--- register FDCAN_RXF0S -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0FL_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0FL_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_RXF0S_BIT_F0FL_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0G_SHIFT                       (8U)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0G_MASK                        (((1U<<6)-1) << PERI_FDCAN2_FDCAN_RXF0S_BIT_F0G_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0P_SHIFT                       (16U)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0P_MASK                        (((1U<<6)-1) << PERI_FDCAN2_FDCAN_RXF0S_BIT_F0P_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0F_SHIFT                       (24U)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_F0F_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_RXF0S_BIT_F0F_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_RF0L_SHIFT                      (25U)
#define PERI_FDCAN2_FDCAN_RXF0S_BIT_RF0L_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_RXF0S_BIT_RF0L_SHIFT)

/*--- register FDCAN_RXF0A -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXF0A_BIT_FA01_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_RXF0A_BIT_FA01_MASK                       (((1U<<6)-1) << PERI_FDCAN2_FDCAN_RXF0A_BIT_FA01_SHIFT)

/*--- register FDCAN_RXBC -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXBC_BIT_RBSA_SHIFT                       (2U)
#define PERI_FDCAN2_FDCAN_RXBC_BIT_RBSA_MASK                        (((1U<<14)-1) << PERI_FDCAN2_FDCAN_RXBC_BIT_RBSA_SHIFT)

/*--- register FDCAN_RXF1C -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXF1C_BIT_F1SA_SHIFT                      (2U)
#define PERI_FDCAN2_FDCAN_RXF1C_BIT_F1SA_MASK                       (((1U<<14)-1) << PERI_FDCAN2_FDCAN_RXF1C_BIT_F1SA_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1C_BIT_F1S_SHIFT                       (16U)
#define PERI_FDCAN2_FDCAN_RXF1C_BIT_F1S_MASK                        (((1U<<7)-1) << PERI_FDCAN2_FDCAN_RXF1C_BIT_F1S_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1C_BIT_F1WM_SHIFT                      (24U)
#define PERI_FDCAN2_FDCAN_RXF1C_BIT_F1WM_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_RXF1C_BIT_F1WM_SHIFT)

/*--- register FDCAN_RXF1S -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1FL_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1FL_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_RXF1S_BIT_F1FL_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1GI_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1GI_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_RXF1S_BIT_F1GI_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1PI_SHIFT                      (16U)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1PI_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_RXF1S_BIT_F1PI_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1F_SHIFT                       (24U)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_F1F_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_RXF1S_BIT_F1F_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_RF1L_SHIFT                      (25U)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_RF1L_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_RXF1S_BIT_RF1L_SHIFT)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_DMS_SHIFT                       (30U)
#define PERI_FDCAN2_FDCAN_RXF1S_BIT_DMS_MASK                        (((1U<<2)-1) << PERI_FDCAN2_FDCAN_RXF1S_BIT_DMS_SHIFT)

/*--- register FDCAN_RXF1A -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXF1A_BIT_F1AI_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_RXF1A_BIT_F1AI_MASK                       (((1U<<6)-1) << PERI_FDCAN2_FDCAN_RXF1A_BIT_F1AI_SHIFT)

/*--- register FDCAN_RXESC -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_RXESC_BIT_F0DS_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_RXESC_BIT_F0DS_MASK                       (((1U<<3)-1) << PERI_FDCAN2_FDCAN_RXESC_BIT_F0DS_SHIFT)
#define PERI_FDCAN2_FDCAN_RXESC_BIT_F1DS_SHIFT                      (4U)
#define PERI_FDCAN2_FDCAN_RXESC_BIT_F1DS_MASK                       (((1U<<3)-1) << PERI_FDCAN2_FDCAN_RXESC_BIT_F1DS_SHIFT)
#define PERI_FDCAN2_FDCAN_RXESC_BIT_RBDS_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_RXESC_BIT_RBDS_MASK                       (((1U<<3)-1) << PERI_FDCAN2_FDCAN_RXESC_BIT_RBDS_SHIFT)

