minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_TTOCF -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_OM_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_OM_MASK                         (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_OM_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_GEN_SHIFT                       (3U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_GEN_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_GEN_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_TM_SHIFT                        (4U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_TM_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_TM_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_LDSDL_SHIFT                     (5U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_LDSDL_MASK                      (((1U<<3)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_LDSDL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_IRTO_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_IRTO_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_IRTO_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_EECS_SHIFT                      (15U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_EECS_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_EECS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_AWL_SHIFT                       (16U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_AWL_MASK                        (((1U<<8)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_AWL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_EGTF_SHIFT                      (24U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_EGTF_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_EGTF_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_ECC_SHIFT                       (25U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_ECC_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_ECC_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_EVTP_SHIFT                      (26U)
#define PERI_FDCAN2_FDCAN_TTOCF_BIT_EVTP_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCF_BIT_EVTP_SHIFT)

/*--- register FDCAN_TTMLM -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_CCM_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_CCM_MASK                        (((1U<<6)-1) << PERI_FDCAN2_FDCAN_TTMLM_BIT_CCM_SHIFT)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_CSS_SHIFT                       (6U)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_CSS_MASK                        (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTMLM_BIT_CSS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_TXEW_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_TXEW_MASK                       (((1U<<4)-1) << PERI_FDCAN2_FDCAN_TTMLM_BIT_TXEW_SHIFT)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_ENTT_SHIFT                      (16U)
#define PERI_FDCAN2_FDCAN_TTMLM_BIT_ENTT_MASK                       (((1U<<12)-1) << PERI_FDCAN2_FDCAN_TTMLM_BIT_ENTT_SHIFT)

/*--- register FDCAN_TURCF -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TURCF_BIT_NCL_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TURCF_BIT_NCL_MASK                        (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TURCF_BIT_NCL_SHIFT)
#define PERI_FDCAN2_FDCAN_TURCF_BIT_DC_SHIFT                        (16U)
#define PERI_FDCAN2_FDCAN_TURCF_BIT_DC_MASK                         (((1U<<14)-1) << PERI_FDCAN2_FDCAN_TURCF_BIT_DC_SHIFT)
#define PERI_FDCAN2_FDCAN_TURCF_BIT_ELT_SHIFT                       (31U)
#define PERI_FDCAN2_FDCAN_TURCF_BIT_ELT_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TURCF_BIT_ELT_SHIFT)

/*--- register FDCAN_TTOCN -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_SGT_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_SGT_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_SGT_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_ECS_SHIFT                       (1U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_ECS_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_ECS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_SWP_SHIFT                       (2U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_SWP_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_SWP_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_SWS_SHIFT                       (3U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_SWS_MASK                        (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_SWS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_RTIE_SHIFT                      (5U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_RTIE_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_RTIE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_TMC_SHIFT                       (6U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_TMC_MASK                        (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_TMC_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_TTIE_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_TTIE_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_TTIE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_GCS_SHIFT                       (9U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_GCS_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_GCS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_FGP_SHIFT                       (10U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_FGP_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_FGP_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_TMG_SHIFT                       (11U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_TMG_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_TMG_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_NIG_SHIFT                       (12U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_NIG_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_NIG_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_ESCN_SHIFT                      (13U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_ESCN_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_ESCN_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_LCKC_SHIFT                      (15U)
#define PERI_FDCAN2_FDCAN_TTOCN_BIT_LCKC_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOCN_BIT_LCKC_SHIFT)

