minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CAN_TTGTP -------------------------------------------------*/
#define PERI_FDCAN2_CAN_TTGTP_BIT_NCL_SHIFT                         (0U)
#define PERI_FDCAN2_CAN_TTGTP_BIT_NCL_MASK                          (((1U<<16)-1) << PERI_FDCAN2_CAN_TTGTP_BIT_NCL_SHIFT)
#define PERI_FDCAN2_CAN_TTGTP_BIT_CTP_SHIFT                         (16U)
#define PERI_FDCAN2_CAN_TTGTP_BIT_CTP_MASK                          (((1U<<16)-1) << PERI_FDCAN2_CAN_TTGTP_BIT_CTP_SHIFT)

/*--- register FDCAN_TTTMK -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTTMK_BIT_TM_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTTMK_BIT_TM_MASK                         (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TTTMK_BIT_TM_SHIFT)
#define PERI_FDCAN2_FDCAN_TTTMK_BIT_TICC_SHIFT                      (16U)
#define PERI_FDCAN2_FDCAN_TTTMK_BIT_TICC_MASK                       (((1U<<7)-1) << PERI_FDCAN2_FDCAN_TTTMK_BIT_TICC_SHIFT)
#define PERI_FDCAN2_FDCAN_TTTMK_BIT_LCKM_SHIFT                      (31U)
#define PERI_FDCAN2_FDCAN_TTTMK_BIT_LCKM_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTTMK_BIT_LCKM_SHIFT)

/*--- register FDCAN_TTIR -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SBC_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SBC_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_SBC_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SMC_SHIFT                        (1U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SMC_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_SMC_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_CSM_SHIFT                        (2U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_CSM_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_CSM_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SOG_SHIFT                        (3U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SOG_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_SOG_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_RTMI_SHIFT                       (4U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_RTMI_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_RTMI_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_TTMI_SHIFT                       (5U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_TTMI_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_TTMI_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SWE_SHIFT                        (6U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SWE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_SWE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_GTW_SHIFT                        (7U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_GTW_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_GTW_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_GTD_SHIFT                        (8U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_GTD_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_GTD_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_GTE_SHIFT                        (9U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_GTE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_GTE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_TXU_SHIFT                        (10U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_TXU_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_TXU_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_TXO_SHIFT                        (11U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_TXO_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_TXO_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SE1_SHIFT                        (12U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SE1_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_SE1_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SE2_SHIFT                        (13U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_SE2_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_SE2_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_ELC_SHIFT                        (14U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_ELC_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_ELC_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_IWTG_SHIFT                       (15U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_IWTG_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_IWTG_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_WT_SHIFT                         (16U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_WT_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_WT_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_AW_SHIFT                         (17U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_AW_MASK                          (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_AW_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_CER_SHIFT                        (18U)
#define PERI_FDCAN2_FDCAN_TTIR_BIT_CER_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIR_BIT_CER_SHIFT)

/*--- register FDCAN_TTIE -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SBCE_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SBCE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_SBCE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SMCE_SHIFT                       (1U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SMCE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_SMCE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_CSME_SHIFT                       (2U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_CSME_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_CSME_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SOGE_SHIFT                       (3U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SOGE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_SOGE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_RTMIE_SHIFT                      (4U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_RTMIE_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_RTMIE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_TTMIE_SHIFT                      (5U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_TTMIE_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_TTMIE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SWEE_SHIFT                       (6U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SWEE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_SWEE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_GTWE_SHIFT                       (7U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_GTWE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_GTWE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_GTDE_SHIFT                       (8U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_GTDE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_GTDE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_GTEE_SHIFT                       (9U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_GTEE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_GTEE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_TXUE_SHIFT                       (10U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_TXUE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_TXUE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_TXOE_SHIFT                       (11U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_TXOE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_TXOE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SE1E_SHIFT                       (12U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SE1E_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_SE1E_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SE2E_SHIFT                       (13U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_SE2E_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_SE2E_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_ELCE_SHIFT                       (14U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_ELCE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_ELCE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_IWTGE_SHIFT                      (15U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_IWTGE_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_IWTGE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_WTE_SHIFT                        (16U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_WTE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_WTE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_AWE_SHIFT                        (17U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_AWE_MASK                         (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_AWE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_CERE_SHIFT                       (18U)
#define PERI_FDCAN2_FDCAN_TTIE_BIT_CERE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTIE_BIT_CERE_SHIFT)

/*--- register FDCAN_TTILS -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SBCL_SHIFT                      (0U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SBCL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_SBCL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SMCL_SHIFT                      (1U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SMCL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_SMCL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_CSML_SHIFT                      (2U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_CSML_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_CSML_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SOGL_SHIFT                      (3U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SOGL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_SOGL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_RTMIL_SHIFT                     (4U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_RTMIL_MASK                      (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_RTMIL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_TTMIL_SHIFT                     (5U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_TTMIL_MASK                      (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_TTMIL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SWEL_SHIFT                      (6U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SWEL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_SWEL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_GTWL_SHIFT                      (7U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_GTWL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_GTWL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_GTDL_SHIFT                      (8U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_GTDL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_GTDL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_GTEL_SHIFT                      (9U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_GTEL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_GTEL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_TXUL_SHIFT                      (10U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_TXUL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_TXUL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_TXOL_SHIFT                      (11U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_TXOL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_TXOL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SE1L_SHIFT                      (12U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SE1L_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_SE1L_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SE2L_SHIFT                      (13U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_SE2L_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_SE2L_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_ELCL_SHIFT                      (14U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_ELCL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_ELCL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_IWTGL_SHIFT                     (15U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_IWTGL_MASK                      (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_IWTGL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_WTL_SHIFT                       (16U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_WTL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_WTL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_AWL_SHIFT                       (17U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_AWL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_AWL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_CERL_SHIFT                      (18U)
#define PERI_FDCAN2_FDCAN_TTILS_BIT_CERL_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTILS_BIT_CERL_SHIFT)

/*--- register FDCAN_TTOST -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTOST_BIT_EL_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_EL_MASK                         (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_EL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_MS_SHIFT                        (2U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_MS_MASK                         (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_MS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_SYS_SHIFT                       (4U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_SYS_MASK                        (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_SYS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_GTP_SHIFT                       (6U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_GTP_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_GTP_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_QCS_SHIFT                       (7U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_QCS_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_QCS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_RTO_SHIFT                       (8U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_RTO_MASK                        (((1U<<8)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_RTO_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_WGTD_SHIFT                      (22U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_WGTD_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_WGTD_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_GFI_SHIFT                       (23U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_GFI_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_GFI_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_TMP_SHIFT                       (24U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_TMP_MASK                        (((1U<<3)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_TMP_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_GSI_SHIFT                       (27U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_GSI_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_GSI_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_WFE_SHIFT                       (28U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_WFE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_WFE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_AWE_SHIFT                       (29U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_AWE_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_AWE_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_WECS_SHIFT                      (30U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_WECS_MASK                       (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_WECS_SHIFT)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_SPL_SHIFT                       (31U)
#define PERI_FDCAN2_FDCAN_TTOST_BIT_SPL_MASK                        (((1U<<1)-1) << PERI_FDCAN2_FDCAN_TTOST_BIT_SPL_SHIFT)

/*--- register FDCAN_TURNA -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TURNA_BIT_NAV_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TURNA_BIT_NAV_MASK                        (((1U<<18)-1) << PERI_FDCAN2_FDCAN_TURNA_BIT_NAV_SHIFT)

/*--- register FDCAN_TTLGT -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTLGT_BIT_LT_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTLGT_BIT_LT_MASK                         (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TTLGT_BIT_LT_SHIFT)
#define PERI_FDCAN2_FDCAN_TTLGT_BIT_GT_SHIFT                        (16U)
#define PERI_FDCAN2_FDCAN_TTLGT_BIT_GT_MASK                         (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TTLGT_BIT_GT_SHIFT)

/*--- register FDCAN_TTCTC -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTCTC_BIT_CT_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTCTC_BIT_CT_MASK                         (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TTCTC_BIT_CT_SHIFT)
#define PERI_FDCAN2_FDCAN_TTCTC_BIT_CC_SHIFT                        (16U)
#define PERI_FDCAN2_FDCAN_TTCTC_BIT_CC_MASK                         (((1U<<6)-1) << PERI_FDCAN2_FDCAN_TTCTC_BIT_CC_SHIFT)

/*--- register FDCAN_TTCPT -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTCPT_BIT_CT_SHIFT                        (0U)
#define PERI_FDCAN2_FDCAN_TTCPT_BIT_CT_MASK                         (((1U<<6)-1) << PERI_FDCAN2_FDCAN_TTCPT_BIT_CT_SHIFT)
#define PERI_FDCAN2_FDCAN_TTCPT_BIT_SWV_SHIFT                       (16U)
#define PERI_FDCAN2_FDCAN_TTCPT_BIT_SWV_MASK                        (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TTCPT_BIT_SWV_SHIFT)

