minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FDCAN_TTCSM -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTCSM_BIT_CSM_SHIFT                       (0U)
#define PERI_FDCAN2_FDCAN_TTCSM_BIT_CSM_MASK                        (((1U<<16)-1) << PERI_FDCAN2_FDCAN_TTCSM_BIT_CSM_SHIFT)

/*--- register FDCAN_TTTS -------------------------------------------------*/
#define PERI_FDCAN2_FDCAN_TTTS_BIT_SWTDEL_SHIFT                     (0U)
#define PERI_FDCAN2_FDCAN_TTTS_BIT_SWTDEL_MASK                      (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTTS_BIT_SWTDEL_SHIFT)
#define PERI_FDCAN2_FDCAN_TTTS_BIT_EVTSEL_SHIFT                     (4U)
#define PERI_FDCAN2_FDCAN_TTTS_BIT_EVTSEL_MASK                      (((1U<<2)-1) << PERI_FDCAN2_FDCAN_TTTS_BIT_EVTSEL_SHIFT)

/*--- register BCR1 -------------------------------------------------*/
#define PERI_FMC_BCR1_BIT_MBKEN_SHIFT                               (0U)
#define PERI_FMC_BCR1_BIT_MBKEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR1_BIT_MBKEN_SHIFT)
#define PERI_FMC_BCR1_BIT_MUXEN_SHIFT                               (1U)
#define PERI_FMC_BCR1_BIT_MUXEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR1_BIT_MUXEN_SHIFT)
#define PERI_FMC_BCR1_BIT_MTYP_SHIFT                                (2U)
#define PERI_FMC_BCR1_BIT_MTYP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR1_BIT_MTYP_SHIFT)
#define PERI_FMC_BCR1_BIT_MWID_SHIFT                                (4U)
#define PERI_FMC_BCR1_BIT_MWID_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR1_BIT_MWID_SHIFT)
#define PERI_FMC_BCR1_BIT_FACCEN_SHIFT                              (6U)
#define PERI_FMC_BCR1_BIT_FACCEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR1_BIT_FACCEN_SHIFT)
#define PERI_FMC_BCR1_BIT_BURSTEN_SHIFT                             (8U)
#define PERI_FMC_BCR1_BIT_BURSTEN_MASK                              (((1U<<1)-1) << PERI_FMC_BCR1_BIT_BURSTEN_SHIFT)
#define PERI_FMC_BCR1_BIT_WAITPOL_SHIFT                             (9U)
#define PERI_FMC_BCR1_BIT_WAITPOL_MASK                              (((1U<<1)-1) << PERI_FMC_BCR1_BIT_WAITPOL_SHIFT)
#define PERI_FMC_BCR1_BIT_WAITCFG_SHIFT                             (11U)
#define PERI_FMC_BCR1_BIT_WAITCFG_MASK                              (((1U<<1)-1) << PERI_FMC_BCR1_BIT_WAITCFG_SHIFT)
#define PERI_FMC_BCR1_BIT_WREN_SHIFT                                (12U)
#define PERI_FMC_BCR1_BIT_WREN_MASK                                 (((1U<<1)-1) << PERI_FMC_BCR1_BIT_WREN_SHIFT)
#define PERI_FMC_BCR1_BIT_WAITEN_SHIFT                              (13U)
#define PERI_FMC_BCR1_BIT_WAITEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR1_BIT_WAITEN_SHIFT)
#define PERI_FMC_BCR1_BIT_EXTMOD_SHIFT                              (14U)
#define PERI_FMC_BCR1_BIT_EXTMOD_MASK                               (((1U<<1)-1) << PERI_FMC_BCR1_BIT_EXTMOD_SHIFT)
#define PERI_FMC_BCR1_BIT_ASYNCWAIT_SHIFT                           (15U)
#define PERI_FMC_BCR1_BIT_ASYNCWAIT_MASK                            (((1U<<1)-1) << PERI_FMC_BCR1_BIT_ASYNCWAIT_SHIFT)
#define PERI_FMC_BCR1_BIT_CPSIZE_SHIFT                              (16U)
#define PERI_FMC_BCR1_BIT_CPSIZE_MASK                               (((1U<<3)-1) << PERI_FMC_BCR1_BIT_CPSIZE_SHIFT)
#define PERI_FMC_BCR1_BIT_CBURSTRW_SHIFT                            (19U)
#define PERI_FMC_BCR1_BIT_CBURSTRW_MASK                             (((1U<<1)-1) << PERI_FMC_BCR1_BIT_CBURSTRW_SHIFT)
#define PERI_FMC_BCR1_BIT_CCLKEN_SHIFT                              (20U)
#define PERI_FMC_BCR1_BIT_CCLKEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR1_BIT_CCLKEN_SHIFT)
#define PERI_FMC_BCR1_BIT_WFDIS_SHIFT                               (21U)
#define PERI_FMC_BCR1_BIT_WFDIS_MASK                                (((1U<<1)-1) << PERI_FMC_BCR1_BIT_WFDIS_SHIFT)
#define PERI_FMC_BCR1_BIT_BMAP_SHIFT                                (24U)
#define PERI_FMC_BCR1_BIT_BMAP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR1_BIT_BMAP_SHIFT)
#define PERI_FMC_BCR1_BIT_FMCEN_SHIFT                               (31U)
#define PERI_FMC_BCR1_BIT_FMCEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR1_BIT_FMCEN_SHIFT)

/*--- register BTR1 -------------------------------------------------*/
#define PERI_FMC_BTR1_BIT_ADDSET_SHIFT                              (0U)
#define PERI_FMC_BTR1_BIT_ADDSET_MASK                               (((1U<<4)-1) << PERI_FMC_BTR1_BIT_ADDSET_SHIFT)
#define PERI_FMC_BTR1_BIT_ADDHLD_SHIFT                              (4U)
#define PERI_FMC_BTR1_BIT_ADDHLD_MASK                               (((1U<<4)-1) << PERI_FMC_BTR1_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BTR1_BIT_DATAST_SHIFT                              (8U)
#define PERI_FMC_BTR1_BIT_DATAST_MASK                               (((1U<<8)-1) << PERI_FMC_BTR1_BIT_DATAST_SHIFT)
#define PERI_FMC_BTR1_BIT_BUSTURN_SHIFT                             (16U)
#define PERI_FMC_BTR1_BIT_BUSTURN_MASK                              (((1U<<4)-1) << PERI_FMC_BTR1_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BTR1_BIT_CLKDIV_SHIFT                              (20U)
#define PERI_FMC_BTR1_BIT_CLKDIV_MASK                               (((1U<<4)-1) << PERI_FMC_BTR1_BIT_CLKDIV_SHIFT)
#define PERI_FMC_BTR1_BIT_DATLAT_SHIFT                              (24U)
#define PERI_FMC_BTR1_BIT_DATLAT_MASK                               (((1U<<4)-1) << PERI_FMC_BTR1_BIT_DATLAT_SHIFT)
#define PERI_FMC_BTR1_BIT_ACCMOD_SHIFT                              (28U)
#define PERI_FMC_BTR1_BIT_ACCMOD_MASK                               (((1U<<2)-1) << PERI_FMC_BTR1_BIT_ACCMOD_SHIFT)

/*--- register BCR2 -------------------------------------------------*/
#define PERI_FMC_BCR2_BIT_MBKEN_SHIFT                               (0U)
#define PERI_FMC_BCR2_BIT_MBKEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR2_BIT_MBKEN_SHIFT)
#define PERI_FMC_BCR2_BIT_MUXEN_SHIFT                               (1U)
#define PERI_FMC_BCR2_BIT_MUXEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR2_BIT_MUXEN_SHIFT)
#define PERI_FMC_BCR2_BIT_MTYP_SHIFT                                (2U)
#define PERI_FMC_BCR2_BIT_MTYP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR2_BIT_MTYP_SHIFT)
#define PERI_FMC_BCR2_BIT_MWID_SHIFT                                (4U)
#define PERI_FMC_BCR2_BIT_MWID_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR2_BIT_MWID_SHIFT)
#define PERI_FMC_BCR2_BIT_FACCEN_SHIFT                              (6U)
#define PERI_FMC_BCR2_BIT_FACCEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR2_BIT_FACCEN_SHIFT)
#define PERI_FMC_BCR2_BIT_BURSTEN_SHIFT                             (8U)
#define PERI_FMC_BCR2_BIT_BURSTEN_MASK                              (((1U<<1)-1) << PERI_FMC_BCR2_BIT_BURSTEN_SHIFT)
#define PERI_FMC_BCR2_BIT_WAITPOL_SHIFT                             (9U)
#define PERI_FMC_BCR2_BIT_WAITPOL_MASK                              (((1U<<1)-1) << PERI_FMC_BCR2_BIT_WAITPOL_SHIFT)
#define PERI_FMC_BCR2_BIT_WAITCFG_SHIFT                             (11U)
#define PERI_FMC_BCR2_BIT_WAITCFG_MASK                              (((1U<<1)-1) << PERI_FMC_BCR2_BIT_WAITCFG_SHIFT)
#define PERI_FMC_BCR2_BIT_WREN_SHIFT                                (12U)
#define PERI_FMC_BCR2_BIT_WREN_MASK                                 (((1U<<1)-1) << PERI_FMC_BCR2_BIT_WREN_SHIFT)
#define PERI_FMC_BCR2_BIT_WAITEN_SHIFT                              (13U)
#define PERI_FMC_BCR2_BIT_WAITEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR2_BIT_WAITEN_SHIFT)
#define PERI_FMC_BCR2_BIT_EXTMOD_SHIFT                              (14U)
#define PERI_FMC_BCR2_BIT_EXTMOD_MASK                               (((1U<<1)-1) << PERI_FMC_BCR2_BIT_EXTMOD_SHIFT)
#define PERI_FMC_BCR2_BIT_ASYNCWAIT_SHIFT                           (15U)
#define PERI_FMC_BCR2_BIT_ASYNCWAIT_MASK                            (((1U<<1)-1) << PERI_FMC_BCR2_BIT_ASYNCWAIT_SHIFT)
#define PERI_FMC_BCR2_BIT_CPSIZE_SHIFT                              (16U)
#define PERI_FMC_BCR2_BIT_CPSIZE_MASK                               (((1U<<3)-1) << PERI_FMC_BCR2_BIT_CPSIZE_SHIFT)
#define PERI_FMC_BCR2_BIT_CBURSTRW_SHIFT                            (19U)
#define PERI_FMC_BCR2_BIT_CBURSTRW_MASK                             (((1U<<1)-1) << PERI_FMC_BCR2_BIT_CBURSTRW_SHIFT)
#define PERI_FMC_BCR2_BIT_CCLKEN_SHIFT                              (20U)
#define PERI_FMC_BCR2_BIT_CCLKEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR2_BIT_CCLKEN_SHIFT)
#define PERI_FMC_BCR2_BIT_WFDIS_SHIFT                               (21U)
#define PERI_FMC_BCR2_BIT_WFDIS_MASK                                (((1U<<1)-1) << PERI_FMC_BCR2_BIT_WFDIS_SHIFT)
#define PERI_FMC_BCR2_BIT_BMAP_SHIFT                                (24U)
#define PERI_FMC_BCR2_BIT_BMAP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR2_BIT_BMAP_SHIFT)
#define PERI_FMC_BCR2_BIT_FMCEN_SHIFT                               (31U)
#define PERI_FMC_BCR2_BIT_FMCEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR2_BIT_FMCEN_SHIFT)

/*--- register BTR2 -------------------------------------------------*/
#define PERI_FMC_BTR2_BIT_ADDSET_SHIFT                              (0U)
#define PERI_FMC_BTR2_BIT_ADDSET_MASK                               (((1U<<4)-1) << PERI_FMC_BTR2_BIT_ADDSET_SHIFT)
#define PERI_FMC_BTR2_BIT_ADDHLD_SHIFT                              (4U)
#define PERI_FMC_BTR2_BIT_ADDHLD_MASK                               (((1U<<4)-1) << PERI_FMC_BTR2_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BTR2_BIT_DATAST_SHIFT                              (8U)
#define PERI_FMC_BTR2_BIT_DATAST_MASK                               (((1U<<8)-1) << PERI_FMC_BTR2_BIT_DATAST_SHIFT)
#define PERI_FMC_BTR2_BIT_BUSTURN_SHIFT                             (16U)
#define PERI_FMC_BTR2_BIT_BUSTURN_MASK                              (((1U<<4)-1) << PERI_FMC_BTR2_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BTR2_BIT_CLKDIV_SHIFT                              (20U)
#define PERI_FMC_BTR2_BIT_CLKDIV_MASK                               (((1U<<4)-1) << PERI_FMC_BTR2_BIT_CLKDIV_SHIFT)
#define PERI_FMC_BTR2_BIT_DATLAT_SHIFT                              (24U)
#define PERI_FMC_BTR2_BIT_DATLAT_MASK                               (((1U<<4)-1) << PERI_FMC_BTR2_BIT_DATLAT_SHIFT)
#define PERI_FMC_BTR2_BIT_ACCMOD_SHIFT                              (28U)
#define PERI_FMC_BTR2_BIT_ACCMOD_MASK                               (((1U<<2)-1) << PERI_FMC_BTR2_BIT_ACCMOD_SHIFT)

/*--- register BCR3 -------------------------------------------------*/
#define PERI_FMC_BCR3_BIT_MBKEN_SHIFT                               (0U)
#define PERI_FMC_BCR3_BIT_MBKEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR3_BIT_MBKEN_SHIFT)
#define PERI_FMC_BCR3_BIT_MUXEN_SHIFT                               (1U)
#define PERI_FMC_BCR3_BIT_MUXEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR3_BIT_MUXEN_SHIFT)
#define PERI_FMC_BCR3_BIT_MTYP_SHIFT                                (2U)
#define PERI_FMC_BCR3_BIT_MTYP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR3_BIT_MTYP_SHIFT)
#define PERI_FMC_BCR3_BIT_MWID_SHIFT                                (4U)
#define PERI_FMC_BCR3_BIT_MWID_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR3_BIT_MWID_SHIFT)
#define PERI_FMC_BCR3_BIT_FACCEN_SHIFT                              (6U)
#define PERI_FMC_BCR3_BIT_FACCEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR3_BIT_FACCEN_SHIFT)
#define PERI_FMC_BCR3_BIT_BURSTEN_SHIFT                             (8U)
#define PERI_FMC_BCR3_BIT_BURSTEN_MASK                              (((1U<<1)-1) << PERI_FMC_BCR3_BIT_BURSTEN_SHIFT)
#define PERI_FMC_BCR3_BIT_WAITPOL_SHIFT                             (9U)
#define PERI_FMC_BCR3_BIT_WAITPOL_MASK                              (((1U<<1)-1) << PERI_FMC_BCR3_BIT_WAITPOL_SHIFT)
#define PERI_FMC_BCR3_BIT_WAITCFG_SHIFT                             (11U)
#define PERI_FMC_BCR3_BIT_WAITCFG_MASK                              (((1U<<1)-1) << PERI_FMC_BCR3_BIT_WAITCFG_SHIFT)
#define PERI_FMC_BCR3_BIT_WREN_SHIFT                                (12U)
#define PERI_FMC_BCR3_BIT_WREN_MASK                                 (((1U<<1)-1) << PERI_FMC_BCR3_BIT_WREN_SHIFT)
#define PERI_FMC_BCR3_BIT_WAITEN_SHIFT                              (13U)
#define PERI_FMC_BCR3_BIT_WAITEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR3_BIT_WAITEN_SHIFT)
#define PERI_FMC_BCR3_BIT_EXTMOD_SHIFT                              (14U)
#define PERI_FMC_BCR3_BIT_EXTMOD_MASK                               (((1U<<1)-1) << PERI_FMC_BCR3_BIT_EXTMOD_SHIFT)
#define PERI_FMC_BCR3_BIT_ASYNCWAIT_SHIFT                           (15U)
#define PERI_FMC_BCR3_BIT_ASYNCWAIT_MASK                            (((1U<<1)-1) << PERI_FMC_BCR3_BIT_ASYNCWAIT_SHIFT)
#define PERI_FMC_BCR3_BIT_CPSIZE_SHIFT                              (16U)
#define PERI_FMC_BCR3_BIT_CPSIZE_MASK                               (((1U<<3)-1) << PERI_FMC_BCR3_BIT_CPSIZE_SHIFT)
#define PERI_FMC_BCR3_BIT_CBURSTRW_SHIFT                            (19U)
#define PERI_FMC_BCR3_BIT_CBURSTRW_MASK                             (((1U<<1)-1) << PERI_FMC_BCR3_BIT_CBURSTRW_SHIFT)
#define PERI_FMC_BCR3_BIT_CCLKEN_SHIFT                              (20U)
#define PERI_FMC_BCR3_BIT_CCLKEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR3_BIT_CCLKEN_SHIFT)
#define PERI_FMC_BCR3_BIT_WFDIS_SHIFT                               (21U)
#define PERI_FMC_BCR3_BIT_WFDIS_MASK                                (((1U<<1)-1) << PERI_FMC_BCR3_BIT_WFDIS_SHIFT)
#define PERI_FMC_BCR3_BIT_BMAP_SHIFT                                (24U)
#define PERI_FMC_BCR3_BIT_BMAP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR3_BIT_BMAP_SHIFT)
#define PERI_FMC_BCR3_BIT_FMCEN_SHIFT                               (31U)
#define PERI_FMC_BCR3_BIT_FMCEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR3_BIT_FMCEN_SHIFT)

/*--- register BTR3 -------------------------------------------------*/
#define PERI_FMC_BTR3_BIT_ADDSET_SHIFT                              (0U)
#define PERI_FMC_BTR3_BIT_ADDSET_MASK                               (((1U<<4)-1) << PERI_FMC_BTR3_BIT_ADDSET_SHIFT)
#define PERI_FMC_BTR3_BIT_ADDHLD_SHIFT                              (4U)
#define PERI_FMC_BTR3_BIT_ADDHLD_MASK                               (((1U<<4)-1) << PERI_FMC_BTR3_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BTR3_BIT_DATAST_SHIFT                              (8U)
#define PERI_FMC_BTR3_BIT_DATAST_MASK                               (((1U<<8)-1) << PERI_FMC_BTR3_BIT_DATAST_SHIFT)
#define PERI_FMC_BTR3_BIT_BUSTURN_SHIFT                             (16U)
#define PERI_FMC_BTR3_BIT_BUSTURN_MASK                              (((1U<<4)-1) << PERI_FMC_BTR3_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BTR3_BIT_CLKDIV_SHIFT                              (20U)
#define PERI_FMC_BTR3_BIT_CLKDIV_MASK                               (((1U<<4)-1) << PERI_FMC_BTR3_BIT_CLKDIV_SHIFT)
#define PERI_FMC_BTR3_BIT_DATLAT_SHIFT                              (24U)
#define PERI_FMC_BTR3_BIT_DATLAT_MASK                               (((1U<<4)-1) << PERI_FMC_BTR3_BIT_DATLAT_SHIFT)
#define PERI_FMC_BTR3_BIT_ACCMOD_SHIFT                              (28U)
#define PERI_FMC_BTR3_BIT_ACCMOD_MASK                               (((1U<<2)-1) << PERI_FMC_BTR3_BIT_ACCMOD_SHIFT)

/*--- register BCR4 -------------------------------------------------*/
#define PERI_FMC_BCR4_BIT_MBKEN_SHIFT                               (0U)
#define PERI_FMC_BCR4_BIT_MBKEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR4_BIT_MBKEN_SHIFT)
#define PERI_FMC_BCR4_BIT_MUXEN_SHIFT                               (1U)
#define PERI_FMC_BCR4_BIT_MUXEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR4_BIT_MUXEN_SHIFT)
#define PERI_FMC_BCR4_BIT_MTYP_SHIFT                                (2U)
#define PERI_FMC_BCR4_BIT_MTYP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR4_BIT_MTYP_SHIFT)
#define PERI_FMC_BCR4_BIT_MWID_SHIFT                                (4U)
#define PERI_FMC_BCR4_BIT_MWID_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR4_BIT_MWID_SHIFT)
#define PERI_FMC_BCR4_BIT_FACCEN_SHIFT                              (6U)
#define PERI_FMC_BCR4_BIT_FACCEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR4_BIT_FACCEN_SHIFT)
#define PERI_FMC_BCR4_BIT_BURSTEN_SHIFT                             (8U)
#define PERI_FMC_BCR4_BIT_BURSTEN_MASK                              (((1U<<1)-1) << PERI_FMC_BCR4_BIT_BURSTEN_SHIFT)
#define PERI_FMC_BCR4_BIT_WAITPOL_SHIFT                             (9U)
#define PERI_FMC_BCR4_BIT_WAITPOL_MASK                              (((1U<<1)-1) << PERI_FMC_BCR4_BIT_WAITPOL_SHIFT)
#define PERI_FMC_BCR4_BIT_WAITCFG_SHIFT                             (11U)
#define PERI_FMC_BCR4_BIT_WAITCFG_MASK                              (((1U<<1)-1) << PERI_FMC_BCR4_BIT_WAITCFG_SHIFT)
#define PERI_FMC_BCR4_BIT_WREN_SHIFT                                (12U)
#define PERI_FMC_BCR4_BIT_WREN_MASK                                 (((1U<<1)-1) << PERI_FMC_BCR4_BIT_WREN_SHIFT)
#define PERI_FMC_BCR4_BIT_WAITEN_SHIFT                              (13U)
#define PERI_FMC_BCR4_BIT_WAITEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR4_BIT_WAITEN_SHIFT)
#define PERI_FMC_BCR4_BIT_EXTMOD_SHIFT                              (14U)
#define PERI_FMC_BCR4_BIT_EXTMOD_MASK                               (((1U<<1)-1) << PERI_FMC_BCR4_BIT_EXTMOD_SHIFT)
#define PERI_FMC_BCR4_BIT_ASYNCWAIT_SHIFT                           (15U)
#define PERI_FMC_BCR4_BIT_ASYNCWAIT_MASK                            (((1U<<1)-1) << PERI_FMC_BCR4_BIT_ASYNCWAIT_SHIFT)
#define PERI_FMC_BCR4_BIT_CPSIZE_SHIFT                              (16U)
#define PERI_FMC_BCR4_BIT_CPSIZE_MASK                               (((1U<<3)-1) << PERI_FMC_BCR4_BIT_CPSIZE_SHIFT)
#define PERI_FMC_BCR4_BIT_CBURSTRW_SHIFT                            (19U)
#define PERI_FMC_BCR4_BIT_CBURSTRW_MASK                             (((1U<<1)-1) << PERI_FMC_BCR4_BIT_CBURSTRW_SHIFT)
#define PERI_FMC_BCR4_BIT_CCLKEN_SHIFT                              (20U)
#define PERI_FMC_BCR4_BIT_CCLKEN_MASK                               (((1U<<1)-1) << PERI_FMC_BCR4_BIT_CCLKEN_SHIFT)
#define PERI_FMC_BCR4_BIT_WFDIS_SHIFT                               (21U)
#define PERI_FMC_BCR4_BIT_WFDIS_MASK                                (((1U<<1)-1) << PERI_FMC_BCR4_BIT_WFDIS_SHIFT)
#define PERI_FMC_BCR4_BIT_BMAP_SHIFT                                (24U)
#define PERI_FMC_BCR4_BIT_BMAP_MASK                                 (((1U<<2)-1) << PERI_FMC_BCR4_BIT_BMAP_SHIFT)
#define PERI_FMC_BCR4_BIT_FMCEN_SHIFT                               (31U)
#define PERI_FMC_BCR4_BIT_FMCEN_MASK                                (((1U<<1)-1) << PERI_FMC_BCR4_BIT_FMCEN_SHIFT)

