minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register BTR4 -------------------------------------------------*/
#define PERI_FMC_BTR4_BIT_ADDSET_SHIFT                              (0U)
#define PERI_FMC_BTR4_BIT_ADDSET_MASK                               (((1U<<4)-1) << PERI_FMC_BTR4_BIT_ADDSET_SHIFT)
#define PERI_FMC_BTR4_BIT_ADDHLD_SHIFT                              (4U)
#define PERI_FMC_BTR4_BIT_ADDHLD_MASK                               (((1U<<4)-1) << PERI_FMC_BTR4_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BTR4_BIT_DATAST_SHIFT                              (8U)
#define PERI_FMC_BTR4_BIT_DATAST_MASK                               (((1U<<8)-1) << PERI_FMC_BTR4_BIT_DATAST_SHIFT)
#define PERI_FMC_BTR4_BIT_BUSTURN_SHIFT                             (16U)
#define PERI_FMC_BTR4_BIT_BUSTURN_MASK                              (((1U<<4)-1) << PERI_FMC_BTR4_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BTR4_BIT_CLKDIV_SHIFT                              (20U)
#define PERI_FMC_BTR4_BIT_CLKDIV_MASK                               (((1U<<4)-1) << PERI_FMC_BTR4_BIT_CLKDIV_SHIFT)
#define PERI_FMC_BTR4_BIT_DATLAT_SHIFT                              (24U)
#define PERI_FMC_BTR4_BIT_DATLAT_MASK                               (((1U<<4)-1) << PERI_FMC_BTR4_BIT_DATLAT_SHIFT)
#define PERI_FMC_BTR4_BIT_ACCMOD_SHIFT                              (28U)
#define PERI_FMC_BTR4_BIT_ACCMOD_MASK                               (((1U<<2)-1) << PERI_FMC_BTR4_BIT_ACCMOD_SHIFT)

/*--- register PCR -------------------------------------------------*/
#define PERI_FMC_PCR_BIT_PWAITEN_SHIFT                              (1U)
#define PERI_FMC_PCR_BIT_PWAITEN_MASK                               (((1U<<1)-1) << PERI_FMC_PCR_BIT_PWAITEN_SHIFT)
#define PERI_FMC_PCR_BIT_PBKEN_SHIFT                                (2U)
#define PERI_FMC_PCR_BIT_PBKEN_MASK                                 (((1U<<1)-1) << PERI_FMC_PCR_BIT_PBKEN_SHIFT)
#define PERI_FMC_PCR_BIT_PWID_SHIFT                                 (4U)
#define PERI_FMC_PCR_BIT_PWID_MASK                                  (((1U<<2)-1) << PERI_FMC_PCR_BIT_PWID_SHIFT)
#define PERI_FMC_PCR_BIT_ECCEN_SHIFT                                (6U)
#define PERI_FMC_PCR_BIT_ECCEN_MASK                                 (((1U<<1)-1) << PERI_FMC_PCR_BIT_ECCEN_SHIFT)
#define PERI_FMC_PCR_BIT_TCLR_SHIFT                                 (9U)
#define PERI_FMC_PCR_BIT_TCLR_MASK                                  (((1U<<4)-1) << PERI_FMC_PCR_BIT_TCLR_SHIFT)
#define PERI_FMC_PCR_BIT_TAR_SHIFT                                  (13U)
#define PERI_FMC_PCR_BIT_TAR_MASK                                   (((1U<<4)-1) << PERI_FMC_PCR_BIT_TAR_SHIFT)
#define PERI_FMC_PCR_BIT_ECCPS_SHIFT                                (17U)
#define PERI_FMC_PCR_BIT_ECCPS_MASK                                 (((1U<<3)-1) << PERI_FMC_PCR_BIT_ECCPS_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_FMC_SR_BIT_IRS_SHIFT                                   (0U)
#define PERI_FMC_SR_BIT_IRS_MASK                                    (((1U<<1)-1) << PERI_FMC_SR_BIT_IRS_SHIFT)
#define PERI_FMC_SR_BIT_ILS_SHIFT                                   (1U)
#define PERI_FMC_SR_BIT_ILS_MASK                                    (((1U<<1)-1) << PERI_FMC_SR_BIT_ILS_SHIFT)
#define PERI_FMC_SR_BIT_IFS_SHIFT                                   (2U)
#define PERI_FMC_SR_BIT_IFS_MASK                                    (((1U<<1)-1) << PERI_FMC_SR_BIT_IFS_SHIFT)
#define PERI_FMC_SR_BIT_IREN_SHIFT                                  (3U)
#define PERI_FMC_SR_BIT_IREN_MASK                                   (((1U<<1)-1) << PERI_FMC_SR_BIT_IREN_SHIFT)
#define PERI_FMC_SR_BIT_ILEN_SHIFT                                  (4U)
#define PERI_FMC_SR_BIT_ILEN_MASK                                   (((1U<<1)-1) << PERI_FMC_SR_BIT_ILEN_SHIFT)
#define PERI_FMC_SR_BIT_IFEN_SHIFT                                  (5U)
#define PERI_FMC_SR_BIT_IFEN_MASK                                   (((1U<<1)-1) << PERI_FMC_SR_BIT_IFEN_SHIFT)
#define PERI_FMC_SR_BIT_FEMPT_SHIFT                                 (6U)
#define PERI_FMC_SR_BIT_FEMPT_MASK                                  (((1U<<1)-1) << PERI_FMC_SR_BIT_FEMPT_SHIFT)

/*--- register PMEM -------------------------------------------------*/
#define PERI_FMC_PMEM_BIT_MEMSET_SHIFT                              (0U)
#define PERI_FMC_PMEM_BIT_MEMSET_MASK                               (((1U<<8)-1) << PERI_FMC_PMEM_BIT_MEMSET_SHIFT)
#define PERI_FMC_PMEM_BIT_MEMWAIT_SHIFT                             (8U)
#define PERI_FMC_PMEM_BIT_MEMWAIT_MASK                              (((1U<<8)-1) << PERI_FMC_PMEM_BIT_MEMWAIT_SHIFT)
#define PERI_FMC_PMEM_BIT_MEMHOLD_SHIFT                             (16U)
#define PERI_FMC_PMEM_BIT_MEMHOLD_MASK                              (((1U<<8)-1) << PERI_FMC_PMEM_BIT_MEMHOLD_SHIFT)
#define PERI_FMC_PMEM_BIT_MEMHIZ_SHIFT                              (24U)
#define PERI_FMC_PMEM_BIT_MEMHIZ_MASK                               (((1U<<8)-1) << PERI_FMC_PMEM_BIT_MEMHIZ_SHIFT)

/*--- register PATT -------------------------------------------------*/
#define PERI_FMC_PATT_BIT_ATTSET_SHIFT                              (0U)
#define PERI_FMC_PATT_BIT_ATTSET_MASK                               (((1U<<8)-1) << PERI_FMC_PATT_BIT_ATTSET_SHIFT)
#define PERI_FMC_PATT_BIT_ATTWAIT_SHIFT                             (8U)
#define PERI_FMC_PATT_BIT_ATTWAIT_MASK                              (((1U<<8)-1) << PERI_FMC_PATT_BIT_ATTWAIT_SHIFT)
#define PERI_FMC_PATT_BIT_ATTHOLD_SHIFT                             (16U)
#define PERI_FMC_PATT_BIT_ATTHOLD_MASK                              (((1U<<8)-1) << PERI_FMC_PATT_BIT_ATTHOLD_SHIFT)
#define PERI_FMC_PATT_BIT_ATTHIZ_SHIFT                              (24U)
#define PERI_FMC_PATT_BIT_ATTHIZ_MASK                               (((1U<<8)-1) << PERI_FMC_PATT_BIT_ATTHIZ_SHIFT)

/*--- register ECCR -------------------------------------------------*/
#define PERI_FMC_ECCR_BIT_ECC_SHIFT                                 (0U)
#define PERI_FMC_ECCR_BIT_ECC_MASK                                  (((1U<<32)-1) << PERI_FMC_ECCR_BIT_ECC_SHIFT)

/*--- register BWTR1 -------------------------------------------------*/
#define PERI_FMC_BWTR1_BIT_ADDSET_SHIFT                             (0U)
#define PERI_FMC_BWTR1_BIT_ADDSET_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR1_BIT_ADDSET_SHIFT)
#define PERI_FMC_BWTR1_BIT_ADDHLD_SHIFT                             (4U)
#define PERI_FMC_BWTR1_BIT_ADDHLD_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR1_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BWTR1_BIT_DATAST_SHIFT                             (8U)
#define PERI_FMC_BWTR1_BIT_DATAST_MASK                              (((1U<<8)-1) << PERI_FMC_BWTR1_BIT_DATAST_SHIFT)
#define PERI_FMC_BWTR1_BIT_BUSTURN_SHIFT                            (16U)
#define PERI_FMC_BWTR1_BIT_BUSTURN_MASK                             (((1U<<4)-1) << PERI_FMC_BWTR1_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BWTR1_BIT_ACCMOD_SHIFT                             (28U)
#define PERI_FMC_BWTR1_BIT_ACCMOD_MASK                              (((1U<<2)-1) << PERI_FMC_BWTR1_BIT_ACCMOD_SHIFT)

/*--- register BWTR2 -------------------------------------------------*/
#define PERI_FMC_BWTR2_BIT_ADDSET_SHIFT                             (0U)
#define PERI_FMC_BWTR2_BIT_ADDSET_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR2_BIT_ADDSET_SHIFT)
#define PERI_FMC_BWTR2_BIT_ADDHLD_SHIFT                             (4U)
#define PERI_FMC_BWTR2_BIT_ADDHLD_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR2_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BWTR2_BIT_DATAST_SHIFT                             (8U)
#define PERI_FMC_BWTR2_BIT_DATAST_MASK                              (((1U<<8)-1) << PERI_FMC_BWTR2_BIT_DATAST_SHIFT)
#define PERI_FMC_BWTR2_BIT_BUSTURN_SHIFT                            (16U)
#define PERI_FMC_BWTR2_BIT_BUSTURN_MASK                             (((1U<<4)-1) << PERI_FMC_BWTR2_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BWTR2_BIT_ACCMOD_SHIFT                             (28U)
#define PERI_FMC_BWTR2_BIT_ACCMOD_MASK                              (((1U<<2)-1) << PERI_FMC_BWTR2_BIT_ACCMOD_SHIFT)

/*--- register BWTR3 -------------------------------------------------*/
#define PERI_FMC_BWTR3_BIT_ADDSET_SHIFT                             (0U)
#define PERI_FMC_BWTR3_BIT_ADDSET_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR3_BIT_ADDSET_SHIFT)
#define PERI_FMC_BWTR3_BIT_ADDHLD_SHIFT                             (4U)
#define PERI_FMC_BWTR3_BIT_ADDHLD_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR3_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BWTR3_BIT_DATAST_SHIFT                             (8U)
#define PERI_FMC_BWTR3_BIT_DATAST_MASK                              (((1U<<8)-1) << PERI_FMC_BWTR3_BIT_DATAST_SHIFT)
#define PERI_FMC_BWTR3_BIT_BUSTURN_SHIFT                            (16U)
#define PERI_FMC_BWTR3_BIT_BUSTURN_MASK                             (((1U<<4)-1) << PERI_FMC_BWTR3_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BWTR3_BIT_ACCMOD_SHIFT                             (28U)
#define PERI_FMC_BWTR3_BIT_ACCMOD_MASK                              (((1U<<2)-1) << PERI_FMC_BWTR3_BIT_ACCMOD_SHIFT)

/*--- register BWTR4 -------------------------------------------------*/
#define PERI_FMC_BWTR4_BIT_ADDSET_SHIFT                             (0U)
#define PERI_FMC_BWTR4_BIT_ADDSET_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR4_BIT_ADDSET_SHIFT)
#define PERI_FMC_BWTR4_BIT_ADDHLD_SHIFT                             (4U)
#define PERI_FMC_BWTR4_BIT_ADDHLD_MASK                              (((1U<<4)-1) << PERI_FMC_BWTR4_BIT_ADDHLD_SHIFT)
#define PERI_FMC_BWTR4_BIT_DATAST_SHIFT                             (8U)
#define PERI_FMC_BWTR4_BIT_DATAST_MASK                              (((1U<<8)-1) << PERI_FMC_BWTR4_BIT_DATAST_SHIFT)
#define PERI_FMC_BWTR4_BIT_BUSTURN_SHIFT                            (16U)
#define PERI_FMC_BWTR4_BIT_BUSTURN_MASK                             (((1U<<4)-1) << PERI_FMC_BWTR4_BIT_BUSTURN_SHIFT)
#define PERI_FMC_BWTR4_BIT_ACCMOD_SHIFT                             (28U)
#define PERI_FMC_BWTR4_BIT_ACCMOD_MASK                              (((1U<<2)-1) << PERI_FMC_BWTR4_BIT_ACCMOD_SHIFT)

/*--- register SDCR1 -------------------------------------------------*/
#define PERI_FMC_SDCR1_BIT_NC_SHIFT                                 (0U)
#define PERI_FMC_SDCR1_BIT_NC_MASK                                  (((1U<<2)-1) << PERI_FMC_SDCR1_BIT_NC_SHIFT)
#define PERI_FMC_SDCR1_BIT_NR_SHIFT                                 (2U)
#define PERI_FMC_SDCR1_BIT_NR_MASK                                  (((1U<<2)-1) << PERI_FMC_SDCR1_BIT_NR_SHIFT)
#define PERI_FMC_SDCR1_BIT_MWID_SHIFT                               (4U)
#define PERI_FMC_SDCR1_BIT_MWID_MASK                                (((1U<<2)-1) << PERI_FMC_SDCR1_BIT_MWID_SHIFT)
#define PERI_FMC_SDCR1_BIT_NB_SHIFT                                 (6U)
#define PERI_FMC_SDCR1_BIT_NB_MASK                                  (((1U<<1)-1) << PERI_FMC_SDCR1_BIT_NB_SHIFT)
#define PERI_FMC_SDCR1_BIT_CAS_SHIFT                                (7U)
#define PERI_FMC_SDCR1_BIT_CAS_MASK                                 (((1U<<2)-1) << PERI_FMC_SDCR1_BIT_CAS_SHIFT)
#define PERI_FMC_SDCR1_BIT_WP_SHIFT                                 (9U)
#define PERI_FMC_SDCR1_BIT_WP_MASK                                  (((1U<<1)-1) << PERI_FMC_SDCR1_BIT_WP_SHIFT)
#define PERI_FMC_SDCR1_BIT_SDCLK_SHIFT                              (10U)
#define PERI_FMC_SDCR1_BIT_SDCLK_MASK                               (((1U<<2)-1) << PERI_FMC_SDCR1_BIT_SDCLK_SHIFT)
#define PERI_FMC_SDCR1_BIT_RBURST_SHIFT                             (12U)
#define PERI_FMC_SDCR1_BIT_RBURST_MASK                              (((1U<<1)-1) << PERI_FMC_SDCR1_BIT_RBURST_SHIFT)
#define PERI_FMC_SDCR1_BIT_RPIPE_SHIFT                              (13U)
#define PERI_FMC_SDCR1_BIT_RPIPE_MASK                               (((1U<<2)-1) << PERI_FMC_SDCR1_BIT_RPIPE_SHIFT)

