minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SDCR2 -------------------------------------------------*/
#define PERI_FMC_SDCR2_BIT_NC_SHIFT                                 (0U)
#define PERI_FMC_SDCR2_BIT_NC_MASK                                  (((1U<<2)-1) << PERI_FMC_SDCR2_BIT_NC_SHIFT)
#define PERI_FMC_SDCR2_BIT_NR_SHIFT                                 (2U)
#define PERI_FMC_SDCR2_BIT_NR_MASK                                  (((1U<<2)-1) << PERI_FMC_SDCR2_BIT_NR_SHIFT)
#define PERI_FMC_SDCR2_BIT_MWID_SHIFT                               (4U)
#define PERI_FMC_SDCR2_BIT_MWID_MASK                                (((1U<<2)-1) << PERI_FMC_SDCR2_BIT_MWID_SHIFT)
#define PERI_FMC_SDCR2_BIT_NB_SHIFT                                 (6U)
#define PERI_FMC_SDCR2_BIT_NB_MASK                                  (((1U<<1)-1) << PERI_FMC_SDCR2_BIT_NB_SHIFT)
#define PERI_FMC_SDCR2_BIT_CAS_SHIFT                                (7U)
#define PERI_FMC_SDCR2_BIT_CAS_MASK                                 (((1U<<2)-1) << PERI_FMC_SDCR2_BIT_CAS_SHIFT)
#define PERI_FMC_SDCR2_BIT_WP_SHIFT                                 (9U)
#define PERI_FMC_SDCR2_BIT_WP_MASK                                  (((1U<<1)-1) << PERI_FMC_SDCR2_BIT_WP_SHIFT)
#define PERI_FMC_SDCR2_BIT_SDCLK_SHIFT                              (10U)
#define PERI_FMC_SDCR2_BIT_SDCLK_MASK                               (((1U<<2)-1) << PERI_FMC_SDCR2_BIT_SDCLK_SHIFT)
#define PERI_FMC_SDCR2_BIT_RBURST_SHIFT                             (12U)
#define PERI_FMC_SDCR2_BIT_RBURST_MASK                              (((1U<<1)-1) << PERI_FMC_SDCR2_BIT_RBURST_SHIFT)
#define PERI_FMC_SDCR2_BIT_RPIPE_SHIFT                              (13U)
#define PERI_FMC_SDCR2_BIT_RPIPE_MASK                               (((1U<<2)-1) << PERI_FMC_SDCR2_BIT_RPIPE_SHIFT)

/*--- register SDTR1 -------------------------------------------------*/
#define PERI_FMC_SDTR1_BIT_TMRD_SHIFT                               (0U)
#define PERI_FMC_SDTR1_BIT_TMRD_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TMRD_SHIFT)
#define PERI_FMC_SDTR1_BIT_TXSR_SHIFT                               (4U)
#define PERI_FMC_SDTR1_BIT_TXSR_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TXSR_SHIFT)
#define PERI_FMC_SDTR1_BIT_TRAS_SHIFT                               (8U)
#define PERI_FMC_SDTR1_BIT_TRAS_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TRAS_SHIFT)
#define PERI_FMC_SDTR1_BIT_TRC_SHIFT                                (12U)
#define PERI_FMC_SDTR1_BIT_TRC_MASK                                 (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TRC_SHIFT)
#define PERI_FMC_SDTR1_BIT_TWR_SHIFT                                (16U)
#define PERI_FMC_SDTR1_BIT_TWR_MASK                                 (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TWR_SHIFT)
#define PERI_FMC_SDTR1_BIT_TRP_SHIFT                                (20U)
#define PERI_FMC_SDTR1_BIT_TRP_MASK                                 (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TRP_SHIFT)
#define PERI_FMC_SDTR1_BIT_TRCD_SHIFT                               (24U)
#define PERI_FMC_SDTR1_BIT_TRCD_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR1_BIT_TRCD_SHIFT)

/*--- register SDTR2 -------------------------------------------------*/
#define PERI_FMC_SDTR2_BIT_TMRD_SHIFT                               (0U)
#define PERI_FMC_SDTR2_BIT_TMRD_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TMRD_SHIFT)
#define PERI_FMC_SDTR2_BIT_TXSR_SHIFT                               (4U)
#define PERI_FMC_SDTR2_BIT_TXSR_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TXSR_SHIFT)
#define PERI_FMC_SDTR2_BIT_TRAS_SHIFT                               (8U)
#define PERI_FMC_SDTR2_BIT_TRAS_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TRAS_SHIFT)
#define PERI_FMC_SDTR2_BIT_TRC_SHIFT                                (12U)
#define PERI_FMC_SDTR2_BIT_TRC_MASK                                 (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TRC_SHIFT)
#define PERI_FMC_SDTR2_BIT_TWR_SHIFT                                (16U)
#define PERI_FMC_SDTR2_BIT_TWR_MASK                                 (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TWR_SHIFT)
#define PERI_FMC_SDTR2_BIT_TRP_SHIFT                                (20U)
#define PERI_FMC_SDTR2_BIT_TRP_MASK                                 (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TRP_SHIFT)
#define PERI_FMC_SDTR2_BIT_TRCD_SHIFT                               (24U)
#define PERI_FMC_SDTR2_BIT_TRCD_MASK                                (((1U<<4)-1) << PERI_FMC_SDTR2_BIT_TRCD_SHIFT)

/*--- register SDCMR -------------------------------------------------*/
#define PERI_FMC_SDCMR_BIT_MODE_SHIFT                               (0U)
#define PERI_FMC_SDCMR_BIT_MODE_MASK                                (((1U<<3)-1) << PERI_FMC_SDCMR_BIT_MODE_SHIFT)
#define PERI_FMC_SDCMR_BIT_CTB2_SHIFT                               (3U)
#define PERI_FMC_SDCMR_BIT_CTB2_MASK                                (((1U<<1)-1) << PERI_FMC_SDCMR_BIT_CTB2_SHIFT)
#define PERI_FMC_SDCMR_BIT_CTB1_SHIFT                               (4U)
#define PERI_FMC_SDCMR_BIT_CTB1_MASK                                (((1U<<1)-1) << PERI_FMC_SDCMR_BIT_CTB1_SHIFT)
#define PERI_FMC_SDCMR_BIT_NRFS_SHIFT                               (5U)
#define PERI_FMC_SDCMR_BIT_NRFS_MASK                                (((1U<<4)-1) << PERI_FMC_SDCMR_BIT_NRFS_SHIFT)
#define PERI_FMC_SDCMR_BIT_MRD_SHIFT                                (9U)
#define PERI_FMC_SDCMR_BIT_MRD_MASK                                 (((1U<<14)-1) << PERI_FMC_SDCMR_BIT_MRD_SHIFT)

/*--- register SDRTR -------------------------------------------------*/
#define PERI_FMC_SDRTR_BIT_CRE_SHIFT                                (0U)
#define PERI_FMC_SDRTR_BIT_CRE_MASK                                 (((1U<<1)-1) << PERI_FMC_SDRTR_BIT_CRE_SHIFT)
#define PERI_FMC_SDRTR_BIT_COUNT_SHIFT                              (1U)
#define PERI_FMC_SDRTR_BIT_COUNT_MASK                               (((1U<<13)-1) << PERI_FMC_SDRTR_BIT_COUNT_SHIFT)
#define PERI_FMC_SDRTR_BIT_REIE_SHIFT                               (14U)
#define PERI_FMC_SDRTR_BIT_REIE_MASK                                (((1U<<1)-1) << PERI_FMC_SDRTR_BIT_REIE_SHIFT)

/*--- register SDSR -------------------------------------------------*/
#define PERI_FMC_SDSR_BIT_RE_SHIFT                                  (0U)
#define PERI_FMC_SDSR_BIT_RE_MASK                                   (((1U<<1)-1) << PERI_FMC_SDSR_BIT_RE_SHIFT)
#define PERI_FMC_SDSR_BIT_MODES1_SHIFT                              (1U)
#define PERI_FMC_SDSR_BIT_MODES1_MASK                               (((1U<<2)-1) << PERI_FMC_SDSR_BIT_MODES1_SHIFT)
#define PERI_FMC_SDSR_BIT_MODES2_SHIFT                              (3U)
#define PERI_FMC_SDSR_BIT_MODES2_MASK                               (((1U<<2)-1) << PERI_FMC_SDSR_BIT_MODES2_SHIFT)

/*--- register ACR -------------------------------------------------*/
#define PERI_Flash_ACR_BIT_LATENCY_SHIFT                            (0U)
#define PERI_Flash_ACR_BIT_LATENCY_MASK                             (((1U<<4)-1) << PERI_Flash_ACR_BIT_LATENCY_SHIFT)
#define PERI_Flash_ACR_BIT_WRHIGHFREQ_SHIFT                         (4U)
#define PERI_Flash_ACR_BIT_WRHIGHFREQ_MASK                          (((1U<<2)-1) << PERI_Flash_ACR_BIT_WRHIGHFREQ_SHIFT)

/*--- register KEYR1 -------------------------------------------------*/
#define PERI_Flash_KEYR1_BIT_KEY1R_SHIFT                            (0U)
#define PERI_Flash_KEYR1_BIT_KEY1R_MASK                             (((1U<<32)-1) << PERI_Flash_KEYR1_BIT_KEY1R_SHIFT)

