minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OPTKEYR -------------------------------------------------*/
#define PERI_Flash_OPTKEYR_BIT_OPTKEYR_SHIFT                        (0U)
#define PERI_Flash_OPTKEYR_BIT_OPTKEYR_MASK                         (((1U<<32)-1) << PERI_Flash_OPTKEYR_BIT_OPTKEYR_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_Flash_CR1_BIT_LOCK1_SHIFT                              (0U)
#define PERI_Flash_CR1_BIT_LOCK1_MASK                               (((1U<<1)-1) << PERI_Flash_CR1_BIT_LOCK1_SHIFT)
#define PERI_Flash_CR1_BIT_PG1_SHIFT                                (1U)
#define PERI_Flash_CR1_BIT_PG1_MASK                                 (((1U<<1)-1) << PERI_Flash_CR1_BIT_PG1_SHIFT)
#define PERI_Flash_CR1_BIT_SER1_SHIFT                               (2U)
#define PERI_Flash_CR1_BIT_SER1_MASK                                (((1U<<1)-1) << PERI_Flash_CR1_BIT_SER1_SHIFT)
#define PERI_Flash_CR1_BIT_BER1_SHIFT                               (3U)
#define PERI_Flash_CR1_BIT_BER1_MASK                                (((1U<<1)-1) << PERI_Flash_CR1_BIT_BER1_SHIFT)
#define PERI_Flash_CR1_BIT_PSIZE1_SHIFT                             (4U)
#define PERI_Flash_CR1_BIT_PSIZE1_MASK                              (((1U<<2)-1) << PERI_Flash_CR1_BIT_PSIZE1_SHIFT)
#define PERI_Flash_CR1_BIT_FW1_SHIFT                                (6U)
#define PERI_Flash_CR1_BIT_FW1_MASK                                 (((1U<<1)-1) << PERI_Flash_CR1_BIT_FW1_SHIFT)
#define PERI_Flash_CR1_BIT_START1_SHIFT                             (7U)
#define PERI_Flash_CR1_BIT_START1_MASK                              (((1U<<1)-1) << PERI_Flash_CR1_BIT_START1_SHIFT)
#define PERI_Flash_CR1_BIT_SNB1_SHIFT                               (8U)
#define PERI_Flash_CR1_BIT_SNB1_MASK                                (((1U<<3)-1) << PERI_Flash_CR1_BIT_SNB1_SHIFT)
#define PERI_Flash_CR1_BIT_CRC_EN_SHIFT                             (15U)
#define PERI_Flash_CR1_BIT_CRC_EN_MASK                              (((1U<<1)-1) << PERI_Flash_CR1_BIT_CRC_EN_SHIFT)
#define PERI_Flash_CR1_BIT_EOPIE1_SHIFT                             (16U)
#define PERI_Flash_CR1_BIT_EOPIE1_MASK                              (((1U<<1)-1) << PERI_Flash_CR1_BIT_EOPIE1_SHIFT)
#define PERI_Flash_CR1_BIT_WRPERRIE1_SHIFT                          (17U)
#define PERI_Flash_CR1_BIT_WRPERRIE1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_WRPERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_PGSERRIE1_SHIFT                          (18U)
#define PERI_Flash_CR1_BIT_PGSERRIE1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_PGSERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_STRBERRIE1_SHIFT                         (19U)
#define PERI_Flash_CR1_BIT_STRBERRIE1_MASK                          (((1U<<1)-1) << PERI_Flash_CR1_BIT_STRBERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_INCERRIE1_SHIFT                          (21U)
#define PERI_Flash_CR1_BIT_INCERRIE1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_INCERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_OPERRIE1_SHIFT                           (22U)
#define PERI_Flash_CR1_BIT_OPERRIE1_MASK                            (((1U<<1)-1) << PERI_Flash_CR1_BIT_OPERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_RDPERRIE1_SHIFT                          (23U)
#define PERI_Flash_CR1_BIT_RDPERRIE1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_RDPERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_RDSERRIE1_SHIFT                          (24U)
#define PERI_Flash_CR1_BIT_RDSERRIE1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_RDSERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_SNECCERR1_SHIFT                          (25U)
#define PERI_Flash_CR1_BIT_SNECCERR1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_SNECCERR1_SHIFT)
#define PERI_Flash_CR1_BIT_DBECCERRIE1_SHIFT                        (26U)
#define PERI_Flash_CR1_BIT_DBECCERRIE1_MASK                         (((1U<<1)-1) << PERI_Flash_CR1_BIT_DBECCERRIE1_SHIFT)
#define PERI_Flash_CR1_BIT_CRCENDIE1_SHIFT                          (27U)
#define PERI_Flash_CR1_BIT_CRCENDIE1_MASK                           (((1U<<1)-1) << PERI_Flash_CR1_BIT_CRCENDIE1_SHIFT)
#define PERI_Flash_CR1_BIT_CRCRDERRIE1_SHIFT                        (28U)
#define PERI_Flash_CR1_BIT_CRCRDERRIE1_MASK                         (((1U<<1)-1) << PERI_Flash_CR1_BIT_CRCRDERRIE1_SHIFT)

/*--- register SR1 -------------------------------------------------*/
#define PERI_Flash_SR1_BIT_BSY1_SHIFT                               (0U)
#define PERI_Flash_SR1_BIT_BSY1_MASK                                (((1U<<1)-1) << PERI_Flash_SR1_BIT_BSY1_SHIFT)
#define PERI_Flash_SR1_BIT_WBNE1_SHIFT                              (1U)
#define PERI_Flash_SR1_BIT_WBNE1_MASK                               (((1U<<1)-1) << PERI_Flash_SR1_BIT_WBNE1_SHIFT)
#define PERI_Flash_SR1_BIT_QW1_SHIFT                                (2U)
#define PERI_Flash_SR1_BIT_QW1_MASK                                 (((1U<<1)-1) << PERI_Flash_SR1_BIT_QW1_SHIFT)
#define PERI_Flash_SR1_BIT_CRC_BUSY1_SHIFT                          (3U)
#define PERI_Flash_SR1_BIT_CRC_BUSY1_MASK                           (((1U<<1)-1) << PERI_Flash_SR1_BIT_CRC_BUSY1_SHIFT)
#define PERI_Flash_SR1_BIT_EOP1_SHIFT                               (16U)
#define PERI_Flash_SR1_BIT_EOP1_MASK                                (((1U<<1)-1) << PERI_Flash_SR1_BIT_EOP1_SHIFT)
#define PERI_Flash_SR1_BIT_WRPERR1_SHIFT                            (17U)
#define PERI_Flash_SR1_BIT_WRPERR1_MASK                             (((1U<<1)-1) << PERI_Flash_SR1_BIT_WRPERR1_SHIFT)
#define PERI_Flash_SR1_BIT_PGSERR1_SHIFT                            (18U)
#define PERI_Flash_SR1_BIT_PGSERR1_MASK                             (((1U<<1)-1) << PERI_Flash_SR1_BIT_PGSERR1_SHIFT)
#define PERI_Flash_SR1_BIT_STRBERR1_SHIFT                           (19U)
#define PERI_Flash_SR1_BIT_STRBERR1_MASK                            (((1U<<1)-1) << PERI_Flash_SR1_BIT_STRBERR1_SHIFT)
#define PERI_Flash_SR1_BIT_INCERR1_SHIFT                            (21U)
#define PERI_Flash_SR1_BIT_INCERR1_MASK                             (((1U<<1)-1) << PERI_Flash_SR1_BIT_INCERR1_SHIFT)
#define PERI_Flash_SR1_BIT_OPERR1_SHIFT                             (22U)
#define PERI_Flash_SR1_BIT_OPERR1_MASK                              (((1U<<1)-1) << PERI_Flash_SR1_BIT_OPERR1_SHIFT)
#define PERI_Flash_SR1_BIT_RDPERR1_SHIFT                            (23U)
#define PERI_Flash_SR1_BIT_RDPERR1_MASK                             (((1U<<1)-1) << PERI_Flash_SR1_BIT_RDPERR1_SHIFT)
#define PERI_Flash_SR1_BIT_RDSERR1_SHIFT                            (24U)
#define PERI_Flash_SR1_BIT_RDSERR1_MASK                             (((1U<<1)-1) << PERI_Flash_SR1_BIT_RDSERR1_SHIFT)
#define PERI_Flash_SR1_BIT_SNECCERR_SHIFT                           (25U)
#define PERI_Flash_SR1_BIT_SNECCERR_MASK                            (((1U<<1)-1) << PERI_Flash_SR1_BIT_SNECCERR_SHIFT)
#define PERI_Flash_SR1_BIT_DBECCERR1_SHIFT                          (26U)
#define PERI_Flash_SR1_BIT_DBECCERR1_MASK                           (((1U<<1)-1) << PERI_Flash_SR1_BIT_DBECCERR1_SHIFT)
#define PERI_Flash_SR1_BIT_CRCEND1_SHIFT                            (27U)
#define PERI_Flash_SR1_BIT_CRCEND1_MASK                             (((1U<<1)-1) << PERI_Flash_SR1_BIT_CRCEND1_SHIFT)
#define PERI_Flash_SR1_BIT_CRCRDERR1_SHIFT                          (28U)
#define PERI_Flash_SR1_BIT_CRCRDERR1_MASK                           (((1U<<1)-1) << PERI_Flash_SR1_BIT_CRCRDERR1_SHIFT)

