minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CCR1 -------------------------------------------------*/
#define PERI_Flash_CCR1_BIT_CLR_EOP1_SHIFT                          (16U)
#define PERI_Flash_CCR1_BIT_CLR_EOP1_MASK                           (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_EOP1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_WRPERR1_SHIFT                       (17U)
#define PERI_Flash_CCR1_BIT_CLR_WRPERR1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_WRPERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_PGSERR1_SHIFT                       (18U)
#define PERI_Flash_CCR1_BIT_CLR_PGSERR1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_PGSERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_STRBERR1_SHIFT                      (19U)
#define PERI_Flash_CCR1_BIT_CLR_STRBERR1_MASK                       (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_STRBERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_INCERR1_SHIFT                       (21U)
#define PERI_Flash_CCR1_BIT_CLR_INCERR1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_INCERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_OPERR1_SHIFT                        (22U)
#define PERI_Flash_CCR1_BIT_CLR_OPERR1_MASK                         (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_OPERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_RDPERR1_SHIFT                       (23U)
#define PERI_Flash_CCR1_BIT_CLR_RDPERR1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_RDPERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_RDSERR1_SHIFT                       (24U)
#define PERI_Flash_CCR1_BIT_CLR_RDSERR1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_RDSERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_SNECCERR1_SHIFT                     (25U)
#define PERI_Flash_CCR1_BIT_CLR_SNECCERR1_MASK                      (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_SNECCERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_DBECCERR1_SHIFT                     (26U)
#define PERI_Flash_CCR1_BIT_CLR_DBECCERR1_MASK                      (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_DBECCERR1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_CRCEND1_SHIFT                       (27U)
#define PERI_Flash_CCR1_BIT_CLR_CRCEND1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_CRCEND1_SHIFT)
#define PERI_Flash_CCR1_BIT_CLR_CRCRDERR1_SHIFT                     (28U)
#define PERI_Flash_CCR1_BIT_CLR_CRCRDERR1_MASK                      (((1U<<1)-1) << PERI_Flash_CCR1_BIT_CLR_CRCRDERR1_SHIFT)

/*--- register OPTCR -------------------------------------------------*/
#define PERI_Flash_OPTCR_BIT_OPTLOCK_SHIFT                          (0U)
#define PERI_Flash_OPTCR_BIT_OPTLOCK_MASK                           (((1U<<1)-1) << PERI_Flash_OPTCR_BIT_OPTLOCK_SHIFT)
#define PERI_Flash_OPTCR_BIT_OPTSTART_SHIFT                         (1U)
#define PERI_Flash_OPTCR_BIT_OPTSTART_MASK                          (((1U<<1)-1) << PERI_Flash_OPTCR_BIT_OPTSTART_SHIFT)
#define PERI_Flash_OPTCR_BIT_MER_SHIFT                              (4U)
#define PERI_Flash_OPTCR_BIT_MER_MASK                               (((1U<<1)-1) << PERI_Flash_OPTCR_BIT_MER_SHIFT)
#define PERI_Flash_OPTCR_BIT_OPTCHANGEERRIE_SHIFT                   (30U)
#define PERI_Flash_OPTCR_BIT_OPTCHANGEERRIE_MASK                    (((1U<<1)-1) << PERI_Flash_OPTCR_BIT_OPTCHANGEERRIE_SHIFT)
#define PERI_Flash_OPTCR_BIT_SWAP_BANK_SHIFT                        (31U)
#define PERI_Flash_OPTCR_BIT_SWAP_BANK_MASK                         (((1U<<1)-1) << PERI_Flash_OPTCR_BIT_SWAP_BANK_SHIFT)

/*--- register OPTSR_CUR -------------------------------------------------*/
#define PERI_Flash_OPTSR_CUR_BIT_OPT_BUSY_SHIFT                     (0U)
#define PERI_Flash_OPTSR_CUR_BIT_OPT_BUSY_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_OPT_BUSY_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_BOR_LEV_SHIFT                      (2U)
#define PERI_Flash_OPTSR_CUR_BIT_BOR_LEV_MASK                       (((1U<<2)-1) << PERI_Flash_OPTSR_CUR_BIT_BOR_LEV_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_IWDG1_SW_SHIFT                     (4U)
#define PERI_Flash_OPTSR_CUR_BIT_IWDG1_SW_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_IWDG1_SW_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_NRST_STOP_D1_SHIFT                 (6U)
#define PERI_Flash_OPTSR_CUR_BIT_NRST_STOP_D1_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_NRST_STOP_D1_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_NRST_STBY_D1_SHIFT                 (7U)
#define PERI_Flash_OPTSR_CUR_BIT_NRST_STBY_D1_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_NRST_STBY_D1_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_RDP_SHIFT                          (8U)
#define PERI_Flash_OPTSR_CUR_BIT_RDP_MASK                           (((1U<<8)-1) << PERI_Flash_OPTSR_CUR_BIT_RDP_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_IWDG_FZ_STOP_SHIFT                 (17U)
#define PERI_Flash_OPTSR_CUR_BIT_IWDG_FZ_STOP_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_IWDG_FZ_STOP_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_IWDG_FZ_SDBY_SHIFT                 (18U)
#define PERI_Flash_OPTSR_CUR_BIT_IWDG_FZ_SDBY_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_IWDG_FZ_SDBY_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_ST_RAM_SIZE_SHIFT                  (19U)
#define PERI_Flash_OPTSR_CUR_BIT_ST_RAM_SIZE_MASK                   (((1U<<2)-1) << PERI_Flash_OPTSR_CUR_BIT_ST_RAM_SIZE_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_SECURITY_SHIFT                     (21U)
#define PERI_Flash_OPTSR_CUR_BIT_SECURITY_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_SECURITY_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_IO_HSLV_SHIFT                      (29U)
#define PERI_Flash_OPTSR_CUR_BIT_IO_HSLV_MASK                       (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_IO_HSLV_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_OPTCHANGEERR_SHIFT                 (30U)
#define PERI_Flash_OPTSR_CUR_BIT_OPTCHANGEERR_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_OPTCHANGEERR_SHIFT)
#define PERI_Flash_OPTSR_CUR_BIT_SWAP_BANK_OPT_SHIFT                (31U)
#define PERI_Flash_OPTSR_CUR_BIT_SWAP_BANK_OPT_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_CUR_BIT_SWAP_BANK_OPT_SHIFT)

