minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OPTSR_PRG -------------------------------------------------*/
#define PERI_Flash_OPTSR_PRG_BIT_BOR_LEV_SHIFT                      (2U)
#define PERI_Flash_OPTSR_PRG_BIT_BOR_LEV_MASK                       (((1U<<2)-1) << PERI_Flash_OPTSR_PRG_BIT_BOR_LEV_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_IWDG1_SW_SHIFT                     (4U)
#define PERI_Flash_OPTSR_PRG_BIT_IWDG1_SW_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_IWDG1_SW_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_NRST_STOP_D1_SHIFT                 (6U)
#define PERI_Flash_OPTSR_PRG_BIT_NRST_STOP_D1_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_NRST_STOP_D1_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_NRST_STBY_D1_SHIFT                 (7U)
#define PERI_Flash_OPTSR_PRG_BIT_NRST_STBY_D1_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_NRST_STBY_D1_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_RDP_SHIFT                          (8U)
#define PERI_Flash_OPTSR_PRG_BIT_RDP_MASK                           (((1U<<8)-1) << PERI_Flash_OPTSR_PRG_BIT_RDP_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_IWDG_FZ_STOP_SHIFT                 (17U)
#define PERI_Flash_OPTSR_PRG_BIT_IWDG_FZ_STOP_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_IWDG_FZ_STOP_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_IWDG_FZ_SDBY_SHIFT                 (18U)
#define PERI_Flash_OPTSR_PRG_BIT_IWDG_FZ_SDBY_MASK                  (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_IWDG_FZ_SDBY_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_ST_RAM_SIZE_SHIFT                  (19U)
#define PERI_Flash_OPTSR_PRG_BIT_ST_RAM_SIZE_MASK                   (((1U<<2)-1) << PERI_Flash_OPTSR_PRG_BIT_ST_RAM_SIZE_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_SECURITY_SHIFT                     (21U)
#define PERI_Flash_OPTSR_PRG_BIT_SECURITY_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_SECURITY_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_IO_HSLV_SHIFT                      (29U)
#define PERI_Flash_OPTSR_PRG_BIT_IO_HSLV_MASK                       (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_IO_HSLV_SHIFT)
#define PERI_Flash_OPTSR_PRG_BIT_SWAP_BANK_OPT_SHIFT                (31U)
#define PERI_Flash_OPTSR_PRG_BIT_SWAP_BANK_OPT_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_PRG_BIT_SWAP_BANK_OPT_SHIFT)

/*--- register OPTCCR -------------------------------------------------*/
#define PERI_Flash_OPTCCR_BIT_CLR_OPTCHANGEERR_SHIFT                (30U)
#define PERI_Flash_OPTCCR_BIT_CLR_OPTCHANGEERR_MASK                 (((1U<<1)-1) << PERI_Flash_OPTCCR_BIT_CLR_OPTCHANGEERR_SHIFT)

/*--- register PRAR_CUR1 -------------------------------------------------*/
#define PERI_Flash_PRAR_CUR1_BIT_PROT_AREA_START1_SHIFT             (0U)
#define PERI_Flash_PRAR_CUR1_BIT_PROT_AREA_START1_MASK              (((1U<<12)-1) << PERI_Flash_PRAR_CUR1_BIT_PROT_AREA_START1_SHIFT)
#define PERI_Flash_PRAR_CUR1_BIT_PROT_AREA_END1_SHIFT               (16U)
#define PERI_Flash_PRAR_CUR1_BIT_PROT_AREA_END1_MASK                (((1U<<12)-1) << PERI_Flash_PRAR_CUR1_BIT_PROT_AREA_END1_SHIFT)
#define PERI_Flash_PRAR_CUR1_BIT_DMEP1_SHIFT                        (31U)
#define PERI_Flash_PRAR_CUR1_BIT_DMEP1_MASK                         (((1U<<1)-1) << PERI_Flash_PRAR_CUR1_BIT_DMEP1_SHIFT)

/*--- register PRAR_PRG1 -------------------------------------------------*/
#define PERI_Flash_PRAR_PRG1_BIT_PROT_AREA_START1_SHIFT             (0U)
#define PERI_Flash_PRAR_PRG1_BIT_PROT_AREA_START1_MASK              (((1U<<12)-1) << PERI_Flash_PRAR_PRG1_BIT_PROT_AREA_START1_SHIFT)
#define PERI_Flash_PRAR_PRG1_BIT_PROT_AREA_END1_SHIFT               (16U)
#define PERI_Flash_PRAR_PRG1_BIT_PROT_AREA_END1_MASK                (((1U<<12)-1) << PERI_Flash_PRAR_PRG1_BIT_PROT_AREA_END1_SHIFT)
#define PERI_Flash_PRAR_PRG1_BIT_DMEP1_SHIFT                        (31U)
#define PERI_Flash_PRAR_PRG1_BIT_DMEP1_MASK                         (((1U<<1)-1) << PERI_Flash_PRAR_PRG1_BIT_DMEP1_SHIFT)

/*--- register SCAR_CUR1 -------------------------------------------------*/
#define PERI_Flash_SCAR_CUR1_BIT_SEC_AREA_START1_SHIFT              (0U)
#define PERI_Flash_SCAR_CUR1_BIT_SEC_AREA_START1_MASK               (((1U<<12)-1) << PERI_Flash_SCAR_CUR1_BIT_SEC_AREA_START1_SHIFT)
#define PERI_Flash_SCAR_CUR1_BIT_SEC_AREA_END1_SHIFT                (16U)
#define PERI_Flash_SCAR_CUR1_BIT_SEC_AREA_END1_MASK                 (((1U<<12)-1) << PERI_Flash_SCAR_CUR1_BIT_SEC_AREA_END1_SHIFT)
#define PERI_Flash_SCAR_CUR1_BIT_DMES1_SHIFT                        (31U)
#define PERI_Flash_SCAR_CUR1_BIT_DMES1_MASK                         (((1U<<1)-1) << PERI_Flash_SCAR_CUR1_BIT_DMES1_SHIFT)

/*--- register SCAR_PRG1 -------------------------------------------------*/
#define PERI_Flash_SCAR_PRG1_BIT_SEC_AREA_START1_SHIFT              (0U)
#define PERI_Flash_SCAR_PRG1_BIT_SEC_AREA_START1_MASK               (((1U<<12)-1) << PERI_Flash_SCAR_PRG1_BIT_SEC_AREA_START1_SHIFT)
#define PERI_Flash_SCAR_PRG1_BIT_SEC_AREA_END1_SHIFT                (16U)
#define PERI_Flash_SCAR_PRG1_BIT_SEC_AREA_END1_MASK                 (((1U<<12)-1) << PERI_Flash_SCAR_PRG1_BIT_SEC_AREA_END1_SHIFT)
#define PERI_Flash_SCAR_PRG1_BIT_DMES1_SHIFT                        (31U)
#define PERI_Flash_SCAR_PRG1_BIT_DMES1_MASK                         (((1U<<1)-1) << PERI_Flash_SCAR_PRG1_BIT_DMES1_SHIFT)

/*--- register WPSN_CUR1R -------------------------------------------------*/
#define PERI_Flash_WPSN_CUR1R_BIT_WRPSN1_SHIFT                      (0U)
#define PERI_Flash_WPSN_CUR1R_BIT_WRPSN1_MASK                       (((1U<<8)-1) << PERI_Flash_WPSN_CUR1R_BIT_WRPSN1_SHIFT)

/*--- register WPSN_PRG1R -------------------------------------------------*/
#define PERI_Flash_WPSN_PRG1R_BIT_WRPSN1_SHIFT                      (0U)
#define PERI_Flash_WPSN_PRG1R_BIT_WRPSN1_MASK                       (((1U<<8)-1) << PERI_Flash_WPSN_PRG1R_BIT_WRPSN1_SHIFT)

/*--- register BOOT_CURR -------------------------------------------------*/
#define PERI_Flash_BOOT_CURR_BIT_BOOT_ADD0_SHIFT                    (0U)
#define PERI_Flash_BOOT_CURR_BIT_BOOT_ADD0_MASK                     (((1U<<16)-1) << PERI_Flash_BOOT_CURR_BIT_BOOT_ADD0_SHIFT)
#define PERI_Flash_BOOT_CURR_BIT_BOOT_ADD1_SHIFT                    (16U)
#define PERI_Flash_BOOT_CURR_BIT_BOOT_ADD1_MASK                     (((1U<<16)-1) << PERI_Flash_BOOT_CURR_BIT_BOOT_ADD1_SHIFT)

/*--- register BOOT_PRGR -------------------------------------------------*/
#define PERI_Flash_BOOT_PRGR_BIT_BOOT_ADD0_SHIFT                    (0U)
#define PERI_Flash_BOOT_PRGR_BIT_BOOT_ADD0_MASK                     (((1U<<16)-1) << PERI_Flash_BOOT_PRGR_BIT_BOOT_ADD0_SHIFT)
#define PERI_Flash_BOOT_PRGR_BIT_BOOT_ADD1_SHIFT                    (16U)
#define PERI_Flash_BOOT_PRGR_BIT_BOOT_ADD1_MASK                     (((1U<<16)-1) << PERI_Flash_BOOT_PRGR_BIT_BOOT_ADD1_SHIFT)

/*--- register CRCCR1 -------------------------------------------------*/
#define PERI_Flash_CRCCR1_BIT_CRC_SECT_SHIFT                        (0U)
#define PERI_Flash_CRCCR1_BIT_CRC_SECT_MASK                         (((1U<<3)-1) << PERI_Flash_CRCCR1_BIT_CRC_SECT_SHIFT)
#define PERI_Flash_CRCCR1_BIT_ALL_BANK_SHIFT                        (7U)
#define PERI_Flash_CRCCR1_BIT_ALL_BANK_MASK                         (((1U<<1)-1) << PERI_Flash_CRCCR1_BIT_ALL_BANK_SHIFT)
#define PERI_Flash_CRCCR1_BIT_CRC_BY_SECT_SHIFT                     (8U)
#define PERI_Flash_CRCCR1_BIT_CRC_BY_SECT_MASK                      (((1U<<1)-1) << PERI_Flash_CRCCR1_BIT_CRC_BY_SECT_SHIFT)
#define PERI_Flash_CRCCR1_BIT_ADD_SECT_SHIFT                        (9U)
#define PERI_Flash_CRCCR1_BIT_ADD_SECT_MASK                         (((1U<<1)-1) << PERI_Flash_CRCCR1_BIT_ADD_SECT_SHIFT)
#define PERI_Flash_CRCCR1_BIT_CLEAN_SECT_SHIFT                      (10U)
#define PERI_Flash_CRCCR1_BIT_CLEAN_SECT_MASK                       (((1U<<1)-1) << PERI_Flash_CRCCR1_BIT_CLEAN_SECT_SHIFT)
#define PERI_Flash_CRCCR1_BIT_START_CRC_SHIFT                       (16U)
#define PERI_Flash_CRCCR1_BIT_START_CRC_MASK                        (((1U<<1)-1) << PERI_Flash_CRCCR1_BIT_START_CRC_SHIFT)
#define PERI_Flash_CRCCR1_BIT_CLEAN_CRC_SHIFT                       (17U)
#define PERI_Flash_CRCCR1_BIT_CLEAN_CRC_MASK                        (((1U<<1)-1) << PERI_Flash_CRCCR1_BIT_CLEAN_CRC_SHIFT)
#define PERI_Flash_CRCCR1_BIT_CRC_BURST_SHIFT                       (20U)
#define PERI_Flash_CRCCR1_BIT_CRC_BURST_MASK                        (((1U<<2)-1) << PERI_Flash_CRCCR1_BIT_CRC_BURST_SHIFT)

/*--- register CRCSADD1R -------------------------------------------------*/
#define PERI_Flash_CRCSADD1R_BIT_CRC_START_ADDR_SHIFT               (2U)
#define PERI_Flash_CRCSADD1R_BIT_CRC_START_ADDR_MASK                (((1U<<18)-1) << PERI_Flash_CRCSADD1R_BIT_CRC_START_ADDR_SHIFT)

/*--- register CRCEADD1R -------------------------------------------------*/
#define PERI_Flash_CRCEADD1R_BIT_CRC_END_ADDR_SHIFT                 (2U)
#define PERI_Flash_CRCEADD1R_BIT_CRC_END_ADDR_MASK                  (((1U<<18)-1) << PERI_Flash_CRCEADD1R_BIT_CRC_END_ADDR_SHIFT)

/*--- register CRCDATAR -------------------------------------------------*/
#define PERI_Flash_CRCDATAR_BIT_CRC_DATA_SHIFT                      (0U)
#define PERI_Flash_CRCDATAR_BIT_CRC_DATA_MASK                       (((1U<<32)-1) << PERI_Flash_CRCDATAR_BIT_CRC_DATA_SHIFT)

/*--- register ECC_FA1R -------------------------------------------------*/
#define PERI_Flash_ECC_FA1R_BIT_FAIL_ECC_ADDR1_SHIFT                (0U)
#define PERI_Flash_ECC_FA1R_BIT_FAIL_ECC_ADDR1_MASK                 (((1U<<15)-1) << PERI_Flash_ECC_FA1R_BIT_FAIL_ECC_ADDR1_SHIFT)

/*--- register ACR_ -------------------------------------------------*/
#define PERI_Flash_ACR__BIT_LATENCY_SHIFT                           (0U)
#define PERI_Flash_ACR__BIT_LATENCY_MASK                            (((1U<<4)-1) << PERI_Flash_ACR__BIT_LATENCY_SHIFT)
#define PERI_Flash_ACR__BIT_WRHIGHFREQ_SHIFT                        (4U)
#define PERI_Flash_ACR__BIT_WRHIGHFREQ_MASK                         (((1U<<2)-1) << PERI_Flash_ACR__BIT_WRHIGHFREQ_SHIFT)

