minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register KEYR2 -------------------------------------------------*/
#define PERI_Flash_KEYR2_BIT_KEYR2_SHIFT                            (0U)
#define PERI_Flash_KEYR2_BIT_KEYR2_MASK                             (((1U<<32)-1) << PERI_Flash_KEYR2_BIT_KEYR2_SHIFT)

/*--- register OPTKEYR_ -------------------------------------------------*/
#define PERI_Flash_OPTKEYR__BIT_OPTKEYR_SHIFT                       (0U)
#define PERI_Flash_OPTKEYR__BIT_OPTKEYR_MASK                        (((1U<<32)-1) << PERI_Flash_OPTKEYR__BIT_OPTKEYR_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_Flash_CR2_BIT_LOCK2_SHIFT                              (0U)
#define PERI_Flash_CR2_BIT_LOCK2_MASK                               (((1U<<1)-1) << PERI_Flash_CR2_BIT_LOCK2_SHIFT)
#define PERI_Flash_CR2_BIT_PG2_SHIFT                                (1U)
#define PERI_Flash_CR2_BIT_PG2_MASK                                 (((1U<<1)-1) << PERI_Flash_CR2_BIT_PG2_SHIFT)
#define PERI_Flash_CR2_BIT_SER2_SHIFT                               (2U)
#define PERI_Flash_CR2_BIT_SER2_MASK                                (((1U<<1)-1) << PERI_Flash_CR2_BIT_SER2_SHIFT)
#define PERI_Flash_CR2_BIT_BER2_SHIFT                               (3U)
#define PERI_Flash_CR2_BIT_BER2_MASK                                (((1U<<1)-1) << PERI_Flash_CR2_BIT_BER2_SHIFT)
#define PERI_Flash_CR2_BIT_PSIZE2_SHIFT                             (4U)
#define PERI_Flash_CR2_BIT_PSIZE2_MASK                              (((1U<<2)-1) << PERI_Flash_CR2_BIT_PSIZE2_SHIFT)
#define PERI_Flash_CR2_BIT_FW2_SHIFT                                (6U)
#define PERI_Flash_CR2_BIT_FW2_MASK                                 (((1U<<1)-1) << PERI_Flash_CR2_BIT_FW2_SHIFT)
#define PERI_Flash_CR2_BIT_START2_SHIFT                             (7U)
#define PERI_Flash_CR2_BIT_START2_MASK                              (((1U<<1)-1) << PERI_Flash_CR2_BIT_START2_SHIFT)
#define PERI_Flash_CR2_BIT_SNB2_SHIFT                               (8U)
#define PERI_Flash_CR2_BIT_SNB2_MASK                                (((1U<<3)-1) << PERI_Flash_CR2_BIT_SNB2_SHIFT)
#define PERI_Flash_CR2_BIT_SPSS2_SHIFT                              (14U)
#define PERI_Flash_CR2_BIT_SPSS2_MASK                               (((1U<<1)-1) << PERI_Flash_CR2_BIT_SPSS2_SHIFT)
#define PERI_Flash_CR2_BIT_CRC_EN_SHIFT                             (15U)
#define PERI_Flash_CR2_BIT_CRC_EN_MASK                              (((1U<<1)-1) << PERI_Flash_CR2_BIT_CRC_EN_SHIFT)
#define PERI_Flash_CR2_BIT_EOPIE2_SHIFT                             (16U)
#define PERI_Flash_CR2_BIT_EOPIE2_MASK                              (((1U<<1)-1) << PERI_Flash_CR2_BIT_EOPIE2_SHIFT)
#define PERI_Flash_CR2_BIT_WRPERRIE2_SHIFT                          (17U)
#define PERI_Flash_CR2_BIT_WRPERRIE2_MASK                           (((1U<<1)-1) << PERI_Flash_CR2_BIT_WRPERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_PGSERRIE2_SHIFT                          (18U)
#define PERI_Flash_CR2_BIT_PGSERRIE2_MASK                           (((1U<<1)-1) << PERI_Flash_CR2_BIT_PGSERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_STRBERRIE2_SHIFT                         (19U)
#define PERI_Flash_CR2_BIT_STRBERRIE2_MASK                          (((1U<<1)-1) << PERI_Flash_CR2_BIT_STRBERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_INCERRIE2_SHIFT                          (21U)
#define PERI_Flash_CR2_BIT_INCERRIE2_MASK                           (((1U<<1)-1) << PERI_Flash_CR2_BIT_INCERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_OPERRIE2_SHIFT                           (22U)
#define PERI_Flash_CR2_BIT_OPERRIE2_MASK                            (((1U<<1)-1) << PERI_Flash_CR2_BIT_OPERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_RDPERRIE2_SHIFT                          (23U)
#define PERI_Flash_CR2_BIT_RDPERRIE2_MASK                           (((1U<<1)-1) << PERI_Flash_CR2_BIT_RDPERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_RDSERRIE2_SHIFT                          (24U)
#define PERI_Flash_CR2_BIT_RDSERRIE2_MASK                           (((1U<<1)-1) << PERI_Flash_CR2_BIT_RDSERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_SNECCERRIE2_SHIFT                        (25U)
#define PERI_Flash_CR2_BIT_SNECCERRIE2_MASK                         (((1U<<1)-1) << PERI_Flash_CR2_BIT_SNECCERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_DBECCERRIE2_SHIFT                        (26U)
#define PERI_Flash_CR2_BIT_DBECCERRIE2_MASK                         (((1U<<1)-1) << PERI_Flash_CR2_BIT_DBECCERRIE2_SHIFT)
#define PERI_Flash_CR2_BIT_CRCENDIE2_SHIFT                          (27U)
#define PERI_Flash_CR2_BIT_CRCENDIE2_MASK                           (((1U<<1)-1) << PERI_Flash_CR2_BIT_CRCENDIE2_SHIFT)
#define PERI_Flash_CR2_BIT_CRCRDERRIE2_SHIFT                        (28U)
#define PERI_Flash_CR2_BIT_CRCRDERRIE2_MASK                         (((1U<<1)-1) << PERI_Flash_CR2_BIT_CRCRDERRIE2_SHIFT)

/*--- register SR2 -------------------------------------------------*/
#define PERI_Flash_SR2_BIT_BSY2_SHIFT                               (0U)
#define PERI_Flash_SR2_BIT_BSY2_MASK                                (((1U<<1)-1) << PERI_Flash_SR2_BIT_BSY2_SHIFT)
#define PERI_Flash_SR2_BIT_WBNE2_SHIFT                              (1U)
#define PERI_Flash_SR2_BIT_WBNE2_MASK                               (((1U<<1)-1) << PERI_Flash_SR2_BIT_WBNE2_SHIFT)
#define PERI_Flash_SR2_BIT_QW2_SHIFT                                (2U)
#define PERI_Flash_SR2_BIT_QW2_MASK                                 (((1U<<1)-1) << PERI_Flash_SR2_BIT_QW2_SHIFT)
#define PERI_Flash_SR2_BIT_CRC_BUSY2_SHIFT                          (3U)
#define PERI_Flash_SR2_BIT_CRC_BUSY2_MASK                           (((1U<<1)-1) << PERI_Flash_SR2_BIT_CRC_BUSY2_SHIFT)
#define PERI_Flash_SR2_BIT_EOP2_SHIFT                               (16U)
#define PERI_Flash_SR2_BIT_EOP2_MASK                                (((1U<<1)-1) << PERI_Flash_SR2_BIT_EOP2_SHIFT)
#define PERI_Flash_SR2_BIT_WRPERR2_SHIFT                            (17U)
#define PERI_Flash_SR2_BIT_WRPERR2_MASK                             (((1U<<1)-1) << PERI_Flash_SR2_BIT_WRPERR2_SHIFT)
#define PERI_Flash_SR2_BIT_PGSERR2_SHIFT                            (18U)
#define PERI_Flash_SR2_BIT_PGSERR2_MASK                             (((1U<<1)-1) << PERI_Flash_SR2_BIT_PGSERR2_SHIFT)
#define PERI_Flash_SR2_BIT_STRBERR2_SHIFT                           (19U)
#define PERI_Flash_SR2_BIT_STRBERR2_MASK                            (((1U<<1)-1) << PERI_Flash_SR2_BIT_STRBERR2_SHIFT)
#define PERI_Flash_SR2_BIT_INCERR2_SHIFT                            (21U)
#define PERI_Flash_SR2_BIT_INCERR2_MASK                             (((1U<<1)-1) << PERI_Flash_SR2_BIT_INCERR2_SHIFT)
#define PERI_Flash_SR2_BIT_OPERR2_SHIFT                             (22U)
#define PERI_Flash_SR2_BIT_OPERR2_MASK                              (((1U<<1)-1) << PERI_Flash_SR2_BIT_OPERR2_SHIFT)
#define PERI_Flash_SR2_BIT_RDPERR2_SHIFT                            (23U)
#define PERI_Flash_SR2_BIT_RDPERR2_MASK                             (((1U<<1)-1) << PERI_Flash_SR2_BIT_RDPERR2_SHIFT)
#define PERI_Flash_SR2_BIT_RDSERR2_SHIFT                            (24U)
#define PERI_Flash_SR2_BIT_RDSERR2_MASK                             (((1U<<1)-1) << PERI_Flash_SR2_BIT_RDSERR2_SHIFT)
#define PERI_Flash_SR2_BIT_SNECCERR2_SHIFT                          (25U)
#define PERI_Flash_SR2_BIT_SNECCERR2_MASK                           (((1U<<1)-1) << PERI_Flash_SR2_BIT_SNECCERR2_SHIFT)
#define PERI_Flash_SR2_BIT_DBECCERR2_SHIFT                          (26U)
#define PERI_Flash_SR2_BIT_DBECCERR2_MASK                           (((1U<<1)-1) << PERI_Flash_SR2_BIT_DBECCERR2_SHIFT)
#define PERI_Flash_SR2_BIT_CRCEND2_SHIFT                            (27U)
#define PERI_Flash_SR2_BIT_CRCEND2_MASK                             (((1U<<1)-1) << PERI_Flash_SR2_BIT_CRCEND2_SHIFT)

/*--- register CCR2 -------------------------------------------------*/
#define PERI_Flash_CCR2_BIT_CLR_EOP2_SHIFT                          (16U)
#define PERI_Flash_CCR2_BIT_CLR_EOP2_MASK                           (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_EOP2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_WRPERR2_SHIFT                       (17U)
#define PERI_Flash_CCR2_BIT_CLR_WRPERR2_MASK                        (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_WRPERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_PGSERR2_SHIFT                       (18U)
#define PERI_Flash_CCR2_BIT_CLR_PGSERR2_MASK                        (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_PGSERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_STRBERR2_SHIFT                      (19U)
#define PERI_Flash_CCR2_BIT_CLR_STRBERR2_MASK                       (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_STRBERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_INCERR2_SHIFT                       (21U)
#define PERI_Flash_CCR2_BIT_CLR_INCERR2_MASK                        (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_INCERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_OPERR2_SHIFT                        (22U)
#define PERI_Flash_CCR2_BIT_CLR_OPERR2_MASK                         (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_OPERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_RDPERR2_SHIFT                       (23U)
#define PERI_Flash_CCR2_BIT_CLR_RDPERR2_MASK                        (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_RDPERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_RDSERR1_SHIFT                       (24U)
#define PERI_Flash_CCR2_BIT_CLR_RDSERR1_MASK                        (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_RDSERR1_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_SNECCERR2_SHIFT                     (25U)
#define PERI_Flash_CCR2_BIT_CLR_SNECCERR2_MASK                      (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_SNECCERR2_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_DBECCERR1_SHIFT                     (26U)
#define PERI_Flash_CCR2_BIT_CLR_DBECCERR1_MASK                      (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_DBECCERR1_SHIFT)
#define PERI_Flash_CCR2_BIT_CLR_CRCEND2_SHIFT                       (27U)
#define PERI_Flash_CCR2_BIT_CLR_CRCEND2_MASK                        (((1U<<1)-1) << PERI_Flash_CCR2_BIT_CLR_CRCEND2_SHIFT)

