minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OPTCR_ -------------------------------------------------*/
#define PERI_Flash_OPTCR__BIT_OPTLOCK_SHIFT                         (0U)
#define PERI_Flash_OPTCR__BIT_OPTLOCK_MASK                          (((1U<<1)-1) << PERI_Flash_OPTCR__BIT_OPTLOCK_SHIFT)
#define PERI_Flash_OPTCR__BIT_OPTSTART_SHIFT                        (1U)
#define PERI_Flash_OPTCR__BIT_OPTSTART_MASK                         (((1U<<1)-1) << PERI_Flash_OPTCR__BIT_OPTSTART_SHIFT)
#define PERI_Flash_OPTCR__BIT_MER_SHIFT                             (4U)
#define PERI_Flash_OPTCR__BIT_MER_MASK                              (((1U<<1)-1) << PERI_Flash_OPTCR__BIT_MER_SHIFT)
#define PERI_Flash_OPTCR__BIT_OPTCHANGEERRIE_SHIFT                  (30U)
#define PERI_Flash_OPTCR__BIT_OPTCHANGEERRIE_MASK                   (((1U<<1)-1) << PERI_Flash_OPTCR__BIT_OPTCHANGEERRIE_SHIFT)
#define PERI_Flash_OPTCR__BIT_SWAP_BANK_SHIFT                       (31U)
#define PERI_Flash_OPTCR__BIT_SWAP_BANK_MASK                        (((1U<<1)-1) << PERI_Flash_OPTCR__BIT_SWAP_BANK_SHIFT)

/*--- register OPTSR_CUR_ -------------------------------------------------*/
#define PERI_Flash_OPTSR_CUR__BIT_OPT_BUSY_SHIFT                    (0U)
#define PERI_Flash_OPTSR_CUR__BIT_OPT_BUSY_MASK                     (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_OPT_BUSY_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_BOR_LEV_SHIFT                     (2U)
#define PERI_Flash_OPTSR_CUR__BIT_BOR_LEV_MASK                      (((1U<<2)-1) << PERI_Flash_OPTSR_CUR__BIT_BOR_LEV_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_IWDG1_SW_SHIFT                    (4U)
#define PERI_Flash_OPTSR_CUR__BIT_IWDG1_SW_MASK                     (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_IWDG1_SW_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_NRST_STOP_D1_SHIFT                (6U)
#define PERI_Flash_OPTSR_CUR__BIT_NRST_STOP_D1_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_NRST_STOP_D1_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_NRST_STBY_D1_SHIFT                (7U)
#define PERI_Flash_OPTSR_CUR__BIT_NRST_STBY_D1_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_NRST_STBY_D1_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_RDP_SHIFT                         (8U)
#define PERI_Flash_OPTSR_CUR__BIT_RDP_MASK                          (((1U<<8)-1) << PERI_Flash_OPTSR_CUR__BIT_RDP_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_IWDG_FZ_STOP_SHIFT                (17U)
#define PERI_Flash_OPTSR_CUR__BIT_IWDG_FZ_STOP_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_IWDG_FZ_STOP_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_IWDG_FZ_SDBY_SHIFT                (18U)
#define PERI_Flash_OPTSR_CUR__BIT_IWDG_FZ_SDBY_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_IWDG_FZ_SDBY_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_ST_RAM_SIZE_SHIFT                 (19U)
#define PERI_Flash_OPTSR_CUR__BIT_ST_RAM_SIZE_MASK                  (((1U<<2)-1) << PERI_Flash_OPTSR_CUR__BIT_ST_RAM_SIZE_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_SECURITY_SHIFT                    (21U)
#define PERI_Flash_OPTSR_CUR__BIT_SECURITY_MASK                     (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_SECURITY_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_IO_HSLV_SHIFT                     (29U)
#define PERI_Flash_OPTSR_CUR__BIT_IO_HSLV_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_IO_HSLV_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_OPTCHANGEERR_SHIFT                (30U)
#define PERI_Flash_OPTSR_CUR__BIT_OPTCHANGEERR_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_OPTCHANGEERR_SHIFT)
#define PERI_Flash_OPTSR_CUR__BIT_SWAP_BANK_OPT_SHIFT               (31U)
#define PERI_Flash_OPTSR_CUR__BIT_SWAP_BANK_OPT_MASK                (((1U<<1)-1) << PERI_Flash_OPTSR_CUR__BIT_SWAP_BANK_OPT_SHIFT)

/*--- register OPTSR_PRG_ -------------------------------------------------*/
#define PERI_Flash_OPTSR_PRG__BIT_BOR_LEV_SHIFT                     (2U)
#define PERI_Flash_OPTSR_PRG__BIT_BOR_LEV_MASK                      (((1U<<2)-1) << PERI_Flash_OPTSR_PRG__BIT_BOR_LEV_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_IWDG1_SW_SHIFT                    (4U)
#define PERI_Flash_OPTSR_PRG__BIT_IWDG1_SW_MASK                     (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_IWDG1_SW_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_NRST_STOP_SHIFT                   (6U)
#define PERI_Flash_OPTSR_PRG__BIT_NRST_STOP_MASK                    (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_NRST_STOP_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_NRST_STDY_SHIFT                   (7U)
#define PERI_Flash_OPTSR_PRG__BIT_NRST_STDY_MASK                    (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_NRST_STDY_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_RDP_SHIFT                         (8U)
#define PERI_Flash_OPTSR_PRG__BIT_RDP_MASK                          (((1U<<8)-1) << PERI_Flash_OPTSR_PRG__BIT_RDP_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_FZ_IWDG_STOP_SHIFT                (17U)
#define PERI_Flash_OPTSR_PRG__BIT_FZ_IWDG_STOP_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_FZ_IWDG_STOP_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_FZ_IWDG_SDBY_SHIFT                (18U)
#define PERI_Flash_OPTSR_PRG__BIT_FZ_IWDG_SDBY_MASK                 (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_FZ_IWDG_SDBY_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_ST_RAM_SIZE_SHIFT                 (19U)
#define PERI_Flash_OPTSR_PRG__BIT_ST_RAM_SIZE_MASK                  (((1U<<2)-1) << PERI_Flash_OPTSR_PRG__BIT_ST_RAM_SIZE_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_SECURITY_SHIFT                    (21U)
#define PERI_Flash_OPTSR_PRG__BIT_SECURITY_MASK                     (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_SECURITY_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_IO_HSLV_SHIFT                     (29U)
#define PERI_Flash_OPTSR_PRG__BIT_IO_HSLV_MASK                      (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_IO_HSLV_SHIFT)
#define PERI_Flash_OPTSR_PRG__BIT_SWAP_BANK_OPT_SHIFT               (31U)
#define PERI_Flash_OPTSR_PRG__BIT_SWAP_BANK_OPT_MASK                (((1U<<1)-1) << PERI_Flash_OPTSR_PRG__BIT_SWAP_BANK_OPT_SHIFT)

