minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OPTCCR_ -------------------------------------------------*/
#define PERI_Flash_OPTCCR__BIT_CLR_OPTCHANGEERR_SHIFT               (30U)
#define PERI_Flash_OPTCCR__BIT_CLR_OPTCHANGEERR_MASK                (((1U<<1)-1) << PERI_Flash_OPTCCR__BIT_CLR_OPTCHANGEERR_SHIFT)

/*--- register PRAR_CUR2 -------------------------------------------------*/
#define PERI_Flash_PRAR_CUR2_BIT_PROT_AREA_START2_SHIFT             (0U)
#define PERI_Flash_PRAR_CUR2_BIT_PROT_AREA_START2_MASK              (((1U<<12)-1) << PERI_Flash_PRAR_CUR2_BIT_PROT_AREA_START2_SHIFT)
#define PERI_Flash_PRAR_CUR2_BIT_PROT_AREA_END2_SHIFT               (16U)
#define PERI_Flash_PRAR_CUR2_BIT_PROT_AREA_END2_MASK                (((1U<<12)-1) << PERI_Flash_PRAR_CUR2_BIT_PROT_AREA_END2_SHIFT)
#define PERI_Flash_PRAR_CUR2_BIT_DMEP2_SHIFT                        (31U)
#define PERI_Flash_PRAR_CUR2_BIT_DMEP2_MASK                         (((1U<<1)-1) << PERI_Flash_PRAR_CUR2_BIT_DMEP2_SHIFT)

/*--- register PRAR_PRG2 -------------------------------------------------*/
#define PERI_Flash_PRAR_PRG2_BIT_PROT_AREA_START2_SHIFT             (0U)
#define PERI_Flash_PRAR_PRG2_BIT_PROT_AREA_START2_MASK              (((1U<<12)-1) << PERI_Flash_PRAR_PRG2_BIT_PROT_AREA_START2_SHIFT)
#define PERI_Flash_PRAR_PRG2_BIT_PROT_AREA_END2_SHIFT               (16U)
#define PERI_Flash_PRAR_PRG2_BIT_PROT_AREA_END2_MASK                (((1U<<12)-1) << PERI_Flash_PRAR_PRG2_BIT_PROT_AREA_END2_SHIFT)
#define PERI_Flash_PRAR_PRG2_BIT_DMEP2_SHIFT                        (31U)
#define PERI_Flash_PRAR_PRG2_BIT_DMEP2_MASK                         (((1U<<1)-1) << PERI_Flash_PRAR_PRG2_BIT_DMEP2_SHIFT)

/*--- register SCAR_CUR2 -------------------------------------------------*/
#define PERI_Flash_SCAR_CUR2_BIT_SEC_AREA_START2_SHIFT              (0U)
#define PERI_Flash_SCAR_CUR2_BIT_SEC_AREA_START2_MASK               (((1U<<12)-1) << PERI_Flash_SCAR_CUR2_BIT_SEC_AREA_START2_SHIFT)
#define PERI_Flash_SCAR_CUR2_BIT_SEC_AREA_END2_SHIFT                (16U)
#define PERI_Flash_SCAR_CUR2_BIT_SEC_AREA_END2_MASK                 (((1U<<12)-1) << PERI_Flash_SCAR_CUR2_BIT_SEC_AREA_END2_SHIFT)
#define PERI_Flash_SCAR_CUR2_BIT_DMES2_SHIFT                        (31U)
#define PERI_Flash_SCAR_CUR2_BIT_DMES2_MASK                         (((1U<<1)-1) << PERI_Flash_SCAR_CUR2_BIT_DMES2_SHIFT)

/*--- register SCAR_PRG2 -------------------------------------------------*/
#define PERI_Flash_SCAR_PRG2_BIT_SEC_AREA_START2_SHIFT              (0U)
#define PERI_Flash_SCAR_PRG2_BIT_SEC_AREA_START2_MASK               (((1U<<12)-1) << PERI_Flash_SCAR_PRG2_BIT_SEC_AREA_START2_SHIFT)
#define PERI_Flash_SCAR_PRG2_BIT_SEC_AREA_END2_SHIFT                (16U)
#define PERI_Flash_SCAR_PRG2_BIT_SEC_AREA_END2_MASK                 (((1U<<12)-1) << PERI_Flash_SCAR_PRG2_BIT_SEC_AREA_END2_SHIFT)
#define PERI_Flash_SCAR_PRG2_BIT_DMES2_SHIFT                        (31U)
#define PERI_Flash_SCAR_PRG2_BIT_DMES2_MASK                         (((1U<<1)-1) << PERI_Flash_SCAR_PRG2_BIT_DMES2_SHIFT)

/*--- register WPSN_CUR2R -------------------------------------------------*/
#define PERI_Flash_WPSN_CUR2R_BIT_WRPSN2_SHIFT                      (0U)
#define PERI_Flash_WPSN_CUR2R_BIT_WRPSN2_MASK                       (((1U<<8)-1) << PERI_Flash_WPSN_CUR2R_BIT_WRPSN2_SHIFT)

/*--- register WPSN_PRG2R -------------------------------------------------*/
#define PERI_Flash_WPSN_PRG2R_BIT_WRPSN2_SHIFT                      (0U)
#define PERI_Flash_WPSN_PRG2R_BIT_WRPSN2_MASK                       (((1U<<8)-1) << PERI_Flash_WPSN_PRG2R_BIT_WRPSN2_SHIFT)

/*--- register BOOT_CURR_ -------------------------------------------------*/
#define PERI_Flash_BOOT_CURR__BIT_BOOT_ADD0_SHIFT                   (0U)
#define PERI_Flash_BOOT_CURR__BIT_BOOT_ADD0_MASK                    (((1U<<16)-1) << PERI_Flash_BOOT_CURR__BIT_BOOT_ADD0_SHIFT)
#define PERI_Flash_BOOT_CURR__BIT_BOOT_ADD1_SHIFT                   (16U)
#define PERI_Flash_BOOT_CURR__BIT_BOOT_ADD1_MASK                    (((1U<<16)-1) << PERI_Flash_BOOT_CURR__BIT_BOOT_ADD1_SHIFT)

/*--- register BOOT_PRGR_ -------------------------------------------------*/
#define PERI_Flash_BOOT_PRGR__BIT_BOOT_ADD0_SHIFT                   (0U)
#define PERI_Flash_BOOT_PRGR__BIT_BOOT_ADD0_MASK                    (((1U<<16)-1) << PERI_Flash_BOOT_PRGR__BIT_BOOT_ADD0_SHIFT)
#define PERI_Flash_BOOT_PRGR__BIT_BOOT_ADD1_SHIFT                   (16U)
#define PERI_Flash_BOOT_PRGR__BIT_BOOT_ADD1_MASK                    (((1U<<16)-1) << PERI_Flash_BOOT_PRGR__BIT_BOOT_ADD1_SHIFT)

/*--- register CRCCR2 -------------------------------------------------*/
#define PERI_Flash_CRCCR2_BIT_CRC_SECT_SHIFT                        (0U)
#define PERI_Flash_CRCCR2_BIT_CRC_SECT_MASK                         (((1U<<3)-1) << PERI_Flash_CRCCR2_BIT_CRC_SECT_SHIFT)
#define PERI_Flash_CRCCR2_BIT_ALL_BANK_SHIFT                        (7U)
#define PERI_Flash_CRCCR2_BIT_ALL_BANK_MASK                         (((1U<<1)-1) << PERI_Flash_CRCCR2_BIT_ALL_BANK_SHIFT)
#define PERI_Flash_CRCCR2_BIT_CRC_BY_SECT_SHIFT                     (8U)
#define PERI_Flash_CRCCR2_BIT_CRC_BY_SECT_MASK                      (((1U<<1)-1) << PERI_Flash_CRCCR2_BIT_CRC_BY_SECT_SHIFT)
#define PERI_Flash_CRCCR2_BIT_ADD_SECT_SHIFT                        (9U)
#define PERI_Flash_CRCCR2_BIT_ADD_SECT_MASK                         (((1U<<1)-1) << PERI_Flash_CRCCR2_BIT_ADD_SECT_SHIFT)
#define PERI_Flash_CRCCR2_BIT_CLEAN_SECT_SHIFT                      (10U)
#define PERI_Flash_CRCCR2_BIT_CLEAN_SECT_MASK                       (((1U<<1)-1) << PERI_Flash_CRCCR2_BIT_CLEAN_SECT_SHIFT)
#define PERI_Flash_CRCCR2_BIT_START_CRC_SHIFT                       (16U)
#define PERI_Flash_CRCCR2_BIT_START_CRC_MASK                        (((1U<<1)-1) << PERI_Flash_CRCCR2_BIT_START_CRC_SHIFT)
#define PERI_Flash_CRCCR2_BIT_CLEAN_CRC_SHIFT                       (17U)
#define PERI_Flash_CRCCR2_BIT_CLEAN_CRC_MASK                        (((1U<<1)-1) << PERI_Flash_CRCCR2_BIT_CLEAN_CRC_SHIFT)
#define PERI_Flash_CRCCR2_BIT_CRC_BURST_SHIFT                       (20U)
#define PERI_Flash_CRCCR2_BIT_CRC_BURST_MASK                        (((1U<<2)-1) << PERI_Flash_CRCCR2_BIT_CRC_BURST_SHIFT)

/*--- register CRCSADD2R -------------------------------------------------*/
#define PERI_Flash_CRCSADD2R_BIT_CRC_START_ADDR_SHIFT               (2U)
#define PERI_Flash_CRCSADD2R_BIT_CRC_START_ADDR_MASK                (((1U<<18)-1) << PERI_Flash_CRCSADD2R_BIT_CRC_START_ADDR_SHIFT)

