minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register IDR -------------------------------------------------*/
#define PERI_GPIOE_IDR_BIT_ID0_SHIFT                                (0U)
#define PERI_GPIOE_IDR_BIT_ID0_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID0_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID1_SHIFT                                (1U)
#define PERI_GPIOE_IDR_BIT_ID1_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID1_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID2_SHIFT                                (2U)
#define PERI_GPIOE_IDR_BIT_ID2_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID2_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID3_SHIFT                                (3U)
#define PERI_GPIOE_IDR_BIT_ID3_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID3_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID4_SHIFT                                (4U)
#define PERI_GPIOE_IDR_BIT_ID4_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID4_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID5_SHIFT                                (5U)
#define PERI_GPIOE_IDR_BIT_ID5_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID5_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID6_SHIFT                                (6U)
#define PERI_GPIOE_IDR_BIT_ID6_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID6_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID7_SHIFT                                (7U)
#define PERI_GPIOE_IDR_BIT_ID7_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID7_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID8_SHIFT                                (8U)
#define PERI_GPIOE_IDR_BIT_ID8_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID8_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID9_SHIFT                                (9U)
#define PERI_GPIOE_IDR_BIT_ID9_MASK                                 (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID9_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID10_SHIFT                               (10U)
#define PERI_GPIOE_IDR_BIT_ID10_MASK                                (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID10_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID11_SHIFT                               (11U)
#define PERI_GPIOE_IDR_BIT_ID11_MASK                                (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID11_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID12_SHIFT                               (12U)
#define PERI_GPIOE_IDR_BIT_ID12_MASK                                (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID12_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID13_SHIFT                               (13U)
#define PERI_GPIOE_IDR_BIT_ID13_MASK                                (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID13_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID14_SHIFT                               (14U)
#define PERI_GPIOE_IDR_BIT_ID14_MASK                                (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID14_SHIFT)
#define PERI_GPIOE_IDR_BIT_ID15_SHIFT                               (15U)
#define PERI_GPIOE_IDR_BIT_ID15_MASK                                (((1U<<1)-1) << PERI_GPIOE_IDR_BIT_ID15_SHIFT)

/*--- register ODR -------------------------------------------------*/
#define PERI_GPIOE_ODR_BIT_OD0_SHIFT                                (0U)
#define PERI_GPIOE_ODR_BIT_OD0_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD0_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD1_SHIFT                                (1U)
#define PERI_GPIOE_ODR_BIT_OD1_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD1_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD2_SHIFT                                (2U)
#define PERI_GPIOE_ODR_BIT_OD2_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD2_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD3_SHIFT                                (3U)
#define PERI_GPIOE_ODR_BIT_OD3_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD3_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD4_SHIFT                                (4U)
#define PERI_GPIOE_ODR_BIT_OD4_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD4_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD5_SHIFT                                (5U)
#define PERI_GPIOE_ODR_BIT_OD5_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD5_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD6_SHIFT                                (6U)
#define PERI_GPIOE_ODR_BIT_OD6_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD6_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD7_SHIFT                                (7U)
#define PERI_GPIOE_ODR_BIT_OD7_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD7_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD8_SHIFT                                (8U)
#define PERI_GPIOE_ODR_BIT_OD8_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD8_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD9_SHIFT                                (9U)
#define PERI_GPIOE_ODR_BIT_OD9_MASK                                 (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD9_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD10_SHIFT                               (10U)
#define PERI_GPIOE_ODR_BIT_OD10_MASK                                (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD10_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD11_SHIFT                               (11U)
#define PERI_GPIOE_ODR_BIT_OD11_MASK                                (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD11_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD12_SHIFT                               (12U)
#define PERI_GPIOE_ODR_BIT_OD12_MASK                                (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD12_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD13_SHIFT                               (13U)
#define PERI_GPIOE_ODR_BIT_OD13_MASK                                (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD13_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD14_SHIFT                               (14U)
#define PERI_GPIOE_ODR_BIT_OD14_MASK                                (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD14_SHIFT)
#define PERI_GPIOE_ODR_BIT_OD15_SHIFT                               (15U)
#define PERI_GPIOE_ODR_BIT_OD15_MASK                                (((1U<<1)-1) << PERI_GPIOE_ODR_BIT_OD15_SHIFT)

/*--- register BSRR -------------------------------------------------*/
#define PERI_GPIOE_BSRR_BIT_BS0_SHIFT                               (0U)
#define PERI_GPIOE_BSRR_BIT_BS0_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS0_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS1_SHIFT                               (1U)
#define PERI_GPIOE_BSRR_BIT_BS1_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS1_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS2_SHIFT                               (2U)
#define PERI_GPIOE_BSRR_BIT_BS2_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS2_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS3_SHIFT                               (3U)
#define PERI_GPIOE_BSRR_BIT_BS3_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS3_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS4_SHIFT                               (4U)
#define PERI_GPIOE_BSRR_BIT_BS4_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS4_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS5_SHIFT                               (5U)
#define PERI_GPIOE_BSRR_BIT_BS5_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS5_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS6_SHIFT                               (6U)
#define PERI_GPIOE_BSRR_BIT_BS6_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS6_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS7_SHIFT                               (7U)
#define PERI_GPIOE_BSRR_BIT_BS7_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS7_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS8_SHIFT                               (8U)
#define PERI_GPIOE_BSRR_BIT_BS8_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS8_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS9_SHIFT                               (9U)
#define PERI_GPIOE_BSRR_BIT_BS9_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS9_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS10_SHIFT                              (10U)
#define PERI_GPIOE_BSRR_BIT_BS10_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS10_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS11_SHIFT                              (11U)
#define PERI_GPIOE_BSRR_BIT_BS11_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS11_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS12_SHIFT                              (12U)
#define PERI_GPIOE_BSRR_BIT_BS12_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS12_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS13_SHIFT                              (13U)
#define PERI_GPIOE_BSRR_BIT_BS13_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS13_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS14_SHIFT                              (14U)
#define PERI_GPIOE_BSRR_BIT_BS14_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS14_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BS15_SHIFT                              (15U)
#define PERI_GPIOE_BSRR_BIT_BS15_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BS15_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR0_SHIFT                               (16U)
#define PERI_GPIOE_BSRR_BIT_BR0_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR0_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR1_SHIFT                               (17U)
#define PERI_GPIOE_BSRR_BIT_BR1_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR1_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR2_SHIFT                               (18U)
#define PERI_GPIOE_BSRR_BIT_BR2_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR2_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR3_SHIFT                               (19U)
#define PERI_GPIOE_BSRR_BIT_BR3_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR3_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR4_SHIFT                               (20U)
#define PERI_GPIOE_BSRR_BIT_BR4_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR4_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR5_SHIFT                               (21U)
#define PERI_GPIOE_BSRR_BIT_BR5_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR5_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR6_SHIFT                               (22U)
#define PERI_GPIOE_BSRR_BIT_BR6_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR6_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR7_SHIFT                               (23U)
#define PERI_GPIOE_BSRR_BIT_BR7_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR7_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR8_SHIFT                               (24U)
#define PERI_GPIOE_BSRR_BIT_BR8_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR8_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR9_SHIFT                               (25U)
#define PERI_GPIOE_BSRR_BIT_BR9_MASK                                (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR9_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR10_SHIFT                              (26U)
#define PERI_GPIOE_BSRR_BIT_BR10_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR10_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR11_SHIFT                              (27U)
#define PERI_GPIOE_BSRR_BIT_BR11_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR11_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR12_SHIFT                              (28U)
#define PERI_GPIOE_BSRR_BIT_BR12_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR12_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR13_SHIFT                              (29U)
#define PERI_GPIOE_BSRR_BIT_BR13_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR13_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR14_SHIFT                              (30U)
#define PERI_GPIOE_BSRR_BIT_BR14_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR14_SHIFT)
#define PERI_GPIOE_BSRR_BIT_BR15_SHIFT                              (31U)
#define PERI_GPIOE_BSRR_BIT_BR15_MASK                               (((1U<<1)-1) << PERI_GPIOE_BSRR_BIT_BR15_SHIFT)

/*--- register LCKR -------------------------------------------------*/
#define PERI_GPIOE_LCKR_BIT_LCK0_SHIFT                              (0U)
#define PERI_GPIOE_LCKR_BIT_LCK0_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK0_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK1_SHIFT                              (1U)
#define PERI_GPIOE_LCKR_BIT_LCK1_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK1_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK2_SHIFT                              (2U)
#define PERI_GPIOE_LCKR_BIT_LCK2_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK2_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK3_SHIFT                              (3U)
#define PERI_GPIOE_LCKR_BIT_LCK3_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK3_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK4_SHIFT                              (4U)
#define PERI_GPIOE_LCKR_BIT_LCK4_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK4_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK5_SHIFT                              (5U)
#define PERI_GPIOE_LCKR_BIT_LCK5_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK5_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK6_SHIFT                              (6U)
#define PERI_GPIOE_LCKR_BIT_LCK6_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK6_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK7_SHIFT                              (7U)
#define PERI_GPIOE_LCKR_BIT_LCK7_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK7_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK8_SHIFT                              (8U)
#define PERI_GPIOE_LCKR_BIT_LCK8_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK8_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK9_SHIFT                              (9U)
#define PERI_GPIOE_LCKR_BIT_LCK9_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK9_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK10_SHIFT                             (10U)
#define PERI_GPIOE_LCKR_BIT_LCK10_MASK                              (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK10_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK11_SHIFT                             (11U)
#define PERI_GPIOE_LCKR_BIT_LCK11_MASK                              (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK11_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK12_SHIFT                             (12U)
#define PERI_GPIOE_LCKR_BIT_LCK12_MASK                              (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK12_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK13_SHIFT                             (13U)
#define PERI_GPIOE_LCKR_BIT_LCK13_MASK                              (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK13_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK14_SHIFT                             (14U)
#define PERI_GPIOE_LCKR_BIT_LCK14_MASK                              (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK14_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCK15_SHIFT                             (15U)
#define PERI_GPIOE_LCKR_BIT_LCK15_MASK                              (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCK15_SHIFT)
#define PERI_GPIOE_LCKR_BIT_LCKK_SHIFT                              (16U)
#define PERI_GPIOE_LCKR_BIT_LCKK_MASK                               (((1U<<1)-1) << PERI_GPIOE_LCKR_BIT_LCKK_SHIFT)

/*--- register AFRL -------------------------------------------------*/
#define PERI_GPIOE_AFRL_BIT_AFSEL0_SHIFT                            (0U)
#define PERI_GPIOE_AFRL_BIT_AFSEL0_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL0_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL1_SHIFT                            (4U)
#define PERI_GPIOE_AFRL_BIT_AFSEL1_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL1_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL2_SHIFT                            (8U)
#define PERI_GPIOE_AFRL_BIT_AFSEL2_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL2_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL3_SHIFT                            (12U)
#define PERI_GPIOE_AFRL_BIT_AFSEL3_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL3_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL4_SHIFT                            (16U)
#define PERI_GPIOE_AFRL_BIT_AFSEL4_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL4_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL5_SHIFT                            (20U)
#define PERI_GPIOE_AFRL_BIT_AFSEL5_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL5_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL6_SHIFT                            (24U)
#define PERI_GPIOE_AFRL_BIT_AFSEL6_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL6_SHIFT)
#define PERI_GPIOE_AFRL_BIT_AFSEL7_SHIFT                            (28U)
#define PERI_GPIOE_AFRL_BIT_AFSEL7_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRL_BIT_AFSEL7_SHIFT)

/*--- register AFRH -------------------------------------------------*/
#define PERI_GPIOE_AFRH_BIT_AFSEL8_SHIFT                            (0U)
#define PERI_GPIOE_AFRH_BIT_AFSEL8_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL8_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL9_SHIFT                            (4U)
#define PERI_GPIOE_AFRH_BIT_AFSEL9_MASK                             (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL9_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL10_SHIFT                           (8U)
#define PERI_GPIOE_AFRH_BIT_AFSEL10_MASK                            (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL10_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL11_SHIFT                           (12U)
#define PERI_GPIOE_AFRH_BIT_AFSEL11_MASK                            (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL11_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL12_SHIFT                           (16U)
#define PERI_GPIOE_AFRH_BIT_AFSEL12_MASK                            (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL12_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL13_SHIFT                           (20U)
#define PERI_GPIOE_AFRH_BIT_AFSEL13_MASK                            (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL13_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL14_SHIFT                           (24U)
#define PERI_GPIOE_AFRH_BIT_AFSEL14_MASK                            (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL14_SHIFT)
#define PERI_GPIOE_AFRH_BIT_AFSEL15_SHIFT                           (28U)
#define PERI_GPIOE_AFRH_BIT_AFSEL15_MASK                            (((1U<<4)-1) << PERI_GPIOE_AFRH_BIT_AFSEL15_SHIFT)

