minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MODER -------------------------------------------------*/
#define PERI_GPIOK_MODER_BIT_MODE0_SHIFT                            (0U)
#define PERI_GPIOK_MODER_BIT_MODE0_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE0_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE1_SHIFT                            (2U)
#define PERI_GPIOK_MODER_BIT_MODE1_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE1_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE2_SHIFT                            (4U)
#define PERI_GPIOK_MODER_BIT_MODE2_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE2_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE3_SHIFT                            (6U)
#define PERI_GPIOK_MODER_BIT_MODE3_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE3_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE4_SHIFT                            (8U)
#define PERI_GPIOK_MODER_BIT_MODE4_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE4_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE5_SHIFT                            (10U)
#define PERI_GPIOK_MODER_BIT_MODE5_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE5_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE6_SHIFT                            (12U)
#define PERI_GPIOK_MODER_BIT_MODE6_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE6_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE7_SHIFT                            (14U)
#define PERI_GPIOK_MODER_BIT_MODE7_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE7_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE8_SHIFT                            (16U)
#define PERI_GPIOK_MODER_BIT_MODE8_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE8_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE9_SHIFT                            (18U)
#define PERI_GPIOK_MODER_BIT_MODE9_MASK                             (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE9_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE10_SHIFT                           (20U)
#define PERI_GPIOK_MODER_BIT_MODE10_MASK                            (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE10_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE11_SHIFT                           (22U)
#define PERI_GPIOK_MODER_BIT_MODE11_MASK                            (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE11_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE12_SHIFT                           (24U)
#define PERI_GPIOK_MODER_BIT_MODE12_MASK                            (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE12_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE13_SHIFT                           (26U)
#define PERI_GPIOK_MODER_BIT_MODE13_MASK                            (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE13_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE14_SHIFT                           (28U)
#define PERI_GPIOK_MODER_BIT_MODE14_MASK                            (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE14_SHIFT)
#define PERI_GPIOK_MODER_BIT_MODE15_SHIFT                           (30U)
#define PERI_GPIOK_MODER_BIT_MODE15_MASK                            (((1U<<2)-1) << PERI_GPIOK_MODER_BIT_MODE15_SHIFT)

/*--- register OTYPER -------------------------------------------------*/
#define PERI_GPIOK_OTYPER_BIT_OT0_SHIFT                             (0U)
#define PERI_GPIOK_OTYPER_BIT_OT0_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT0_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT1_SHIFT                             (1U)
#define PERI_GPIOK_OTYPER_BIT_OT1_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT1_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT2_SHIFT                             (2U)
#define PERI_GPIOK_OTYPER_BIT_OT2_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT2_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT3_SHIFT                             (3U)
#define PERI_GPIOK_OTYPER_BIT_OT3_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT3_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT4_SHIFT                             (4U)
#define PERI_GPIOK_OTYPER_BIT_OT4_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT4_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT5_SHIFT                             (5U)
#define PERI_GPIOK_OTYPER_BIT_OT5_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT5_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT6_SHIFT                             (6U)
#define PERI_GPIOK_OTYPER_BIT_OT6_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT6_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT7_SHIFT                             (7U)
#define PERI_GPIOK_OTYPER_BIT_OT7_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT7_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT8_SHIFT                             (8U)
#define PERI_GPIOK_OTYPER_BIT_OT8_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT8_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT9_SHIFT                             (9U)
#define PERI_GPIOK_OTYPER_BIT_OT9_MASK                              (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT9_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT10_SHIFT                            (10U)
#define PERI_GPIOK_OTYPER_BIT_OT10_MASK                             (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT10_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT11_SHIFT                            (11U)
#define PERI_GPIOK_OTYPER_BIT_OT11_MASK                             (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT11_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT12_SHIFT                            (12U)
#define PERI_GPIOK_OTYPER_BIT_OT12_MASK                             (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT12_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT13_SHIFT                            (13U)
#define PERI_GPIOK_OTYPER_BIT_OT13_MASK                             (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT13_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT14_SHIFT                            (14U)
#define PERI_GPIOK_OTYPER_BIT_OT14_MASK                             (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT14_SHIFT)
#define PERI_GPIOK_OTYPER_BIT_OT15_SHIFT                            (15U)
#define PERI_GPIOK_OTYPER_BIT_OT15_MASK                             (((1U<<1)-1) << PERI_GPIOK_OTYPER_BIT_OT15_SHIFT)

/*--- register OSPEEDR -------------------------------------------------*/
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED0_SHIFT                        (0U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED0_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED0_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED1_SHIFT                        (2U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED1_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED1_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED2_SHIFT                        (4U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED2_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED2_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED3_SHIFT                        (6U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED3_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED3_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED4_SHIFT                        (8U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED4_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED4_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED5_SHIFT                        (10U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED5_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED5_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED6_SHIFT                        (12U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED6_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED6_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED7_SHIFT                        (14U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED7_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED7_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED8_SHIFT                        (16U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED8_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED8_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED9_SHIFT                        (18U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED9_MASK                         (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED9_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED10_SHIFT                       (20U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED10_MASK                        (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED10_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED11_SHIFT                       (22U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED11_MASK                        (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED11_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED12_SHIFT                       (24U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED12_MASK                        (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED12_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED13_SHIFT                       (26U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED13_MASK                        (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED13_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED14_SHIFT                       (28U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED14_MASK                        (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED14_SHIFT)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED15_SHIFT                       (30U)
#define PERI_GPIOK_OSPEEDR_BIT_OSPEED15_MASK                        (((1U<<2)-1) << PERI_GPIOK_OSPEEDR_BIT_OSPEED15_SHIFT)

/*--- register PUPDR -------------------------------------------------*/
#define PERI_GPIOK_PUPDR_BIT_PUPD0_SHIFT                            (0U)
#define PERI_GPIOK_PUPDR_BIT_PUPD0_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD0_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD1_SHIFT                            (2U)
#define PERI_GPIOK_PUPDR_BIT_PUPD1_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD1_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD2_SHIFT                            (4U)
#define PERI_GPIOK_PUPDR_BIT_PUPD2_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD2_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD3_SHIFT                            (6U)
#define PERI_GPIOK_PUPDR_BIT_PUPD3_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD3_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD4_SHIFT                            (8U)
#define PERI_GPIOK_PUPDR_BIT_PUPD4_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD4_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD5_SHIFT                            (10U)
#define PERI_GPIOK_PUPDR_BIT_PUPD5_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD5_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD6_SHIFT                            (12U)
#define PERI_GPIOK_PUPDR_BIT_PUPD6_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD6_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD7_SHIFT                            (14U)
#define PERI_GPIOK_PUPDR_BIT_PUPD7_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD7_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD8_SHIFT                            (16U)
#define PERI_GPIOK_PUPDR_BIT_PUPD8_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD8_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD9_SHIFT                            (18U)
#define PERI_GPIOK_PUPDR_BIT_PUPD9_MASK                             (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD9_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD10_SHIFT                           (20U)
#define PERI_GPIOK_PUPDR_BIT_PUPD10_MASK                            (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD10_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD11_SHIFT                           (22U)
#define PERI_GPIOK_PUPDR_BIT_PUPD11_MASK                            (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD11_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD12_SHIFT                           (24U)
#define PERI_GPIOK_PUPDR_BIT_PUPD12_MASK                            (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD12_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD13_SHIFT                           (26U)
#define PERI_GPIOK_PUPDR_BIT_PUPD13_MASK                            (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD13_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD14_SHIFT                           (28U)
#define PERI_GPIOK_PUPDR_BIT_PUPD14_MASK                            (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD14_SHIFT)
#define PERI_GPIOK_PUPDR_BIT_PUPD15_SHIFT                           (30U)
#define PERI_GPIOK_PUPDR_BIT_PUPD15_MASK                            (((1U<<2)-1) << PERI_GPIOK_PUPDR_BIT_PUPD15_SHIFT)

