minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR1 -------------------------------------------------*/
#define PERI_HRTIM_Common_CR1_BIT_MUDIS_SHIFT                       (0U)
#define PERI_HRTIM_Common_CR1_BIT_MUDIS_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR1_BIT_MUDIS_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_TAUDIS_SHIFT                      (1U)
#define PERI_HRTIM_Common_CR1_BIT_TAUDIS_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_CR1_BIT_TAUDIS_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_TBUDIS_SHIFT                      (2U)
#define PERI_HRTIM_Common_CR1_BIT_TBUDIS_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_CR1_BIT_TBUDIS_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_TCUDIS_SHIFT                      (3U)
#define PERI_HRTIM_Common_CR1_BIT_TCUDIS_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_CR1_BIT_TCUDIS_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_TDUDIS_SHIFT                      (4U)
#define PERI_HRTIM_Common_CR1_BIT_TDUDIS_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_CR1_BIT_TDUDIS_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_TEUDIS_SHIFT                      (5U)
#define PERI_HRTIM_Common_CR1_BIT_TEUDIS_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_CR1_BIT_TEUDIS_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_AD1USRC_SHIFT                     (16U)
#define PERI_HRTIM_Common_CR1_BIT_AD1USRC_MASK                      (((1U<<3)-1) << PERI_HRTIM_Common_CR1_BIT_AD1USRC_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_AD2USRC_SHIFT                     (19U)
#define PERI_HRTIM_Common_CR1_BIT_AD2USRC_MASK                      (((1U<<3)-1) << PERI_HRTIM_Common_CR1_BIT_AD2USRC_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_AD3USRC_SHIFT                     (22U)
#define PERI_HRTIM_Common_CR1_BIT_AD3USRC_MASK                      (((1U<<3)-1) << PERI_HRTIM_Common_CR1_BIT_AD3USRC_SHIFT)
#define PERI_HRTIM_Common_CR1_BIT_AD4USRC_SHIFT                     (25U)
#define PERI_HRTIM_Common_CR1_BIT_AD4USRC_MASK                      (((1U<<3)-1) << PERI_HRTIM_Common_CR1_BIT_AD4USRC_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_HRTIM_Common_CR2_BIT_MSWU_SHIFT                        (0U)
#define PERI_HRTIM_Common_CR2_BIT_MSWU_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_MSWU_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TASWU_SHIFT                       (1U)
#define PERI_HRTIM_Common_CR2_BIT_TASWU_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TASWU_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TBSWU_SHIFT                       (2U)
#define PERI_HRTIM_Common_CR2_BIT_TBSWU_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TBSWU_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TCSWU_SHIFT                       (3U)
#define PERI_HRTIM_Common_CR2_BIT_TCSWU_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TCSWU_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TDSWU_SHIFT                       (4U)
#define PERI_HRTIM_Common_CR2_BIT_TDSWU_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TDSWU_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TESWU_SHIFT                       (5U)
#define PERI_HRTIM_Common_CR2_BIT_TESWU_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TESWU_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_MRST_SHIFT                        (8U)
#define PERI_HRTIM_Common_CR2_BIT_MRST_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_MRST_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TARST_SHIFT                       (9U)
#define PERI_HRTIM_Common_CR2_BIT_TARST_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TARST_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TBRST_SHIFT                       (10U)
#define PERI_HRTIM_Common_CR2_BIT_TBRST_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TBRST_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TCRST_SHIFT                       (11U)
#define PERI_HRTIM_Common_CR2_BIT_TCRST_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TCRST_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TDRST_SHIFT                       (12U)
#define PERI_HRTIM_Common_CR2_BIT_TDRST_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TDRST_SHIFT)
#define PERI_HRTIM_Common_CR2_BIT_TERST_SHIFT                       (13U)
#define PERI_HRTIM_Common_CR2_BIT_TERST_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_CR2_BIT_TERST_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_HRTIM_Common_ISR_BIT_FLT1_SHIFT                        (0U)
#define PERI_HRTIM_Common_ISR_BIT_FLT1_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_FLT1_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_FLT2_SHIFT                        (1U)
#define PERI_HRTIM_Common_ISR_BIT_FLT2_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_FLT2_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_FLT3_SHIFT                        (2U)
#define PERI_HRTIM_Common_ISR_BIT_FLT3_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_FLT3_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_FLT4_SHIFT                        (3U)
#define PERI_HRTIM_Common_ISR_BIT_FLT4_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_FLT4_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_FLT5_SHIFT                        (4U)
#define PERI_HRTIM_Common_ISR_BIT_FLT5_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_FLT5_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_SYSFLT_SHIFT                      (5U)
#define PERI_HRTIM_Common_ISR_BIT_SYSFLT_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_SYSFLT_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_DLLRDY_SHIFT                      (16U)
#define PERI_HRTIM_Common_ISR_BIT_DLLRDY_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_DLLRDY_SHIFT)
#define PERI_HRTIM_Common_ISR_BIT_BMPER_SHIFT                       (17U)
#define PERI_HRTIM_Common_ISR_BIT_BMPER_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_ISR_BIT_BMPER_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_HRTIM_Common_ICR_BIT_FLT1C_SHIFT                       (0U)
#define PERI_HRTIM_Common_ICR_BIT_FLT1C_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_FLT1C_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_FLT2C_SHIFT                       (1U)
#define PERI_HRTIM_Common_ICR_BIT_FLT2C_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_FLT2C_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_FLT3C_SHIFT                       (2U)
#define PERI_HRTIM_Common_ICR_BIT_FLT3C_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_FLT3C_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_FLT4C_SHIFT                       (3U)
#define PERI_HRTIM_Common_ICR_BIT_FLT4C_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_FLT4C_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_FLT5C_SHIFT                       (4U)
#define PERI_HRTIM_Common_ICR_BIT_FLT5C_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_FLT5C_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_SYSFLTC_SHIFT                     (5U)
#define PERI_HRTIM_Common_ICR_BIT_SYSFLTC_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_SYSFLTC_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_DLLRDYC_SHIFT                     (16U)
#define PERI_HRTIM_Common_ICR_BIT_DLLRDYC_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_DLLRDYC_SHIFT)
#define PERI_HRTIM_Common_ICR_BIT_BMPERC_SHIFT                      (17U)
#define PERI_HRTIM_Common_ICR_BIT_BMPERC_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_ICR_BIT_BMPERC_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_HRTIM_Common_IER_BIT_FLT1IE_SHIFT                      (0U)
#define PERI_HRTIM_Common_IER_BIT_FLT1IE_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_FLT1IE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_FLT2IE_SHIFT                      (1U)
#define PERI_HRTIM_Common_IER_BIT_FLT2IE_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_FLT2IE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_FLT3IE_SHIFT                      (2U)
#define PERI_HRTIM_Common_IER_BIT_FLT3IE_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_FLT3IE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_FLT4IE_SHIFT                      (3U)
#define PERI_HRTIM_Common_IER_BIT_FLT4IE_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_FLT4IE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_FLT5IE_SHIFT                      (4U)
#define PERI_HRTIM_Common_IER_BIT_FLT5IE_MASK                       (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_FLT5IE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_SYSFLTE_SHIFT                     (5U)
#define PERI_HRTIM_Common_IER_BIT_SYSFLTE_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_SYSFLTE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_DLLRDYIE_SHIFT                    (16U)
#define PERI_HRTIM_Common_IER_BIT_DLLRDYIE_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_DLLRDYIE_SHIFT)
#define PERI_HRTIM_Common_IER_BIT_BMPERIE_SHIFT                     (17U)
#define PERI_HRTIM_Common_IER_BIT_BMPERIE_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_IER_BIT_BMPERIE_SHIFT)

/*--- register OENR -------------------------------------------------*/
#define PERI_HRTIM_Common_OENR_BIT_TA1OEN_SHIFT                     (0U)
#define PERI_HRTIM_Common_OENR_BIT_TA1OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TA1OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TA2OEN_SHIFT                     (1U)
#define PERI_HRTIM_Common_OENR_BIT_TA2OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TA2OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TB1OEN_SHIFT                     (2U)
#define PERI_HRTIM_Common_OENR_BIT_TB1OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TB1OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TB2OEN_SHIFT                     (3U)
#define PERI_HRTIM_Common_OENR_BIT_TB2OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TB2OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TC1OEN_SHIFT                     (4U)
#define PERI_HRTIM_Common_OENR_BIT_TC1OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TC1OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TC2OEN_SHIFT                     (5U)
#define PERI_HRTIM_Common_OENR_BIT_TC2OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TC2OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TD1OEN_SHIFT                     (6U)
#define PERI_HRTIM_Common_OENR_BIT_TD1OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TD1OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TD2OEN_SHIFT                     (7U)
#define PERI_HRTIM_Common_OENR_BIT_TD2OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TD2OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TE1OEN_SHIFT                     (8U)
#define PERI_HRTIM_Common_OENR_BIT_TE1OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TE1OEN_SHIFT)
#define PERI_HRTIM_Common_OENR_BIT_TE2OEN_SHIFT                     (9U)
#define PERI_HRTIM_Common_OENR_BIT_TE2OEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_OENR_BIT_TE2OEN_SHIFT)

/*--- register DISR -------------------------------------------------*/
#define PERI_HRTIM_Common_DISR_BIT_TA1ODIS_SHIFT                    (0U)
#define PERI_HRTIM_Common_DISR_BIT_TA1ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TA1ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TA2ODIS_SHIFT                    (1U)
#define PERI_HRTIM_Common_DISR_BIT_TA2ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TA2ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TB1ODIS_SHIFT                    (2U)
#define PERI_HRTIM_Common_DISR_BIT_TB1ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TB1ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TB2ODIS_SHIFT                    (3U)
#define PERI_HRTIM_Common_DISR_BIT_TB2ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TB2ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TC1ODIS_SHIFT                    (4U)
#define PERI_HRTIM_Common_DISR_BIT_TC1ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TC1ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TC2ODIS_SHIFT                    (5U)
#define PERI_HRTIM_Common_DISR_BIT_TC2ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TC2ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TD1ODIS_SHIFT                    (6U)
#define PERI_HRTIM_Common_DISR_BIT_TD1ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TD1ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TD2ODIS_SHIFT                    (7U)
#define PERI_HRTIM_Common_DISR_BIT_TD2ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TD2ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TE1ODIS_SHIFT                    (8U)
#define PERI_HRTIM_Common_DISR_BIT_TE1ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TE1ODIS_SHIFT)
#define PERI_HRTIM_Common_DISR_BIT_TE2ODIS_SHIFT                    (9U)
#define PERI_HRTIM_Common_DISR_BIT_TE2ODIS_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_DISR_BIT_TE2ODIS_SHIFT)

/*--- register ODSR -------------------------------------------------*/
#define PERI_HRTIM_Common_ODSR_BIT_TA1ODS_SHIFT                     (0U)
#define PERI_HRTIM_Common_ODSR_BIT_TA1ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TA1ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TA2ODS_SHIFT                     (1U)
#define PERI_HRTIM_Common_ODSR_BIT_TA2ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TA2ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TB1ODS_SHIFT                     (2U)
#define PERI_HRTIM_Common_ODSR_BIT_TB1ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TB1ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TB2ODS_SHIFT                     (3U)
#define PERI_HRTIM_Common_ODSR_BIT_TB2ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TB2ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TC1ODS_SHIFT                     (4U)
#define PERI_HRTIM_Common_ODSR_BIT_TC1ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TC1ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TC2ODS_SHIFT                     (5U)
#define PERI_HRTIM_Common_ODSR_BIT_TC2ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TC2ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TD1ODS_SHIFT                     (6U)
#define PERI_HRTIM_Common_ODSR_BIT_TD1ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TD1ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TD2ODS_SHIFT                     (7U)
#define PERI_HRTIM_Common_ODSR_BIT_TD2ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TD2ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TE1ODS_SHIFT                     (8U)
#define PERI_HRTIM_Common_ODSR_BIT_TE1ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TE1ODS_SHIFT)
#define PERI_HRTIM_Common_ODSR_BIT_TE2ODS_SHIFT                     (9U)
#define PERI_HRTIM_Common_ODSR_BIT_TE2ODS_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_ODSR_BIT_TE2ODS_SHIFT)

/*--- register BMCR -------------------------------------------------*/
#define PERI_HRTIM_Common_BMCR_BIT_BME_SHIFT                        (0U)
#define PERI_HRTIM_Common_BMCR_BIT_BME_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_BME_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_BMOM_SHIFT                       (1U)
#define PERI_HRTIM_Common_BMCR_BIT_BMOM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_BMOM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_BMCLK_SHIFT                      (2U)
#define PERI_HRTIM_Common_BMCR_BIT_BMCLK_MASK                       (((1U<<4)-1) << PERI_HRTIM_Common_BMCR_BIT_BMCLK_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_BMPRSC_SHIFT                     (6U)
#define PERI_HRTIM_Common_BMCR_BIT_BMPRSC_MASK                      (((1U<<4)-1) << PERI_HRTIM_Common_BMCR_BIT_BMPRSC_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_BMPREN_SHIFT                     (10U)
#define PERI_HRTIM_Common_BMCR_BIT_BMPREN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_BMPREN_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_MTBM_SHIFT                       (16U)
#define PERI_HRTIM_Common_BMCR_BIT_MTBM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_MTBM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_TABM_SHIFT                       (17U)
#define PERI_HRTIM_Common_BMCR_BIT_TABM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_TABM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_TBBM_SHIFT                       (18U)
#define PERI_HRTIM_Common_BMCR_BIT_TBBM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_TBBM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_TCBM_SHIFT                       (19U)
#define PERI_HRTIM_Common_BMCR_BIT_TCBM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_TCBM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_TDBM_SHIFT                       (20U)
#define PERI_HRTIM_Common_BMCR_BIT_TDBM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_TDBM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_TEBM_SHIFT                       (21U)
#define PERI_HRTIM_Common_BMCR_BIT_TEBM_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_TEBM_SHIFT)
#define PERI_HRTIM_Common_BMCR_BIT_BMSTAT_SHIFT                     (31U)
#define PERI_HRTIM_Common_BMCR_BIT_BMSTAT_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMCR_BIT_BMSTAT_SHIFT)

/*--- register BMTRG -------------------------------------------------*/
#define PERI_HRTIM_Common_BMTRG_BIT_SW_SHIFT                        (0U)
#define PERI_HRTIM_Common_BMTRG_BIT_SW_MASK                         (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_SW_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTRST_SHIFT                    (1U)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTRST_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_MSTRST_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTREP_SHIFT                    (2U)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTREP_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_MSTREP_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP1_SHIFT                   (3U)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP1_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_MSTCMP1_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP2_SHIFT                   (4U)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_MSTCMP2_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP3_SHIFT                   (5U)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_MSTCMP3_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP4_SHIFT                   (6U)
#define PERI_HRTIM_Common_BMTRG_BIT_MSTCMP4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_MSTCMP4_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TARST_SHIFT                     (7U)
#define PERI_HRTIM_Common_BMTRG_BIT_TARST_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TARST_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TAREP_SHIFT                     (8U)
#define PERI_HRTIM_Common_BMTRG_BIT_TAREP_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TAREP_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TACMP1_SHIFT                    (9U)
#define PERI_HRTIM_Common_BMTRG_BIT_TACMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TACMP1_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TACMP2_SHIFT                    (10U)
#define PERI_HRTIM_Common_BMTRG_BIT_TACMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TACMP2_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TBRST_SHIFT                     (11U)
#define PERI_HRTIM_Common_BMTRG_BIT_TBRST_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TBRST_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TBREP_SHIFT                     (12U)
#define PERI_HRTIM_Common_BMTRG_BIT_TBREP_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TBREP_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TBCMP1_SHIFT                    (13U)
#define PERI_HRTIM_Common_BMTRG_BIT_TBCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TBCMP1_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TBCMP2_SHIFT                    (14U)
#define PERI_HRTIM_Common_BMTRG_BIT_TBCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TBCMP2_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TCRST_SHIFT                     (15U)
#define PERI_HRTIM_Common_BMTRG_BIT_TCRST_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TCRST_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TCREP_SHIFT                     (16U)
#define PERI_HRTIM_Common_BMTRG_BIT_TCREP_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TCREP_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TCCMP1_SHIFT                    (17U)
#define PERI_HRTIM_Common_BMTRG_BIT_TCCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TCCMP1_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TCCMP2_SHIFT                    (18U)
#define PERI_HRTIM_Common_BMTRG_BIT_TCCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TCCMP2_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TDRST_SHIFT                     (19U)
#define PERI_HRTIM_Common_BMTRG_BIT_TDRST_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TDRST_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TDREP_SHIFT                     (20U)
#define PERI_HRTIM_Common_BMTRG_BIT_TDREP_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TDREP_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TDCMP1_SHIFT                    (21U)
#define PERI_HRTIM_Common_BMTRG_BIT_TDCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TDCMP1_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TDCMP2_SHIFT                    (22U)
#define PERI_HRTIM_Common_BMTRG_BIT_TDCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TDCMP2_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TERST_SHIFT                     (23U)
#define PERI_HRTIM_Common_BMTRG_BIT_TERST_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TERST_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TEREP_SHIFT                     (24U)
#define PERI_HRTIM_Common_BMTRG_BIT_TEREP_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TEREP_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TECMP1_SHIFT                    (25U)
#define PERI_HRTIM_Common_BMTRG_BIT_TECMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TECMP1_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_TECMP2_SHIFT                    (26U)
#define PERI_HRTIM_Common_BMTRG_BIT_TECMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_TECMP2_SHIFT)
#define PERI_HRTIM_Common_BMTRG_BIT_OCHPEV_SHIFT                    (31U)
#define PERI_HRTIM_Common_BMTRG_BIT_OCHPEV_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BMTRG_BIT_OCHPEV_SHIFT)

