minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register BMCMPR6 -------------------------------------------------*/
#define PERI_HRTIM_Common_BMCMPR6_BIT_BMCMP_SHIFT                   (0U)
#define PERI_HRTIM_Common_BMCMPR6_BIT_BMCMP_MASK                    (((1U<<16)-1) << PERI_HRTIM_Common_BMCMPR6_BIT_BMCMP_SHIFT)

/*--- register BMPER -------------------------------------------------*/
#define PERI_HRTIM_Common_BMPER_BIT_BMPER_SHIFT                     (0U)
#define PERI_HRTIM_Common_BMPER_BIT_BMPER_MASK                      (((1U<<16)-1) << PERI_HRTIM_Common_BMPER_BIT_BMPER_SHIFT)

/*--- register EECR1 -------------------------------------------------*/
#define PERI_HRTIM_Common_EECR1_BIT_EE1SRC_SHIFT                    (0U)
#define PERI_HRTIM_Common_EECR1_BIT_EE1SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE1SRC_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE1POL_SHIFT                    (2U)
#define PERI_HRTIM_Common_EECR1_BIT_EE1POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE1POL_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE1SNS_SHIFT                    (3U)
#define PERI_HRTIM_Common_EECR1_BIT_EE1SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE1SNS_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE1FAST_SHIFT                   (5U)
#define PERI_HRTIM_Common_EECR1_BIT_EE1FAST_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE1FAST_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE2SRC_SHIFT                    (6U)
#define PERI_HRTIM_Common_EECR1_BIT_EE2SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE2SRC_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE2POL_SHIFT                    (8U)
#define PERI_HRTIM_Common_EECR1_BIT_EE2POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE2POL_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE2SNS_SHIFT                    (9U)
#define PERI_HRTIM_Common_EECR1_BIT_EE2SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE2SNS_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE2FAST_SHIFT                   (11U)
#define PERI_HRTIM_Common_EECR1_BIT_EE2FAST_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE2FAST_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE3SRC_SHIFT                    (12U)
#define PERI_HRTIM_Common_EECR1_BIT_EE3SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE3SRC_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE3POL_SHIFT                    (14U)
#define PERI_HRTIM_Common_EECR1_BIT_EE3POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE3POL_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE3SNS_SHIFT                    (15U)
#define PERI_HRTIM_Common_EECR1_BIT_EE3SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE3SNS_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE3FAST_SHIFT                   (17U)
#define PERI_HRTIM_Common_EECR1_BIT_EE3FAST_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE3FAST_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE4SRC_SHIFT                    (18U)
#define PERI_HRTIM_Common_EECR1_BIT_EE4SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE4SRC_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE4POL_SHIFT                    (20U)
#define PERI_HRTIM_Common_EECR1_BIT_EE4POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE4POL_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE4SNS_SHIFT                    (21U)
#define PERI_HRTIM_Common_EECR1_BIT_EE4SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE4SNS_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE4FAST_SHIFT                   (23U)
#define PERI_HRTIM_Common_EECR1_BIT_EE4FAST_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE4FAST_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE5SRC_SHIFT                    (24U)
#define PERI_HRTIM_Common_EECR1_BIT_EE5SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE5SRC_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE5POL_SHIFT                    (26U)
#define PERI_HRTIM_Common_EECR1_BIT_EE5POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE5POL_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE5SNS_SHIFT                    (27U)
#define PERI_HRTIM_Common_EECR1_BIT_EE5SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR1_BIT_EE5SNS_SHIFT)
#define PERI_HRTIM_Common_EECR1_BIT_EE5FAST_SHIFT                   (29U)
#define PERI_HRTIM_Common_EECR1_BIT_EE5FAST_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR1_BIT_EE5FAST_SHIFT)

/*--- register EECR2 -------------------------------------------------*/
#define PERI_HRTIM_Common_EECR2_BIT_EE6SRC_SHIFT                    (0U)
#define PERI_HRTIM_Common_EECR2_BIT_EE6SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE6SRC_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE6POL_SHIFT                    (2U)
#define PERI_HRTIM_Common_EECR2_BIT_EE6POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR2_BIT_EE6POL_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE6SNS_SHIFT                    (3U)
#define PERI_HRTIM_Common_EECR2_BIT_EE6SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE6SNS_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE7SRC_SHIFT                    (6U)
#define PERI_HRTIM_Common_EECR2_BIT_EE7SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE7SRC_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE7POL_SHIFT                    (8U)
#define PERI_HRTIM_Common_EECR2_BIT_EE7POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR2_BIT_EE7POL_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE7SNS_SHIFT                    (9U)
#define PERI_HRTIM_Common_EECR2_BIT_EE7SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE7SNS_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE8SRC_SHIFT                    (12U)
#define PERI_HRTIM_Common_EECR2_BIT_EE8SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE8SRC_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE8POL_SHIFT                    (14U)
#define PERI_HRTIM_Common_EECR2_BIT_EE8POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR2_BIT_EE8POL_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE8SNS_SHIFT                    (15U)
#define PERI_HRTIM_Common_EECR2_BIT_EE8SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE8SNS_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE9SRC_SHIFT                    (18U)
#define PERI_HRTIM_Common_EECR2_BIT_EE9SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE9SRC_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE9POL_SHIFT                    (20U)
#define PERI_HRTIM_Common_EECR2_BIT_EE9POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR2_BIT_EE9POL_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE9SNS_SHIFT                    (21U)
#define PERI_HRTIM_Common_EECR2_BIT_EE9SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE9SNS_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE10SRC_SHIFT                   (24U)
#define PERI_HRTIM_Common_EECR2_BIT_EE10SRC_MASK                    (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE10SRC_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE10POL_SHIFT                   (26U)
#define PERI_HRTIM_Common_EECR2_BIT_EE10POL_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR2_BIT_EE10POL_SHIFT)
#define PERI_HRTIM_Common_EECR2_BIT_EE10SNS_SHIFT                   (27U)
#define PERI_HRTIM_Common_EECR2_BIT_EE10SNS_MASK                    (((1U<<2)-1) << PERI_HRTIM_Common_EECR2_BIT_EE10SNS_SHIFT)

/*--- register EECR3 -------------------------------------------------*/
#define PERI_HRTIM_Common_EECR3_BIT_EE6SRC_SHIFT                    (0U)
#define PERI_HRTIM_Common_EECR3_BIT_EE6SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE6SRC_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE6POL_SHIFT                    (2U)
#define PERI_HRTIM_Common_EECR3_BIT_EE6POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR3_BIT_EE6POL_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE6SNS_SHIFT                    (3U)
#define PERI_HRTIM_Common_EECR3_BIT_EE6SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE6SNS_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE7SRC_SHIFT                    (6U)
#define PERI_HRTIM_Common_EECR3_BIT_EE7SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE7SRC_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE7POL_SHIFT                    (8U)
#define PERI_HRTIM_Common_EECR3_BIT_EE7POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR3_BIT_EE7POL_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE7SNS_SHIFT                    (9U)
#define PERI_HRTIM_Common_EECR3_BIT_EE7SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE7SNS_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE8SRC_SHIFT                    (12U)
#define PERI_HRTIM_Common_EECR3_BIT_EE8SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE8SRC_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE8POL_SHIFT                    (14U)
#define PERI_HRTIM_Common_EECR3_BIT_EE8POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR3_BIT_EE8POL_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE8SNS_SHIFT                    (15U)
#define PERI_HRTIM_Common_EECR3_BIT_EE8SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE8SNS_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE9SRC_SHIFT                    (18U)
#define PERI_HRTIM_Common_EECR3_BIT_EE9SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE9SRC_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE9POL_SHIFT                    (20U)
#define PERI_HRTIM_Common_EECR3_BIT_EE9POL_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_EECR3_BIT_EE9POL_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE9SNS_SHIFT                    (21U)
#define PERI_HRTIM_Common_EECR3_BIT_EE9SNS_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE9SNS_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE10SRC_SHIFT                   (24U)
#define PERI_HRTIM_Common_EECR3_BIT_EE10SRC_MASK                    (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE10SRC_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE10POL_SHIFT                   (26U)
#define PERI_HRTIM_Common_EECR3_BIT_EE10POL_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_EECR3_BIT_EE10POL_SHIFT)
#define PERI_HRTIM_Common_EECR3_BIT_EE10SNS_SHIFT                   (27U)
#define PERI_HRTIM_Common_EECR3_BIT_EE10SNS_MASK                    (((1U<<2)-1) << PERI_HRTIM_Common_EECR3_BIT_EE10SNS_SHIFT)

/*--- register ADC1R -------------------------------------------------*/
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC1_SHIFT                    (0U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1MC1_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC2_SHIFT                    (1U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1MC2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC3_SHIFT                    (2U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC3_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1MC3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC4_SHIFT                    (3U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MC4_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1MC4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MPER_SHIFT                   (4U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1MPER_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1MPER_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV1_SHIFT                   (5U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV1_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1EEV1_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV2_SHIFT                   (6U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1EEV2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV3_SHIFT                   (7U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1EEV3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV4_SHIFT                   (8U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1EEV4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV5_SHIFT                   (9U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1EEV5_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1EEV5_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAC2_SHIFT                   (10U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TAC2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAC3_SHIFT                   (11U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TAC3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAC4_SHIFT                   (12U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TAC4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAPER_SHIFT                  (13U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TAPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TAPER_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TARST_SHIFT                  (14U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TARST_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TARST_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBC2_SHIFT                   (15U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TBC2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBC3_SHIFT                   (16U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TBC3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBC4_SHIFT                   (17U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TBC4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBPER_SHIFT                  (18U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TBPER_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBRST_SHIFT                  (19U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TBRST_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TBRST_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCC2_SHIFT                   (20U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TCC2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCC3_SHIFT                   (21U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TCC3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCC4_SHIFT                   (22U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TCC4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCPER_SHIFT                  (23U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TCPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TCPER_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDC2_SHIFT                   (24U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TDC2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDC3_SHIFT                   (25U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TDC3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDC4_SHIFT                   (26U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TDC4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDPER_SHIFT                  (27U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TDPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TDPER_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEC2_SHIFT                   (28U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TEC2_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEC3_SHIFT                   (29U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TEC3_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEC4_SHIFT                   (30U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TEC4_SHIFT)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEPER_SHIFT                  (31U)
#define PERI_HRTIM_Common_ADC1R_BIT_AD1TEPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC1R_BIT_AD1TEPER_SHIFT)

/*--- register ADC2R -------------------------------------------------*/
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC1_SHIFT                    (0U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC1_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2MC1_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC2_SHIFT                    (1U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC2_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2MC2_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC3_SHIFT                    (2U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC3_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2MC3_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC4_SHIFT                    (3U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MC4_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2MC4_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MPER_SHIFT                   (4U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2MPER_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2MPER_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV6_SHIFT                   (5U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV6_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2EEV6_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV7_SHIFT                   (6U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV7_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2EEV7_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV8_SHIFT                   (7U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV8_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2EEV8_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV9_SHIFT                   (8U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV9_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2EEV9_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV10_SHIFT                  (9U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2EEV10_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2EEV10_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAC2_SHIFT                   (10U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TAC2_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAC3_SHIFT                   (11U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TAC3_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAC4_SHIFT                   (12U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TAC4_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAPER_SHIFT                  (13U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TAPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TAPER_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBC2_SHIFT                   (14U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TBC2_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBC3_SHIFT                   (15U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TBC3_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBC4_SHIFT                   (16U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TBC4_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBPER_SHIFT                  (17U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TBPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TBPER_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCC2_SHIFT                   (18U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TCC2_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCC3_SHIFT                   (19U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TCC3_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCC4_SHIFT                   (20U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TCC4_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCPER_SHIFT                  (21U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TCPER_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCRST_SHIFT                  (22U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TCRST_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TCRST_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDC2_SHIFT                   (23U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TDC2_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDC3_SHIFT                   (24U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TDC3_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDC4_SHIFT                   (25U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TDC4_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDPER_SHIFT                  (26U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDPER_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TDPER_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDRST_SHIFT                  (27U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TDRST_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TDRST_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TEC2_SHIFT                   (28U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TEC2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TEC2_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TEC3_SHIFT                   (29U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TEC3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TEC3_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TEC4_SHIFT                   (30U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TEC4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TEC4_SHIFT)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TERST_SHIFT                  (31U)
#define PERI_HRTIM_Common_ADC2R_BIT_AD2TERST_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_ADC2R_BIT_AD2TERST_SHIFT)

