minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DLLCR -------------------------------------------------*/
#define PERI_HRTIM_Common_DLLCR_BIT_CAL_SHIFT                       (0U)
#define PERI_HRTIM_Common_DLLCR_BIT_CAL_MASK                        (((1U<<1)-1) << PERI_HRTIM_Common_DLLCR_BIT_CAL_SHIFT)
#define PERI_HRTIM_Common_DLLCR_BIT_CALEN_SHIFT                     (1U)
#define PERI_HRTIM_Common_DLLCR_BIT_CALEN_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_DLLCR_BIT_CALEN_SHIFT)
#define PERI_HRTIM_Common_DLLCR_BIT_CALRTE_SHIFT                    (2U)
#define PERI_HRTIM_Common_DLLCR_BIT_CALRTE_MASK                     (((1U<<2)-1) << PERI_HRTIM_Common_DLLCR_BIT_CALRTE_SHIFT)

/*--- register FLTINR1 -------------------------------------------------*/
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1E_SHIFT                   (0U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1E_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT1E_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1P_SHIFT                   (1U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1P_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT1P_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1SRC_SHIFT                 (2U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1SRC_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT1SRC_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1F_SHIFT                   (3U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1F_MASK                    (((1U<<4)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT1F_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1LCK_SHIFT                 (7U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT1LCK_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT1LCK_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2E_SHIFT                   (8U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2E_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT2E_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2P_SHIFT                   (9U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2P_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT2P_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2SRC_SHIFT                 (10U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2SRC_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT2SRC_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2F_SHIFT                   (11U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2F_MASK                    (((1U<<4)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT2F_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2LCK_SHIFT                 (15U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT2LCK_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT2LCK_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3E_SHIFT                   (16U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3E_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT3E_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3P_SHIFT                   (17U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3P_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT3P_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3SRC_SHIFT                 (18U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3SRC_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT3SRC_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3F_SHIFT                   (19U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3F_MASK                    (((1U<<4)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT3F_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3LCK_SHIFT                 (23U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT3LCK_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT3LCK_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4E_SHIFT                   (24U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4E_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT4E_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4P_SHIFT                   (25U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4P_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT4P_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4SRC_SHIFT                 (26U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4SRC_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT4SRC_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4F_SHIFT                   (27U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4F_MASK                    (((1U<<4)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT4F_SHIFT)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4LCK_SHIFT                 (31U)
#define PERI_HRTIM_Common_FLTINR1_BIT_FLT4LCK_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR1_BIT_FLT4LCK_SHIFT)

/*--- register FLTINR2 -------------------------------------------------*/
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5E_SHIFT                   (0U)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5E_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR2_BIT_FLT5E_SHIFT)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5P_SHIFT                   (1U)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5P_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR2_BIT_FLT5P_SHIFT)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5SRC_SHIFT                 (2U)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5SRC_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR2_BIT_FLT5SRC_SHIFT)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5F_SHIFT                   (3U)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5F_MASK                    (((1U<<4)-1) << PERI_HRTIM_Common_FLTINR2_BIT_FLT5F_SHIFT)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5LCK_SHIFT                 (7U)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLT5LCK_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_FLTINR2_BIT_FLT5LCK_SHIFT)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLTSD_SHIFT                   (24U)
#define PERI_HRTIM_Common_FLTINR2_BIT_FLTSD_MASK                    (((1U<<2)-1) << PERI_HRTIM_Common_FLTINR2_BIT_FLTSD_SHIFT)

/*--- register BDMUPDR -------------------------------------------------*/
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCR_SHIFT                     (0U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCR_MASK                      (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MCR_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MICR_SHIFT                    (1U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MICR_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MICR_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MDIER_SHIFT                   (2U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MDIER_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MDIER_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCNT_SHIFT                    (3U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCNT_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MCNT_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MPER_SHIFT                    (4U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MPER_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MPER_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MREP_SHIFT                    (5U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MREP_MASK                     (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MREP_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP1_SHIFT                   (6U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP1_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MCMP1_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP2_SHIFT                   (7U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP2_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MCMP2_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP3_SHIFT                   (8U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP3_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MCMP3_SHIFT)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP4_SHIFT                   (9U)
#define PERI_HRTIM_Common_BDMUPDR_BIT_MCMP4_MASK                    (((1U<<1)-1) << PERI_HRTIM_Common_BDMUPDR_BIT_MCMP4_SHIFT)

/*--- register BDTxUPR -------------------------------------------------*/
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCR_SHIFT                  (0U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCR_MASK                   (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCR_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXICR_SHIFT                 (1U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXICR_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXICR_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXDIER_SHIFT                (2U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXDIER_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXDIER_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCNT_SHIFT                 (3U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCNT_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCNT_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXPER_SHIFT                 (4U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXPER_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXPER_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXREP_SHIFT                 (5U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXREP_MASK                  (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXREP_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP1_SHIFT                (6U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP1_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP1_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP2_SHIFT                (7U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP2_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP2_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP3_SHIFT                (8U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP3_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP3_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP4_SHIFT                (9U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP4_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCMP4_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMX_DTXR_SHIFT               (10U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMX_DTXR_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMX_DTXR_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXSET1R_SHIFT               (11U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXSET1R_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXSET1R_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRST1R_SHIFT               (12U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRST1R_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRST1R_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXSET2R_SHIFT               (13U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXSET2R_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXSET2R_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRST2R_SHIFT               (14U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRST2R_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRST2R_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXEEFR1_SHIFT               (15U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXEEFR1_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXEEFR1_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXEEFR2_SHIFT               (16U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXEEFR2_MASK                (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXEEFR2_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRSTR_SHIFT                (17U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRSTR_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXRSTR_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCHPR_SHIFT                (18U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCHPR_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXCHPR_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXOUTR_SHIFT                (19U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXOUTR_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXOUTR_SHIFT)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXFLTR_SHIFT                (20U)
#define PERI_HRTIM_Common_BDTXUPR_BIT_TIMXFLTR_MASK                 (((1U<<1)-1) << PERI_HRTIM_Common_BDTXUPR_BIT_TIMXFLTR_SHIFT)

