minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register BDMADR -------------------------------------------------*/
#define PERI_HRTIM_Common_BDMADR_BIT_BDMADR_SHIFT                   (0U)
#define PERI_HRTIM_Common_BDMADR_BIT_BDMADR_MASK                    (((1U<<32)-1) << PERI_HRTIM_Common_BDMADR_BIT_BDMADR_SHIFT)

/*--- register MCR -------------------------------------------------*/
#define PERI_HRTIM_Master_MCR_BIT_CK_PSC_SHIFT                      (0U)
#define PERI_HRTIM_Master_MCR_BIT_CK_PSC_MASK                       (((1U<<3)-1) << PERI_HRTIM_Master_MCR_BIT_CK_PSC_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_CONT_SHIFT                        (3U)
#define PERI_HRTIM_Master_MCR_BIT_CONT_MASK                         (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_CONT_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_RETRIG_SHIFT                      (4U)
#define PERI_HRTIM_Master_MCR_BIT_RETRIG_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_RETRIG_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_HALF_SHIFT                        (5U)
#define PERI_HRTIM_Master_MCR_BIT_HALF_MASK                         (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_HALF_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_SYNC_IN_SHIFT                     (8U)
#define PERI_HRTIM_Master_MCR_BIT_SYNC_IN_MASK                      (((1U<<2)-1) << PERI_HRTIM_Master_MCR_BIT_SYNC_IN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_SYNCRSTM_SHIFT                    (10U)
#define PERI_HRTIM_Master_MCR_BIT_SYNCRSTM_MASK                     (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_SYNCRSTM_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_SYNCSTRTM_SHIFT                   (11U)
#define PERI_HRTIM_Master_MCR_BIT_SYNCSTRTM_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_SYNCSTRTM_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_SYNC_OUT_SHIFT                    (12U)
#define PERI_HRTIM_Master_MCR_BIT_SYNC_OUT_MASK                     (((1U<<2)-1) << PERI_HRTIM_Master_MCR_BIT_SYNC_OUT_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_SYNC_SRC_SHIFT                    (14U)
#define PERI_HRTIM_Master_MCR_BIT_SYNC_SRC_MASK                     (((1U<<2)-1) << PERI_HRTIM_Master_MCR_BIT_SYNC_SRC_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_MCEN_SHIFT                        (16U)
#define PERI_HRTIM_Master_MCR_BIT_MCEN_MASK                         (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_MCEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_TACEN_SHIFT                       (17U)
#define PERI_HRTIM_Master_MCR_BIT_TACEN_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_TACEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_TBCEN_SHIFT                       (18U)
#define PERI_HRTIM_Master_MCR_BIT_TBCEN_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_TBCEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_TCCEN_SHIFT                       (19U)
#define PERI_HRTIM_Master_MCR_BIT_TCCEN_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_TCCEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_TDCEN_SHIFT                       (20U)
#define PERI_HRTIM_Master_MCR_BIT_TDCEN_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_TDCEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_TECEN_SHIFT                       (21U)
#define PERI_HRTIM_Master_MCR_BIT_TECEN_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_TECEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_DACSYNC_SHIFT                     (25U)
#define PERI_HRTIM_Master_MCR_BIT_DACSYNC_MASK                      (((1U<<2)-1) << PERI_HRTIM_Master_MCR_BIT_DACSYNC_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_PREEN_SHIFT                       (27U)
#define PERI_HRTIM_Master_MCR_BIT_PREEN_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_PREEN_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_MREPU_SHIFT                       (29U)
#define PERI_HRTIM_Master_MCR_BIT_MREPU_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MCR_BIT_MREPU_SHIFT)
#define PERI_HRTIM_Master_MCR_BIT_BRSTDMA_SHIFT                     (30U)
#define PERI_HRTIM_Master_MCR_BIT_BRSTDMA_MASK                      (((1U<<2)-1) << PERI_HRTIM_Master_MCR_BIT_BRSTDMA_SHIFT)

/*--- register MISR -------------------------------------------------*/
#define PERI_HRTIM_Master_MISR_BIT_MCMP1_SHIFT                      (0U)
#define PERI_HRTIM_Master_MISR_BIT_MCMP1_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_MCMP1_SHIFT)
#define PERI_HRTIM_Master_MISR_BIT_MCMP2_SHIFT                      (1U)
#define PERI_HRTIM_Master_MISR_BIT_MCMP2_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_MCMP2_SHIFT)
#define PERI_HRTIM_Master_MISR_BIT_MCMP3_SHIFT                      (2U)
#define PERI_HRTIM_Master_MISR_BIT_MCMP3_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_MCMP3_SHIFT)
#define PERI_HRTIM_Master_MISR_BIT_MCMP4_SHIFT                      (3U)
#define PERI_HRTIM_Master_MISR_BIT_MCMP4_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_MCMP4_SHIFT)
#define PERI_HRTIM_Master_MISR_BIT_MREP_SHIFT                       (4U)
#define PERI_HRTIM_Master_MISR_BIT_MREP_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_MREP_SHIFT)
#define PERI_HRTIM_Master_MISR_BIT_SYNC_SHIFT                       (5U)
#define PERI_HRTIM_Master_MISR_BIT_SYNC_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_SYNC_SHIFT)
#define PERI_HRTIM_Master_MISR_BIT_MUPD_SHIFT                       (6U)
#define PERI_HRTIM_Master_MISR_BIT_MUPD_MASK                        (((1U<<1)-1) << PERI_HRTIM_Master_MISR_BIT_MUPD_SHIFT)

/*--- register MICR -------------------------------------------------*/
#define PERI_HRTIM_Master_MICR_BIT_MCMP1C_SHIFT                     (0U)
#define PERI_HRTIM_Master_MICR_BIT_MCMP1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_MCMP1C_SHIFT)
#define PERI_HRTIM_Master_MICR_BIT_MCMP2C_SHIFT                     (1U)
#define PERI_HRTIM_Master_MICR_BIT_MCMP2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_MCMP2C_SHIFT)
#define PERI_HRTIM_Master_MICR_BIT_MCMP3C_SHIFT                     (2U)
#define PERI_HRTIM_Master_MICR_BIT_MCMP3C_MASK                      (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_MCMP3C_SHIFT)
#define PERI_HRTIM_Master_MICR_BIT_MCMP4C_SHIFT                     (3U)
#define PERI_HRTIM_Master_MICR_BIT_MCMP4C_MASK                      (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_MCMP4C_SHIFT)
#define PERI_HRTIM_Master_MICR_BIT_MREPC_SHIFT                      (4U)
#define PERI_HRTIM_Master_MICR_BIT_MREPC_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_MREPC_SHIFT)
#define PERI_HRTIM_Master_MICR_BIT_SYNCC_SHIFT                      (5U)
#define PERI_HRTIM_Master_MICR_BIT_SYNCC_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_SYNCC_SHIFT)
#define PERI_HRTIM_Master_MICR_BIT_MUPDC_SHIFT                      (6U)
#define PERI_HRTIM_Master_MICR_BIT_MUPDC_MASK                       (((1U<<1)-1) << PERI_HRTIM_Master_MICR_BIT_MUPDC_SHIFT)

/*--- register MDIER4 -------------------------------------------------*/
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP1IE_SHIFT                  (0U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP1IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP1IE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP2IE_SHIFT                  (1U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP2IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP2IE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP3IE_SHIFT                  (2U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP3IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP3IE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP4IE_SHIFT                  (3U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP4IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP4IE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MREPIE_SHIFT                   (4U)
#define PERI_HRTIM_Master_MDIER4_BIT_MREPIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MREPIE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_SYNCIE_SHIFT                   (5U)
#define PERI_HRTIM_Master_MDIER4_BIT_SYNCIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_SYNCIE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MUPDIE_SHIFT                   (6U)
#define PERI_HRTIM_Master_MDIER4_BIT_MUPDIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MUPDIE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP1DE_SHIFT                  (16U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP1DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP1DE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP2DE_SHIFT                  (17U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP2DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP2DE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP3DE_SHIFT                  (18U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP3DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP3DE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP4DE_SHIFT                  (19U)
#define PERI_HRTIM_Master_MDIER4_BIT_MCMP4DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MCMP4DE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MREPDE_SHIFT                   (20U)
#define PERI_HRTIM_Master_MDIER4_BIT_MREPDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MREPDE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_SYNCDE_SHIFT                   (21U)
#define PERI_HRTIM_Master_MDIER4_BIT_SYNCDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_SYNCDE_SHIFT)
#define PERI_HRTIM_Master_MDIER4_BIT_MUPDDE_SHIFT                   (22U)
#define PERI_HRTIM_Master_MDIER4_BIT_MUPDDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_Master_MDIER4_BIT_MUPDDE_SHIFT)

/*--- register MCNTR -------------------------------------------------*/
#define PERI_HRTIM_Master_MCNTR_BIT_MCNT_SHIFT                      (0U)
#define PERI_HRTIM_Master_MCNTR_BIT_MCNT_MASK                       (((1U<<16)-1) << PERI_HRTIM_Master_MCNTR_BIT_MCNT_SHIFT)

/*--- register MPER -------------------------------------------------*/
#define PERI_HRTIM_Master_MPER_BIT_MPER_SHIFT                       (0U)
#define PERI_HRTIM_Master_MPER_BIT_MPER_MASK                        (((1U<<16)-1) << PERI_HRTIM_Master_MPER_BIT_MPER_SHIFT)

