minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OUTAR -------------------------------------------------*/
#define PERI_HRTIM_TIMA_OUTAR_BIT_POL1_SHIFT                        (1U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_POL1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_POL1_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLEM1_SHIFT                      (2U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLEM1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_IDLEM1_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLES1_SHIFT                      (3U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLES1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_IDLES1_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_FAULT1_SHIFT                      (4U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_FAULT1_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_FAULT1_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_CHP1_SHIFT                        (6U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_CHP1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_CHP1_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DIDL1_SHIFT                       (7U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DIDL1_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_DIDL1_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DTEN_SHIFT                        (8U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DTEN_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_DTEN_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DLYPRTEN_SHIFT                    (9U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DLYPRTEN_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_DLYPRTEN_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DLYPRT_SHIFT                      (10U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DLYPRT_MASK                       (((1U<<3)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_POL2_SHIFT                        (17U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_POL2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_POL2_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLEM2_SHIFT                      (18U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLEM2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_IDLEM2_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLES2_SHIFT                      (19U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_IDLES2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_IDLES2_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_FAULT2_SHIFT                      (20U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_FAULT2_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_FAULT2_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_CHP2_SHIFT                        (22U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_CHP2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_CHP2_SHIFT)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DIDL2_SHIFT                       (23U)
#define PERI_HRTIM_TIMA_OUTAR_BIT_DIDL2_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMA_OUTAR_BIT_DIDL2_SHIFT)

/*--- register FLTAR -------------------------------------------------*/
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT1EN_SHIFT                      (0U)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT1EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_FLTAR_BIT_FLT1EN_SHIFT)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT2EN_SHIFT                      (1U)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT2EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_FLTAR_BIT_FLT2EN_SHIFT)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT3EN_SHIFT                      (2U)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT3EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_FLTAR_BIT_FLT3EN_SHIFT)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT4EN_SHIFT                      (3U)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT4EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_FLTAR_BIT_FLT4EN_SHIFT)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT5EN_SHIFT                      (4U)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLT5EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_FLTAR_BIT_FLT5EN_SHIFT)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLTLCK_SHIFT                      (31U)
#define PERI_HRTIM_TIMA_FLTAR_BIT_FLTLCK_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMA_FLTAR_BIT_FLTLCK_SHIFT)

/*--- register TIMBCR -------------------------------------------------*/
#define PERI_HRTIM_TIMB_TIMBCR_BIT_CK_PSCX_SHIFT                    (0U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_CK_PSCX_MASK                     (((1U<<3)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_CK_PSCX_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_CONT_SHIFT                       (3U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_CONT_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_CONT_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_RETRIG_SHIFT                     (4U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_RETRIG_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_RETRIG_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_HALF_SHIFT                       (5U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_HALF_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_HALF_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_PSHPLL_SHIFT                     (6U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_PSHPLL_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_PSHPLL_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_SYNCRSTX_SHIFT                   (10U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_SYNCRSTX_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_SYNCRSTX_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_SYNCSTRTX_SHIFT                  (11U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_SYNCSTRTX_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_SYNCSTRTX_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_DELCMP2_SHIFT                    (12U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_DELCMP2_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_DELCMP2_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_DELCMP4_SHIFT                    (14U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_DELCMP4_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_DELCMP4_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TXREPU_SHIFT                     (17U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TXREPU_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_TXREPU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TXRSTU_SHIFT                     (18U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TXRSTU_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_TXRSTU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TBU_SHIFT                        (20U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TBU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_TBU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TCU_SHIFT                        (21U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TCU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_TCU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TDU_SHIFT                        (22U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TDU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_TDU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TEU_SHIFT                        (23U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_TEU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_TEU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_MSTU_SHIFT                       (24U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_MSTU_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_MSTU_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_DACSYNC_SHIFT                    (25U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_DACSYNC_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_DACSYNC_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_PREEN_SHIFT                      (27U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_PREEN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_PREEN_SHIFT)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_UPDGAT_SHIFT                     (28U)
#define PERI_HRTIM_TIMB_TIMBCR_BIT_UPDGAT_MASK                      (((1U<<4)-1) << PERI_HRTIM_TIMB_TIMBCR_BIT_UPDGAT_SHIFT)

/*--- register TIMBISR -------------------------------------------------*/
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP1_SHIFT                      (0U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CMP1_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP2_SHIFT                      (1U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CMP2_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP3_SHIFT                      (2U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP3_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CMP3_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP4_SHIFT                      (3U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CMP4_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CMP4_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_REP_SHIFT                       (4U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_REP_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_REP_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_UPD_SHIFT                       (6U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_UPD_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_UPD_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CPT1_SHIFT                      (7U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CPT1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CPT1_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CPT2_SHIFT                      (8U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CPT2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CPT2_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_SETX1_SHIFT                     (9U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_SETX1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_SETX1_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_RSTX1_SHIFT                     (10U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_RSTX1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_RSTX1_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_SETX2_SHIFT                     (11U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_SETX2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_SETX2_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_RSTX2_SHIFT                     (12U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_RSTX2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_RSTX2_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_RST_SHIFT                       (13U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_RST_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_RST_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_DLYPRT_SHIFT                    (14U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_DLYPRT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CPPSTAT_SHIFT                   (16U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_CPPSTAT_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_CPPSTAT_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_IPPSTAT_SHIFT                   (17U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_IPPSTAT_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_IPPSTAT_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_O1STAT_SHIFT                    (18U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_O1STAT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_O1STAT_SHIFT)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_O2STAT_SHIFT                    (19U)
#define PERI_HRTIM_TIMB_TIMBISR_BIT_O2STAT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBISR_BIT_O2STAT_SHIFT)

/*--- register TIMBICR -------------------------------------------------*/
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP1C_SHIFT                     (0U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_CMP1C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP2C_SHIFT                     (1U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_CMP2C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP3C_SHIFT                     (2U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP3C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_CMP3C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP4C_SHIFT                     (3U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CMP4C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_CMP4C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_REPC_SHIFT                      (4U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_REPC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_REPC_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_UPDC_SHIFT                      (6U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_UPDC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_UPDC_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CPT1C_SHIFT                     (7U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CPT1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_CPT1C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CPT2C_SHIFT                     (8U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_CPT2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_CPT2C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_SET1XC_SHIFT                    (9U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_SET1XC_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_SET1XC_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_RSTX1C_SHIFT                    (10U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_RSTX1C_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_RSTX1C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_SET2XC_SHIFT                    (11U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_SET2XC_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_SET2XC_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_RSTX2C_SHIFT                    (12U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_RSTX2C_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_RSTX2C_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_RSTC_SHIFT                      (13U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_RSTC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_RSTC_SHIFT)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_DLYPRTC_SHIFT                   (14U)
#define PERI_HRTIM_TIMB_TIMBICR_BIT_DLYPRTC_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMB_TIMBICR_BIT_DLYPRTC_SHIFT)

