minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register EEFBR1 -------------------------------------------------*/
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE1LTCH_SHIFT                    (0U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE1LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE1LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE1FLTR_SHIFT                    (1U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE1FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE1FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE2LTCH_SHIFT                    (6U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE2LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE2LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE2FLTR_SHIFT                    (7U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE2FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE2FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE3LTCH_SHIFT                    (12U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE3LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE3LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE3FLTR_SHIFT                    (13U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE3FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE3FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE4LTCH_SHIFT                    (18U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE4LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE4LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE4FLTR_SHIFT                    (19U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE4FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE4FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE5LTCH_SHIFT                    (24U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE5LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE5LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE5FLTR_SHIFT                    (25U)
#define PERI_HRTIM_TIMB_EEFBR1_BIT_EE5FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR1_BIT_EE5FLTR_SHIFT)

/*--- register EEFBR2 -------------------------------------------------*/
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE6LTCH_SHIFT                    (0U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE6LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE6LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE6FLTR_SHIFT                    (1U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE6FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE6FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE7LTCH_SHIFT                    (6U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE7LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE7LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE7FLTR_SHIFT                    (7U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE7FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE7FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE8LTCH_SHIFT                    (12U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE8LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE8LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE8FLTR_SHIFT                    (13U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE8FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE8FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE9LTCH_SHIFT                    (18U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE9LTCH_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE9LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE9FLTR_SHIFT                    (19U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE9FLTR_MASK                     (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE9FLTR_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE10LTCH_SHIFT                   (24U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE10LTCH_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE10LTCH_SHIFT)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE10FLTR_SHIFT                   (25U)
#define PERI_HRTIM_TIMB_EEFBR2_BIT_EE10FLTR_MASK                    (((1U<<4)-1) << PERI_HRTIM_TIMB_EEFBR2_BIT_EE10FLTR_SHIFT)

/*--- register RSTBR -------------------------------------------------*/
#define PERI_HRTIM_TIMB_RSTBR_BIT_UPDT_SHIFT                        (1U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_UPDT_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_UPDT_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_CMP2_SHIFT                        (2U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_CMP2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_CMP2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_CMP4_SHIFT                        (3U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_CMP4_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_CMP4_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTPER_SHIFT                      (4U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTPER_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_MSTPER_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP1_SHIFT                     (5U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP1_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP2_SHIFT                     (6U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP3_SHIFT                     (7U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP3_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP3_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP4_SHIFT                     (8U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP4_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_MSTCMP4_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT1_SHIFT                    (9U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT1_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT2_SHIFT                    (10U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT3_SHIFT                    (11U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT3_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT3_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT4_SHIFT                    (12U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT4_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT5_SHIFT                    (13U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT5_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT5_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT6_SHIFT                    (14U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT6_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT6_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT7_SHIFT                    (15U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT7_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT7_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT8_SHIFT                    (16U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT8_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT8_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT9_SHIFT                    (17U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT9_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT9_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT10_SHIFT                   (18U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT10_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_EXTEVNT10_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP1_SHIFT                    (19U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP1_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP2_SHIFT                    (20U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP4_SHIFT                    (21U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMACMP4_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP1_SHIFT                    (22U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP1_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP2_SHIFT                    (23U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP4_SHIFT                    (24U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMCCMP4_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP1_SHIFT                    (25U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP1_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP2_SHIFT                    (26U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP4_SHIFT                    (27U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMDCMP4_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP1_SHIFT                    (28U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP1_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP2_SHIFT                    (29U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP2_SHIFT)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP4_SHIFT                    (30U)
#define PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMB_RSTBR_BIT_TIMECMP4_SHIFT)

