minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OUTCR -------------------------------------------------*/
#define PERI_HRTIM_TIMC_OUTCR_BIT_POL1_SHIFT                        (1U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_POL1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_POL1_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLEM1_SHIFT                      (2U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLEM1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_IDLEM1_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLES1_SHIFT                      (3U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLES1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_IDLES1_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_FAULT1_SHIFT                      (4U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_FAULT1_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_FAULT1_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_CHP1_SHIFT                        (6U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_CHP1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_CHP1_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DIDL1_SHIFT                       (7U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DIDL1_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_DIDL1_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DTEN_SHIFT                        (8U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DTEN_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_DTEN_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DLYPRTEN_SHIFT                    (9U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DLYPRTEN_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_DLYPRTEN_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DLYPRT_SHIFT                      (10U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DLYPRT_MASK                       (((1U<<3)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_POL2_SHIFT                        (17U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_POL2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_POL2_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLEM2_SHIFT                      (18U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLEM2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_IDLEM2_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLES2_SHIFT                      (19U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_IDLES2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_IDLES2_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_FAULT2_SHIFT                      (20U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_FAULT2_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_FAULT2_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_CHP2_SHIFT                        (22U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_CHP2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_CHP2_SHIFT)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DIDL2_SHIFT                       (23U)
#define PERI_HRTIM_TIMC_OUTCR_BIT_DIDL2_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMC_OUTCR_BIT_DIDL2_SHIFT)

/*--- register FLTCR -------------------------------------------------*/
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT1EN_SHIFT                      (0U)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT1EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_FLTCR_BIT_FLT1EN_SHIFT)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT2EN_SHIFT                      (1U)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT2EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_FLTCR_BIT_FLT2EN_SHIFT)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT3EN_SHIFT                      (2U)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT3EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_FLTCR_BIT_FLT3EN_SHIFT)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT4EN_SHIFT                      (3U)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT4EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_FLTCR_BIT_FLT4EN_SHIFT)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT5EN_SHIFT                      (4U)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLT5EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_FLTCR_BIT_FLT5EN_SHIFT)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLTLCK_SHIFT                      (31U)
#define PERI_HRTIM_TIMC_FLTCR_BIT_FLTLCK_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMC_FLTCR_BIT_FLTLCK_SHIFT)

/*--- register TIMDCR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_TIMDCR_BIT_CK_PSCX_SHIFT                    (0U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_CK_PSCX_MASK                     (((1U<<3)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_CK_PSCX_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_CONT_SHIFT                       (3U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_CONT_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_CONT_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_RETRIG_SHIFT                     (4U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_RETRIG_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_RETRIG_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_HALF_SHIFT                       (5U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_HALF_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_HALF_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_PSHPLL_SHIFT                     (6U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_PSHPLL_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_PSHPLL_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_SYNCRSTX_SHIFT                   (10U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_SYNCRSTX_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_SYNCRSTX_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_SYNCSTRTX_SHIFT                  (11U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_SYNCSTRTX_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_SYNCSTRTX_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_DELCMP2_SHIFT                    (12U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_DELCMP2_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_DELCMP2_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_DELCMP4_SHIFT                    (14U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_DELCMP4_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_DELCMP4_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TXREPU_SHIFT                     (17U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TXREPU_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_TXREPU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TXRSTU_SHIFT                     (18U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TXRSTU_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_TXRSTU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TBU_SHIFT                        (20U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TBU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_TBU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TCU_SHIFT                        (21U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TCU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_TCU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TDU_SHIFT                        (22U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TDU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_TDU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TEU_SHIFT                        (23U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_TEU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_TEU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_MSTU_SHIFT                       (24U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_MSTU_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_MSTU_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_DACSYNC_SHIFT                    (25U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_DACSYNC_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_DACSYNC_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_PREEN_SHIFT                      (27U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_PREEN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_PREEN_SHIFT)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_UPDGAT_SHIFT                     (28U)
#define PERI_HRTIM_TIMD_TIMDCR_BIT_UPDGAT_MASK                      (((1U<<4)-1) << PERI_HRTIM_TIMD_TIMDCR_BIT_UPDGAT_SHIFT)

/*--- register TIMDISR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP1_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CMP1_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP2_SHIFT                      (1U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CMP2_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP3_SHIFT                      (2U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP3_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CMP3_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP4_SHIFT                      (3U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CMP4_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CMP4_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_REP_SHIFT                       (4U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_REP_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_REP_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_UPD_SHIFT                       (6U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_UPD_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_UPD_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CPT1_SHIFT                      (7U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CPT1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CPT1_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CPT2_SHIFT                      (8U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CPT2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CPT2_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_SETX1_SHIFT                     (9U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_SETX1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_SETX1_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_RSTX1_SHIFT                     (10U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_RSTX1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_RSTX1_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_SETX2_SHIFT                     (11U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_SETX2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_SETX2_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_RSTX2_SHIFT                     (12U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_RSTX2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_RSTX2_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_RST_SHIFT                       (13U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_RST_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_RST_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_DLYPRT_SHIFT                    (14U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_DLYPRT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CPPSTAT_SHIFT                   (16U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_CPPSTAT_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_CPPSTAT_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_IPPSTAT_SHIFT                   (17U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_IPPSTAT_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_IPPSTAT_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_O1STAT_SHIFT                    (18U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_O1STAT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_O1STAT_SHIFT)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_O2STAT_SHIFT                    (19U)
#define PERI_HRTIM_TIMD_TIMDISR_BIT_O2STAT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDISR_BIT_O2STAT_SHIFT)

/*--- register TIMDICR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP1C_SHIFT                     (0U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_CMP1C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP2C_SHIFT                     (1U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_CMP2C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP3C_SHIFT                     (2U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP3C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_CMP3C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP4C_SHIFT                     (3U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CMP4C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_CMP4C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_REPC_SHIFT                      (4U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_REPC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_REPC_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_UPDC_SHIFT                      (6U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_UPDC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_UPDC_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CPT1C_SHIFT                     (7U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CPT1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_CPT1C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CPT2C_SHIFT                     (8U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_CPT2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_CPT2C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_SET1XC_SHIFT                    (9U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_SET1XC_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_SET1XC_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_RSTX1C_SHIFT                    (10U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_RSTX1C_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_RSTX1C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_SET2XC_SHIFT                    (11U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_SET2XC_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_SET2XC_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_RSTX2C_SHIFT                    (12U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_RSTX2C_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_RSTX2C_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_RSTC_SHIFT                      (13U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_RSTC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_RSTC_SHIFT)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_DLYPRTC_SHIFT                   (14U)
#define PERI_HRTIM_TIMD_TIMDICR_BIT_DLYPRTC_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDICR_BIT_DLYPRTC_SHIFT)

/*--- register TIMDDIER5 -------------------------------------------------*/
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP1IE_SHIFT                  (0U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP1IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP1IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP2IE_SHIFT                  (1U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP2IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP2IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP3IE_SHIFT                  (2U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP3IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP3IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP4IE_SHIFT                  (3U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP4IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP4IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_REPIE_SHIFT                   (4U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_REPIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_REPIE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_UPDIE_SHIFT                   (6U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_UPDIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_UPDIE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT1IE_SHIFT                  (7U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT1IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT1IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT2IE_SHIFT                  (8U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT2IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT2IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SET1XIE_SHIFT                 (9U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SET1XIE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_SET1XIE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX1IE_SHIFT                 (10U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX1IE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX1IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SETX2IE_SHIFT                 (11U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SETX2IE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_SETX2IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX2IE_SHIFT                 (12U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX2IE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX2IE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTIE_SHIFT                   (13U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTIE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_DLYPRTIE_SHIFT                (14U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_DLYPRTIE_MASK                 (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_DLYPRTIE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP1DE_SHIFT                  (16U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP1DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP1DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP2DE_SHIFT                  (17U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP2DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP2DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP3DE_SHIFT                  (18U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP3DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP3DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP4DE_SHIFT                  (19U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP4DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CMP4DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_REPDE_SHIFT                   (20U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_REPDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_REPDE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_UPDDE_SHIFT                   (22U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_UPDDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_UPDDE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT1DE_SHIFT                  (23U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT1DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT1DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT2DE_SHIFT                  (24U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT2DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_CPT2DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SET1XDE_SHIFT                 (25U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SET1XDE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_SET1XDE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX1DE_SHIFT                 (26U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX1DE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX1DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SETX2DE_SHIFT                 (27U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_SETX2DE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_SETX2DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX2DE_SHIFT                 (28U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX2DE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTX2DE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTDE_SHIFT                   (29U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_RSTDE_SHIFT)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_DLYPRTDE_SHIFT                (30U)
#define PERI_HRTIM_TIMD_TIMDDIER5_BIT_DLYPRTDE_MASK                 (((1U<<1)-1) << PERI_HRTIM_TIMD_TIMDDIER5_BIT_DLYPRTDE_SHIFT)

/*--- register CNTDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CNTDR_BIT_CNTX_SHIFT                        (0U)
#define PERI_HRTIM_TIMD_CNTDR_BIT_CNTX_MASK                         (((1U<<16)-1) << PERI_HRTIM_TIMD_CNTDR_BIT_CNTX_SHIFT)

/*--- register PERDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_PERDR_BIT_PERX_SHIFT                        (0U)
#define PERI_HRTIM_TIMD_PERDR_BIT_PERX_MASK                         (((1U<<16)-1) << PERI_HRTIM_TIMD_PERDR_BIT_PERX_SHIFT)

/*--- register REPDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_REPDR_BIT_REPX_SHIFT                        (0U)
#define PERI_HRTIM_TIMD_REPDR_BIT_REPX_MASK                         (((1U<<8)-1) << PERI_HRTIM_TIMD_REPDR_BIT_REPX_SHIFT)

/*--- register CMP1DR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CMP1DR_BIT_CMP1X_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_CMP1DR_BIT_CMP1X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIMD_CMP1DR_BIT_CMP1X_SHIFT)

/*--- register CMP1CDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CMP1CDR_BIT_CMP1X_SHIFT                     (0U)
#define PERI_HRTIM_TIMD_CMP1CDR_BIT_CMP1X_MASK                      (((1U<<16)-1) << PERI_HRTIM_TIMD_CMP1CDR_BIT_CMP1X_SHIFT)
#define PERI_HRTIM_TIMD_CMP1CDR_BIT_REPX_SHIFT                      (16U)
#define PERI_HRTIM_TIMD_CMP1CDR_BIT_REPX_MASK                       (((1U<<8)-1) << PERI_HRTIM_TIMD_CMP1CDR_BIT_REPX_SHIFT)

/*--- register CMP2DR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CMP2DR_BIT_CMP2X_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_CMP2DR_BIT_CMP2X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIMD_CMP2DR_BIT_CMP2X_SHIFT)

/*--- register CMP3DR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CMP3DR_BIT_CMP3X_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_CMP3DR_BIT_CMP3X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIMD_CMP3DR_BIT_CMP3X_SHIFT)

/*--- register CMP4DR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CMP4DR_BIT_CMP4X_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_CMP4DR_BIT_CMP4X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIMD_CMP4DR_BIT_CMP4X_SHIFT)

