minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CHPDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CHPDR_BIT_CHPFRQ_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_CHPDR_BIT_CHPFRQ_MASK                       (((1U<<4)-1) << PERI_HRTIM_TIMD_CHPDR_BIT_CHPFRQ_SHIFT)
#define PERI_HRTIM_TIMD_CHPDR_BIT_CHPDTY_SHIFT                      (4U)
#define PERI_HRTIM_TIMD_CHPDR_BIT_CHPDTY_MASK                       (((1U<<3)-1) << PERI_HRTIM_TIMD_CHPDR_BIT_CHPDTY_SHIFT)
#define PERI_HRTIM_TIMD_CHPDR_BIT_STRTPW_SHIFT                      (7U)
#define PERI_HRTIM_TIMD_CHPDR_BIT_STRTPW_MASK                       (((1U<<4)-1) << PERI_HRTIM_TIMD_CHPDR_BIT_STRTPW_SHIFT)

/*--- register CPT1DCR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_SWCPT_SHIFT                     (0U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_SWCPT_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_SWCPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_UDPCPT_SHIFT                    (1U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_UDPCPT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_UDPCPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV1CPT_SHIFT                  (2U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV1CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV1CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV2CPT_SHIFT                  (3U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV2CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV2CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV3CPT_SHIFT                  (4U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV3CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV3CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV4CPT_SHIFT                  (5U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV4CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV4CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV5CPT_SHIFT                  (6U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV5CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV5CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV6CPT_SHIFT                  (7U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV6CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV6CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV7CPT_SHIFT                  (8U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV7CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV7CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV8CPT_SHIFT                  (9U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV8CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV8CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV9CPT_SHIFT                  (10U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV9CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV9CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV10CPT_SHIFT                 (11U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV10CPT_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_EXEV10CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TA1SET_SHIFT                    (12U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TA1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TA1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TA1RST_SHIFT                    (13U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TA1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TA1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TACMP1_SHIFT                    (14U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TACMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TACMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TACMP2_SHIFT                    (15U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TACMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TACMP2_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TB1SET_SHIFT                    (16U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TB1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TB1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TB1RST_SHIFT                    (17U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TB1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TB1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TBCMP1_SHIFT                    (18U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TBCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TBCMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TBCMP2_SHIFT                    (19U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TBCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TBCMP2_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TC1SET_SHIFT                    (20U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TC1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TC1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TC1RST_SHIFT                    (21U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TC1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TC1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TCCMP1_SHIFT                    (22U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TCCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TCCMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TCCMP2_SHIFT                    (23U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TCCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TCCMP2_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TE1SET_SHIFT                    (28U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TE1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TE1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TE1RST_SHIFT                    (29U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TE1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TE1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TECMP1_SHIFT                    (30U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TECMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TECMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TECMP2_SHIFT                    (31U)
#define PERI_HRTIM_TIMD_CPT1DCR_BIT_TECMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT1DCR_BIT_TECMP2_SHIFT)

/*--- register CPT2DCR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_SWCPT_SHIFT                     (0U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_SWCPT_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_SWCPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_UDPCPT_SHIFT                    (1U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_UDPCPT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_UDPCPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV1CPT_SHIFT                  (2U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV1CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV1CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV2CPT_SHIFT                  (3U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV2CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV2CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV3CPT_SHIFT                  (4U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV3CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV3CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV4CPT_SHIFT                  (5U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV4CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV4CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV5CPT_SHIFT                  (6U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV5CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV5CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV6CPT_SHIFT                  (7U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV6CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV6CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV7CPT_SHIFT                  (8U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV7CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV7CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV8CPT_SHIFT                  (9U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV8CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV8CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV9CPT_SHIFT                  (10U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV9CPT_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV9CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV10CPT_SHIFT                 (11U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV10CPT_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_EXEV10CPT_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TA1SET_SHIFT                    (12U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TA1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TA1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TA1RST_SHIFT                    (13U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TA1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TA1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TACMP1_SHIFT                    (14U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TACMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TACMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TACMP2_SHIFT                    (15U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TACMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TACMP2_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TB1SET_SHIFT                    (16U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TB1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TB1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TB1RST_SHIFT                    (17U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TB1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TB1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TBCMP1_SHIFT                    (18U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TBCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TBCMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TBCMP2_SHIFT                    (19U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TBCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TBCMP2_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TC1SET_SHIFT                    (20U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TC1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TC1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TC1RST_SHIFT                    (21U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TC1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TC1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TCCMP1_SHIFT                    (22U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TCCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TCCMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TCCMP2_SHIFT                    (23U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TCCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TCCMP2_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TE1SET_SHIFT                    (28U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TE1SET_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TE1SET_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TE1RST_SHIFT                    (29U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TE1RST_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TE1RST_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TECMP1_SHIFT                    (30U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TECMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TECMP1_SHIFT)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TECMP2_SHIFT                    (31U)
#define PERI_HRTIM_TIMD_CPT2DCR_BIT_TECMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_CPT2DCR_BIT_TECMP2_SHIFT)

/*--- register OUTDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_OUTDR_BIT_POL1_SHIFT                        (1U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_POL1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_POL1_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLEM1_SHIFT                      (2U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLEM1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_IDLEM1_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLES1_SHIFT                      (3U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLES1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_IDLES1_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_FAULT1_SHIFT                      (4U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_FAULT1_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_FAULT1_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_CHP1_SHIFT                        (6U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_CHP1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_CHP1_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DIDL1_SHIFT                       (7U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DIDL1_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_DIDL1_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DTEN_SHIFT                        (8U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DTEN_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_DTEN_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DLYPRTEN_SHIFT                    (9U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DLYPRTEN_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_DLYPRTEN_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DLYPRT_SHIFT                      (10U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DLYPRT_MASK                       (((1U<<3)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_POL2_SHIFT                        (17U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_POL2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_POL2_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLEM2_SHIFT                      (18U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLEM2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_IDLEM2_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLES2_SHIFT                      (19U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_IDLES2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_IDLES2_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_FAULT2_SHIFT                      (20U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_FAULT2_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_FAULT2_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_CHP2_SHIFT                        (22U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_CHP2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_CHP2_SHIFT)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DIDL2_SHIFT                       (23U)
#define PERI_HRTIM_TIMD_OUTDR_BIT_DIDL2_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIMD_OUTDR_BIT_DIDL2_SHIFT)

