minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register FLTDR -------------------------------------------------*/
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT1EN_SHIFT                      (0U)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT1EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_FLTDR_BIT_FLT1EN_SHIFT)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT2EN_SHIFT                      (1U)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT2EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_FLTDR_BIT_FLT2EN_SHIFT)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT3EN_SHIFT                      (2U)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT3EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_FLTDR_BIT_FLT3EN_SHIFT)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT4EN_SHIFT                      (3U)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT4EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_FLTDR_BIT_FLT4EN_SHIFT)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT5EN_SHIFT                      (4U)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLT5EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_FLTDR_BIT_FLT5EN_SHIFT)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLTLCK_SHIFT                      (31U)
#define PERI_HRTIM_TIMD_FLTDR_BIT_FLTLCK_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIMD_FLTDR_BIT_FLTLCK_SHIFT)

/*--- register TIMECR -------------------------------------------------*/
#define PERI_HRTIM_TIME_TIMECR_BIT_CK_PSCX_SHIFT                    (0U)
#define PERI_HRTIM_TIME_TIMECR_BIT_CK_PSCX_MASK                     (((1U<<3)-1) << PERI_HRTIM_TIME_TIMECR_BIT_CK_PSCX_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_CONT_SHIFT                       (3U)
#define PERI_HRTIM_TIME_TIMECR_BIT_CONT_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_CONT_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_RETRIG_SHIFT                     (4U)
#define PERI_HRTIM_TIME_TIMECR_BIT_RETRIG_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_RETRIG_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_HALF_SHIFT                       (5U)
#define PERI_HRTIM_TIME_TIMECR_BIT_HALF_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_HALF_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_PSHPLL_SHIFT                     (6U)
#define PERI_HRTIM_TIME_TIMECR_BIT_PSHPLL_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_PSHPLL_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_SYNCRSTX_SHIFT                   (10U)
#define PERI_HRTIM_TIME_TIMECR_BIT_SYNCRSTX_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_SYNCRSTX_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_SYNCSTRTX_SHIFT                  (11U)
#define PERI_HRTIM_TIME_TIMECR_BIT_SYNCSTRTX_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_SYNCSTRTX_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_DELCMP2_SHIFT                    (12U)
#define PERI_HRTIM_TIME_TIMECR_BIT_DELCMP2_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIME_TIMECR_BIT_DELCMP2_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_DELCMP4_SHIFT                    (14U)
#define PERI_HRTIM_TIME_TIMECR_BIT_DELCMP4_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIME_TIMECR_BIT_DELCMP4_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_TXREPU_SHIFT                     (17U)
#define PERI_HRTIM_TIME_TIMECR_BIT_TXREPU_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_TXREPU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_TXRSTU_SHIFT                     (18U)
#define PERI_HRTIM_TIME_TIMECR_BIT_TXRSTU_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_TXRSTU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_TBU_SHIFT                        (20U)
#define PERI_HRTIM_TIME_TIMECR_BIT_TBU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_TBU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_TCU_SHIFT                        (21U)
#define PERI_HRTIM_TIME_TIMECR_BIT_TCU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_TCU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_TDU_SHIFT                        (22U)
#define PERI_HRTIM_TIME_TIMECR_BIT_TDU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_TDU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_TEU_SHIFT                        (23U)
#define PERI_HRTIM_TIME_TIMECR_BIT_TEU_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_TEU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_MSTU_SHIFT                       (24U)
#define PERI_HRTIM_TIME_TIMECR_BIT_MSTU_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_MSTU_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_DACSYNC_SHIFT                    (25U)
#define PERI_HRTIM_TIME_TIMECR_BIT_DACSYNC_MASK                     (((1U<<2)-1) << PERI_HRTIM_TIME_TIMECR_BIT_DACSYNC_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_PREEN_SHIFT                      (27U)
#define PERI_HRTIM_TIME_TIMECR_BIT_PREEN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMECR_BIT_PREEN_SHIFT)
#define PERI_HRTIM_TIME_TIMECR_BIT_UPDGAT_SHIFT                     (28U)
#define PERI_HRTIM_TIME_TIMECR_BIT_UPDGAT_MASK                      (((1U<<4)-1) << PERI_HRTIM_TIME_TIMECR_BIT_UPDGAT_SHIFT)

/*--- register TIMEISR -------------------------------------------------*/
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP1_SHIFT                      (0U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CMP1_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP2_SHIFT                      (1U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CMP2_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP3_SHIFT                      (2U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP3_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CMP3_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP4_SHIFT                      (3U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CMP4_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CMP4_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_REP_SHIFT                       (4U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_REP_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_REP_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_UPD_SHIFT                       (6U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_UPD_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_UPD_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CPT1_SHIFT                      (7U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CPT1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CPT1_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CPT2_SHIFT                      (8U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CPT2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CPT2_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_SETX1_SHIFT                     (9U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_SETX1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_SETX1_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_RSTX1_SHIFT                     (10U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_RSTX1_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_RSTX1_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_SETX2_SHIFT                     (11U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_SETX2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_SETX2_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_RSTX2_SHIFT                     (12U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_RSTX2_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_RSTX2_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_RST_SHIFT                       (13U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_RST_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_RST_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_DLYPRT_SHIFT                    (14U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_DLYPRT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CPPSTAT_SHIFT                   (16U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_CPPSTAT_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_CPPSTAT_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_IPPSTAT_SHIFT                   (17U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_IPPSTAT_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_IPPSTAT_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_O1STAT_SHIFT                    (18U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_O1STAT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_O1STAT_SHIFT)
#define PERI_HRTIM_TIME_TIMEISR_BIT_O2STAT_SHIFT                    (19U)
#define PERI_HRTIM_TIME_TIMEISR_BIT_O2STAT_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEISR_BIT_O2STAT_SHIFT)

