minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register TIMEICR -------------------------------------------------*/
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP1C_SHIFT                     (0U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_CMP1C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP2C_SHIFT                     (1U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_CMP2C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP3C_SHIFT                     (2U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP3C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_CMP3C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP4C_SHIFT                     (3U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CMP4C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_CMP4C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_REPC_SHIFT                      (4U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_REPC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_REPC_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_UPDC_SHIFT                      (6U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_UPDC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_UPDC_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CPT1C_SHIFT                     (7U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CPT1C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_CPT1C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CPT2C_SHIFT                     (8U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_CPT2C_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_CPT2C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_SET1XC_SHIFT                    (9U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_SET1XC_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_SET1XC_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_RSTX1C_SHIFT                    (10U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_RSTX1C_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_RSTX1C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_SET2XC_SHIFT                    (11U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_SET2XC_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_SET2XC_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_RSTX2C_SHIFT                    (12U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_RSTX2C_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_RSTX2C_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_RSTC_SHIFT                      (13U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_RSTC_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_RSTC_SHIFT)
#define PERI_HRTIM_TIME_TIMEICR_BIT_DLYPRTC_SHIFT                   (14U)
#define PERI_HRTIM_TIME_TIMEICR_BIT_DLYPRTC_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEICR_BIT_DLYPRTC_SHIFT)

/*--- register TIMEDIER5 -------------------------------------------------*/
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP1IE_SHIFT                  (0U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP1IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP1IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP2IE_SHIFT                  (1U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP2IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP2IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP3IE_SHIFT                  (2U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP3IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP3IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP4IE_SHIFT                  (3U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP4IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP4IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_REPIE_SHIFT                   (4U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_REPIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_REPIE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_UPDIE_SHIFT                   (6U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_UPDIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_UPDIE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT1IE_SHIFT                  (7U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT1IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT1IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT2IE_SHIFT                  (8U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT2IE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT2IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SET1XIE_SHIFT                 (9U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SET1XIE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_SET1XIE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX1IE_SHIFT                 (10U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX1IE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX1IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SETX2IE_SHIFT                 (11U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SETX2IE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_SETX2IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX2IE_SHIFT                 (12U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX2IE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX2IE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTIE_SHIFT                   (13U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTIE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTIE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_DLYPRTIE_SHIFT                (14U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_DLYPRTIE_MASK                 (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_DLYPRTIE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP1DE_SHIFT                  (16U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP1DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP1DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP2DE_SHIFT                  (17U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP2DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP2DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP3DE_SHIFT                  (18U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP3DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP3DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP4DE_SHIFT                  (19U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP4DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CMP4DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_REPDE_SHIFT                   (20U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_REPDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_REPDE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_UPDDE_SHIFT                   (22U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_UPDDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_UPDDE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT1DE_SHIFT                  (23U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT1DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT1DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT2DE_SHIFT                  (24U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT2DE_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_CPT2DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SET1XDE_SHIFT                 (25U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SET1XDE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_SET1XDE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX1DE_SHIFT                 (26U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX1DE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX1DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SETX2DE_SHIFT                 (27U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_SETX2DE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_SETX2DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX2DE_SHIFT                 (28U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX2DE_MASK                  (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTX2DE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTDE_SHIFT                   (29U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTDE_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_RSTDE_SHIFT)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_DLYPRTDE_SHIFT                (30U)
#define PERI_HRTIM_TIME_TIMEDIER5_BIT_DLYPRTDE_MASK                 (((1U<<1)-1) << PERI_HRTIM_TIME_TIMEDIER5_BIT_DLYPRTDE_SHIFT)

