minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CNTER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CNTER_BIT_CNTX_SHIFT                        (0U)
#define PERI_HRTIM_TIME_CNTER_BIT_CNTX_MASK                         (((1U<<16)-1) << PERI_HRTIM_TIME_CNTER_BIT_CNTX_SHIFT)

/*--- register PERER -------------------------------------------------*/
#define PERI_HRTIM_TIME_PERER_BIT_PERX_SHIFT                        (0U)
#define PERI_HRTIM_TIME_PERER_BIT_PERX_MASK                         (((1U<<16)-1) << PERI_HRTIM_TIME_PERER_BIT_PERX_SHIFT)

/*--- register REPER -------------------------------------------------*/
#define PERI_HRTIM_TIME_REPER_BIT_REPX_SHIFT                        (0U)
#define PERI_HRTIM_TIME_REPER_BIT_REPX_MASK                         (((1U<<8)-1) << PERI_HRTIM_TIME_REPER_BIT_REPX_SHIFT)

/*--- register CMP1ER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CMP1ER_BIT_CMP1X_SHIFT                      (0U)
#define PERI_HRTIM_TIME_CMP1ER_BIT_CMP1X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIME_CMP1ER_BIT_CMP1X_SHIFT)

/*--- register CMP1CER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CMP1CER_BIT_CMP1X_SHIFT                     (0U)
#define PERI_HRTIM_TIME_CMP1CER_BIT_CMP1X_MASK                      (((1U<<16)-1) << PERI_HRTIM_TIME_CMP1CER_BIT_CMP1X_SHIFT)
#define PERI_HRTIM_TIME_CMP1CER_BIT_REPX_SHIFT                      (16U)
#define PERI_HRTIM_TIME_CMP1CER_BIT_REPX_MASK                       (((1U<<8)-1) << PERI_HRTIM_TIME_CMP1CER_BIT_REPX_SHIFT)

/*--- register CMP2ER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CMP2ER_BIT_CMP2X_SHIFT                      (0U)
#define PERI_HRTIM_TIME_CMP2ER_BIT_CMP2X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIME_CMP2ER_BIT_CMP2X_SHIFT)

/*--- register CMP3ER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CMP3ER_BIT_CMP3X_SHIFT                      (0U)
#define PERI_HRTIM_TIME_CMP3ER_BIT_CMP3X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIME_CMP3ER_BIT_CMP3X_SHIFT)

/*--- register CMP4ER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CMP4ER_BIT_CMP4X_SHIFT                      (0U)
#define PERI_HRTIM_TIME_CMP4ER_BIT_CMP4X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIME_CMP4ER_BIT_CMP4X_SHIFT)

/*--- register CPT1ER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CPT1ER_BIT_CPT1X_SHIFT                      (0U)
#define PERI_HRTIM_TIME_CPT1ER_BIT_CPT1X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIME_CPT1ER_BIT_CPT1X_SHIFT)

/*--- register CPT2ER -------------------------------------------------*/
#define PERI_HRTIM_TIME_CPT2ER_BIT_CPT2X_SHIFT                      (0U)
#define PERI_HRTIM_TIME_CPT2ER_BIT_CPT2X_MASK                       (((1U<<16)-1) << PERI_HRTIM_TIME_CPT2ER_BIT_CPT2X_SHIFT)

/*--- register DTER -------------------------------------------------*/
#define PERI_HRTIM_TIME_DTER_BIT_DTRX_SHIFT                         (0U)
#define PERI_HRTIM_TIME_DTER_BIT_DTRX_MASK                          (((1U<<9)-1) << PERI_HRTIM_TIME_DTER_BIT_DTRX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_SDTRX_SHIFT                        (9U)
#define PERI_HRTIM_TIME_DTER_BIT_SDTRX_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_DTER_BIT_SDTRX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_DTPRSC_SHIFT                       (10U)
#define PERI_HRTIM_TIME_DTER_BIT_DTPRSC_MASK                        (((1U<<3)-1) << PERI_HRTIM_TIME_DTER_BIT_DTPRSC_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_DTRSLKX_SHIFT                      (14U)
#define PERI_HRTIM_TIME_DTER_BIT_DTRSLKX_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_DTER_BIT_DTRSLKX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_DTRLKX_SHIFT                       (15U)
#define PERI_HRTIM_TIME_DTER_BIT_DTRLKX_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_DTER_BIT_DTRLKX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_DTFX_SHIFT                         (16U)
#define PERI_HRTIM_TIME_DTER_BIT_DTFX_MASK                          (((1U<<9)-1) << PERI_HRTIM_TIME_DTER_BIT_DTFX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_SDTFX_SHIFT                        (25U)
#define PERI_HRTIM_TIME_DTER_BIT_SDTFX_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_DTER_BIT_SDTFX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_DTFSLKX_SHIFT                      (30U)
#define PERI_HRTIM_TIME_DTER_BIT_DTFSLKX_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_DTER_BIT_DTFSLKX_SHIFT)
#define PERI_HRTIM_TIME_DTER_BIT_DTFLKX_SHIFT                       (31U)
#define PERI_HRTIM_TIME_DTER_BIT_DTFLKX_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_DTER_BIT_DTFLKX_SHIFT)

/*--- register SETE1R -------------------------------------------------*/
#define PERI_HRTIM_TIME_SETE1R_BIT_SST_SHIFT                        (0U)
#define PERI_HRTIM_TIME_SETE1R_BIT_SST_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_SST_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_RESYNC_SHIFT                     (1U)
#define PERI_HRTIM_TIME_SETE1R_BIT_RESYNC_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_RESYNC_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_PER_SHIFT                        (2U)
#define PERI_HRTIM_TIME_SETE1R_BIT_PER_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_PER_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP1_SHIFT                       (3U)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP1_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_CMP1_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP2_SHIFT                       (4U)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP2_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_CMP2_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP3_SHIFT                       (5U)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP3_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_CMP3_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP4_SHIFT                       (6U)
#define PERI_HRTIM_TIME_SETE1R_BIT_CMP4_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_CMP4_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTPER_SHIFT                     (7U)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTPER_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_MSTPER_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP1_SHIFT                    (8U)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP1_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP2_SHIFT                    (9U)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP2_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP3_SHIFT                    (10U)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP3_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP3_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP4_SHIFT                    (11U)
#define PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_MSTCMP4_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT1_SHIFT                   (12U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT1_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT1_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT2_SHIFT                   (13U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT2_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT2_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT3_SHIFT                   (14U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT3_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT3_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT4_SHIFT                   (15U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT4_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT4_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT5_SHIFT                   (16U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT5_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT5_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT6_SHIFT                   (17U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT6_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT6_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT7_SHIFT                   (18U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT7_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT7_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT8_SHIFT                   (19U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT8_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT8_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT9_SHIFT                   (20U)
#define PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT9_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_TIMEVNT9_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT1_SHIFT                   (21U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT1_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT1_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT2_SHIFT                   (22U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT2_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT2_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT3_SHIFT                   (23U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT3_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT3_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT4_SHIFT                   (24U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT4_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT4_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT5_SHIFT                   (25U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT5_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT5_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT6_SHIFT                   (26U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT6_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT6_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT7_SHIFT                   (27U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT7_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT7_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT8_SHIFT                   (28U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT8_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT8_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT9_SHIFT                   (29U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT9_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT9_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT10_SHIFT                  (30U)
#define PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT10_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_EXTEVNT10_SHIFT)
#define PERI_HRTIM_TIME_SETE1R_BIT_UPDATE_SHIFT                     (31U)
#define PERI_HRTIM_TIME_SETE1R_BIT_UPDATE_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_SETE1R_BIT_UPDATE_SHIFT)

/*--- register RSTE1R -------------------------------------------------*/
#define PERI_HRTIM_TIME_RSTE1R_BIT_SRT_SHIFT                        (0U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_SRT_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_SRT_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_RESYNC_SHIFT                     (1U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_RESYNC_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_RESYNC_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_PER_SHIFT                        (2U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_PER_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_PER_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP1_SHIFT                       (3U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP1_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_CMP1_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP2_SHIFT                       (4U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP2_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_CMP2_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP3_SHIFT                       (5U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP3_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_CMP3_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP4_SHIFT                       (6U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_CMP4_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_CMP4_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTPER_SHIFT                     (7U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTPER_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_MSTPER_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP1_SHIFT                    (8U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP1_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP1_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP2_SHIFT                    (9U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP2_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP2_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP3_SHIFT                    (10U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP3_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP3_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP4_SHIFT                    (11U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP4_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_MSTCMP4_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT1_SHIFT                   (12U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT1_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT1_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT2_SHIFT                   (13U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT2_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT2_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT3_SHIFT                   (14U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT3_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT3_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT4_SHIFT                   (15U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT4_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT4_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT5_SHIFT                   (16U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT5_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT5_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT6_SHIFT                   (17U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT6_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT6_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT7_SHIFT                   (18U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT7_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT7_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT8_SHIFT                   (19U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT8_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT8_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT9_SHIFT                   (20U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT9_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_TIMEVNT9_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT1_SHIFT                   (21U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT1_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT1_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT2_SHIFT                   (22U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT2_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT2_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT3_SHIFT                   (23U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT3_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT3_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT4_SHIFT                   (24U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT4_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT4_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT5_SHIFT                   (25U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT5_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT5_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT6_SHIFT                   (26U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT6_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT6_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT7_SHIFT                   (27U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT7_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT7_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT8_SHIFT                   (28U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT8_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT8_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT9_SHIFT                   (29U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT9_MASK                    (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT9_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT10_SHIFT                  (30U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT10_MASK                   (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_EXTEVNT10_SHIFT)
#define PERI_HRTIM_TIME_RSTE1R_BIT_UPDATE_SHIFT                     (31U)
#define PERI_HRTIM_TIME_RSTE1R_BIT_UPDATE_MASK                      (((1U<<1)-1) << PERI_HRTIM_TIME_RSTE1R_BIT_UPDATE_SHIFT)

