minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OUTER -------------------------------------------------*/
#define PERI_HRTIM_TIME_OUTER_BIT_POL1_SHIFT                        (1U)
#define PERI_HRTIM_TIME_OUTER_BIT_POL1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_POL1_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLEM1_SHIFT                      (2U)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLEM1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_IDLEM1_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLES1_SHIFT                      (3U)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLES1_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_IDLES1_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_FAULT1_SHIFT                      (4U)
#define PERI_HRTIM_TIME_OUTER_BIT_FAULT1_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIME_OUTER_BIT_FAULT1_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_CHP1_SHIFT                        (6U)
#define PERI_HRTIM_TIME_OUTER_BIT_CHP1_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_CHP1_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_DIDL1_SHIFT                       (7U)
#define PERI_HRTIM_TIME_OUTER_BIT_DIDL1_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_DIDL1_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_DTEN_SHIFT                        (8U)
#define PERI_HRTIM_TIME_OUTER_BIT_DTEN_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_DTEN_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_DLYPRTEN_SHIFT                    (9U)
#define PERI_HRTIM_TIME_OUTER_BIT_DLYPRTEN_MASK                     (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_DLYPRTEN_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_DLYPRT_SHIFT                      (10U)
#define PERI_HRTIM_TIME_OUTER_BIT_DLYPRT_MASK                       (((1U<<3)-1) << PERI_HRTIM_TIME_OUTER_BIT_DLYPRT_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_POL2_SHIFT                        (17U)
#define PERI_HRTIM_TIME_OUTER_BIT_POL2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_POL2_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLEM2_SHIFT                      (18U)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLEM2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_IDLEM2_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLES2_SHIFT                      (19U)
#define PERI_HRTIM_TIME_OUTER_BIT_IDLES2_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_IDLES2_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_FAULT2_SHIFT                      (20U)
#define PERI_HRTIM_TIME_OUTER_BIT_FAULT2_MASK                       (((1U<<2)-1) << PERI_HRTIM_TIME_OUTER_BIT_FAULT2_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_CHP2_SHIFT                        (22U)
#define PERI_HRTIM_TIME_OUTER_BIT_CHP2_MASK                         (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_CHP2_SHIFT)
#define PERI_HRTIM_TIME_OUTER_BIT_DIDL2_SHIFT                       (23U)
#define PERI_HRTIM_TIME_OUTER_BIT_DIDL2_MASK                        (((1U<<1)-1) << PERI_HRTIM_TIME_OUTER_BIT_DIDL2_SHIFT)

/*--- register FLTER -------------------------------------------------*/
#define PERI_HRTIM_TIME_FLTER_BIT_FLT1EN_SHIFT                      (0U)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT1EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_FLTER_BIT_FLT1EN_SHIFT)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT2EN_SHIFT                      (1U)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT2EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_FLTER_BIT_FLT2EN_SHIFT)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT3EN_SHIFT                      (2U)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT3EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_FLTER_BIT_FLT3EN_SHIFT)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT4EN_SHIFT                      (3U)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT4EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_FLTER_BIT_FLT4EN_SHIFT)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT5EN_SHIFT                      (4U)
#define PERI_HRTIM_TIME_FLTER_BIT_FLT5EN_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_FLTER_BIT_FLT5EN_SHIFT)
#define PERI_HRTIM_TIME_FLTER_BIT_FLTLCK_SHIFT                      (31U)
#define PERI_HRTIM_TIME_FLTER_BIT_FLTLCK_MASK                       (((1U<<1)-1) << PERI_HRTIM_TIME_FLTER_BIT_FLTLCK_SHIFT)

/*--- register HSEM_R0 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R0_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R0_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R0_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R0_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R0_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R0_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R0_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R0_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R0_BIT_LOCK_SHIFT)

/*--- register HSEM_R1 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R1_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R1_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R1_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R1_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R1_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R1_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R1_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R1_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R1_BIT_LOCK_SHIFT)

/*--- register HSEM_R2 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R2_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R2_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R2_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R2_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R2_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R2_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R2_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R2_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R2_BIT_LOCK_SHIFT)

/*--- register HSEM_R3 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R3_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R3_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R3_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R3_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R3_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R3_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R3_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R3_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R3_BIT_LOCK_SHIFT)

/*--- register HSEM_R4 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R4_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R4_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R4_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R4_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R4_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R4_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R4_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R4_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R4_BIT_LOCK_SHIFT)

