minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register HSEM_R5 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R5_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R5_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R5_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R5_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R5_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R5_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R5_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R5_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R5_BIT_LOCK_SHIFT)

/*--- register HSEM_R6 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R6_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R6_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R6_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R6_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R6_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R6_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R6_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R6_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R6_BIT_LOCK_SHIFT)

/*--- register HSEM_R7 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R7_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R7_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R7_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R7_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R7_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R7_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R7_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R7_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R7_BIT_LOCK_SHIFT)

/*--- register HSEM_R8 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R8_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R8_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R8_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R8_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R8_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R8_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R8_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R8_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R8_BIT_LOCK_SHIFT)

/*--- register HSEM_R9 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R9_BIT_PROCID_SHIFT                          (0U)
#define PERI_HSEM_HSEM_R9_BIT_PROCID_MASK                           (((1U<<8)-1) << PERI_HSEM_HSEM_R9_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R9_BIT_MASTERID_SHIFT                        (8U)
#define PERI_HSEM_HSEM_R9_BIT_MASTERID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_R9_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R9_BIT_LOCK_SHIFT                            (31U)
#define PERI_HSEM_HSEM_R9_BIT_LOCK_MASK                             (((1U<<1)-1) << PERI_HSEM_HSEM_R9_BIT_LOCK_SHIFT)

/*--- register HSEM_R10 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R10_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R10_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R10_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R10_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R10_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R10_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R10_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R10_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R10_BIT_LOCK_SHIFT)

/*--- register HSEM_R11 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R11_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R11_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R11_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R11_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R11_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R11_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R11_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R11_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R11_BIT_LOCK_SHIFT)

/*--- register HSEM_R12 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R12_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R12_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R12_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R12_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R12_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R12_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R12_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R12_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R12_BIT_LOCK_SHIFT)

/*--- register HSEM_R13 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R13_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R13_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R13_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R13_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R13_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R13_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R13_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R13_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R13_BIT_LOCK_SHIFT)

/*--- register HSEM_R14 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R14_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R14_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R14_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R14_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R14_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R14_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R14_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R14_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R14_BIT_LOCK_SHIFT)

/*--- register HSEM_R15 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R15_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R15_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R15_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R15_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R15_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R15_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R15_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R15_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R15_BIT_LOCK_SHIFT)

