minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register HSEM_R16 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R16_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R16_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R16_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R16_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R16_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R16_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R16_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R16_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R16_BIT_LOCK_SHIFT)

/*--- register HSEM_R17 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R17_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R17_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R17_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R17_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R17_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R17_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R17_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R17_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R17_BIT_LOCK_SHIFT)

/*--- register HSEM_R18 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R18_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R18_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R18_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R18_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R18_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R18_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R18_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R18_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R18_BIT_LOCK_SHIFT)

/*--- register HSEM_R19 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R19_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R19_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R19_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R19_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R19_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R19_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R19_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R19_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R19_BIT_LOCK_SHIFT)

/*--- register HSEM_R20 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R20_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R20_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R20_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R20_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R20_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R20_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R20_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R20_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R20_BIT_LOCK_SHIFT)

/*--- register HSEM_R21 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R21_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R21_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R21_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R21_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R21_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R21_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R21_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R21_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R21_BIT_LOCK_SHIFT)

/*--- register HSEM_R22 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R22_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R22_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R22_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R22_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R22_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R22_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R22_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R22_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R22_BIT_LOCK_SHIFT)

/*--- register HSEM_R23 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R23_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R23_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R23_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R23_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R23_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R23_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R23_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R23_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R23_BIT_LOCK_SHIFT)

/*--- register HSEM_R24 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R24_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R24_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R24_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R24_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R24_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R24_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R24_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R24_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R24_BIT_LOCK_SHIFT)

/*--- register HSEM_R25 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R25_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R25_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R25_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R25_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R25_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R25_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R25_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R25_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R25_BIT_LOCK_SHIFT)

/*--- register HSEM_R26 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R26_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R26_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R26_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R26_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R26_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R26_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R26_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R26_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R26_BIT_LOCK_SHIFT)

/*--- register HSEM_R27 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R27_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R27_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R27_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R27_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R27_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R27_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R27_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R27_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R27_BIT_LOCK_SHIFT)

/*--- register HSEM_R28 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R28_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R28_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R28_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R28_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R28_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R28_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R28_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R28_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R28_BIT_LOCK_SHIFT)

/*--- register HSEM_R29 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R29_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R29_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R29_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R29_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R29_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R29_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R29_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R29_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R29_BIT_LOCK_SHIFT)

/*--- register HSEM_R30 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R30_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R30_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R30_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R30_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R30_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R30_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R30_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R30_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R30_BIT_LOCK_SHIFT)

/*--- register HSEM_R31 -------------------------------------------------*/
#define PERI_HSEM_HSEM_R31_BIT_PROCID_SHIFT                         (0U)
#define PERI_HSEM_HSEM_R31_BIT_PROCID_MASK                          (((1U<<8)-1) << PERI_HSEM_HSEM_R31_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_R31_BIT_MASTERID_SHIFT                       (8U)
#define PERI_HSEM_HSEM_R31_BIT_MASTERID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_R31_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_R31_BIT_LOCK_SHIFT                           (31U)
#define PERI_HSEM_HSEM_R31_BIT_LOCK_MASK                            (((1U<<1)-1) << PERI_HSEM_HSEM_R31_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR0 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR0_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR0_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR0_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR0_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR0_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR0_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR0_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR0_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR0_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR1 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR1_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR1_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR1_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR1_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR1_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR1_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR1_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR1_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR1_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR2 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR2_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR2_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR2_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR2_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR2_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR2_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR2_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR2_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR2_BIT_LOCK_SHIFT)

