minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register HSEM_RLR3 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR3_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR3_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR3_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR3_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR3_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR3_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR3_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR3_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR3_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR4 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR4_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR4_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR4_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR4_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR4_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR4_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR4_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR4_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR4_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR5 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR5_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR5_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR5_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR5_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR5_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR5_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR5_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR5_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR5_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR6 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR6_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR6_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR6_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR6_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR6_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR6_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR6_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR6_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR6_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR7 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR7_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR7_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR7_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR7_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR7_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR7_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR7_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR7_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR7_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR8 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR8_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR8_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR8_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR8_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR8_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR8_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR8_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR8_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR8_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR9 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR9_BIT_PROCID_SHIFT                        (0U)
#define PERI_HSEM_HSEM_RLR9_BIT_PROCID_MASK                         (((1U<<8)-1) << PERI_HSEM_HSEM_RLR9_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR9_BIT_MASTERID_SHIFT                      (8U)
#define PERI_HSEM_HSEM_RLR9_BIT_MASTERID_MASK                       (((1U<<8)-1) << PERI_HSEM_HSEM_RLR9_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR9_BIT_LOCK_SHIFT                          (31U)
#define PERI_HSEM_HSEM_RLR9_BIT_LOCK_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_RLR9_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR10 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR10_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR10_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR10_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR10_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR10_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR10_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR10_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR10_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR10_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR11 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR11_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR11_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR11_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR11_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR11_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR11_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR11_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR11_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR11_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR12 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR12_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR12_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR12_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR12_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR12_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR12_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR12_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR12_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR12_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR13 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR13_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR13_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR13_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR13_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR13_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR13_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR13_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR13_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR13_BIT_LOCK_SHIFT)

