minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register HSEM_RLR14 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR14_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR14_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR14_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR14_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR14_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR14_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR14_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR14_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR14_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR15 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR15_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR15_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR15_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR15_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR15_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR15_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR15_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR15_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR15_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR16 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR16_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR16_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR16_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR16_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR16_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR16_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR16_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR16_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR16_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR17 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR17_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR17_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR17_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR17_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR17_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR17_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR17_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR17_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR17_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR18 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR18_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR18_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR18_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR18_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR18_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR18_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR18_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR18_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR18_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR19 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR19_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR19_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR19_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR19_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR19_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR19_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR19_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR19_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR19_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR20 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR20_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR20_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR20_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR20_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR20_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR20_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR20_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR20_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR20_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR21 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR21_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR21_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR21_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR21_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR21_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR21_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR21_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR21_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR21_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR22 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR22_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR22_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR22_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR22_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR22_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR22_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR22_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR22_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR22_BIT_LOCK_SHIFT)

