minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register HSEM_RLR23 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR23_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR23_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR23_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR23_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR23_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR23_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR23_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR23_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR23_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR24 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR24_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR24_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR24_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR24_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR24_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR24_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR24_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR24_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR24_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR25 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR25_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR25_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR25_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR25_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR25_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR25_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR25_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR25_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR25_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR26 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR26_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR26_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR26_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR26_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR26_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR26_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR26_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR26_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR26_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR27 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR27_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR27_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR27_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR27_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR27_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR27_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR27_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR27_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR27_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR28 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR28_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR28_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR28_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR28_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR28_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR28_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR28_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR28_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR28_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR29 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR29_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR29_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR29_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR29_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR29_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR29_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR29_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR29_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR29_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR30 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR30_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR30_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR30_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR30_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR30_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR30_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR30_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR30_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR30_BIT_LOCK_SHIFT)

/*--- register HSEM_RLR31 -------------------------------------------------*/
#define PERI_HSEM_HSEM_RLR31_BIT_PROCID_SHIFT                       (0U)
#define PERI_HSEM_HSEM_RLR31_BIT_PROCID_MASK                        (((1U<<8)-1) << PERI_HSEM_HSEM_RLR31_BIT_PROCID_SHIFT)
#define PERI_HSEM_HSEM_RLR31_BIT_MASTERID_SHIFT                     (8U)
#define PERI_HSEM_HSEM_RLR31_BIT_MASTERID_MASK                      (((1U<<8)-1) << PERI_HSEM_HSEM_RLR31_BIT_MASTERID_SHIFT)
#define PERI_HSEM_HSEM_RLR31_BIT_LOCK_SHIFT                         (31U)
#define PERI_HSEM_HSEM_RLR31_BIT_LOCK_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_RLR31_BIT_LOCK_SHIFT)

/*--- register HSEM_IER -------------------------------------------------*/
#define PERI_HSEM_HSEM_IER_BIT_ISEM0_SHIFT                          (0U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM0_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM0_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM1_SHIFT                          (1U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM1_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM1_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM2_SHIFT                          (2U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM2_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM2_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM3_SHIFT                          (3U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM3_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM3_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM4_SHIFT                          (4U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM4_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM4_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM5_SHIFT                          (5U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM5_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM5_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM6_SHIFT                          (6U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM6_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM6_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM7_SHIFT                          (7U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM7_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM7_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM8_SHIFT                          (8U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM8_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM8_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM9_SHIFT                          (9U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM9_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM9_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM10_SHIFT                         (10U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM10_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM10_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM11_SHIFT                         (11U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM11_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM11_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM12_SHIFT                         (12U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM12_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM12_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM13_SHIFT                         (13U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM13_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM13_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM14_SHIFT                         (14U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM14_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM14_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM15_SHIFT                         (15U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM15_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM15_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM16_SHIFT                         (16U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM16_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM16_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM17_SHIFT                         (17U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM17_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM17_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM18_SHIFT                         (18U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM18_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM18_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM19_SHIFT                         (19U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM19_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM19_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM20_SHIFT                         (20U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM20_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM20_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM21_SHIFT                         (21U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM21_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM21_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM22_SHIFT                         (22U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM22_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM22_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM23_SHIFT                         (23U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM23_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM23_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM24_SHIFT                         (24U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM24_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM24_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM25_SHIFT                         (25U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM25_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM25_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM26_SHIFT                         (26U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM26_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM26_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM27_SHIFT                         (27U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM27_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM27_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM28_SHIFT                         (28U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM28_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM28_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM29_SHIFT                         (29U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM29_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM29_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM30_SHIFT                         (30U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM30_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM30_SHIFT)
#define PERI_HSEM_HSEM_IER_BIT_ISEM31_SHIFT                         (31U)
#define PERI_HSEM_HSEM_IER_BIT_ISEM31_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_IER_BIT_ISEM31_SHIFT)

/*--- register HSEM_ICR -------------------------------------------------*/
#define PERI_HSEM_HSEM_ICR_BIT_ISEM0_SHIFT                          (0U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM0_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM0_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM1_SHIFT                          (1U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM1_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM1_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM2_SHIFT                          (2U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM2_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM2_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM3_SHIFT                          (3U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM3_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM3_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM4_SHIFT                          (4U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM4_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM4_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM5_SHIFT                          (5U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM5_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM5_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM6_SHIFT                          (6U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM6_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM6_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM7_SHIFT                          (7U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM7_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM7_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM8_SHIFT                          (8U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM8_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM8_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM9_SHIFT                          (9U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM9_MASK                           (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM9_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM10_SHIFT                         (10U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM10_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM10_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM11_SHIFT                         (11U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM11_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM11_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM12_SHIFT                         (12U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM12_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM12_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM13_SHIFT                         (13U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM13_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM13_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM14_SHIFT                         (14U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM14_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM14_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM15_SHIFT                         (15U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM15_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM15_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM16_SHIFT                         (16U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM16_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM16_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM17_SHIFT                         (17U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM17_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM17_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM18_SHIFT                         (18U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM18_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM18_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM19_SHIFT                         (19U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM19_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM19_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM20_SHIFT                         (20U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM20_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM20_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM21_SHIFT                         (21U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM21_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM21_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM22_SHIFT                         (22U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM22_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM22_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM23_SHIFT                         (23U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM23_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM23_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM24_SHIFT                         (24U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM24_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM24_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM25_SHIFT                         (25U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM25_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM25_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM26_SHIFT                         (26U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM26_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM26_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM27_SHIFT                         (27U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM27_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM27_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM28_SHIFT                         (28U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM28_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM28_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM29_SHIFT                         (29U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM29_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM29_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM30_SHIFT                         (30U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM30_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM30_SHIFT)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM31_SHIFT                         (31U)
#define PERI_HSEM_HSEM_ICR_BIT_ISEM31_MASK                          (((1U<<1)-1) << PERI_HSEM_HSEM_ICR_BIT_ISEM31_SHIFT)

