minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR1 -------------------------------------------------*/
#define PERI_I2C2_CR1_BIT_PE_SHIFT                                  (0U)
#define PERI_I2C2_CR1_BIT_PE_MASK                                   (((1U<<1)-1) << PERI_I2C2_CR1_BIT_PE_SHIFT)
#define PERI_I2C2_CR1_BIT_TXIE_SHIFT                                (1U)
#define PERI_I2C2_CR1_BIT_TXIE_MASK                                 (((1U<<1)-1) << PERI_I2C2_CR1_BIT_TXIE_SHIFT)
#define PERI_I2C2_CR1_BIT_RXIE_SHIFT                                (2U)
#define PERI_I2C2_CR1_BIT_RXIE_MASK                                 (((1U<<1)-1) << PERI_I2C2_CR1_BIT_RXIE_SHIFT)
#define PERI_I2C2_CR1_BIT_ADDRIE_SHIFT                              (3U)
#define PERI_I2C2_CR1_BIT_ADDRIE_MASK                               (((1U<<1)-1) << PERI_I2C2_CR1_BIT_ADDRIE_SHIFT)
#define PERI_I2C2_CR1_BIT_NACKIE_SHIFT                              (4U)
#define PERI_I2C2_CR1_BIT_NACKIE_MASK                               (((1U<<1)-1) << PERI_I2C2_CR1_BIT_NACKIE_SHIFT)
#define PERI_I2C2_CR1_BIT_STOPIE_SHIFT                              (5U)
#define PERI_I2C2_CR1_BIT_STOPIE_MASK                               (((1U<<1)-1) << PERI_I2C2_CR1_BIT_STOPIE_SHIFT)
#define PERI_I2C2_CR1_BIT_TCIE_SHIFT                                (6U)
#define PERI_I2C2_CR1_BIT_TCIE_MASK                                 (((1U<<1)-1) << PERI_I2C2_CR1_BIT_TCIE_SHIFT)
#define PERI_I2C2_CR1_BIT_ERRIE_SHIFT                               (7U)
#define PERI_I2C2_CR1_BIT_ERRIE_MASK                                (((1U<<1)-1) << PERI_I2C2_CR1_BIT_ERRIE_SHIFT)
#define PERI_I2C2_CR1_BIT_DNF_SHIFT                                 (8U)
#define PERI_I2C2_CR1_BIT_DNF_MASK                                  (((1U<<4)-1) << PERI_I2C2_CR1_BIT_DNF_SHIFT)
#define PERI_I2C2_CR1_BIT_ANFOFF_SHIFT                              (12U)
#define PERI_I2C2_CR1_BIT_ANFOFF_MASK                               (((1U<<1)-1) << PERI_I2C2_CR1_BIT_ANFOFF_SHIFT)
#define PERI_I2C2_CR1_BIT_TXDMAEN_SHIFT                             (14U)
#define PERI_I2C2_CR1_BIT_TXDMAEN_MASK                              (((1U<<1)-1) << PERI_I2C2_CR1_BIT_TXDMAEN_SHIFT)
#define PERI_I2C2_CR1_BIT_RXDMAEN_SHIFT                             (15U)
#define PERI_I2C2_CR1_BIT_RXDMAEN_MASK                              (((1U<<1)-1) << PERI_I2C2_CR1_BIT_RXDMAEN_SHIFT)
#define PERI_I2C2_CR1_BIT_SBC_SHIFT                                 (16U)
#define PERI_I2C2_CR1_BIT_SBC_MASK                                  (((1U<<1)-1) << PERI_I2C2_CR1_BIT_SBC_SHIFT)
#define PERI_I2C2_CR1_BIT_NOSTRETCH_SHIFT                           (17U)
#define PERI_I2C2_CR1_BIT_NOSTRETCH_MASK                            (((1U<<1)-1) << PERI_I2C2_CR1_BIT_NOSTRETCH_SHIFT)
#define PERI_I2C2_CR1_BIT_WUPEN_SHIFT                               (18U)
#define PERI_I2C2_CR1_BIT_WUPEN_MASK                                (((1U<<1)-1) << PERI_I2C2_CR1_BIT_WUPEN_SHIFT)
#define PERI_I2C2_CR1_BIT_GCEN_SHIFT                                (19U)
#define PERI_I2C2_CR1_BIT_GCEN_MASK                                 (((1U<<1)-1) << PERI_I2C2_CR1_BIT_GCEN_SHIFT)
#define PERI_I2C2_CR1_BIT_SMBHEN_SHIFT                              (20U)
#define PERI_I2C2_CR1_BIT_SMBHEN_MASK                               (((1U<<1)-1) << PERI_I2C2_CR1_BIT_SMBHEN_SHIFT)
#define PERI_I2C2_CR1_BIT_SMBDEN_SHIFT                              (21U)
#define PERI_I2C2_CR1_BIT_SMBDEN_MASK                               (((1U<<1)-1) << PERI_I2C2_CR1_BIT_SMBDEN_SHIFT)
#define PERI_I2C2_CR1_BIT_ALERTEN_SHIFT                             (22U)
#define PERI_I2C2_CR1_BIT_ALERTEN_MASK                              (((1U<<1)-1) << PERI_I2C2_CR1_BIT_ALERTEN_SHIFT)
#define PERI_I2C2_CR1_BIT_PECEN_SHIFT                               (23U)
#define PERI_I2C2_CR1_BIT_PECEN_MASK                                (((1U<<1)-1) << PERI_I2C2_CR1_BIT_PECEN_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_I2C2_CR2_BIT_SADD_SHIFT                                (0U)
#define PERI_I2C2_CR2_BIT_SADD_MASK                                 (((1U<<10)-1) << PERI_I2C2_CR2_BIT_SADD_SHIFT)
#define PERI_I2C2_CR2_BIT_RD_WRN_SHIFT                              (10U)
#define PERI_I2C2_CR2_BIT_RD_WRN_MASK                               (((1U<<1)-1) << PERI_I2C2_CR2_BIT_RD_WRN_SHIFT)
#define PERI_I2C2_CR2_BIT_ADD10_SHIFT                               (11U)
#define PERI_I2C2_CR2_BIT_ADD10_MASK                                (((1U<<1)-1) << PERI_I2C2_CR2_BIT_ADD10_SHIFT)
#define PERI_I2C2_CR2_BIT_HEAD10R_SHIFT                             (12U)
#define PERI_I2C2_CR2_BIT_HEAD10R_MASK                              (((1U<<1)-1) << PERI_I2C2_CR2_BIT_HEAD10R_SHIFT)
#define PERI_I2C2_CR2_BIT_START_SHIFT                               (13U)
#define PERI_I2C2_CR2_BIT_START_MASK                                (((1U<<1)-1) << PERI_I2C2_CR2_BIT_START_SHIFT)
#define PERI_I2C2_CR2_BIT_STOP_SHIFT                                (14U)
#define PERI_I2C2_CR2_BIT_STOP_MASK                                 (((1U<<1)-1) << PERI_I2C2_CR2_BIT_STOP_SHIFT)
#define PERI_I2C2_CR2_BIT_NACK_SHIFT                                (15U)
#define PERI_I2C2_CR2_BIT_NACK_MASK                                 (((1U<<1)-1) << PERI_I2C2_CR2_BIT_NACK_SHIFT)
#define PERI_I2C2_CR2_BIT_NBYTES_SHIFT                              (16U)
#define PERI_I2C2_CR2_BIT_NBYTES_MASK                               (((1U<<8)-1) << PERI_I2C2_CR2_BIT_NBYTES_SHIFT)
#define PERI_I2C2_CR2_BIT_RELOAD_SHIFT                              (24U)
#define PERI_I2C2_CR2_BIT_RELOAD_MASK                               (((1U<<1)-1) << PERI_I2C2_CR2_BIT_RELOAD_SHIFT)
#define PERI_I2C2_CR2_BIT_AUTOEND_SHIFT                             (25U)
#define PERI_I2C2_CR2_BIT_AUTOEND_MASK                              (((1U<<1)-1) << PERI_I2C2_CR2_BIT_AUTOEND_SHIFT)
#define PERI_I2C2_CR2_BIT_PECBYTE_SHIFT                             (26U)
#define PERI_I2C2_CR2_BIT_PECBYTE_MASK                              (((1U<<1)-1) << PERI_I2C2_CR2_BIT_PECBYTE_SHIFT)

