minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OAR1 -------------------------------------------------*/
#define PERI_I2C2_OAR1_BIT_OA1_SHIFT                                (0U)
#define PERI_I2C2_OAR1_BIT_OA1_MASK                                 (((1U<<10)-1) << PERI_I2C2_OAR1_BIT_OA1_SHIFT)
#define PERI_I2C2_OAR1_BIT_OA1MODE_SHIFT                            (10U)
#define PERI_I2C2_OAR1_BIT_OA1MODE_MASK                             (((1U<<1)-1) << PERI_I2C2_OAR1_BIT_OA1MODE_SHIFT)
#define PERI_I2C2_OAR1_BIT_OA1EN_SHIFT                              (15U)
#define PERI_I2C2_OAR1_BIT_OA1EN_MASK                               (((1U<<1)-1) << PERI_I2C2_OAR1_BIT_OA1EN_SHIFT)

/*--- register OAR2 -------------------------------------------------*/
#define PERI_I2C2_OAR2_BIT_OA2_SHIFT                                (1U)
#define PERI_I2C2_OAR2_BIT_OA2_MASK                                 (((1U<<7)-1) << PERI_I2C2_OAR2_BIT_OA2_SHIFT)
#define PERI_I2C2_OAR2_BIT_OA2MSK_SHIFT                             (8U)
#define PERI_I2C2_OAR2_BIT_OA2MSK_MASK                              (((1U<<3)-1) << PERI_I2C2_OAR2_BIT_OA2MSK_SHIFT)
#define PERI_I2C2_OAR2_BIT_OA2EN_SHIFT                              (15U)
#define PERI_I2C2_OAR2_BIT_OA2EN_MASK                               (((1U<<1)-1) << PERI_I2C2_OAR2_BIT_OA2EN_SHIFT)

/*--- register TIMINGR -------------------------------------------------*/
#define PERI_I2C2_TIMINGR_BIT_SCLL_SHIFT                            (0U)
#define PERI_I2C2_TIMINGR_BIT_SCLL_MASK                             (((1U<<8)-1) << PERI_I2C2_TIMINGR_BIT_SCLL_SHIFT)
#define PERI_I2C2_TIMINGR_BIT_SCLH_SHIFT                            (8U)
#define PERI_I2C2_TIMINGR_BIT_SCLH_MASK                             (((1U<<8)-1) << PERI_I2C2_TIMINGR_BIT_SCLH_SHIFT)
#define PERI_I2C2_TIMINGR_BIT_SDADEL_SHIFT                          (16U)
#define PERI_I2C2_TIMINGR_BIT_SDADEL_MASK                           (((1U<<4)-1) << PERI_I2C2_TIMINGR_BIT_SDADEL_SHIFT)
#define PERI_I2C2_TIMINGR_BIT_SCLDEL_SHIFT                          (20U)
#define PERI_I2C2_TIMINGR_BIT_SCLDEL_MASK                           (((1U<<4)-1) << PERI_I2C2_TIMINGR_BIT_SCLDEL_SHIFT)
#define PERI_I2C2_TIMINGR_BIT_PRESC_SHIFT                           (28U)
#define PERI_I2C2_TIMINGR_BIT_PRESC_MASK                            (((1U<<4)-1) << PERI_I2C2_TIMINGR_BIT_PRESC_SHIFT)

/*--- register TIMEOUTR -------------------------------------------------*/
#define PERI_I2C2_TIMEOUTR_BIT_TIMEOUTA_SHIFT                       (0U)
#define PERI_I2C2_TIMEOUTR_BIT_TIMEOUTA_MASK                        (((1U<<12)-1) << PERI_I2C2_TIMEOUTR_BIT_TIMEOUTA_SHIFT)
#define PERI_I2C2_TIMEOUTR_BIT_TIDLE_SHIFT                          (12U)
#define PERI_I2C2_TIMEOUTR_BIT_TIDLE_MASK                           (((1U<<1)-1) << PERI_I2C2_TIMEOUTR_BIT_TIDLE_SHIFT)
#define PERI_I2C2_TIMEOUTR_BIT_TIMOUTEN_SHIFT                       (15U)
#define PERI_I2C2_TIMEOUTR_BIT_TIMOUTEN_MASK                        (((1U<<1)-1) << PERI_I2C2_TIMEOUTR_BIT_TIMOUTEN_SHIFT)
#define PERI_I2C2_TIMEOUTR_BIT_TIMEOUTB_SHIFT                       (16U)
#define PERI_I2C2_TIMEOUTR_BIT_TIMEOUTB_MASK                        (((1U<<12)-1) << PERI_I2C2_TIMEOUTR_BIT_TIMEOUTB_SHIFT)
#define PERI_I2C2_TIMEOUTR_BIT_TEXTEN_SHIFT                         (31U)
#define PERI_I2C2_TIMEOUTR_BIT_TEXTEN_MASK                          (((1U<<1)-1) << PERI_I2C2_TIMEOUTR_BIT_TEXTEN_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_I2C2_ISR_BIT_TXE_SHIFT                                 (0U)
#define PERI_I2C2_ISR_BIT_TXE_MASK                                  (((1U<<1)-1) << PERI_I2C2_ISR_BIT_TXE_SHIFT)
#define PERI_I2C2_ISR_BIT_TXIS_SHIFT                                (1U)
#define PERI_I2C2_ISR_BIT_TXIS_MASK                                 (((1U<<1)-1) << PERI_I2C2_ISR_BIT_TXIS_SHIFT)
#define PERI_I2C2_ISR_BIT_RXNE_SHIFT                                (2U)
#define PERI_I2C2_ISR_BIT_RXNE_MASK                                 (((1U<<1)-1) << PERI_I2C2_ISR_BIT_RXNE_SHIFT)
#define PERI_I2C2_ISR_BIT_ADDR_SHIFT                                (3U)
#define PERI_I2C2_ISR_BIT_ADDR_MASK                                 (((1U<<1)-1) << PERI_I2C2_ISR_BIT_ADDR_SHIFT)
#define PERI_I2C2_ISR_BIT_NACKF_SHIFT                               (4U)
#define PERI_I2C2_ISR_BIT_NACKF_MASK                                (((1U<<1)-1) << PERI_I2C2_ISR_BIT_NACKF_SHIFT)
#define PERI_I2C2_ISR_BIT_STOPF_SHIFT                               (5U)
#define PERI_I2C2_ISR_BIT_STOPF_MASK                                (((1U<<1)-1) << PERI_I2C2_ISR_BIT_STOPF_SHIFT)
#define PERI_I2C2_ISR_BIT_TC_SHIFT                                  (6U)
#define PERI_I2C2_ISR_BIT_TC_MASK                                   (((1U<<1)-1) << PERI_I2C2_ISR_BIT_TC_SHIFT)
#define PERI_I2C2_ISR_BIT_TCR_SHIFT                                 (7U)
#define PERI_I2C2_ISR_BIT_TCR_MASK                                  (((1U<<1)-1) << PERI_I2C2_ISR_BIT_TCR_SHIFT)
#define PERI_I2C2_ISR_BIT_BERR_SHIFT                                (8U)
#define PERI_I2C2_ISR_BIT_BERR_MASK                                 (((1U<<1)-1) << PERI_I2C2_ISR_BIT_BERR_SHIFT)
#define PERI_I2C2_ISR_BIT_ARLO_SHIFT                                (9U)
#define PERI_I2C2_ISR_BIT_ARLO_MASK                                 (((1U<<1)-1) << PERI_I2C2_ISR_BIT_ARLO_SHIFT)
#define PERI_I2C2_ISR_BIT_OVR_SHIFT                                 (10U)
#define PERI_I2C2_ISR_BIT_OVR_MASK                                  (((1U<<1)-1) << PERI_I2C2_ISR_BIT_OVR_SHIFT)
#define PERI_I2C2_ISR_BIT_PECERR_SHIFT                              (11U)
#define PERI_I2C2_ISR_BIT_PECERR_MASK                               (((1U<<1)-1) << PERI_I2C2_ISR_BIT_PECERR_SHIFT)
#define PERI_I2C2_ISR_BIT_TIMEOUT_SHIFT                             (12U)
#define PERI_I2C2_ISR_BIT_TIMEOUT_MASK                              (((1U<<1)-1) << PERI_I2C2_ISR_BIT_TIMEOUT_SHIFT)
#define PERI_I2C2_ISR_BIT_ALERT_SHIFT                               (13U)
#define PERI_I2C2_ISR_BIT_ALERT_MASK                                (((1U<<1)-1) << PERI_I2C2_ISR_BIT_ALERT_SHIFT)
#define PERI_I2C2_ISR_BIT_BUSY_SHIFT                                (15U)
#define PERI_I2C2_ISR_BIT_BUSY_MASK                                 (((1U<<1)-1) << PERI_I2C2_ISR_BIT_BUSY_SHIFT)
#define PERI_I2C2_ISR_BIT_DIR_SHIFT                                 (16U)
#define PERI_I2C2_ISR_BIT_DIR_MASK                                  (((1U<<1)-1) << PERI_I2C2_ISR_BIT_DIR_SHIFT)
#define PERI_I2C2_ISR_BIT_ADDCODE_SHIFT                             (17U)
#define PERI_I2C2_ISR_BIT_ADDCODE_MASK                              (((1U<<7)-1) << PERI_I2C2_ISR_BIT_ADDCODE_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_I2C2_ICR_BIT_ADDRCF_SHIFT                              (3U)
#define PERI_I2C2_ICR_BIT_ADDRCF_MASK                               (((1U<<1)-1) << PERI_I2C2_ICR_BIT_ADDRCF_SHIFT)
#define PERI_I2C2_ICR_BIT_NACKCF_SHIFT                              (4U)
#define PERI_I2C2_ICR_BIT_NACKCF_MASK                               (((1U<<1)-1) << PERI_I2C2_ICR_BIT_NACKCF_SHIFT)
#define PERI_I2C2_ICR_BIT_STOPCF_SHIFT                              (5U)
#define PERI_I2C2_ICR_BIT_STOPCF_MASK                               (((1U<<1)-1) << PERI_I2C2_ICR_BIT_STOPCF_SHIFT)
#define PERI_I2C2_ICR_BIT_BERRCF_SHIFT                              (8U)
#define PERI_I2C2_ICR_BIT_BERRCF_MASK                               (((1U<<1)-1) << PERI_I2C2_ICR_BIT_BERRCF_SHIFT)
#define PERI_I2C2_ICR_BIT_ARLOCF_SHIFT                              (9U)
#define PERI_I2C2_ICR_BIT_ARLOCF_MASK                               (((1U<<1)-1) << PERI_I2C2_ICR_BIT_ARLOCF_SHIFT)
#define PERI_I2C2_ICR_BIT_OVRCF_SHIFT                               (10U)
#define PERI_I2C2_ICR_BIT_OVRCF_MASK                                (((1U<<1)-1) << PERI_I2C2_ICR_BIT_OVRCF_SHIFT)
#define PERI_I2C2_ICR_BIT_PECCF_SHIFT                               (11U)
#define PERI_I2C2_ICR_BIT_PECCF_MASK                                (((1U<<1)-1) << PERI_I2C2_ICR_BIT_PECCF_SHIFT)
#define PERI_I2C2_ICR_BIT_TIMOUTCF_SHIFT                            (12U)
#define PERI_I2C2_ICR_BIT_TIMOUTCF_MASK                             (((1U<<1)-1) << PERI_I2C2_ICR_BIT_TIMOUTCF_SHIFT)
#define PERI_I2C2_ICR_BIT_ALERTCF_SHIFT                             (13U)
#define PERI_I2C2_ICR_BIT_ALERTCF_MASK                              (((1U<<1)-1) << PERI_I2C2_ICR_BIT_ALERTCF_SHIFT)

/*--- register PECR -------------------------------------------------*/
#define PERI_I2C2_PECR_BIT_PEC_SHIFT                                (0U)
#define PERI_I2C2_PECR_BIT_PEC_MASK                                 (((1U<<8)-1) << PERI_I2C2_PECR_BIT_PEC_SHIFT)

/*--- register RXDR -------------------------------------------------*/
#define PERI_I2C2_RXDR_BIT_RXDATA_SHIFT                             (0U)
#define PERI_I2C2_RXDR_BIT_RXDATA_MASK                              (((1U<<8)-1) << PERI_I2C2_RXDR_BIT_RXDATA_SHIFT)

/*--- register TXDR -------------------------------------------------*/
#define PERI_I2C2_TXDR_BIT_TXDATA_SHIFT                             (0U)
#define PERI_I2C2_TXDR_BIT_TXDATA_MASK                              (((1U<<8)-1) << PERI_I2C2_TXDR_BIT_TXDATA_SHIFT)

