minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register KR -------------------------------------------------*/
#define PERI_IWDG_KR_BIT_KEY_SHIFT                                  (0U)
#define PERI_IWDG_KR_BIT_KEY_MASK                                   (((1U<<16)-1) << PERI_IWDG_KR_BIT_KEY_SHIFT)

/*--- register PR -------------------------------------------------*/
#define PERI_IWDG_PR_BIT_PR_SHIFT                                   (0U)
#define PERI_IWDG_PR_BIT_PR_MASK                                    (((1U<<3)-1) << PERI_IWDG_PR_BIT_PR_SHIFT)

/*--- register RLR -------------------------------------------------*/
#define PERI_IWDG_RLR_BIT_RL_SHIFT                                  (0U)
#define PERI_IWDG_RLR_BIT_RL_MASK                                   (((1U<<12)-1) << PERI_IWDG_RLR_BIT_RL_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_IWDG_SR_BIT_PVU_SHIFT                                  (0U)
#define PERI_IWDG_SR_BIT_PVU_MASK                                   (((1U<<1)-1) << PERI_IWDG_SR_BIT_PVU_SHIFT)
#define PERI_IWDG_SR_BIT_RVU_SHIFT                                  (1U)
#define PERI_IWDG_SR_BIT_RVU_MASK                                   (((1U<<1)-1) << PERI_IWDG_SR_BIT_RVU_SHIFT)
#define PERI_IWDG_SR_BIT_WVU_SHIFT                                  (2U)
#define PERI_IWDG_SR_BIT_WVU_MASK                                   (((1U<<1)-1) << PERI_IWDG_SR_BIT_WVU_SHIFT)

/*--- register WINR -------------------------------------------------*/
#define PERI_IWDG_WINR_BIT_WIN_SHIFT                                (0U)
#define PERI_IWDG_WINR_BIT_WIN_MASK                                 (((1U<<12)-1) << PERI_IWDG_WINR_BIT_WIN_SHIFT)

/*--- register CONFR0 -------------------------------------------------*/
#define PERI_JPEG_CONFR0_BIT_START_SHIFT                            (0U)
#define PERI_JPEG_CONFR0_BIT_START_MASK                             (((1U<<1)-1) << PERI_JPEG_CONFR0_BIT_START_SHIFT)

/*--- register CONFR1 -------------------------------------------------*/
#define PERI_JPEG_CONFR1_BIT_NF_SHIFT                               (0U)
#define PERI_JPEG_CONFR1_BIT_NF_MASK                                (((1U<<2)-1) << PERI_JPEG_CONFR1_BIT_NF_SHIFT)
#define PERI_JPEG_CONFR1_BIT_DE_SHIFT                               (3U)
#define PERI_JPEG_CONFR1_BIT_DE_MASK                                (((1U<<1)-1) << PERI_JPEG_CONFR1_BIT_DE_SHIFT)
#define PERI_JPEG_CONFR1_BIT_COLORSPACE_SHIFT                       (4U)
#define PERI_JPEG_CONFR1_BIT_COLORSPACE_MASK                        (((1U<<2)-1) << PERI_JPEG_CONFR1_BIT_COLORSPACE_SHIFT)
#define PERI_JPEG_CONFR1_BIT_NS_SHIFT                               (6U)
#define PERI_JPEG_CONFR1_BIT_NS_MASK                                (((1U<<2)-1) << PERI_JPEG_CONFR1_BIT_NS_SHIFT)
#define PERI_JPEG_CONFR1_BIT_HDR_SHIFT                              (8U)
#define PERI_JPEG_CONFR1_BIT_HDR_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFR1_BIT_HDR_SHIFT)
#define PERI_JPEG_CONFR1_BIT_YSIZE_SHIFT                            (16U)
#define PERI_JPEG_CONFR1_BIT_YSIZE_MASK                             (((1U<<16)-1) << PERI_JPEG_CONFR1_BIT_YSIZE_SHIFT)

/*--- register CONFR2 -------------------------------------------------*/
#define PERI_JPEG_CONFR2_BIT_NMCU_SHIFT                             (0U)
#define PERI_JPEG_CONFR2_BIT_NMCU_MASK                              (((1U<<26)-1) << PERI_JPEG_CONFR2_BIT_NMCU_SHIFT)

/*--- register CONFR3 -------------------------------------------------*/
#define PERI_JPEG_CONFR3_BIT_XSIZE_SHIFT                            (16U)
#define PERI_JPEG_CONFR3_BIT_XSIZE_MASK                             (((1U<<16)-1) << PERI_JPEG_CONFR3_BIT_XSIZE_SHIFT)

/*--- register CONFRN1 -------------------------------------------------*/
#define PERI_JPEG_CONFRN1_BIT_HD_SHIFT                              (0U)
#define PERI_JPEG_CONFRN1_BIT_HD_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN1_BIT_HD_SHIFT)
#define PERI_JPEG_CONFRN1_BIT_HA_SHIFT                              (1U)
#define PERI_JPEG_CONFRN1_BIT_HA_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN1_BIT_HA_SHIFT)
#define PERI_JPEG_CONFRN1_BIT_QT_SHIFT                              (2U)
#define PERI_JPEG_CONFRN1_BIT_QT_MASK                               (((1U<<2)-1) << PERI_JPEG_CONFRN1_BIT_QT_SHIFT)
#define PERI_JPEG_CONFRN1_BIT_NB_SHIFT                              (4U)
#define PERI_JPEG_CONFRN1_BIT_NB_MASK                               (((1U<<4)-1) << PERI_JPEG_CONFRN1_BIT_NB_SHIFT)
#define PERI_JPEG_CONFRN1_BIT_VSF_SHIFT                             (8U)
#define PERI_JPEG_CONFRN1_BIT_VSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN1_BIT_VSF_SHIFT)
#define PERI_JPEG_CONFRN1_BIT_HSF_SHIFT                             (12U)
#define PERI_JPEG_CONFRN1_BIT_HSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN1_BIT_HSF_SHIFT)

/*--- register CONFRN2 -------------------------------------------------*/
#define PERI_JPEG_CONFRN2_BIT_HD_SHIFT                              (0U)
#define PERI_JPEG_CONFRN2_BIT_HD_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN2_BIT_HD_SHIFT)
#define PERI_JPEG_CONFRN2_BIT_HA_SHIFT                              (1U)
#define PERI_JPEG_CONFRN2_BIT_HA_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN2_BIT_HA_SHIFT)
#define PERI_JPEG_CONFRN2_BIT_QT_SHIFT                              (2U)
#define PERI_JPEG_CONFRN2_BIT_QT_MASK                               (((1U<<2)-1) << PERI_JPEG_CONFRN2_BIT_QT_SHIFT)
#define PERI_JPEG_CONFRN2_BIT_NB_SHIFT                              (4U)
#define PERI_JPEG_CONFRN2_BIT_NB_MASK                               (((1U<<4)-1) << PERI_JPEG_CONFRN2_BIT_NB_SHIFT)
#define PERI_JPEG_CONFRN2_BIT_VSF_SHIFT                             (8U)
#define PERI_JPEG_CONFRN2_BIT_VSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN2_BIT_VSF_SHIFT)
#define PERI_JPEG_CONFRN2_BIT_HSF_SHIFT                             (12U)
#define PERI_JPEG_CONFRN2_BIT_HSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN2_BIT_HSF_SHIFT)

/*--- register CONFRN3 -------------------------------------------------*/
#define PERI_JPEG_CONFRN3_BIT_HD_SHIFT                              (0U)
#define PERI_JPEG_CONFRN3_BIT_HD_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN3_BIT_HD_SHIFT)
#define PERI_JPEG_CONFRN3_BIT_HA_SHIFT                              (1U)
#define PERI_JPEG_CONFRN3_BIT_HA_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN3_BIT_HA_SHIFT)
#define PERI_JPEG_CONFRN3_BIT_QT_SHIFT                              (2U)
#define PERI_JPEG_CONFRN3_BIT_QT_MASK                               (((1U<<2)-1) << PERI_JPEG_CONFRN3_BIT_QT_SHIFT)
#define PERI_JPEG_CONFRN3_BIT_NB_SHIFT                              (4U)
#define PERI_JPEG_CONFRN3_BIT_NB_MASK                               (((1U<<4)-1) << PERI_JPEG_CONFRN3_BIT_NB_SHIFT)
#define PERI_JPEG_CONFRN3_BIT_VSF_SHIFT                             (8U)
#define PERI_JPEG_CONFRN3_BIT_VSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN3_BIT_VSF_SHIFT)
#define PERI_JPEG_CONFRN3_BIT_HSF_SHIFT                             (12U)
#define PERI_JPEG_CONFRN3_BIT_HSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN3_BIT_HSF_SHIFT)

