minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CONFRN4 -------------------------------------------------*/
#define PERI_JPEG_CONFRN4_BIT_HD_SHIFT                              (0U)
#define PERI_JPEG_CONFRN4_BIT_HD_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN4_BIT_HD_SHIFT)
#define PERI_JPEG_CONFRN4_BIT_HA_SHIFT                              (1U)
#define PERI_JPEG_CONFRN4_BIT_HA_MASK                               (((1U<<1)-1) << PERI_JPEG_CONFRN4_BIT_HA_SHIFT)
#define PERI_JPEG_CONFRN4_BIT_QT_SHIFT                              (2U)
#define PERI_JPEG_CONFRN4_BIT_QT_MASK                               (((1U<<2)-1) << PERI_JPEG_CONFRN4_BIT_QT_SHIFT)
#define PERI_JPEG_CONFRN4_BIT_NB_SHIFT                              (4U)
#define PERI_JPEG_CONFRN4_BIT_NB_MASK                               (((1U<<4)-1) << PERI_JPEG_CONFRN4_BIT_NB_SHIFT)
#define PERI_JPEG_CONFRN4_BIT_VSF_SHIFT                             (8U)
#define PERI_JPEG_CONFRN4_BIT_VSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN4_BIT_VSF_SHIFT)
#define PERI_JPEG_CONFRN4_BIT_HSF_SHIFT                             (12U)
#define PERI_JPEG_CONFRN4_BIT_HSF_MASK                              (((1U<<4)-1) << PERI_JPEG_CONFRN4_BIT_HSF_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_JPEG_CR_BIT_JCEN_SHIFT                                 (0U)
#define PERI_JPEG_CR_BIT_JCEN_MASK                                  (((1U<<1)-1) << PERI_JPEG_CR_BIT_JCEN_SHIFT)
#define PERI_JPEG_CR_BIT_IFTIE_SHIFT                                (1U)
#define PERI_JPEG_CR_BIT_IFTIE_MASK                                 (((1U<<1)-1) << PERI_JPEG_CR_BIT_IFTIE_SHIFT)
#define PERI_JPEG_CR_BIT_IFNFIE_SHIFT                               (2U)
#define PERI_JPEG_CR_BIT_IFNFIE_MASK                                (((1U<<1)-1) << PERI_JPEG_CR_BIT_IFNFIE_SHIFT)
#define PERI_JPEG_CR_BIT_OFTIE_SHIFT                                (3U)
#define PERI_JPEG_CR_BIT_OFTIE_MASK                                 (((1U<<1)-1) << PERI_JPEG_CR_BIT_OFTIE_SHIFT)
#define PERI_JPEG_CR_BIT_OFNEIE_SHIFT                               (4U)
#define PERI_JPEG_CR_BIT_OFNEIE_MASK                                (((1U<<1)-1) << PERI_JPEG_CR_BIT_OFNEIE_SHIFT)
#define PERI_JPEG_CR_BIT_EOCIE_SHIFT                                (5U)
#define PERI_JPEG_CR_BIT_EOCIE_MASK                                 (((1U<<1)-1) << PERI_JPEG_CR_BIT_EOCIE_SHIFT)
#define PERI_JPEG_CR_BIT_HPDIE_SHIFT                                (6U)
#define PERI_JPEG_CR_BIT_HPDIE_MASK                                 (((1U<<1)-1) << PERI_JPEG_CR_BIT_HPDIE_SHIFT)
#define PERI_JPEG_CR_BIT_IDMAEN_SHIFT                               (11U)
#define PERI_JPEG_CR_BIT_IDMAEN_MASK                                (((1U<<1)-1) << PERI_JPEG_CR_BIT_IDMAEN_SHIFT)
#define PERI_JPEG_CR_BIT_ODMAEN_SHIFT                               (12U)
#define PERI_JPEG_CR_BIT_ODMAEN_MASK                                (((1U<<1)-1) << PERI_JPEG_CR_BIT_ODMAEN_SHIFT)
#define PERI_JPEG_CR_BIT_IFF_SHIFT                                  (13U)
#define PERI_JPEG_CR_BIT_IFF_MASK                                   (((1U<<1)-1) << PERI_JPEG_CR_BIT_IFF_SHIFT)
#define PERI_JPEG_CR_BIT_OFF_SHIFT                                  (14U)
#define PERI_JPEG_CR_BIT_OFF_MASK                                   (((1U<<1)-1) << PERI_JPEG_CR_BIT_OFF_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_JPEG_SR_BIT_IFTF_SHIFT                                 (1U)
#define PERI_JPEG_SR_BIT_IFTF_MASK                                  (((1U<<1)-1) << PERI_JPEG_SR_BIT_IFTF_SHIFT)
#define PERI_JPEG_SR_BIT_IFNFF_SHIFT                                (2U)
#define PERI_JPEG_SR_BIT_IFNFF_MASK                                 (((1U<<1)-1) << PERI_JPEG_SR_BIT_IFNFF_SHIFT)
#define PERI_JPEG_SR_BIT_OFTF_SHIFT                                 (3U)
#define PERI_JPEG_SR_BIT_OFTF_MASK                                  (((1U<<1)-1) << PERI_JPEG_SR_BIT_OFTF_SHIFT)
#define PERI_JPEG_SR_BIT_OFNEF_SHIFT                                (4U)
#define PERI_JPEG_SR_BIT_OFNEF_MASK                                 (((1U<<1)-1) << PERI_JPEG_SR_BIT_OFNEF_SHIFT)
#define PERI_JPEG_SR_BIT_EOCF_SHIFT                                 (5U)
#define PERI_JPEG_SR_BIT_EOCF_MASK                                  (((1U<<1)-1) << PERI_JPEG_SR_BIT_EOCF_SHIFT)
#define PERI_JPEG_SR_BIT_HPDF_SHIFT                                 (6U)
#define PERI_JPEG_SR_BIT_HPDF_MASK                                  (((1U<<1)-1) << PERI_JPEG_SR_BIT_HPDF_SHIFT)
#define PERI_JPEG_SR_BIT_COF_SHIFT                                  (7U)
#define PERI_JPEG_SR_BIT_COF_MASK                                   (((1U<<1)-1) << PERI_JPEG_SR_BIT_COF_SHIFT)

/*--- register CFR -------------------------------------------------*/
#define PERI_JPEG_CFR_BIT_CEOCF_SHIFT                               (5U)
#define PERI_JPEG_CFR_BIT_CEOCF_MASK                                (((1U<<1)-1) << PERI_JPEG_CFR_BIT_CEOCF_SHIFT)
#define PERI_JPEG_CFR_BIT_CHPDF_SHIFT                               (6U)
#define PERI_JPEG_CFR_BIT_CHPDF_MASK                                (((1U<<1)-1) << PERI_JPEG_CFR_BIT_CHPDF_SHIFT)

/*--- register DIR -------------------------------------------------*/
#define PERI_JPEG_DIR_BIT_DATAIN_SHIFT                              (0U)
#define PERI_JPEG_DIR_BIT_DATAIN_MASK                               (((1U<<32)-1) << PERI_JPEG_DIR_BIT_DATAIN_SHIFT)

/*--- register DOR -------------------------------------------------*/
#define PERI_JPEG_DOR_BIT_DATAOUT_SHIFT                             (0U)
#define PERI_JPEG_DOR_BIT_DATAOUT_MASK                              (((1U<<32)-1) << PERI_JPEG_DOR_BIT_DATAOUT_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_LPTIM1_ISR_BIT_CMPM_SHIFT                              (0U)
#define PERI_LPTIM1_ISR_BIT_CMPM_MASK                               (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_CMPM_SHIFT)
#define PERI_LPTIM1_ISR_BIT_ARRM_SHIFT                              (1U)
#define PERI_LPTIM1_ISR_BIT_ARRM_MASK                               (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_ARRM_SHIFT)
#define PERI_LPTIM1_ISR_BIT_EXTTRIG_SHIFT                           (2U)
#define PERI_LPTIM1_ISR_BIT_EXTTRIG_MASK                            (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_EXTTRIG_SHIFT)
#define PERI_LPTIM1_ISR_BIT_CMPOK_SHIFT                             (3U)
#define PERI_LPTIM1_ISR_BIT_CMPOK_MASK                              (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_CMPOK_SHIFT)
#define PERI_LPTIM1_ISR_BIT_ARROK_SHIFT                             (4U)
#define PERI_LPTIM1_ISR_BIT_ARROK_MASK                              (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_ARROK_SHIFT)
#define PERI_LPTIM1_ISR_BIT_UP_SHIFT                                (5U)
#define PERI_LPTIM1_ISR_BIT_UP_MASK                                 (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_UP_SHIFT)
#define PERI_LPTIM1_ISR_BIT_DOWN_SHIFT                              (6U)
#define PERI_LPTIM1_ISR_BIT_DOWN_MASK                               (((1U<<1)-1) << PERI_LPTIM1_ISR_BIT_DOWN_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_LPTIM1_ICR_BIT_CMPMCF_SHIFT                            (0U)
#define PERI_LPTIM1_ICR_BIT_CMPMCF_MASK                             (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_CMPMCF_SHIFT)
#define PERI_LPTIM1_ICR_BIT_ARRMCF_SHIFT                            (1U)
#define PERI_LPTIM1_ICR_BIT_ARRMCF_MASK                             (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_ARRMCF_SHIFT)
#define PERI_LPTIM1_ICR_BIT_EXTTRIGCF_SHIFT                         (2U)
#define PERI_LPTIM1_ICR_BIT_EXTTRIGCF_MASK                          (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_EXTTRIGCF_SHIFT)
#define PERI_LPTIM1_ICR_BIT_CMPOKCF_SHIFT                           (3U)
#define PERI_LPTIM1_ICR_BIT_CMPOKCF_MASK                            (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_CMPOKCF_SHIFT)
#define PERI_LPTIM1_ICR_BIT_ARROKCF_SHIFT                           (4U)
#define PERI_LPTIM1_ICR_BIT_ARROKCF_MASK                            (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_ARROKCF_SHIFT)
#define PERI_LPTIM1_ICR_BIT_UPCF_SHIFT                              (5U)
#define PERI_LPTIM1_ICR_BIT_UPCF_MASK                               (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_UPCF_SHIFT)
#define PERI_LPTIM1_ICR_BIT_DOWNCF_SHIFT                            (6U)
#define PERI_LPTIM1_ICR_BIT_DOWNCF_MASK                             (((1U<<1)-1) << PERI_LPTIM1_ICR_BIT_DOWNCF_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_LPTIM1_IER_BIT_CMPMIE_SHIFT                            (0U)
#define PERI_LPTIM1_IER_BIT_CMPMIE_MASK                             (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_CMPMIE_SHIFT)
#define PERI_LPTIM1_IER_BIT_ARRMIE_SHIFT                            (1U)
#define PERI_LPTIM1_IER_BIT_ARRMIE_MASK                             (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_ARRMIE_SHIFT)
#define PERI_LPTIM1_IER_BIT_EXTTRIGIE_SHIFT                         (2U)
#define PERI_LPTIM1_IER_BIT_EXTTRIGIE_MASK                          (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_EXTTRIGIE_SHIFT)
#define PERI_LPTIM1_IER_BIT_CMPOKIE_SHIFT                           (3U)
#define PERI_LPTIM1_IER_BIT_CMPOKIE_MASK                            (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_CMPOKIE_SHIFT)
#define PERI_LPTIM1_IER_BIT_ARROKIE_SHIFT                           (4U)
#define PERI_LPTIM1_IER_BIT_ARROKIE_MASK                            (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_ARROKIE_SHIFT)
#define PERI_LPTIM1_IER_BIT_UPIE_SHIFT                              (5U)
#define PERI_LPTIM1_IER_BIT_UPIE_MASK                               (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_UPIE_SHIFT)
#define PERI_LPTIM1_IER_BIT_DOWNIE_SHIFT                            (6U)
#define PERI_LPTIM1_IER_BIT_DOWNIE_MASK                             (((1U<<1)-1) << PERI_LPTIM1_IER_BIT_DOWNIE_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_LPTIM1_CFGR_BIT_CKSEL_SHIFT                            (0U)
#define PERI_LPTIM1_CFGR_BIT_CKSEL_MASK                             (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_CKSEL_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_CKPOL_SHIFT                            (1U)
#define PERI_LPTIM1_CFGR_BIT_CKPOL_MASK                             (((1U<<2)-1) << PERI_LPTIM1_CFGR_BIT_CKPOL_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_CKFLT_SHIFT                            (3U)
#define PERI_LPTIM1_CFGR_BIT_CKFLT_MASK                             (((1U<<2)-1) << PERI_LPTIM1_CFGR_BIT_CKFLT_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_TRGFLT_SHIFT                           (6U)
#define PERI_LPTIM1_CFGR_BIT_TRGFLT_MASK                            (((1U<<2)-1) << PERI_LPTIM1_CFGR_BIT_TRGFLT_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_PRESC_SHIFT                            (9U)
#define PERI_LPTIM1_CFGR_BIT_PRESC_MASK                             (((1U<<3)-1) << PERI_LPTIM1_CFGR_BIT_PRESC_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_TRIGSEL_SHIFT                          (13U)
#define PERI_LPTIM1_CFGR_BIT_TRIGSEL_MASK                           (((1U<<3)-1) << PERI_LPTIM1_CFGR_BIT_TRIGSEL_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_TRIGEN_SHIFT                           (17U)
#define PERI_LPTIM1_CFGR_BIT_TRIGEN_MASK                            (((1U<<2)-1) << PERI_LPTIM1_CFGR_BIT_TRIGEN_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_TIMOUT_SHIFT                           (19U)
#define PERI_LPTIM1_CFGR_BIT_TIMOUT_MASK                            (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_TIMOUT_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_WAVE_SHIFT                             (20U)
#define PERI_LPTIM1_CFGR_BIT_WAVE_MASK                              (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_WAVE_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_WAVPOL_SHIFT                           (21U)
#define PERI_LPTIM1_CFGR_BIT_WAVPOL_MASK                            (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_WAVPOL_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_PRELOAD_SHIFT                          (22U)
#define PERI_LPTIM1_CFGR_BIT_PRELOAD_MASK                           (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_PRELOAD_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_COUNTMODE_SHIFT                        (23U)
#define PERI_LPTIM1_CFGR_BIT_COUNTMODE_MASK                         (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_COUNTMODE_SHIFT)
#define PERI_LPTIM1_CFGR_BIT_ENC_SHIFT                              (24U)
#define PERI_LPTIM1_CFGR_BIT_ENC_MASK                               (((1U<<1)-1) << PERI_LPTIM1_CFGR_BIT_ENC_SHIFT)

