minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_LPTIM2_CR_BIT_ENABLE_SHIFT                             (0U)
#define PERI_LPTIM2_CR_BIT_ENABLE_MASK                              (((1U<<1)-1) << PERI_LPTIM2_CR_BIT_ENABLE_SHIFT)
#define PERI_LPTIM2_CR_BIT_SNGSTRT_SHIFT                            (1U)
#define PERI_LPTIM2_CR_BIT_SNGSTRT_MASK                             (((1U<<1)-1) << PERI_LPTIM2_CR_BIT_SNGSTRT_SHIFT)
#define PERI_LPTIM2_CR_BIT_CNTSTRT_SHIFT                            (2U)
#define PERI_LPTIM2_CR_BIT_CNTSTRT_MASK                             (((1U<<1)-1) << PERI_LPTIM2_CR_BIT_CNTSTRT_SHIFT)
#define PERI_LPTIM2_CR_BIT_COUNTRST_SHIFT                           (3U)
#define PERI_LPTIM2_CR_BIT_COUNTRST_MASK                            (((1U<<1)-1) << PERI_LPTIM2_CR_BIT_COUNTRST_SHIFT)
#define PERI_LPTIM2_CR_BIT_RSTARE_SHIFT                             (4U)
#define PERI_LPTIM2_CR_BIT_RSTARE_MASK                              (((1U<<1)-1) << PERI_LPTIM2_CR_BIT_RSTARE_SHIFT)

/*--- register CMP -------------------------------------------------*/
#define PERI_LPTIM2_CMP_BIT_CMP_SHIFT                               (0U)
#define PERI_LPTIM2_CMP_BIT_CMP_MASK                                (((1U<<16)-1) << PERI_LPTIM2_CMP_BIT_CMP_SHIFT)

/*--- register ARR -------------------------------------------------*/
#define PERI_LPTIM2_ARR_BIT_ARR_SHIFT                               (0U)
#define PERI_LPTIM2_ARR_BIT_ARR_MASK                                (((1U<<16)-1) << PERI_LPTIM2_ARR_BIT_ARR_SHIFT)

/*--- register CNT -------------------------------------------------*/
#define PERI_LPTIM2_CNT_BIT_CNT_SHIFT                               (0U)
#define PERI_LPTIM2_CNT_BIT_CNT_MASK                                (((1U<<16)-1) << PERI_LPTIM2_CNT_BIT_CNT_SHIFT)

/*--- register CFGR2 -------------------------------------------------*/
#define PERI_LPTIM2_CFGR2_BIT_IN1SEL_SHIFT                          (0U)
#define PERI_LPTIM2_CFGR2_BIT_IN1SEL_MASK                           (((1U<<2)-1) << PERI_LPTIM2_CFGR2_BIT_IN1SEL_SHIFT)
#define PERI_LPTIM2_CFGR2_BIT_IN2SEL_SHIFT                          (4U)
#define PERI_LPTIM2_CFGR2_BIT_IN2SEL_MASK                           (((1U<<2)-1) << PERI_LPTIM2_CFGR2_BIT_IN2SEL_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_LPTIM3_ISR_BIT_CMPM_SHIFT                              (0U)
#define PERI_LPTIM3_ISR_BIT_CMPM_MASK                               (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_CMPM_SHIFT)
#define PERI_LPTIM3_ISR_BIT_ARRM_SHIFT                              (1U)
#define PERI_LPTIM3_ISR_BIT_ARRM_MASK                               (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_ARRM_SHIFT)
#define PERI_LPTIM3_ISR_BIT_EXTTRIG_SHIFT                           (2U)
#define PERI_LPTIM3_ISR_BIT_EXTTRIG_MASK                            (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_EXTTRIG_SHIFT)
#define PERI_LPTIM3_ISR_BIT_CMPOK_SHIFT                             (3U)
#define PERI_LPTIM3_ISR_BIT_CMPOK_MASK                              (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_CMPOK_SHIFT)
#define PERI_LPTIM3_ISR_BIT_ARROK_SHIFT                             (4U)
#define PERI_LPTIM3_ISR_BIT_ARROK_MASK                              (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_ARROK_SHIFT)
#define PERI_LPTIM3_ISR_BIT_UP_SHIFT                                (5U)
#define PERI_LPTIM3_ISR_BIT_UP_MASK                                 (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_UP_SHIFT)
#define PERI_LPTIM3_ISR_BIT_DOWN_SHIFT                              (6U)
#define PERI_LPTIM3_ISR_BIT_DOWN_MASK                               (((1U<<1)-1) << PERI_LPTIM3_ISR_BIT_DOWN_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_LPTIM3_ICR_BIT_CMPMCF_SHIFT                            (0U)
#define PERI_LPTIM3_ICR_BIT_CMPMCF_MASK                             (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_CMPMCF_SHIFT)
#define PERI_LPTIM3_ICR_BIT_ARRMCF_SHIFT                            (1U)
#define PERI_LPTIM3_ICR_BIT_ARRMCF_MASK                             (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_ARRMCF_SHIFT)
#define PERI_LPTIM3_ICR_BIT_EXTTRIGCF_SHIFT                         (2U)
#define PERI_LPTIM3_ICR_BIT_EXTTRIGCF_MASK                          (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_EXTTRIGCF_SHIFT)
#define PERI_LPTIM3_ICR_BIT_CMPOKCF_SHIFT                           (3U)
#define PERI_LPTIM3_ICR_BIT_CMPOKCF_MASK                            (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_CMPOKCF_SHIFT)
#define PERI_LPTIM3_ICR_BIT_ARROKCF_SHIFT                           (4U)
#define PERI_LPTIM3_ICR_BIT_ARROKCF_MASK                            (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_ARROKCF_SHIFT)
#define PERI_LPTIM3_ICR_BIT_UPCF_SHIFT                              (5U)
#define PERI_LPTIM3_ICR_BIT_UPCF_MASK                               (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_UPCF_SHIFT)
#define PERI_LPTIM3_ICR_BIT_DOWNCF_SHIFT                            (6U)
#define PERI_LPTIM3_ICR_BIT_DOWNCF_MASK                             (((1U<<1)-1) << PERI_LPTIM3_ICR_BIT_DOWNCF_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_LPTIM3_IER_BIT_CMPMIE_SHIFT                            (0U)
#define PERI_LPTIM3_IER_BIT_CMPMIE_MASK                             (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_CMPMIE_SHIFT)
#define PERI_LPTIM3_IER_BIT_ARRMIE_SHIFT                            (1U)
#define PERI_LPTIM3_IER_BIT_ARRMIE_MASK                             (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_ARRMIE_SHIFT)
#define PERI_LPTIM3_IER_BIT_EXTTRIGIE_SHIFT                         (2U)
#define PERI_LPTIM3_IER_BIT_EXTTRIGIE_MASK                          (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_EXTTRIGIE_SHIFT)
#define PERI_LPTIM3_IER_BIT_CMPOKIE_SHIFT                           (3U)
#define PERI_LPTIM3_IER_BIT_CMPOKIE_MASK                            (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_CMPOKIE_SHIFT)
#define PERI_LPTIM3_IER_BIT_ARROKIE_SHIFT                           (4U)
#define PERI_LPTIM3_IER_BIT_ARROKIE_MASK                            (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_ARROKIE_SHIFT)
#define PERI_LPTIM3_IER_BIT_UPIE_SHIFT                              (5U)
#define PERI_LPTIM3_IER_BIT_UPIE_MASK                               (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_UPIE_SHIFT)
#define PERI_LPTIM3_IER_BIT_DOWNIE_SHIFT                            (6U)
#define PERI_LPTIM3_IER_BIT_DOWNIE_MASK                             (((1U<<1)-1) << PERI_LPTIM3_IER_BIT_DOWNIE_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_LPTIM3_CFGR_BIT_CKSEL_SHIFT                            (0U)
#define PERI_LPTIM3_CFGR_BIT_CKSEL_MASK                             (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_CKSEL_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_CKPOL_SHIFT                            (1U)
#define PERI_LPTIM3_CFGR_BIT_CKPOL_MASK                             (((1U<<2)-1) << PERI_LPTIM3_CFGR_BIT_CKPOL_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_CKFLT_SHIFT                            (3U)
#define PERI_LPTIM3_CFGR_BIT_CKFLT_MASK                             (((1U<<2)-1) << PERI_LPTIM3_CFGR_BIT_CKFLT_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_TRGFLT_SHIFT                           (6U)
#define PERI_LPTIM3_CFGR_BIT_TRGFLT_MASK                            (((1U<<2)-1) << PERI_LPTIM3_CFGR_BIT_TRGFLT_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_PRESC_SHIFT                            (9U)
#define PERI_LPTIM3_CFGR_BIT_PRESC_MASK                             (((1U<<3)-1) << PERI_LPTIM3_CFGR_BIT_PRESC_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_TRIGSEL_SHIFT                          (13U)
#define PERI_LPTIM3_CFGR_BIT_TRIGSEL_MASK                           (((1U<<3)-1) << PERI_LPTIM3_CFGR_BIT_TRIGSEL_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_TRIGEN_SHIFT                           (17U)
#define PERI_LPTIM3_CFGR_BIT_TRIGEN_MASK                            (((1U<<2)-1) << PERI_LPTIM3_CFGR_BIT_TRIGEN_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_TIMOUT_SHIFT                           (19U)
#define PERI_LPTIM3_CFGR_BIT_TIMOUT_MASK                            (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_TIMOUT_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_WAVE_SHIFT                             (20U)
#define PERI_LPTIM3_CFGR_BIT_WAVE_MASK                              (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_WAVE_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_WAVPOL_SHIFT                           (21U)
#define PERI_LPTIM3_CFGR_BIT_WAVPOL_MASK                            (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_WAVPOL_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_PRELOAD_SHIFT                          (22U)
#define PERI_LPTIM3_CFGR_BIT_PRELOAD_MASK                           (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_PRELOAD_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_COUNTMODE_SHIFT                        (23U)
#define PERI_LPTIM3_CFGR_BIT_COUNTMODE_MASK                         (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_COUNTMODE_SHIFT)
#define PERI_LPTIM3_CFGR_BIT_ENC_SHIFT                              (24U)
#define PERI_LPTIM3_CFGR_BIT_ENC_MASK                               (((1U<<1)-1) << PERI_LPTIM3_CFGR_BIT_ENC_SHIFT)

