minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_LPTIM5_CR_BIT_ENABLE_SHIFT                             (0U)
#define PERI_LPTIM5_CR_BIT_ENABLE_MASK                              (((1U<<1)-1) << PERI_LPTIM5_CR_BIT_ENABLE_SHIFT)
#define PERI_LPTIM5_CR_BIT_SNGSTRT_SHIFT                            (1U)
#define PERI_LPTIM5_CR_BIT_SNGSTRT_MASK                             (((1U<<1)-1) << PERI_LPTIM5_CR_BIT_SNGSTRT_SHIFT)
#define PERI_LPTIM5_CR_BIT_CNTSTRT_SHIFT                            (2U)
#define PERI_LPTIM5_CR_BIT_CNTSTRT_MASK                             (((1U<<1)-1) << PERI_LPTIM5_CR_BIT_CNTSTRT_SHIFT)
#define PERI_LPTIM5_CR_BIT_COUNTRST_SHIFT                           (3U)
#define PERI_LPTIM5_CR_BIT_COUNTRST_MASK                            (((1U<<1)-1) << PERI_LPTIM5_CR_BIT_COUNTRST_SHIFT)
#define PERI_LPTIM5_CR_BIT_RSTARE_SHIFT                             (4U)
#define PERI_LPTIM5_CR_BIT_RSTARE_MASK                              (((1U<<1)-1) << PERI_LPTIM5_CR_BIT_RSTARE_SHIFT)

/*--- register CMP -------------------------------------------------*/
#define PERI_LPTIM5_CMP_BIT_CMP_SHIFT                               (0U)
#define PERI_LPTIM5_CMP_BIT_CMP_MASK                                (((1U<<16)-1) << PERI_LPTIM5_CMP_BIT_CMP_SHIFT)

/*--- register ARR -------------------------------------------------*/
#define PERI_LPTIM5_ARR_BIT_ARR_SHIFT                               (0U)
#define PERI_LPTIM5_ARR_BIT_ARR_MASK                                (((1U<<16)-1) << PERI_LPTIM5_ARR_BIT_ARR_SHIFT)

/*--- register CNT -------------------------------------------------*/
#define PERI_LPTIM5_CNT_BIT_CNT_SHIFT                               (0U)
#define PERI_LPTIM5_CNT_BIT_CNT_MASK                                (((1U<<16)-1) << PERI_LPTIM5_CNT_BIT_CNT_SHIFT)

/*--- register CFGR2 -------------------------------------------------*/
#define PERI_LPTIM5_CFGR2_BIT_IN1SEL_SHIFT                          (0U)
#define PERI_LPTIM5_CFGR2_BIT_IN1SEL_MASK                           (((1U<<2)-1) << PERI_LPTIM5_CFGR2_BIT_IN1SEL_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_LPUART1_CR1_BIT_UE_SHIFT                               (0U)
#define PERI_LPUART1_CR1_BIT_UE_MASK                                (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_UE_SHIFT)
#define PERI_LPUART1_CR1_BIT_UESM_SHIFT                             (1U)
#define PERI_LPUART1_CR1_BIT_UESM_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_UESM_SHIFT)
#define PERI_LPUART1_CR1_BIT_RE_SHIFT                               (2U)
#define PERI_LPUART1_CR1_BIT_RE_MASK                                (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_RE_SHIFT)
#define PERI_LPUART1_CR1_BIT_TE_SHIFT                               (3U)
#define PERI_LPUART1_CR1_BIT_TE_MASK                                (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_TE_SHIFT)
#define PERI_LPUART1_CR1_BIT_IDLEIE_SHIFT                           (4U)
#define PERI_LPUART1_CR1_BIT_IDLEIE_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_IDLEIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_RXNEIE_SHIFT                           (5U)
#define PERI_LPUART1_CR1_BIT_RXNEIE_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_RXNEIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_TCIE_SHIFT                             (6U)
#define PERI_LPUART1_CR1_BIT_TCIE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_TCIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_TXEIE_SHIFT                            (7U)
#define PERI_LPUART1_CR1_BIT_TXEIE_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_TXEIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_PEIE_SHIFT                             (8U)
#define PERI_LPUART1_CR1_BIT_PEIE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_PEIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_PS_SHIFT                               (9U)
#define PERI_LPUART1_CR1_BIT_PS_MASK                                (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_PS_SHIFT)
#define PERI_LPUART1_CR1_BIT_PCE_SHIFT                              (10U)
#define PERI_LPUART1_CR1_BIT_PCE_MASK                               (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_PCE_SHIFT)
#define PERI_LPUART1_CR1_BIT_WAKE_SHIFT                             (11U)
#define PERI_LPUART1_CR1_BIT_WAKE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_WAKE_SHIFT)
#define PERI_LPUART1_CR1_BIT_M0_SHIFT                               (12U)
#define PERI_LPUART1_CR1_BIT_M0_MASK                                (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_M0_SHIFT)
#define PERI_LPUART1_CR1_BIT_MME_SHIFT                              (13U)
#define PERI_LPUART1_CR1_BIT_MME_MASK                               (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_MME_SHIFT)
#define PERI_LPUART1_CR1_BIT_CMIE_SHIFT                             (14U)
#define PERI_LPUART1_CR1_BIT_CMIE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_CMIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_DEDT_SHIFT                             (16U)
#define PERI_LPUART1_CR1_BIT_DEDT_MASK                              (((1U<<5)-1) << PERI_LPUART1_CR1_BIT_DEDT_SHIFT)
#define PERI_LPUART1_CR1_BIT_DEAT_SHIFT                             (21U)
#define PERI_LPUART1_CR1_BIT_DEAT_MASK                              (((1U<<5)-1) << PERI_LPUART1_CR1_BIT_DEAT_SHIFT)
#define PERI_LPUART1_CR1_BIT_M1_SHIFT                               (28U)
#define PERI_LPUART1_CR1_BIT_M1_MASK                                (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_M1_SHIFT)
#define PERI_LPUART1_CR1_BIT_FIFOEN_SHIFT                           (29U)
#define PERI_LPUART1_CR1_BIT_FIFOEN_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_FIFOEN_SHIFT)
#define PERI_LPUART1_CR1_BIT_TXFEIE_SHIFT                           (30U)
#define PERI_LPUART1_CR1_BIT_TXFEIE_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_TXFEIE_SHIFT)
#define PERI_LPUART1_CR1_BIT_RXFFIE_SHIFT                           (31U)
#define PERI_LPUART1_CR1_BIT_RXFFIE_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR1_BIT_RXFFIE_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_LPUART1_CR2_BIT_ADDM7_SHIFT                            (4U)
#define PERI_LPUART1_CR2_BIT_ADDM7_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR2_BIT_ADDM7_SHIFT)
#define PERI_LPUART1_CR2_BIT_STOP_SHIFT                             (12U)
#define PERI_LPUART1_CR2_BIT_STOP_MASK                              (((1U<<2)-1) << PERI_LPUART1_CR2_BIT_STOP_SHIFT)
#define PERI_LPUART1_CR2_BIT_SWAP_SHIFT                             (15U)
#define PERI_LPUART1_CR2_BIT_SWAP_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR2_BIT_SWAP_SHIFT)
#define PERI_LPUART1_CR2_BIT_RXINV_SHIFT                            (16U)
#define PERI_LPUART1_CR2_BIT_RXINV_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR2_BIT_RXINV_SHIFT)
#define PERI_LPUART1_CR2_BIT_TXINV_SHIFT                            (17U)
#define PERI_LPUART1_CR2_BIT_TXINV_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR2_BIT_TXINV_SHIFT)
#define PERI_LPUART1_CR2_BIT_DATAINV_SHIFT                          (18U)
#define PERI_LPUART1_CR2_BIT_DATAINV_MASK                           (((1U<<1)-1) << PERI_LPUART1_CR2_BIT_DATAINV_SHIFT)
#define PERI_LPUART1_CR2_BIT_MSBFIRST_SHIFT                         (19U)
#define PERI_LPUART1_CR2_BIT_MSBFIRST_MASK                          (((1U<<1)-1) << PERI_LPUART1_CR2_BIT_MSBFIRST_SHIFT)
#define PERI_LPUART1_CR2_BIT_ADD_SHIFT                              (24U)
#define PERI_LPUART1_CR2_BIT_ADD_MASK                               (((1U<<8)-1) << PERI_LPUART1_CR2_BIT_ADD_SHIFT)

/*--- register CR3 -------------------------------------------------*/
#define PERI_LPUART1_CR3_BIT_EIE_SHIFT                              (0U)
#define PERI_LPUART1_CR3_BIT_EIE_MASK                               (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_EIE_SHIFT)
#define PERI_LPUART1_CR3_BIT_HDSEL_SHIFT                            (3U)
#define PERI_LPUART1_CR3_BIT_HDSEL_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_HDSEL_SHIFT)
#define PERI_LPUART1_CR3_BIT_DMAR_SHIFT                             (6U)
#define PERI_LPUART1_CR3_BIT_DMAR_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_DMAR_SHIFT)
#define PERI_LPUART1_CR3_BIT_DMAT_SHIFT                             (7U)
#define PERI_LPUART1_CR3_BIT_DMAT_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_DMAT_SHIFT)
#define PERI_LPUART1_CR3_BIT_RTSE_SHIFT                             (8U)
#define PERI_LPUART1_CR3_BIT_RTSE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_RTSE_SHIFT)
#define PERI_LPUART1_CR3_BIT_CTSE_SHIFT                             (9U)
#define PERI_LPUART1_CR3_BIT_CTSE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_CTSE_SHIFT)
#define PERI_LPUART1_CR3_BIT_CTSIE_SHIFT                            (10U)
#define PERI_LPUART1_CR3_BIT_CTSIE_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_CTSIE_SHIFT)
#define PERI_LPUART1_CR3_BIT_OVRDIS_SHIFT                           (12U)
#define PERI_LPUART1_CR3_BIT_OVRDIS_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_OVRDIS_SHIFT)
#define PERI_LPUART1_CR3_BIT_DDRE_SHIFT                             (13U)
#define PERI_LPUART1_CR3_BIT_DDRE_MASK                              (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_DDRE_SHIFT)
#define PERI_LPUART1_CR3_BIT_DEM_SHIFT                              (14U)
#define PERI_LPUART1_CR3_BIT_DEM_MASK                               (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_DEM_SHIFT)
#define PERI_LPUART1_CR3_BIT_DEP_SHIFT                              (15U)
#define PERI_LPUART1_CR3_BIT_DEP_MASK                               (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_DEP_SHIFT)
#define PERI_LPUART1_CR3_BIT_WUS_SHIFT                              (20U)
#define PERI_LPUART1_CR3_BIT_WUS_MASK                               (((1U<<2)-1) << PERI_LPUART1_CR3_BIT_WUS_SHIFT)
#define PERI_LPUART1_CR3_BIT_WUFIE_SHIFT                            (22U)
#define PERI_LPUART1_CR3_BIT_WUFIE_MASK                             (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_WUFIE_SHIFT)
#define PERI_LPUART1_CR3_BIT_TXFTIE_SHIFT                           (23U)
#define PERI_LPUART1_CR3_BIT_TXFTIE_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_TXFTIE_SHIFT)
#define PERI_LPUART1_CR3_BIT_RXFTCFG_SHIFT                          (25U)
#define PERI_LPUART1_CR3_BIT_RXFTCFG_MASK                           (((1U<<3)-1) << PERI_LPUART1_CR3_BIT_RXFTCFG_SHIFT)
#define PERI_LPUART1_CR3_BIT_RXFTIE_SHIFT                           (28U)
#define PERI_LPUART1_CR3_BIT_RXFTIE_MASK                            (((1U<<1)-1) << PERI_LPUART1_CR3_BIT_RXFTIE_SHIFT)
#define PERI_LPUART1_CR3_BIT_TXFTCFG_SHIFT                          (29U)
#define PERI_LPUART1_CR3_BIT_TXFTCFG_MASK                           (((1U<<3)-1) << PERI_LPUART1_CR3_BIT_TXFTCFG_SHIFT)

/*--- register BRR -------------------------------------------------*/
#define PERI_LPUART1_BRR_BIT_BRR_SHIFT                              (0U)
#define PERI_LPUART1_BRR_BIT_BRR_MASK                               (((1U<<20)-1) << PERI_LPUART1_BRR_BIT_BRR_SHIFT)

/*--- register GTPR -------------------------------------------------*/
#define PERI_LPUART1_GTPR_BIT_PSC_SHIFT                             (0U)
#define PERI_LPUART1_GTPR_BIT_PSC_MASK                              (((1U<<8)-1) << PERI_LPUART1_GTPR_BIT_PSC_SHIFT)
#define PERI_LPUART1_GTPR_BIT_GT_SHIFT                              (8U)
#define PERI_LPUART1_GTPR_BIT_GT_MASK                               (((1U<<8)-1) << PERI_LPUART1_GTPR_BIT_GT_SHIFT)

/*--- register RTOR -------------------------------------------------*/
#define PERI_LPUART1_RTOR_BIT_RTO_SHIFT                             (0U)
#define PERI_LPUART1_RTOR_BIT_RTO_MASK                              (((1U<<24)-1) << PERI_LPUART1_RTOR_BIT_RTO_SHIFT)
#define PERI_LPUART1_RTOR_BIT_BLEN_SHIFT                            (24U)
#define PERI_LPUART1_RTOR_BIT_BLEN_MASK                             (((1U<<8)-1) << PERI_LPUART1_RTOR_BIT_BLEN_SHIFT)

