minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register TWCR -------------------------------------------------*/
#define PERI_LTDC_TWCR_BIT_TOTALH_SHIFT                             (0U)
#define PERI_LTDC_TWCR_BIT_TOTALH_MASK                              (((1U<<11)-1) << PERI_LTDC_TWCR_BIT_TOTALH_SHIFT)
#define PERI_LTDC_TWCR_BIT_TOTALW_SHIFT                             (16U)
#define PERI_LTDC_TWCR_BIT_TOTALW_MASK                              (((1U<<12)-1) << PERI_LTDC_TWCR_BIT_TOTALW_SHIFT)

/*--- register GCR -------------------------------------------------*/
#define PERI_LTDC_GCR_BIT_LTDCEN_SHIFT                              (0U)
#define PERI_LTDC_GCR_BIT_LTDCEN_MASK                               (((1U<<1)-1) << PERI_LTDC_GCR_BIT_LTDCEN_SHIFT)
#define PERI_LTDC_GCR_BIT_DBW_SHIFT                                 (4U)
#define PERI_LTDC_GCR_BIT_DBW_MASK                                  (((1U<<3)-1) << PERI_LTDC_GCR_BIT_DBW_SHIFT)
#define PERI_LTDC_GCR_BIT_DGW_SHIFT                                 (8U)
#define PERI_LTDC_GCR_BIT_DGW_MASK                                  (((1U<<3)-1) << PERI_LTDC_GCR_BIT_DGW_SHIFT)
#define PERI_LTDC_GCR_BIT_DRW_SHIFT                                 (12U)
#define PERI_LTDC_GCR_BIT_DRW_MASK                                  (((1U<<3)-1) << PERI_LTDC_GCR_BIT_DRW_SHIFT)
#define PERI_LTDC_GCR_BIT_DEN_SHIFT                                 (16U)
#define PERI_LTDC_GCR_BIT_DEN_MASK                                  (((1U<<1)-1) << PERI_LTDC_GCR_BIT_DEN_SHIFT)
#define PERI_LTDC_GCR_BIT_PCPOL_SHIFT                               (28U)
#define PERI_LTDC_GCR_BIT_PCPOL_MASK                                (((1U<<1)-1) << PERI_LTDC_GCR_BIT_PCPOL_SHIFT)
#define PERI_LTDC_GCR_BIT_DEPOL_SHIFT                               (29U)
#define PERI_LTDC_GCR_BIT_DEPOL_MASK                                (((1U<<1)-1) << PERI_LTDC_GCR_BIT_DEPOL_SHIFT)
#define PERI_LTDC_GCR_BIT_VSPOL_SHIFT                               (30U)
#define PERI_LTDC_GCR_BIT_VSPOL_MASK                                (((1U<<1)-1) << PERI_LTDC_GCR_BIT_VSPOL_SHIFT)
#define PERI_LTDC_GCR_BIT_HSPOL_SHIFT                               (31U)
#define PERI_LTDC_GCR_BIT_HSPOL_MASK                                (((1U<<1)-1) << PERI_LTDC_GCR_BIT_HSPOL_SHIFT)

/*--- register SRCR -------------------------------------------------*/
#define PERI_LTDC_SRCR_BIT_IMR_SHIFT                                (0U)
#define PERI_LTDC_SRCR_BIT_IMR_MASK                                 (((1U<<1)-1) << PERI_LTDC_SRCR_BIT_IMR_SHIFT)
#define PERI_LTDC_SRCR_BIT_VBR_SHIFT                                (1U)
#define PERI_LTDC_SRCR_BIT_VBR_MASK                                 (((1U<<1)-1) << PERI_LTDC_SRCR_BIT_VBR_SHIFT)

/*--- register BCCR -------------------------------------------------*/
#define PERI_LTDC_BCCR_BIT_BCBLUE_SHIFT                             (0U)
#define PERI_LTDC_BCCR_BIT_BCBLUE_MASK                              (((1U<<8)-1) << PERI_LTDC_BCCR_BIT_BCBLUE_SHIFT)
#define PERI_LTDC_BCCR_BIT_BCGREEN_SHIFT                            (8U)
#define PERI_LTDC_BCCR_BIT_BCGREEN_MASK                             (((1U<<8)-1) << PERI_LTDC_BCCR_BIT_BCGREEN_SHIFT)
#define PERI_LTDC_BCCR_BIT_BCRED_SHIFT                              (16U)
#define PERI_LTDC_BCCR_BIT_BCRED_MASK                               (((1U<<8)-1) << PERI_LTDC_BCCR_BIT_BCRED_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_LTDC_IER_BIT_LIE_SHIFT                                 (0U)
#define PERI_LTDC_IER_BIT_LIE_MASK                                  (((1U<<1)-1) << PERI_LTDC_IER_BIT_LIE_SHIFT)
#define PERI_LTDC_IER_BIT_FUIE_SHIFT                                (1U)
#define PERI_LTDC_IER_BIT_FUIE_MASK                                 (((1U<<1)-1) << PERI_LTDC_IER_BIT_FUIE_SHIFT)
#define PERI_LTDC_IER_BIT_TERRIE_SHIFT                              (2U)
#define PERI_LTDC_IER_BIT_TERRIE_MASK                               (((1U<<1)-1) << PERI_LTDC_IER_BIT_TERRIE_SHIFT)
#define PERI_LTDC_IER_BIT_RRIE_SHIFT                                (3U)
#define PERI_LTDC_IER_BIT_RRIE_MASK                                 (((1U<<1)-1) << PERI_LTDC_IER_BIT_RRIE_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_LTDC_ISR_BIT_LIF_SHIFT                                 (0U)
#define PERI_LTDC_ISR_BIT_LIF_MASK                                  (((1U<<1)-1) << PERI_LTDC_ISR_BIT_LIF_SHIFT)
#define PERI_LTDC_ISR_BIT_FUIF_SHIFT                                (1U)
#define PERI_LTDC_ISR_BIT_FUIF_MASK                                 (((1U<<1)-1) << PERI_LTDC_ISR_BIT_FUIF_SHIFT)
#define PERI_LTDC_ISR_BIT_TERRIF_SHIFT                              (2U)
#define PERI_LTDC_ISR_BIT_TERRIF_MASK                               (((1U<<1)-1) << PERI_LTDC_ISR_BIT_TERRIF_SHIFT)
#define PERI_LTDC_ISR_BIT_RRIF_SHIFT                                (3U)
#define PERI_LTDC_ISR_BIT_RRIF_MASK                                 (((1U<<1)-1) << PERI_LTDC_ISR_BIT_RRIF_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_LTDC_ICR_BIT_CLIF_SHIFT                                (0U)
#define PERI_LTDC_ICR_BIT_CLIF_MASK                                 (((1U<<1)-1) << PERI_LTDC_ICR_BIT_CLIF_SHIFT)
#define PERI_LTDC_ICR_BIT_CFUIF_SHIFT                               (1U)
#define PERI_LTDC_ICR_BIT_CFUIF_MASK                                (((1U<<1)-1) << PERI_LTDC_ICR_BIT_CFUIF_SHIFT)
#define PERI_LTDC_ICR_BIT_CTERRIF_SHIFT                             (2U)
#define PERI_LTDC_ICR_BIT_CTERRIF_MASK                              (((1U<<1)-1) << PERI_LTDC_ICR_BIT_CTERRIF_SHIFT)
#define PERI_LTDC_ICR_BIT_CRRIF_SHIFT                               (3U)
#define PERI_LTDC_ICR_BIT_CRRIF_MASK                                (((1U<<1)-1) << PERI_LTDC_ICR_BIT_CRRIF_SHIFT)

/*--- register LIPCR -------------------------------------------------*/
#define PERI_LTDC_LIPCR_BIT_LIPOS_SHIFT                             (0U)
#define PERI_LTDC_LIPCR_BIT_LIPOS_MASK                              (((1U<<11)-1) << PERI_LTDC_LIPCR_BIT_LIPOS_SHIFT)

