minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CPSR -------------------------------------------------*/
#define PERI_LTDC_CPSR_BIT_CYPOS_SHIFT                              (0U)
#define PERI_LTDC_CPSR_BIT_CYPOS_MASK                               (((1U<<16)-1) << PERI_LTDC_CPSR_BIT_CYPOS_SHIFT)
#define PERI_LTDC_CPSR_BIT_CXPOS_SHIFT                              (16U)
#define PERI_LTDC_CPSR_BIT_CXPOS_MASK                               (((1U<<16)-1) << PERI_LTDC_CPSR_BIT_CXPOS_SHIFT)

/*--- register CDSR -------------------------------------------------*/
#define PERI_LTDC_CDSR_BIT_VDES_SHIFT                               (0U)
#define PERI_LTDC_CDSR_BIT_VDES_MASK                                (((1U<<1)-1) << PERI_LTDC_CDSR_BIT_VDES_SHIFT)
#define PERI_LTDC_CDSR_BIT_HDES_SHIFT                               (1U)
#define PERI_LTDC_CDSR_BIT_HDES_MASK                                (((1U<<1)-1) << PERI_LTDC_CDSR_BIT_HDES_SHIFT)
#define PERI_LTDC_CDSR_BIT_VSYNCS_SHIFT                             (2U)
#define PERI_LTDC_CDSR_BIT_VSYNCS_MASK                              (((1U<<1)-1) << PERI_LTDC_CDSR_BIT_VSYNCS_SHIFT)
#define PERI_LTDC_CDSR_BIT_HSYNCS_SHIFT                             (3U)
#define PERI_LTDC_CDSR_BIT_HSYNCS_MASK                              (((1U<<1)-1) << PERI_LTDC_CDSR_BIT_HSYNCS_SHIFT)

/*--- register L1CR -------------------------------------------------*/
#define PERI_LTDC_L1CR_BIT_LEN_SHIFT                                (0U)
#define PERI_LTDC_L1CR_BIT_LEN_MASK                                 (((1U<<1)-1) << PERI_LTDC_L1CR_BIT_LEN_SHIFT)
#define PERI_LTDC_L1CR_BIT_COLKEN_SHIFT                             (1U)
#define PERI_LTDC_L1CR_BIT_COLKEN_MASK                              (((1U<<1)-1) << PERI_LTDC_L1CR_BIT_COLKEN_SHIFT)
#define PERI_LTDC_L1CR_BIT_CLUTEN_SHIFT                             (4U)
#define PERI_LTDC_L1CR_BIT_CLUTEN_MASK                              (((1U<<1)-1) << PERI_LTDC_L1CR_BIT_CLUTEN_SHIFT)

/*--- register L1WHPCR -------------------------------------------------*/
#define PERI_LTDC_L1WHPCR_BIT_WHSTPOS_SHIFT                         (0U)
#define PERI_LTDC_L1WHPCR_BIT_WHSTPOS_MASK                          (((1U<<12)-1) << PERI_LTDC_L1WHPCR_BIT_WHSTPOS_SHIFT)
#define PERI_LTDC_L1WHPCR_BIT_WHSPPOS_SHIFT                         (16U)
#define PERI_LTDC_L1WHPCR_BIT_WHSPPOS_MASK                          (((1U<<12)-1) << PERI_LTDC_L1WHPCR_BIT_WHSPPOS_SHIFT)

/*--- register L1WVPCR -------------------------------------------------*/
#define PERI_LTDC_L1WVPCR_BIT_WVSTPOS_SHIFT                         (0U)
#define PERI_LTDC_L1WVPCR_BIT_WVSTPOS_MASK                          (((1U<<11)-1) << PERI_LTDC_L1WVPCR_BIT_WVSTPOS_SHIFT)
#define PERI_LTDC_L1WVPCR_BIT_WVSPPOS_SHIFT                         (16U)
#define PERI_LTDC_L1WVPCR_BIT_WVSPPOS_MASK                          (((1U<<11)-1) << PERI_LTDC_L1WVPCR_BIT_WVSPPOS_SHIFT)

/*--- register L1CKCR -------------------------------------------------*/
#define PERI_LTDC_L1CKCR_BIT_CKBLUE_SHIFT                           (0U)
#define PERI_LTDC_L1CKCR_BIT_CKBLUE_MASK                            (((1U<<8)-1) << PERI_LTDC_L1CKCR_BIT_CKBLUE_SHIFT)
#define PERI_LTDC_L1CKCR_BIT_CKGREEN_SHIFT                          (8U)
#define PERI_LTDC_L1CKCR_BIT_CKGREEN_MASK                           (((1U<<8)-1) << PERI_LTDC_L1CKCR_BIT_CKGREEN_SHIFT)
#define PERI_LTDC_L1CKCR_BIT_CKRED_SHIFT                            (16U)
#define PERI_LTDC_L1CKCR_BIT_CKRED_MASK                             (((1U<<8)-1) << PERI_LTDC_L1CKCR_BIT_CKRED_SHIFT)

/*--- register L1PFCR -------------------------------------------------*/
#define PERI_LTDC_L1PFCR_BIT_PF_SHIFT                               (0U)
#define PERI_LTDC_L1PFCR_BIT_PF_MASK                                (((1U<<3)-1) << PERI_LTDC_L1PFCR_BIT_PF_SHIFT)

/*--- register L1CACR -------------------------------------------------*/
#define PERI_LTDC_L1CACR_BIT_CONSTA_SHIFT                           (0U)
#define PERI_LTDC_L1CACR_BIT_CONSTA_MASK                            (((1U<<8)-1) << PERI_LTDC_L1CACR_BIT_CONSTA_SHIFT)

/*--- register L1DCCR -------------------------------------------------*/
#define PERI_LTDC_L1DCCR_BIT_DCBLUE_SHIFT                           (0U)
#define PERI_LTDC_L1DCCR_BIT_DCBLUE_MASK                            (((1U<<8)-1) << PERI_LTDC_L1DCCR_BIT_DCBLUE_SHIFT)
#define PERI_LTDC_L1DCCR_BIT_DCGREEN_SHIFT                          (8U)
#define PERI_LTDC_L1DCCR_BIT_DCGREEN_MASK                           (((1U<<8)-1) << PERI_LTDC_L1DCCR_BIT_DCGREEN_SHIFT)
#define PERI_LTDC_L1DCCR_BIT_DCRED_SHIFT                            (16U)
#define PERI_LTDC_L1DCCR_BIT_DCRED_MASK                             (((1U<<8)-1) << PERI_LTDC_L1DCCR_BIT_DCRED_SHIFT)
#define PERI_LTDC_L1DCCR_BIT_DCALPHA_SHIFT                          (24U)
#define PERI_LTDC_L1DCCR_BIT_DCALPHA_MASK                           (((1U<<8)-1) << PERI_LTDC_L1DCCR_BIT_DCALPHA_SHIFT)

/*--- register L1BFCR -------------------------------------------------*/
#define PERI_LTDC_L1BFCR_BIT_BF2_SHIFT                              (0U)
#define PERI_LTDC_L1BFCR_BIT_BF2_MASK                               (((1U<<3)-1) << PERI_LTDC_L1BFCR_BIT_BF2_SHIFT)
#define PERI_LTDC_L1BFCR_BIT_BF1_SHIFT                              (8U)
#define PERI_LTDC_L1BFCR_BIT_BF1_MASK                               (((1U<<3)-1) << PERI_LTDC_L1BFCR_BIT_BF1_SHIFT)

/*--- register L1CFBAR -------------------------------------------------*/
#define PERI_LTDC_L1CFBAR_BIT_CFBADD_SHIFT                          (0U)
#define PERI_LTDC_L1CFBAR_BIT_CFBADD_MASK                           (((1U<<32)-1) << PERI_LTDC_L1CFBAR_BIT_CFBADD_SHIFT)

/*--- register L1CFBLR -------------------------------------------------*/
#define PERI_LTDC_L1CFBLR_BIT_CFBLL_SHIFT                           (0U)
#define PERI_LTDC_L1CFBLR_BIT_CFBLL_MASK                            (((1U<<13)-1) << PERI_LTDC_L1CFBLR_BIT_CFBLL_SHIFT)
#define PERI_LTDC_L1CFBLR_BIT_CFBP_SHIFT                            (16U)
#define PERI_LTDC_L1CFBLR_BIT_CFBP_MASK                             (((1U<<13)-1) << PERI_LTDC_L1CFBLR_BIT_CFBP_SHIFT)

