minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register L1CFBLNR -------------------------------------------------*/
#define PERI_LTDC_L1CFBLNR_BIT_CFBLNBR_SHIFT                        (0U)
#define PERI_LTDC_L1CFBLNR_BIT_CFBLNBR_MASK                         (((1U<<11)-1) << PERI_LTDC_L1CFBLNR_BIT_CFBLNBR_SHIFT)

/*--- register L1CLUTWR -------------------------------------------------*/
#define PERI_LTDC_L1CLUTWR_BIT_BLUE_SHIFT                           (0U)
#define PERI_LTDC_L1CLUTWR_BIT_BLUE_MASK                            (((1U<<8)-1) << PERI_LTDC_L1CLUTWR_BIT_BLUE_SHIFT)
#define PERI_LTDC_L1CLUTWR_BIT_GREEN_SHIFT                          (8U)
#define PERI_LTDC_L1CLUTWR_BIT_GREEN_MASK                           (((1U<<8)-1) << PERI_LTDC_L1CLUTWR_BIT_GREEN_SHIFT)
#define PERI_LTDC_L1CLUTWR_BIT_RED_SHIFT                            (16U)
#define PERI_LTDC_L1CLUTWR_BIT_RED_MASK                             (((1U<<8)-1) << PERI_LTDC_L1CLUTWR_BIT_RED_SHIFT)
#define PERI_LTDC_L1CLUTWR_BIT_CLUTADD_SHIFT                        (24U)
#define PERI_LTDC_L1CLUTWR_BIT_CLUTADD_MASK                         (((1U<<8)-1) << PERI_LTDC_L1CLUTWR_BIT_CLUTADD_SHIFT)

/*--- register L2CR -------------------------------------------------*/
#define PERI_LTDC_L2CR_BIT_LEN_SHIFT                                (0U)
#define PERI_LTDC_L2CR_BIT_LEN_MASK                                 (((1U<<1)-1) << PERI_LTDC_L2CR_BIT_LEN_SHIFT)
#define PERI_LTDC_L2CR_BIT_COLKEN_SHIFT                             (1U)
#define PERI_LTDC_L2CR_BIT_COLKEN_MASK                              (((1U<<1)-1) << PERI_LTDC_L2CR_BIT_COLKEN_SHIFT)
#define PERI_LTDC_L2CR_BIT_CLUTEN_SHIFT                             (4U)
#define PERI_LTDC_L2CR_BIT_CLUTEN_MASK                              (((1U<<1)-1) << PERI_LTDC_L2CR_BIT_CLUTEN_SHIFT)

/*--- register L2WHPCR -------------------------------------------------*/
#define PERI_LTDC_L2WHPCR_BIT_WHSTPOS_SHIFT                         (0U)
#define PERI_LTDC_L2WHPCR_BIT_WHSTPOS_MASK                          (((1U<<12)-1) << PERI_LTDC_L2WHPCR_BIT_WHSTPOS_SHIFT)
#define PERI_LTDC_L2WHPCR_BIT_WHSPPOS_SHIFT                         (16U)
#define PERI_LTDC_L2WHPCR_BIT_WHSPPOS_MASK                          (((1U<<12)-1) << PERI_LTDC_L2WHPCR_BIT_WHSPPOS_SHIFT)

/*--- register L2WVPCR -------------------------------------------------*/
#define PERI_LTDC_L2WVPCR_BIT_WVSTPOS_SHIFT                         (0U)
#define PERI_LTDC_L2WVPCR_BIT_WVSTPOS_MASK                          (((1U<<11)-1) << PERI_LTDC_L2WVPCR_BIT_WVSTPOS_SHIFT)
#define PERI_LTDC_L2WVPCR_BIT_WVSPPOS_SHIFT                         (16U)
#define PERI_LTDC_L2WVPCR_BIT_WVSPPOS_MASK                          (((1U<<11)-1) << PERI_LTDC_L2WVPCR_BIT_WVSPPOS_SHIFT)

/*--- register L2CKCR -------------------------------------------------*/
#define PERI_LTDC_L2CKCR_BIT_CKBLUE_SHIFT                           (0U)
#define PERI_LTDC_L2CKCR_BIT_CKBLUE_MASK                            (((1U<<8)-1) << PERI_LTDC_L2CKCR_BIT_CKBLUE_SHIFT)
#define PERI_LTDC_L2CKCR_BIT_CKGREEN_SHIFT                          (8U)
#define PERI_LTDC_L2CKCR_BIT_CKGREEN_MASK                           (((1U<<8)-1) << PERI_LTDC_L2CKCR_BIT_CKGREEN_SHIFT)
#define PERI_LTDC_L2CKCR_BIT_CKRED_SHIFT                            (16U)
#define PERI_LTDC_L2CKCR_BIT_CKRED_MASK                             (((1U<<8)-1) << PERI_LTDC_L2CKCR_BIT_CKRED_SHIFT)

/*--- register L2PFCR -------------------------------------------------*/
#define PERI_LTDC_L2PFCR_BIT_PF_SHIFT                               (0U)
#define PERI_LTDC_L2PFCR_BIT_PF_MASK                                (((1U<<3)-1) << PERI_LTDC_L2PFCR_BIT_PF_SHIFT)

/*--- register L2CACR -------------------------------------------------*/
#define PERI_LTDC_L2CACR_BIT_CONSTA_SHIFT                           (0U)
#define PERI_LTDC_L2CACR_BIT_CONSTA_MASK                            (((1U<<8)-1) << PERI_LTDC_L2CACR_BIT_CONSTA_SHIFT)

/*--- register L2DCCR -------------------------------------------------*/
#define PERI_LTDC_L2DCCR_BIT_DCBLUE_SHIFT                           (0U)
#define PERI_LTDC_L2DCCR_BIT_DCBLUE_MASK                            (((1U<<8)-1) << PERI_LTDC_L2DCCR_BIT_DCBLUE_SHIFT)
#define PERI_LTDC_L2DCCR_BIT_DCGREEN_SHIFT                          (8U)
#define PERI_LTDC_L2DCCR_BIT_DCGREEN_MASK                           (((1U<<8)-1) << PERI_LTDC_L2DCCR_BIT_DCGREEN_SHIFT)
#define PERI_LTDC_L2DCCR_BIT_DCRED_SHIFT                            (16U)
#define PERI_LTDC_L2DCCR_BIT_DCRED_MASK                             (((1U<<8)-1) << PERI_LTDC_L2DCCR_BIT_DCRED_SHIFT)
#define PERI_LTDC_L2DCCR_BIT_DCALPHA_SHIFT                          (24U)
#define PERI_LTDC_L2DCCR_BIT_DCALPHA_MASK                           (((1U<<8)-1) << PERI_LTDC_L2DCCR_BIT_DCALPHA_SHIFT)

/*--- register L2BFCR -------------------------------------------------*/
#define PERI_LTDC_L2BFCR_BIT_BF2_SHIFT                              (0U)
#define PERI_LTDC_L2BFCR_BIT_BF2_MASK                               (((1U<<3)-1) << PERI_LTDC_L2BFCR_BIT_BF2_SHIFT)
#define PERI_LTDC_L2BFCR_BIT_BF1_SHIFT                              (8U)
#define PERI_LTDC_L2BFCR_BIT_BF1_MASK                               (((1U<<3)-1) << PERI_LTDC_L2BFCR_BIT_BF1_SHIFT)

/*--- register L2CFBAR -------------------------------------------------*/
#define PERI_LTDC_L2CFBAR_BIT_CFBADD_SHIFT                          (0U)
#define PERI_LTDC_L2CFBAR_BIT_CFBADD_MASK                           (((1U<<32)-1) << PERI_LTDC_L2CFBAR_BIT_CFBADD_SHIFT)

/*--- register L2CFBLR -------------------------------------------------*/
#define PERI_LTDC_L2CFBLR_BIT_CFBLL_SHIFT                           (0U)
#define PERI_LTDC_L2CFBLR_BIT_CFBLL_MASK                            (((1U<<13)-1) << PERI_LTDC_L2CFBLR_BIT_CFBLL_SHIFT)
#define PERI_LTDC_L2CFBLR_BIT_CFBP_SHIFT                            (16U)
#define PERI_LTDC_L2CFBLR_BIT_CFBP_MASK                             (((1U<<13)-1) << PERI_LTDC_L2CFBLR_BIT_CFBP_SHIFT)

/*--- register L2CFBLNR -------------------------------------------------*/
#define PERI_LTDC_L2CFBLNR_BIT_CFBLNBR_SHIFT                        (0U)
#define PERI_LTDC_L2CFBLNR_BIT_CFBLNBR_MASK                         (((1U<<11)-1) << PERI_LTDC_L2CFBLNR_BIT_CFBLNBR_SHIFT)

/*--- register L2CLUTWR -------------------------------------------------*/
#define PERI_LTDC_L2CLUTWR_BIT_BLUE_SHIFT                           (0U)
#define PERI_LTDC_L2CLUTWR_BIT_BLUE_MASK                            (((1U<<8)-1) << PERI_LTDC_L2CLUTWR_BIT_BLUE_SHIFT)
#define PERI_LTDC_L2CLUTWR_BIT_GREEN_SHIFT                          (8U)
#define PERI_LTDC_L2CLUTWR_BIT_GREEN_MASK                           (((1U<<8)-1) << PERI_LTDC_L2CLUTWR_BIT_GREEN_SHIFT)
#define PERI_LTDC_L2CLUTWR_BIT_RED_SHIFT                            (16U)
#define PERI_LTDC_L2CLUTWR_BIT_RED_MASK                             (((1U<<8)-1) << PERI_LTDC_L2CLUTWR_BIT_RED_SHIFT)
#define PERI_LTDC_L2CLUTWR_BIT_CLUTADD_SHIFT                        (24U)
#define PERI_LTDC_L2CLUTWR_BIT_CLUTADD_MASK                         (((1U<<8)-1) << PERI_LTDC_L2CLUTWR_BIT_CLUTADD_SHIFT)

