minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_MDIOS_CR_BIT_EN_SHIFT                                  (0U)
#define PERI_MDIOS_CR_BIT_EN_MASK                                   (((1U<<1)-1) << PERI_MDIOS_CR_BIT_EN_SHIFT)
#define PERI_MDIOS_CR_BIT_WRIE_SHIFT                                (1U)
#define PERI_MDIOS_CR_BIT_WRIE_MASK                                 (((1U<<1)-1) << PERI_MDIOS_CR_BIT_WRIE_SHIFT)
#define PERI_MDIOS_CR_BIT_RDIE_SHIFT                                (2U)
#define PERI_MDIOS_CR_BIT_RDIE_MASK                                 (((1U<<1)-1) << PERI_MDIOS_CR_BIT_RDIE_SHIFT)
#define PERI_MDIOS_CR_BIT_EIE_SHIFT                                 (3U)
#define PERI_MDIOS_CR_BIT_EIE_MASK                                  (((1U<<1)-1) << PERI_MDIOS_CR_BIT_EIE_SHIFT)
#define PERI_MDIOS_CR_BIT_DPC_SHIFT                                 (7U)
#define PERI_MDIOS_CR_BIT_DPC_MASK                                  (((1U<<1)-1) << PERI_MDIOS_CR_BIT_DPC_SHIFT)
#define PERI_MDIOS_CR_BIT_PORT_ADDRESS_SHIFT                        (8U)
#define PERI_MDIOS_CR_BIT_PORT_ADDRESS_MASK                         (((1U<<5)-1) << PERI_MDIOS_CR_BIT_PORT_ADDRESS_SHIFT)

/*--- register WRFR -------------------------------------------------*/
#define PERI_MDIOS_WRFR_BIT_WRF_SHIFT                               (0U)
#define PERI_MDIOS_WRFR_BIT_WRF_MASK                                (((1U<<32)-1) << PERI_MDIOS_WRFR_BIT_WRF_SHIFT)

/*--- register CWRFR -------------------------------------------------*/
#define PERI_MDIOS_CWRFR_BIT_CWRF_SHIFT                             (0U)
#define PERI_MDIOS_CWRFR_BIT_CWRF_MASK                              (((1U<<32)-1) << PERI_MDIOS_CWRFR_BIT_CWRF_SHIFT)

/*--- register RDFR -------------------------------------------------*/
#define PERI_MDIOS_RDFR_BIT_RDF_SHIFT                               (0U)
#define PERI_MDIOS_RDFR_BIT_RDF_MASK                                (((1U<<32)-1) << PERI_MDIOS_RDFR_BIT_RDF_SHIFT)

/*--- register CRDFR -------------------------------------------------*/
#define PERI_MDIOS_CRDFR_BIT_CRDF_SHIFT                             (0U)
#define PERI_MDIOS_CRDFR_BIT_CRDF_MASK                              (((1U<<32)-1) << PERI_MDIOS_CRDFR_BIT_CRDF_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_MDIOS_SR_BIT_PERF_SHIFT                                (0U)
#define PERI_MDIOS_SR_BIT_PERF_MASK                                 (((1U<<1)-1) << PERI_MDIOS_SR_BIT_PERF_SHIFT)
#define PERI_MDIOS_SR_BIT_SERF_SHIFT                                (1U)
#define PERI_MDIOS_SR_BIT_SERF_MASK                                 (((1U<<1)-1) << PERI_MDIOS_SR_BIT_SERF_SHIFT)
#define PERI_MDIOS_SR_BIT_TERF_SHIFT                                (2U)
#define PERI_MDIOS_SR_BIT_TERF_MASK                                 (((1U<<1)-1) << PERI_MDIOS_SR_BIT_TERF_SHIFT)

/*--- register CLRFR -------------------------------------------------*/
#define PERI_MDIOS_CLRFR_BIT_CPERF_SHIFT                            (0U)
#define PERI_MDIOS_CLRFR_BIT_CPERF_MASK                             (((1U<<1)-1) << PERI_MDIOS_CLRFR_BIT_CPERF_SHIFT)
#define PERI_MDIOS_CLRFR_BIT_CSERF_SHIFT                            (1U)
#define PERI_MDIOS_CLRFR_BIT_CSERF_MASK                             (((1U<<1)-1) << PERI_MDIOS_CLRFR_BIT_CSERF_SHIFT)
#define PERI_MDIOS_CLRFR_BIT_CTERF_SHIFT                            (2U)
#define PERI_MDIOS_CLRFR_BIT_CTERF_MASK                             (((1U<<1)-1) << PERI_MDIOS_CLRFR_BIT_CTERF_SHIFT)

/*--- register DINR0 -------------------------------------------------*/
#define PERI_MDIOS_DINR0_BIT_DIN0_SHIFT                             (0U)
#define PERI_MDIOS_DINR0_BIT_DIN0_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR0_BIT_DIN0_SHIFT)

/*--- register DINR1 -------------------------------------------------*/
#define PERI_MDIOS_DINR1_BIT_DIN1_SHIFT                             (0U)
#define PERI_MDIOS_DINR1_BIT_DIN1_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR1_BIT_DIN1_SHIFT)

/*--- register DINR2 -------------------------------------------------*/
#define PERI_MDIOS_DINR2_BIT_DIN2_SHIFT                             (0U)
#define PERI_MDIOS_DINR2_BIT_DIN2_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR2_BIT_DIN2_SHIFT)

/*--- register DINR3 -------------------------------------------------*/
#define PERI_MDIOS_DINR3_BIT_DIN3_SHIFT                             (0U)
#define PERI_MDIOS_DINR3_BIT_DIN3_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR3_BIT_DIN3_SHIFT)

/*--- register DINR4 -------------------------------------------------*/
#define PERI_MDIOS_DINR4_BIT_DIN4_SHIFT                             (0U)
#define PERI_MDIOS_DINR4_BIT_DIN4_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR4_BIT_DIN4_SHIFT)

/*--- register DINR5 -------------------------------------------------*/
#define PERI_MDIOS_DINR5_BIT_DIN5_SHIFT                             (0U)
#define PERI_MDIOS_DINR5_BIT_DIN5_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR5_BIT_DIN5_SHIFT)

/*--- register DINR6 -------------------------------------------------*/
#define PERI_MDIOS_DINR6_BIT_DIN6_SHIFT                             (0U)
#define PERI_MDIOS_DINR6_BIT_DIN6_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR6_BIT_DIN6_SHIFT)

/*--- register DINR7 -------------------------------------------------*/
#define PERI_MDIOS_DINR7_BIT_DIN7_SHIFT                             (0U)
#define PERI_MDIOS_DINR7_BIT_DIN7_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR7_BIT_DIN7_SHIFT)

/*--- register DINR8 -------------------------------------------------*/
#define PERI_MDIOS_DINR8_BIT_DIN8_SHIFT                             (0U)
#define PERI_MDIOS_DINR8_BIT_DIN8_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR8_BIT_DIN8_SHIFT)

/*--- register DINR9 -------------------------------------------------*/
#define PERI_MDIOS_DINR9_BIT_DIN9_SHIFT                             (0U)
#define PERI_MDIOS_DINR9_BIT_DIN9_MASK                              (((1U<<16)-1) << PERI_MDIOS_DINR9_BIT_DIN9_SHIFT)

/*--- register DINR10 -------------------------------------------------*/
#define PERI_MDIOS_DINR10_BIT_DIN10_SHIFT                           (0U)
#define PERI_MDIOS_DINR10_BIT_DIN10_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR10_BIT_DIN10_SHIFT)

/*--- register DINR11 -------------------------------------------------*/
#define PERI_MDIOS_DINR11_BIT_DIN11_SHIFT                           (0U)
#define PERI_MDIOS_DINR11_BIT_DIN11_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR11_BIT_DIN11_SHIFT)

/*--- register DINR12 -------------------------------------------------*/
#define PERI_MDIOS_DINR12_BIT_DIN12_SHIFT                           (0U)
#define PERI_MDIOS_DINR12_BIT_DIN12_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR12_BIT_DIN12_SHIFT)

