minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DINR13 -------------------------------------------------*/
#define PERI_MDIOS_DINR13_BIT_DIN13_SHIFT                           (0U)
#define PERI_MDIOS_DINR13_BIT_DIN13_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR13_BIT_DIN13_SHIFT)

/*--- register DINR14 -------------------------------------------------*/
#define PERI_MDIOS_DINR14_BIT_DIN14_SHIFT                           (0U)
#define PERI_MDIOS_DINR14_BIT_DIN14_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR14_BIT_DIN14_SHIFT)

/*--- register DINR15 -------------------------------------------------*/
#define PERI_MDIOS_DINR15_BIT_DIN15_SHIFT                           (0U)
#define PERI_MDIOS_DINR15_BIT_DIN15_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR15_BIT_DIN15_SHIFT)

/*--- register DINR16 -------------------------------------------------*/
#define PERI_MDIOS_DINR16_BIT_DIN16_SHIFT                           (0U)
#define PERI_MDIOS_DINR16_BIT_DIN16_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR16_BIT_DIN16_SHIFT)

/*--- register DINR17 -------------------------------------------------*/
#define PERI_MDIOS_DINR17_BIT_DIN17_SHIFT                           (0U)
#define PERI_MDIOS_DINR17_BIT_DIN17_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR17_BIT_DIN17_SHIFT)

/*--- register DINR18 -------------------------------------------------*/
#define PERI_MDIOS_DINR18_BIT_DIN18_SHIFT                           (0U)
#define PERI_MDIOS_DINR18_BIT_DIN18_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR18_BIT_DIN18_SHIFT)

/*--- register DINR19 -------------------------------------------------*/
#define PERI_MDIOS_DINR19_BIT_DIN19_SHIFT                           (0U)
#define PERI_MDIOS_DINR19_BIT_DIN19_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR19_BIT_DIN19_SHIFT)

/*--- register DINR20 -------------------------------------------------*/
#define PERI_MDIOS_DINR20_BIT_DIN20_SHIFT                           (0U)
#define PERI_MDIOS_DINR20_BIT_DIN20_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR20_BIT_DIN20_SHIFT)

/*--- register DINR21 -------------------------------------------------*/
#define PERI_MDIOS_DINR21_BIT_DIN21_SHIFT                           (0U)
#define PERI_MDIOS_DINR21_BIT_DIN21_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR21_BIT_DIN21_SHIFT)

/*--- register DINR22 -------------------------------------------------*/
#define PERI_MDIOS_DINR22_BIT_DIN22_SHIFT                           (0U)
#define PERI_MDIOS_DINR22_BIT_DIN22_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR22_BIT_DIN22_SHIFT)

/*--- register DINR23 -------------------------------------------------*/
#define PERI_MDIOS_DINR23_BIT_DIN23_SHIFT                           (0U)
#define PERI_MDIOS_DINR23_BIT_DIN23_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR23_BIT_DIN23_SHIFT)

/*--- register DINR24 -------------------------------------------------*/
#define PERI_MDIOS_DINR24_BIT_DIN24_SHIFT                           (0U)
#define PERI_MDIOS_DINR24_BIT_DIN24_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR24_BIT_DIN24_SHIFT)

/*--- register DINR25 -------------------------------------------------*/
#define PERI_MDIOS_DINR25_BIT_DIN25_SHIFT                           (0U)
#define PERI_MDIOS_DINR25_BIT_DIN25_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR25_BIT_DIN25_SHIFT)

/*--- register DINR26 -------------------------------------------------*/
#define PERI_MDIOS_DINR26_BIT_DIN26_SHIFT                           (0U)
#define PERI_MDIOS_DINR26_BIT_DIN26_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR26_BIT_DIN26_SHIFT)

/*--- register DINR27 -------------------------------------------------*/
#define PERI_MDIOS_DINR27_BIT_DIN27_SHIFT                           (0U)
#define PERI_MDIOS_DINR27_BIT_DIN27_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR27_BIT_DIN27_SHIFT)

/*--- register DINR28 -------------------------------------------------*/
#define PERI_MDIOS_DINR28_BIT_DIN28_SHIFT                           (0U)
#define PERI_MDIOS_DINR28_BIT_DIN28_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR28_BIT_DIN28_SHIFT)

/*--- register DINR29 -------------------------------------------------*/
#define PERI_MDIOS_DINR29_BIT_DIN29_SHIFT                           (0U)
#define PERI_MDIOS_DINR29_BIT_DIN29_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR29_BIT_DIN29_SHIFT)

/*--- register DINR30 -------------------------------------------------*/
#define PERI_MDIOS_DINR30_BIT_DIN30_SHIFT                           (0U)
#define PERI_MDIOS_DINR30_BIT_DIN30_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR30_BIT_DIN30_SHIFT)

/*--- register DINR31 -------------------------------------------------*/
#define PERI_MDIOS_DINR31_BIT_DIN31_SHIFT                           (0U)
#define PERI_MDIOS_DINR31_BIT_DIN31_MASK                            (((1U<<16)-1) << PERI_MDIOS_DINR31_BIT_DIN31_SHIFT)

/*--- register DOUTR0 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR0_BIT_DOUT0_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR0_BIT_DOUT0_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR0_BIT_DOUT0_SHIFT)

/*--- register DOUTR1 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR1_BIT_DOUT1_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR1_BIT_DOUT1_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR1_BIT_DOUT1_SHIFT)

/*--- register DOUTR2 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR2_BIT_DOUT2_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR2_BIT_DOUT2_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR2_BIT_DOUT2_SHIFT)

/*--- register DOUTR3 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR3_BIT_DOUT3_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR3_BIT_DOUT3_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR3_BIT_DOUT3_SHIFT)

