minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DOUTR4 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR4_BIT_DOUT4_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR4_BIT_DOUT4_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR4_BIT_DOUT4_SHIFT)

/*--- register DOUTR5 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR5_BIT_DOUT5_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR5_BIT_DOUT5_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR5_BIT_DOUT5_SHIFT)

/*--- register DOUTR6 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR6_BIT_DOUT6_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR6_BIT_DOUT6_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR6_BIT_DOUT6_SHIFT)

/*--- register DOUTR7 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR7_BIT_DOUT7_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR7_BIT_DOUT7_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR7_BIT_DOUT7_SHIFT)

/*--- register DOUTR8 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR8_BIT_DOUT8_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR8_BIT_DOUT8_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR8_BIT_DOUT8_SHIFT)

/*--- register DOUTR9 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR9_BIT_DOUT9_SHIFT                           (0U)
#define PERI_MDIOS_DOUTR9_BIT_DOUT9_MASK                            (((1U<<16)-1) << PERI_MDIOS_DOUTR9_BIT_DOUT9_SHIFT)

/*--- register DOUTR10 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR10_BIT_DOUT10_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR10_BIT_DOUT10_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR10_BIT_DOUT10_SHIFT)

/*--- register DOUTR11 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR11_BIT_DOUT11_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR11_BIT_DOUT11_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR11_BIT_DOUT11_SHIFT)

/*--- register DOUTR12 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR12_BIT_DOUT12_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR12_BIT_DOUT12_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR12_BIT_DOUT12_SHIFT)

/*--- register DOUTR13 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR13_BIT_DOUT13_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR13_BIT_DOUT13_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR13_BIT_DOUT13_SHIFT)

/*--- register DOUTR14 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR14_BIT_DOUT14_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR14_BIT_DOUT14_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR14_BIT_DOUT14_SHIFT)

/*--- register DOUTR15 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR15_BIT_DOUT15_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR15_BIT_DOUT15_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR15_BIT_DOUT15_SHIFT)

/*--- register DOUTR16 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR16_BIT_DOUT16_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR16_BIT_DOUT16_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR16_BIT_DOUT16_SHIFT)

/*--- register DOUTR17 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR17_BIT_DOUT17_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR17_BIT_DOUT17_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR17_BIT_DOUT17_SHIFT)

/*--- register DOUTR18 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR18_BIT_DOUT18_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR18_BIT_DOUT18_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR18_BIT_DOUT18_SHIFT)

/*--- register DOUTR19 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR19_BIT_DOUT19_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR19_BIT_DOUT19_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR19_BIT_DOUT19_SHIFT)

/*--- register DOUTR20 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR20_BIT_DOUT20_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR20_BIT_DOUT20_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR20_BIT_DOUT20_SHIFT)

/*--- register DOUTR21 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR21_BIT_DOUT21_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR21_BIT_DOUT21_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR21_BIT_DOUT21_SHIFT)

/*--- register DOUTR22 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR22_BIT_DOUT22_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR22_BIT_DOUT22_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR22_BIT_DOUT22_SHIFT)

/*--- register DOUTR23 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR23_BIT_DOUT23_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR23_BIT_DOUT23_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR23_BIT_DOUT23_SHIFT)

/*--- register DOUTR24 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR24_BIT_DOUT24_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR24_BIT_DOUT24_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR24_BIT_DOUT24_SHIFT)

/*--- register DOUTR25 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR25_BIT_DOUT25_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR25_BIT_DOUT25_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR25_BIT_DOUT25_SHIFT)

/*--- register DOUTR26 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR26_BIT_DOUT26_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR26_BIT_DOUT26_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR26_BIT_DOUT26_SHIFT)

/*--- register DOUTR27 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR27_BIT_DOUT27_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR27_BIT_DOUT27_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR27_BIT_DOUT27_SHIFT)

/*--- register DOUTR28 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR28_BIT_DOUT28_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR28_BIT_DOUT28_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR28_BIT_DOUT28_SHIFT)

/*--- register DOUTR29 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR29_BIT_DOUT29_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR29_BIT_DOUT29_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR29_BIT_DOUT29_SHIFT)

/*--- register DOUTR30 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR30_BIT_DOUT30_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR30_BIT_DOUT30_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR30_BIT_DOUT30_SHIFT)

/*--- register DOUTR31 -------------------------------------------------*/
#define PERI_MDIOS_DOUTR31_BIT_DOUT31_SHIFT                         (0U)
#define PERI_MDIOS_DOUTR31_BIT_DOUT31_MASK                          (((1U<<16)-1) << PERI_MDIOS_DOUTR31_BIT_DOUT31_SHIFT)

