minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MDMA_C0LAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C0LAR_BIT_LAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C0LAR_BIT_LAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C0LAR_BIT_LAR_SHIFT)

/*--- register MDMA_C0TBR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C0TBR_BIT_TSEL_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C0TBR_BIT_TSEL_MASK                          (((1U<<6)-1) << PERI_MDMA_MDMA_C0TBR_BIT_TSEL_SHIFT)
#define PERI_MDMA_MDMA_C0TBR_BIT_SBUS_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C0TBR_BIT_SBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C0TBR_BIT_SBUS_SHIFT)
#define PERI_MDMA_MDMA_C0TBR_BIT_DBUS_SHIFT                         (17U)
#define PERI_MDMA_MDMA_C0TBR_BIT_DBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C0TBR_BIT_DBUS_SHIFT)

/*--- register MDMA_C0MAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C0MAR_BIT_MAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C0MAR_BIT_MAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C0MAR_BIT_MAR_SHIFT)

/*--- register MDMA_C0MDR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C0MDR_BIT_MDR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C0MDR_BIT_MDR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C0MDR_BIT_MDR_SHIFT)

/*--- register MDMA_C1ISR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1ISR_BIT_TEIF1_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C1ISR_BIT_TEIF1_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C1ISR_BIT_TEIF1_SHIFT)
#define PERI_MDMA_MDMA_C1ISR_BIT_CTCIF1_SHIFT                       (1U)
#define PERI_MDMA_MDMA_C1ISR_BIT_CTCIF1_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C1ISR_BIT_CTCIF1_SHIFT)
#define PERI_MDMA_MDMA_C1ISR_BIT_BRTIF1_SHIFT                       (2U)
#define PERI_MDMA_MDMA_C1ISR_BIT_BRTIF1_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C1ISR_BIT_BRTIF1_SHIFT)
#define PERI_MDMA_MDMA_C1ISR_BIT_BTIF1_SHIFT                        (3U)
#define PERI_MDMA_MDMA_C1ISR_BIT_BTIF1_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C1ISR_BIT_BTIF1_SHIFT)
#define PERI_MDMA_MDMA_C1ISR_BIT_TCIF1_SHIFT                        (4U)
#define PERI_MDMA_MDMA_C1ISR_BIT_TCIF1_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C1ISR_BIT_TCIF1_SHIFT)
#define PERI_MDMA_MDMA_C1ISR_BIT_CRQA1_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C1ISR_BIT_CRQA1_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C1ISR_BIT_CRQA1_SHIFT)

/*--- register MDMA_C1IFCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1IFCR_BIT_CTEIF1_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CTEIF1_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C1IFCR_BIT_CTEIF1_SHIFT)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CCTCIF1_SHIFT                     (1U)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CCTCIF1_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C1IFCR_BIT_CCTCIF1_SHIFT)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CBRTIF1_SHIFT                     (2U)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CBRTIF1_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C1IFCR_BIT_CBRTIF1_SHIFT)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CBTIF1_SHIFT                      (3U)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CBTIF1_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C1IFCR_BIT_CBTIF1_SHIFT)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CLTCIF1_SHIFT                     (4U)
#define PERI_MDMA_MDMA_C1IFCR_BIT_CLTCIF1_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C1IFCR_BIT_CLTCIF1_SHIFT)

/*--- register MDMA_C1ESR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1ESR_BIT_TEA_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C1ESR_BIT_TEA_MASK                           (((1U<<7)-1) << PERI_MDMA_MDMA_C1ESR_BIT_TEA_SHIFT)
#define PERI_MDMA_MDMA_C1ESR_BIT_TED_SHIFT                          (7U)
#define PERI_MDMA_MDMA_C1ESR_BIT_TED_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1ESR_BIT_TED_SHIFT)
#define PERI_MDMA_MDMA_C1ESR_BIT_TELD_SHIFT                         (8U)
#define PERI_MDMA_MDMA_C1ESR_BIT_TELD_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1ESR_BIT_TELD_SHIFT)
#define PERI_MDMA_MDMA_C1ESR_BIT_TEMD_SHIFT                         (9U)
#define PERI_MDMA_MDMA_C1ESR_BIT_TEMD_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1ESR_BIT_TEMD_SHIFT)
#define PERI_MDMA_MDMA_C1ESR_BIT_ASE_SHIFT                          (10U)
#define PERI_MDMA_MDMA_C1ESR_BIT_ASE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1ESR_BIT_ASE_SHIFT)
#define PERI_MDMA_MDMA_C1ESR_BIT_BSE_SHIFT                          (11U)
#define PERI_MDMA_MDMA_C1ESR_BIT_BSE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1ESR_BIT_BSE_SHIFT)

/*--- register MDMA_C1CR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1CR_BIT_EN_SHIFT                            (0U)
#define PERI_MDMA_MDMA_C1CR_BIT_EN_MASK                             (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_EN_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_TEIE_SHIFT                          (1U)
#define PERI_MDMA_MDMA_C1CR_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_TEIE_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_CTCIE_SHIFT                         (2U)
#define PERI_MDMA_MDMA_C1CR_BIT_CTCIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_CTCIE_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_BRTIE_SHIFT                         (3U)
#define PERI_MDMA_MDMA_C1CR_BIT_BRTIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_BRTIE_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_BTIE_SHIFT                          (4U)
#define PERI_MDMA_MDMA_C1CR_BIT_BTIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_BTIE_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_TCIE_SHIFT                          (5U)
#define PERI_MDMA_MDMA_C1CR_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_TCIE_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_PL_SHIFT                            (6U)
#define PERI_MDMA_MDMA_C1CR_BIT_PL_MASK                             (((1U<<2)-1) << PERI_MDMA_MDMA_C1CR_BIT_PL_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_BEX_SHIFT                           (12U)
#define PERI_MDMA_MDMA_C1CR_BIT_BEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_BEX_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_HEX_SHIFT                           (13U)
#define PERI_MDMA_MDMA_C1CR_BIT_HEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_HEX_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_WEX_SHIFT                           (14U)
#define PERI_MDMA_MDMA_C1CR_BIT_WEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_WEX_SHIFT)
#define PERI_MDMA_MDMA_C1CR_BIT_SWRQ_SHIFT                          (16U)
#define PERI_MDMA_MDMA_C1CR_BIT_SWRQ_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1CR_BIT_SWRQ_SHIFT)

/*--- register MDMA_C1TCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1TCR_BIT_SINC_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C1TCR_BIT_SINC_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_SINC_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_DINC_SHIFT                         (2U)
#define PERI_MDMA_MDMA_C1TCR_BIT_DINC_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_DINC_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_SSIZE_SHIFT                        (4U)
#define PERI_MDMA_MDMA_C1TCR_BIT_SSIZE_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_SSIZE_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_DSIZE_SHIFT                        (6U)
#define PERI_MDMA_MDMA_C1TCR_BIT_DSIZE_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_DSIZE_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_SINCOS_SHIFT                       (8U)
#define PERI_MDMA_MDMA_C1TCR_BIT_SINCOS_MASK                        (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_SINCOS_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_DINCOS_SHIFT                       (10U)
#define PERI_MDMA_MDMA_C1TCR_BIT_DINCOS_MASK                        (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_DINCOS_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_SBURST_SHIFT                       (12U)
#define PERI_MDMA_MDMA_C1TCR_BIT_SBURST_MASK                        (((1U<<3)-1) << PERI_MDMA_MDMA_C1TCR_BIT_SBURST_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_DBURST_SHIFT                       (15U)
#define PERI_MDMA_MDMA_C1TCR_BIT_DBURST_MASK                        (((1U<<3)-1) << PERI_MDMA_MDMA_C1TCR_BIT_DBURST_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_TLEN_SHIFT                         (18U)
#define PERI_MDMA_MDMA_C1TCR_BIT_TLEN_MASK                          (((1U<<7)-1) << PERI_MDMA_MDMA_C1TCR_BIT_TLEN_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_PKE_SHIFT                          (25U)
#define PERI_MDMA_MDMA_C1TCR_BIT_PKE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1TCR_BIT_PKE_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_PAM_SHIFT                          (26U)
#define PERI_MDMA_MDMA_C1TCR_BIT_PAM_MASK                           (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_PAM_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_TRGM_SHIFT                         (28U)
#define PERI_MDMA_MDMA_C1TCR_BIT_TRGM_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C1TCR_BIT_TRGM_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_SWRM_SHIFT                         (30U)
#define PERI_MDMA_MDMA_C1TCR_BIT_SWRM_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1TCR_BIT_SWRM_SHIFT)
#define PERI_MDMA_MDMA_C1TCR_BIT_BWM_SHIFT                          (31U)
#define PERI_MDMA_MDMA_C1TCR_BIT_BWM_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C1TCR_BIT_BWM_SHIFT)

/*--- register MDMA_C1BNDTR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BNDT_SHIFT                       (0U)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BNDT_MASK                        (((1U<<17)-1) << PERI_MDMA_MDMA_C1BNDTR_BIT_BNDT_SHIFT)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BRSUM_SHIFT                      (18U)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BRSUM_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C1BNDTR_BIT_BRSUM_SHIFT)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BRDUM_SHIFT                      (19U)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BRDUM_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C1BNDTR_BIT_BRDUM_SHIFT)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BRC_SHIFT                        (20U)
#define PERI_MDMA_MDMA_C1BNDTR_BIT_BRC_MASK                         (((1U<<12)-1) << PERI_MDMA_MDMA_C1BNDTR_BIT_BRC_SHIFT)

/*--- register MDMA_C1SAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1SAR_BIT_SAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C1SAR_BIT_SAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C1SAR_BIT_SAR_SHIFT)

/*--- register MDMA_C1DAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1DAR_BIT_DAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C1DAR_BIT_DAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C1DAR_BIT_DAR_SHIFT)

/*--- register MDMA_C1BRUR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1BRUR_BIT_SUV_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C1BRUR_BIT_SUV_MASK                          (((1U<<16)-1) << PERI_MDMA_MDMA_C1BRUR_BIT_SUV_SHIFT)
#define PERI_MDMA_MDMA_C1BRUR_BIT_DUV_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C1BRUR_BIT_DUV_MASK                          (((1U<<16)-1) << PERI_MDMA_MDMA_C1BRUR_BIT_DUV_SHIFT)

/*--- register MDMA_C1LAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1LAR_BIT_LAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C1LAR_BIT_LAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C1LAR_BIT_LAR_SHIFT)

/*--- register MDMA_C1TBR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1TBR_BIT_TSEL_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C1TBR_BIT_TSEL_MASK                          (((1U<<6)-1) << PERI_MDMA_MDMA_C1TBR_BIT_TSEL_SHIFT)
#define PERI_MDMA_MDMA_C1TBR_BIT_SBUS_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C1TBR_BIT_SBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1TBR_BIT_SBUS_SHIFT)
#define PERI_MDMA_MDMA_C1TBR_BIT_DBUS_SHIFT                         (17U)
#define PERI_MDMA_MDMA_C1TBR_BIT_DBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C1TBR_BIT_DBUS_SHIFT)

/*--- register MDMA_C1MAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1MAR_BIT_MAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C1MAR_BIT_MAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C1MAR_BIT_MAR_SHIFT)

/*--- register MDMA_C1MDR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C1MDR_BIT_MDR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C1MDR_BIT_MDR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C1MDR_BIT_MDR_SHIFT)

/*--- register MDMA_C2ISR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C2ISR_BIT_TEIF2_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C2ISR_BIT_TEIF2_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C2ISR_BIT_TEIF2_SHIFT)
#define PERI_MDMA_MDMA_C2ISR_BIT_CTCIF2_SHIFT                       (1U)
#define PERI_MDMA_MDMA_C2ISR_BIT_CTCIF2_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C2ISR_BIT_CTCIF2_SHIFT)
#define PERI_MDMA_MDMA_C2ISR_BIT_BRTIF2_SHIFT                       (2U)
#define PERI_MDMA_MDMA_C2ISR_BIT_BRTIF2_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C2ISR_BIT_BRTIF2_SHIFT)
#define PERI_MDMA_MDMA_C2ISR_BIT_BTIF2_SHIFT                        (3U)
#define PERI_MDMA_MDMA_C2ISR_BIT_BTIF2_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C2ISR_BIT_BTIF2_SHIFT)
#define PERI_MDMA_MDMA_C2ISR_BIT_TCIF2_SHIFT                        (4U)
#define PERI_MDMA_MDMA_C2ISR_BIT_TCIF2_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C2ISR_BIT_TCIF2_SHIFT)
#define PERI_MDMA_MDMA_C2ISR_BIT_CRQA2_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C2ISR_BIT_CRQA2_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C2ISR_BIT_CRQA2_SHIFT)

/*--- register MDMA_C2IFCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C2IFCR_BIT_CTEIF2_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CTEIF2_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C2IFCR_BIT_CTEIF2_SHIFT)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CCTCIF2_SHIFT                     (1U)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CCTCIF2_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C2IFCR_BIT_CCTCIF2_SHIFT)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CBRTIF2_SHIFT                     (2U)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CBRTIF2_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C2IFCR_BIT_CBRTIF2_SHIFT)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CBTIF2_SHIFT                      (3U)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CBTIF2_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C2IFCR_BIT_CBTIF2_SHIFT)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CLTCIF2_SHIFT                     (4U)
#define PERI_MDMA_MDMA_C2IFCR_BIT_CLTCIF2_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C2IFCR_BIT_CLTCIF2_SHIFT)

/*--- register MDMA_C2ESR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C2ESR_BIT_TEA_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C2ESR_BIT_TEA_MASK                           (((1U<<7)-1) << PERI_MDMA_MDMA_C2ESR_BIT_TEA_SHIFT)
#define PERI_MDMA_MDMA_C2ESR_BIT_TED_SHIFT                          (7U)
#define PERI_MDMA_MDMA_C2ESR_BIT_TED_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2ESR_BIT_TED_SHIFT)
#define PERI_MDMA_MDMA_C2ESR_BIT_TELD_SHIFT                         (8U)
#define PERI_MDMA_MDMA_C2ESR_BIT_TELD_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C2ESR_BIT_TELD_SHIFT)
#define PERI_MDMA_MDMA_C2ESR_BIT_TEMD_SHIFT                         (9U)
#define PERI_MDMA_MDMA_C2ESR_BIT_TEMD_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C2ESR_BIT_TEMD_SHIFT)
#define PERI_MDMA_MDMA_C2ESR_BIT_ASE_SHIFT                          (10U)
#define PERI_MDMA_MDMA_C2ESR_BIT_ASE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2ESR_BIT_ASE_SHIFT)
#define PERI_MDMA_MDMA_C2ESR_BIT_BSE_SHIFT                          (11U)
#define PERI_MDMA_MDMA_C2ESR_BIT_BSE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2ESR_BIT_BSE_SHIFT)

/*--- register MDMA_C2CR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C2CR_BIT_EN_SHIFT                            (0U)
#define PERI_MDMA_MDMA_C2CR_BIT_EN_MASK                             (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_EN_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_TEIE_SHIFT                          (1U)
#define PERI_MDMA_MDMA_C2CR_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_TEIE_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_CTCIE_SHIFT                         (2U)
#define PERI_MDMA_MDMA_C2CR_BIT_CTCIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_CTCIE_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_BRTIE_SHIFT                         (3U)
#define PERI_MDMA_MDMA_C2CR_BIT_BRTIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_BRTIE_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_BTIE_SHIFT                          (4U)
#define PERI_MDMA_MDMA_C2CR_BIT_BTIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_BTIE_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_TCIE_SHIFT                          (5U)
#define PERI_MDMA_MDMA_C2CR_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_TCIE_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_PL_SHIFT                            (6U)
#define PERI_MDMA_MDMA_C2CR_BIT_PL_MASK                             (((1U<<2)-1) << PERI_MDMA_MDMA_C2CR_BIT_PL_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_BEX_SHIFT                           (12U)
#define PERI_MDMA_MDMA_C2CR_BIT_BEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_BEX_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_HEX_SHIFT                           (13U)
#define PERI_MDMA_MDMA_C2CR_BIT_HEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_HEX_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_WEX_SHIFT                           (14U)
#define PERI_MDMA_MDMA_C2CR_BIT_WEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_WEX_SHIFT)
#define PERI_MDMA_MDMA_C2CR_BIT_SWRQ_SHIFT                          (16U)
#define PERI_MDMA_MDMA_C2CR_BIT_SWRQ_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C2CR_BIT_SWRQ_SHIFT)

