minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MDMA_C5BNDTR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BNDT_SHIFT                       (0U)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BNDT_MASK                        (((1U<<17)-1) << PERI_MDMA_MDMA_C5BNDTR_BIT_BNDT_SHIFT)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BRSUM_SHIFT                      (18U)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BRSUM_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C5BNDTR_BIT_BRSUM_SHIFT)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BRDUM_SHIFT                      (19U)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BRDUM_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C5BNDTR_BIT_BRDUM_SHIFT)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BRC_SHIFT                        (20U)
#define PERI_MDMA_MDMA_C5BNDTR_BIT_BRC_MASK                         (((1U<<12)-1) << PERI_MDMA_MDMA_C5BNDTR_BIT_BRC_SHIFT)

/*--- register MDMA_C5SAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5SAR_BIT_SAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C5SAR_BIT_SAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C5SAR_BIT_SAR_SHIFT)

/*--- register MDMA_C5DAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5DAR_BIT_DAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C5DAR_BIT_DAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C5DAR_BIT_DAR_SHIFT)

/*--- register MDMA_C5BRUR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5BRUR_BIT_SUV_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C5BRUR_BIT_SUV_MASK                          (((1U<<16)-1) << PERI_MDMA_MDMA_C5BRUR_BIT_SUV_SHIFT)
#define PERI_MDMA_MDMA_C5BRUR_BIT_DUV_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C5BRUR_BIT_DUV_MASK                          (((1U<<16)-1) << PERI_MDMA_MDMA_C5BRUR_BIT_DUV_SHIFT)

/*--- register MDMA_C5LAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5LAR_BIT_LAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C5LAR_BIT_LAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C5LAR_BIT_LAR_SHIFT)

/*--- register MDMA_C5TBR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5TBR_BIT_TSEL_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C5TBR_BIT_TSEL_MASK                          (((1U<<6)-1) << PERI_MDMA_MDMA_C5TBR_BIT_TSEL_SHIFT)
#define PERI_MDMA_MDMA_C5TBR_BIT_SBUS_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C5TBR_BIT_SBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C5TBR_BIT_SBUS_SHIFT)
#define PERI_MDMA_MDMA_C5TBR_BIT_DBUS_SHIFT                         (17U)
#define PERI_MDMA_MDMA_C5TBR_BIT_DBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C5TBR_BIT_DBUS_SHIFT)

/*--- register MDMA_C5MAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5MAR_BIT_MAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C5MAR_BIT_MAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C5MAR_BIT_MAR_SHIFT)

/*--- register MDMA_C5MDR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C5MDR_BIT_MDR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C5MDR_BIT_MDR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C5MDR_BIT_MDR_SHIFT)

/*--- register MDMA_C6ISR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6ISR_BIT_TEIF6_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C6ISR_BIT_TEIF6_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C6ISR_BIT_TEIF6_SHIFT)
#define PERI_MDMA_MDMA_C6ISR_BIT_CTCIF6_SHIFT                       (1U)
#define PERI_MDMA_MDMA_C6ISR_BIT_CTCIF6_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C6ISR_BIT_CTCIF6_SHIFT)
#define PERI_MDMA_MDMA_C6ISR_BIT_BRTIF6_SHIFT                       (2U)
#define PERI_MDMA_MDMA_C6ISR_BIT_BRTIF6_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C6ISR_BIT_BRTIF6_SHIFT)
#define PERI_MDMA_MDMA_C6ISR_BIT_BTIF6_SHIFT                        (3U)
#define PERI_MDMA_MDMA_C6ISR_BIT_BTIF6_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C6ISR_BIT_BTIF6_SHIFT)
#define PERI_MDMA_MDMA_C6ISR_BIT_TCIF6_SHIFT                        (4U)
#define PERI_MDMA_MDMA_C6ISR_BIT_TCIF6_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C6ISR_BIT_TCIF6_SHIFT)
#define PERI_MDMA_MDMA_C6ISR_BIT_CRQA6_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C6ISR_BIT_CRQA6_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C6ISR_BIT_CRQA6_SHIFT)

/*--- register MDMA_C6IFCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6IFCR_BIT_CTEIF6_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CTEIF6_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C6IFCR_BIT_CTEIF6_SHIFT)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CCTCIF6_SHIFT                     (1U)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CCTCIF6_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C6IFCR_BIT_CCTCIF6_SHIFT)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CBRTIF6_SHIFT                     (2U)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CBRTIF6_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C6IFCR_BIT_CBRTIF6_SHIFT)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CBTIF6_SHIFT                      (3U)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CBTIF6_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C6IFCR_BIT_CBTIF6_SHIFT)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CLTCIF6_SHIFT                     (4U)
#define PERI_MDMA_MDMA_C6IFCR_BIT_CLTCIF6_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C6IFCR_BIT_CLTCIF6_SHIFT)

/*--- register MDMA_C6ESR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6ESR_BIT_TEA_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C6ESR_BIT_TEA_MASK                           (((1U<<7)-1) << PERI_MDMA_MDMA_C6ESR_BIT_TEA_SHIFT)
#define PERI_MDMA_MDMA_C6ESR_BIT_TED_SHIFT                          (7U)
#define PERI_MDMA_MDMA_C6ESR_BIT_TED_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6ESR_BIT_TED_SHIFT)
#define PERI_MDMA_MDMA_C6ESR_BIT_TELD_SHIFT                         (8U)
#define PERI_MDMA_MDMA_C6ESR_BIT_TELD_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6ESR_BIT_TELD_SHIFT)
#define PERI_MDMA_MDMA_C6ESR_BIT_TEMD_SHIFT                         (9U)
#define PERI_MDMA_MDMA_C6ESR_BIT_TEMD_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6ESR_BIT_TEMD_SHIFT)
#define PERI_MDMA_MDMA_C6ESR_BIT_ASE_SHIFT                          (10U)
#define PERI_MDMA_MDMA_C6ESR_BIT_ASE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6ESR_BIT_ASE_SHIFT)
#define PERI_MDMA_MDMA_C6ESR_BIT_BSE_SHIFT                          (11U)
#define PERI_MDMA_MDMA_C6ESR_BIT_BSE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6ESR_BIT_BSE_SHIFT)

/*--- register MDMA_C6CR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6CR_BIT_EN_SHIFT                            (0U)
#define PERI_MDMA_MDMA_C6CR_BIT_EN_MASK                             (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_EN_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_TEIE_SHIFT                          (1U)
#define PERI_MDMA_MDMA_C6CR_BIT_TEIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_TEIE_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_CTCIE_SHIFT                         (2U)
#define PERI_MDMA_MDMA_C6CR_BIT_CTCIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_CTCIE_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_BRTIE_SHIFT                         (3U)
#define PERI_MDMA_MDMA_C6CR_BIT_BRTIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_BRTIE_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_BTIE_SHIFT                          (4U)
#define PERI_MDMA_MDMA_C6CR_BIT_BTIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_BTIE_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_TCIE_SHIFT                          (5U)
#define PERI_MDMA_MDMA_C6CR_BIT_TCIE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_TCIE_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_PL_SHIFT                            (6U)
#define PERI_MDMA_MDMA_C6CR_BIT_PL_MASK                             (((1U<<2)-1) << PERI_MDMA_MDMA_C6CR_BIT_PL_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_BEX_SHIFT                           (12U)
#define PERI_MDMA_MDMA_C6CR_BIT_BEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_BEX_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_HEX_SHIFT                           (13U)
#define PERI_MDMA_MDMA_C6CR_BIT_HEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_HEX_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_WEX_SHIFT                           (14U)
#define PERI_MDMA_MDMA_C6CR_BIT_WEX_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_WEX_SHIFT)
#define PERI_MDMA_MDMA_C6CR_BIT_SWRQ_SHIFT                          (16U)
#define PERI_MDMA_MDMA_C6CR_BIT_SWRQ_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6CR_BIT_SWRQ_SHIFT)

