minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MDMA_C6TCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6TCR_BIT_SINC_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C6TCR_BIT_SINC_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_SINC_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_DINC_SHIFT                         (2U)
#define PERI_MDMA_MDMA_C6TCR_BIT_DINC_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_DINC_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_SSIZE_SHIFT                        (4U)
#define PERI_MDMA_MDMA_C6TCR_BIT_SSIZE_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_SSIZE_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_DSIZE_SHIFT                        (6U)
#define PERI_MDMA_MDMA_C6TCR_BIT_DSIZE_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_DSIZE_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_SINCOS_SHIFT                       (8U)
#define PERI_MDMA_MDMA_C6TCR_BIT_SINCOS_MASK                        (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_SINCOS_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_DINCOS_SHIFT                       (10U)
#define PERI_MDMA_MDMA_C6TCR_BIT_DINCOS_MASK                        (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_DINCOS_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_SBURST_SHIFT                       (12U)
#define PERI_MDMA_MDMA_C6TCR_BIT_SBURST_MASK                        (((1U<<3)-1) << PERI_MDMA_MDMA_C6TCR_BIT_SBURST_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_DBURST_SHIFT                       (15U)
#define PERI_MDMA_MDMA_C6TCR_BIT_DBURST_MASK                        (((1U<<3)-1) << PERI_MDMA_MDMA_C6TCR_BIT_DBURST_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_TLEN_SHIFT                         (18U)
#define PERI_MDMA_MDMA_C6TCR_BIT_TLEN_MASK                          (((1U<<7)-1) << PERI_MDMA_MDMA_C6TCR_BIT_TLEN_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_PKE_SHIFT                          (25U)
#define PERI_MDMA_MDMA_C6TCR_BIT_PKE_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6TCR_BIT_PKE_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_PAM_SHIFT                          (26U)
#define PERI_MDMA_MDMA_C6TCR_BIT_PAM_MASK                           (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_PAM_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_TRGM_SHIFT                         (28U)
#define PERI_MDMA_MDMA_C6TCR_BIT_TRGM_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C6TCR_BIT_TRGM_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_SWRM_SHIFT                         (30U)
#define PERI_MDMA_MDMA_C6TCR_BIT_SWRM_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6TCR_BIT_SWRM_SHIFT)
#define PERI_MDMA_MDMA_C6TCR_BIT_BWM_SHIFT                          (31U)
#define PERI_MDMA_MDMA_C6TCR_BIT_BWM_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C6TCR_BIT_BWM_SHIFT)

/*--- register MDMA_C6BNDTR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BNDT_SHIFT                       (0U)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BNDT_MASK                        (((1U<<17)-1) << PERI_MDMA_MDMA_C6BNDTR_BIT_BNDT_SHIFT)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BRSUM_SHIFT                      (18U)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BRSUM_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C6BNDTR_BIT_BRSUM_SHIFT)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BRDUM_SHIFT                      (19U)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BRDUM_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C6BNDTR_BIT_BRDUM_SHIFT)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BRC_SHIFT                        (20U)
#define PERI_MDMA_MDMA_C6BNDTR_BIT_BRC_MASK                         (((1U<<12)-1) << PERI_MDMA_MDMA_C6BNDTR_BIT_BRC_SHIFT)

/*--- register MDMA_C6SAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6SAR_BIT_SAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C6SAR_BIT_SAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C6SAR_BIT_SAR_SHIFT)

/*--- register MDMA_C6DAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6DAR_BIT_DAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C6DAR_BIT_DAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C6DAR_BIT_DAR_SHIFT)

/*--- register MDMA_C6BRUR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6BRUR_BIT_SUV_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C6BRUR_BIT_SUV_MASK                          (((1U<<16)-1) << PERI_MDMA_MDMA_C6BRUR_BIT_SUV_SHIFT)
#define PERI_MDMA_MDMA_C6BRUR_BIT_DUV_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C6BRUR_BIT_DUV_MASK                          (((1U<<16)-1) << PERI_MDMA_MDMA_C6BRUR_BIT_DUV_SHIFT)

/*--- register MDMA_C6LAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6LAR_BIT_LAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C6LAR_BIT_LAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C6LAR_BIT_LAR_SHIFT)

/*--- register MDMA_C6TBR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6TBR_BIT_TSEL_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C6TBR_BIT_TSEL_MASK                          (((1U<<6)-1) << PERI_MDMA_MDMA_C6TBR_BIT_TSEL_SHIFT)
#define PERI_MDMA_MDMA_C6TBR_BIT_SBUS_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C6TBR_BIT_SBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6TBR_BIT_SBUS_SHIFT)
#define PERI_MDMA_MDMA_C6TBR_BIT_DBUS_SHIFT                         (17U)
#define PERI_MDMA_MDMA_C6TBR_BIT_DBUS_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C6TBR_BIT_DBUS_SHIFT)

/*--- register MDMA_C6MAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6MAR_BIT_MAR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C6MAR_BIT_MAR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C6MAR_BIT_MAR_SHIFT)

/*--- register MDMA_C6MDR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C6MDR_BIT_MDR_SHIFT                          (0U)
#define PERI_MDMA_MDMA_C6MDR_BIT_MDR_MASK                           (((1U<<32)-1) << PERI_MDMA_MDMA_C6MDR_BIT_MDR_SHIFT)

/*--- register MDMA_C7ISR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C7ISR_BIT_TEIF7_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C7ISR_BIT_TEIF7_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C7ISR_BIT_TEIF7_SHIFT)
#define PERI_MDMA_MDMA_C7ISR_BIT_CTCIF7_SHIFT                       (1U)
#define PERI_MDMA_MDMA_C7ISR_BIT_CTCIF7_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C7ISR_BIT_CTCIF7_SHIFT)
#define PERI_MDMA_MDMA_C7ISR_BIT_BRTIF7_SHIFT                       (2U)
#define PERI_MDMA_MDMA_C7ISR_BIT_BRTIF7_MASK                        (((1U<<1)-1) << PERI_MDMA_MDMA_C7ISR_BIT_BRTIF7_SHIFT)
#define PERI_MDMA_MDMA_C7ISR_BIT_BTIF7_SHIFT                        (3U)
#define PERI_MDMA_MDMA_C7ISR_BIT_BTIF7_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C7ISR_BIT_BTIF7_SHIFT)
#define PERI_MDMA_MDMA_C7ISR_BIT_TCIF7_SHIFT                        (4U)
#define PERI_MDMA_MDMA_C7ISR_BIT_TCIF7_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C7ISR_BIT_TCIF7_SHIFT)
#define PERI_MDMA_MDMA_C7ISR_BIT_CRQA7_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C7ISR_BIT_CRQA7_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C7ISR_BIT_CRQA7_SHIFT)

/*--- register MDMA_C7IFCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C7IFCR_BIT_CTEIF7_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CTEIF7_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C7IFCR_BIT_CTEIF7_SHIFT)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CCTCIF7_SHIFT                     (1U)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CCTCIF7_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C7IFCR_BIT_CCTCIF7_SHIFT)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CBRTIF7_SHIFT                     (2U)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CBRTIF7_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C7IFCR_BIT_CBRTIF7_SHIFT)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CBTIF7_SHIFT                      (3U)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CBTIF7_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C7IFCR_BIT_CBTIF7_SHIFT)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CLTCIF7_SHIFT                     (4U)
#define PERI_MDMA_MDMA_C7IFCR_BIT_CLTCIF7_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C7IFCR_BIT_CLTCIF7_SHIFT)

