minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MDMA_C10SAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10SAR_BIT_SAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C10SAR_BIT_SAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C10SAR_BIT_SAR_SHIFT)

/*--- register MDMA_C10DAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10DAR_BIT_DAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C10DAR_BIT_DAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C10DAR_BIT_DAR_SHIFT)

/*--- register MDMA_C10BRUR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10BRUR_BIT_SUV_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C10BRUR_BIT_SUV_MASK                         (((1U<<16)-1) << PERI_MDMA_MDMA_C10BRUR_BIT_SUV_SHIFT)
#define PERI_MDMA_MDMA_C10BRUR_BIT_DUV_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C10BRUR_BIT_DUV_MASK                         (((1U<<16)-1) << PERI_MDMA_MDMA_C10BRUR_BIT_DUV_SHIFT)

/*--- register MDMA_C10LAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10LAR_BIT_LAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C10LAR_BIT_LAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C10LAR_BIT_LAR_SHIFT)

/*--- register MDMA_C10TBR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10TBR_BIT_TSEL_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C10TBR_BIT_TSEL_MASK                         (((1U<<6)-1) << PERI_MDMA_MDMA_C10TBR_BIT_TSEL_SHIFT)
#define PERI_MDMA_MDMA_C10TBR_BIT_SBUS_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C10TBR_BIT_SBUS_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C10TBR_BIT_SBUS_SHIFT)
#define PERI_MDMA_MDMA_C10TBR_BIT_DBUS_SHIFT                        (17U)
#define PERI_MDMA_MDMA_C10TBR_BIT_DBUS_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C10TBR_BIT_DBUS_SHIFT)

/*--- register MDMA_C10MAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10MAR_BIT_MAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C10MAR_BIT_MAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C10MAR_BIT_MAR_SHIFT)

/*--- register MDMA_C10MDR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C10MDR_BIT_MDR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C10MDR_BIT_MDR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C10MDR_BIT_MDR_SHIFT)

/*--- register MDMA_C11ISR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11ISR_BIT_TEIF11_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C11ISR_BIT_TEIF11_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C11ISR_BIT_TEIF11_SHIFT)
#define PERI_MDMA_MDMA_C11ISR_BIT_CTCIF11_SHIFT                     (1U)
#define PERI_MDMA_MDMA_C11ISR_BIT_CTCIF11_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C11ISR_BIT_CTCIF11_SHIFT)
#define PERI_MDMA_MDMA_C11ISR_BIT_BRTIF11_SHIFT                     (2U)
#define PERI_MDMA_MDMA_C11ISR_BIT_BRTIF11_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C11ISR_BIT_BRTIF11_SHIFT)
#define PERI_MDMA_MDMA_C11ISR_BIT_BTIF11_SHIFT                      (3U)
#define PERI_MDMA_MDMA_C11ISR_BIT_BTIF11_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C11ISR_BIT_BTIF11_SHIFT)
#define PERI_MDMA_MDMA_C11ISR_BIT_TCIF11_SHIFT                      (4U)
#define PERI_MDMA_MDMA_C11ISR_BIT_TCIF11_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C11ISR_BIT_TCIF11_SHIFT)
#define PERI_MDMA_MDMA_C11ISR_BIT_CRQA11_SHIFT                      (16U)
#define PERI_MDMA_MDMA_C11ISR_BIT_CRQA11_MASK                       (((1U<<1)-1) << PERI_MDMA_MDMA_C11ISR_BIT_CRQA11_SHIFT)

/*--- register MDMA_C11IFCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11IFCR_BIT_CTEIF11_SHIFT                    (0U)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CTEIF11_MASK                     (((1U<<1)-1) << PERI_MDMA_MDMA_C11IFCR_BIT_CTEIF11_SHIFT)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CCTCIF11_SHIFT                   (1U)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CCTCIF11_MASK                    (((1U<<1)-1) << PERI_MDMA_MDMA_C11IFCR_BIT_CCTCIF11_SHIFT)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CBRTIF11_SHIFT                   (2U)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CBRTIF11_MASK                    (((1U<<1)-1) << PERI_MDMA_MDMA_C11IFCR_BIT_CBRTIF11_SHIFT)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CBTIF11_SHIFT                    (3U)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CBTIF11_MASK                     (((1U<<1)-1) << PERI_MDMA_MDMA_C11IFCR_BIT_CBTIF11_SHIFT)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CLTCIF11_SHIFT                   (4U)
#define PERI_MDMA_MDMA_C11IFCR_BIT_CLTCIF11_MASK                    (((1U<<1)-1) << PERI_MDMA_MDMA_C11IFCR_BIT_CLTCIF11_SHIFT)

/*--- register MDMA_C11ESR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11ESR_BIT_TEA_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C11ESR_BIT_TEA_MASK                          (((1U<<7)-1) << PERI_MDMA_MDMA_C11ESR_BIT_TEA_SHIFT)
#define PERI_MDMA_MDMA_C11ESR_BIT_TED_SHIFT                         (7U)
#define PERI_MDMA_MDMA_C11ESR_BIT_TED_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11ESR_BIT_TED_SHIFT)
#define PERI_MDMA_MDMA_C11ESR_BIT_TELD_SHIFT                        (8U)
#define PERI_MDMA_MDMA_C11ESR_BIT_TELD_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C11ESR_BIT_TELD_SHIFT)
#define PERI_MDMA_MDMA_C11ESR_BIT_TEMD_SHIFT                        (9U)
#define PERI_MDMA_MDMA_C11ESR_BIT_TEMD_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C11ESR_BIT_TEMD_SHIFT)
#define PERI_MDMA_MDMA_C11ESR_BIT_ASE_SHIFT                         (10U)
#define PERI_MDMA_MDMA_C11ESR_BIT_ASE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11ESR_BIT_ASE_SHIFT)
#define PERI_MDMA_MDMA_C11ESR_BIT_BSE_SHIFT                         (11U)
#define PERI_MDMA_MDMA_C11ESR_BIT_BSE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11ESR_BIT_BSE_SHIFT)

/*--- register MDMA_C11CR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11CR_BIT_EN_SHIFT                           (0U)
#define PERI_MDMA_MDMA_C11CR_BIT_EN_MASK                            (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_EN_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_TEIE_SHIFT                         (1U)
#define PERI_MDMA_MDMA_C11CR_BIT_TEIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_TEIE_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_CTCIE_SHIFT                        (2U)
#define PERI_MDMA_MDMA_C11CR_BIT_CTCIE_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_CTCIE_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_BRTIE_SHIFT                        (3U)
#define PERI_MDMA_MDMA_C11CR_BIT_BRTIE_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_BRTIE_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_BTIE_SHIFT                         (4U)
#define PERI_MDMA_MDMA_C11CR_BIT_BTIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_BTIE_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_TCIE_SHIFT                         (5U)
#define PERI_MDMA_MDMA_C11CR_BIT_TCIE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_TCIE_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_PL_SHIFT                           (6U)
#define PERI_MDMA_MDMA_C11CR_BIT_PL_MASK                            (((1U<<2)-1) << PERI_MDMA_MDMA_C11CR_BIT_PL_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_BEX_SHIFT                          (12U)
#define PERI_MDMA_MDMA_C11CR_BIT_BEX_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_BEX_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_HEX_SHIFT                          (13U)
#define PERI_MDMA_MDMA_C11CR_BIT_HEX_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_HEX_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_WEX_SHIFT                          (14U)
#define PERI_MDMA_MDMA_C11CR_BIT_WEX_MASK                           (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_WEX_SHIFT)
#define PERI_MDMA_MDMA_C11CR_BIT_SWRQ_SHIFT                         (16U)
#define PERI_MDMA_MDMA_C11CR_BIT_SWRQ_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11CR_BIT_SWRQ_SHIFT)

/*--- register MDMA_C11TCR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11TCR_BIT_SINC_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C11TCR_BIT_SINC_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_SINC_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_DINC_SHIFT                        (2U)
#define PERI_MDMA_MDMA_C11TCR_BIT_DINC_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_DINC_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_SSIZE_SHIFT                       (4U)
#define PERI_MDMA_MDMA_C11TCR_BIT_SSIZE_MASK                        (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_SSIZE_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_DSIZE_SHIFT                       (6U)
#define PERI_MDMA_MDMA_C11TCR_BIT_DSIZE_MASK                        (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_DSIZE_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_SINCOS_SHIFT                      (8U)
#define PERI_MDMA_MDMA_C11TCR_BIT_SINCOS_MASK                       (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_SINCOS_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_DINCOS_SHIFT                      (10U)
#define PERI_MDMA_MDMA_C11TCR_BIT_DINCOS_MASK                       (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_DINCOS_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_SBURST_SHIFT                      (12U)
#define PERI_MDMA_MDMA_C11TCR_BIT_SBURST_MASK                       (((1U<<3)-1) << PERI_MDMA_MDMA_C11TCR_BIT_SBURST_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_DBURST_SHIFT                      (15U)
#define PERI_MDMA_MDMA_C11TCR_BIT_DBURST_MASK                       (((1U<<3)-1) << PERI_MDMA_MDMA_C11TCR_BIT_DBURST_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_TLEN_SHIFT                        (18U)
#define PERI_MDMA_MDMA_C11TCR_BIT_TLEN_MASK                         (((1U<<7)-1) << PERI_MDMA_MDMA_C11TCR_BIT_TLEN_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_PKE_SHIFT                         (25U)
#define PERI_MDMA_MDMA_C11TCR_BIT_PKE_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11TCR_BIT_PKE_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_PAM_SHIFT                         (26U)
#define PERI_MDMA_MDMA_C11TCR_BIT_PAM_MASK                          (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_PAM_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_TRGM_SHIFT                        (28U)
#define PERI_MDMA_MDMA_C11TCR_BIT_TRGM_MASK                         (((1U<<2)-1) << PERI_MDMA_MDMA_C11TCR_BIT_TRGM_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_SWRM_SHIFT                        (30U)
#define PERI_MDMA_MDMA_C11TCR_BIT_SWRM_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C11TCR_BIT_SWRM_SHIFT)
#define PERI_MDMA_MDMA_C11TCR_BIT_BWM_SHIFT                         (31U)
#define PERI_MDMA_MDMA_C11TCR_BIT_BWM_MASK                          (((1U<<1)-1) << PERI_MDMA_MDMA_C11TCR_BIT_BWM_SHIFT)

/*--- register MDMA_C11BNDTR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BNDT_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BNDT_MASK                       (((1U<<17)-1) << PERI_MDMA_MDMA_C11BNDTR_BIT_BNDT_SHIFT)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BRSUM_SHIFT                     (18U)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BRSUM_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C11BNDTR_BIT_BRSUM_SHIFT)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BRDUM_SHIFT                     (19U)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BRDUM_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C11BNDTR_BIT_BRDUM_SHIFT)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BRC_SHIFT                       (20U)
#define PERI_MDMA_MDMA_C11BNDTR_BIT_BRC_MASK                        (((1U<<12)-1) << PERI_MDMA_MDMA_C11BNDTR_BIT_BRC_SHIFT)

/*--- register MDMA_C11SAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C11SAR_BIT_SAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C11SAR_BIT_SAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C11SAR_BIT_SAR_SHIFT)

