minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register MDMA_C15BNDTR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BNDT_SHIFT                      (0U)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BNDT_MASK                       (((1U<<17)-1) << PERI_MDMA_MDMA_C15BNDTR_BIT_BNDT_SHIFT)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BRSUM_SHIFT                     (18U)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BRSUM_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C15BNDTR_BIT_BRSUM_SHIFT)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BRDUM_SHIFT                     (19U)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BRDUM_MASK                      (((1U<<1)-1) << PERI_MDMA_MDMA_C15BNDTR_BIT_BRDUM_SHIFT)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BRC_SHIFT                       (20U)
#define PERI_MDMA_MDMA_C15BNDTR_BIT_BRC_MASK                        (((1U<<12)-1) << PERI_MDMA_MDMA_C15BNDTR_BIT_BRC_SHIFT)

/*--- register MDMA_C15SAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15SAR_BIT_SAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C15SAR_BIT_SAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C15SAR_BIT_SAR_SHIFT)

/*--- register MDMA_C15DAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15DAR_BIT_DAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C15DAR_BIT_DAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C15DAR_BIT_DAR_SHIFT)

/*--- register MDMA_C15BRUR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15BRUR_BIT_SUV_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C15BRUR_BIT_SUV_MASK                         (((1U<<16)-1) << PERI_MDMA_MDMA_C15BRUR_BIT_SUV_SHIFT)
#define PERI_MDMA_MDMA_C15BRUR_BIT_DUV_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C15BRUR_BIT_DUV_MASK                         (((1U<<16)-1) << PERI_MDMA_MDMA_C15BRUR_BIT_DUV_SHIFT)

/*--- register MDMA_C15LAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15LAR_BIT_LAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C15LAR_BIT_LAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C15LAR_BIT_LAR_SHIFT)

/*--- register MDMA_C15TBR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15TBR_BIT_TSEL_SHIFT                        (0U)
#define PERI_MDMA_MDMA_C15TBR_BIT_TSEL_MASK                         (((1U<<6)-1) << PERI_MDMA_MDMA_C15TBR_BIT_TSEL_SHIFT)
#define PERI_MDMA_MDMA_C15TBR_BIT_SBUS_SHIFT                        (16U)
#define PERI_MDMA_MDMA_C15TBR_BIT_SBUS_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C15TBR_BIT_SBUS_SHIFT)
#define PERI_MDMA_MDMA_C15TBR_BIT_DBUS_SHIFT                        (17U)
#define PERI_MDMA_MDMA_C15TBR_BIT_DBUS_MASK                         (((1U<<1)-1) << PERI_MDMA_MDMA_C15TBR_BIT_DBUS_SHIFT)

/*--- register MDMA_C15MAR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15MAR_BIT_MAR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C15MAR_BIT_MAR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C15MAR_BIT_MAR_SHIFT)

/*--- register MDMA_C15MDR -------------------------------------------------*/
#define PERI_MDMA_MDMA_C15MDR_BIT_MDR_SHIFT                         (0U)
#define PERI_MDMA_MDMA_C15MDR_BIT_MDR_MASK                          (((1U<<32)-1) << PERI_MDMA_MDMA_C15MDR_BIT_MDR_SHIFT)

/*--- register OPAMP1_CSR -------------------------------------------------*/
#define PERI_OPAMP_OPAMP1_CSR_BIT_OPAEN_SHIFT                       (0U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_OPAEN_MASK                        (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_OPAEN_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_FORCE_VP_SHIFT                    (1U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_FORCE_VP_MASK                     (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_FORCE_VP_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_VP_SEL_SHIFT                      (2U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_VP_SEL_MASK                       (((1U<<2)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_VP_SEL_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_VM_SEL_SHIFT                      (5U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_VM_SEL_MASK                       (((1U<<2)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_VM_SEL_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_OPAHSM_SHIFT                      (8U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_OPAHSM_MASK                       (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_OPAHSM_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_CALON_SHIFT                       (11U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_CALON_MASK                        (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_CALON_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_CALSEL_SHIFT                      (12U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_CALSEL_MASK                       (((1U<<2)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_CALSEL_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_PGA_GAIN_SHIFT                    (14U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_PGA_GAIN_MASK                     (((1U<<4)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_PGA_GAIN_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_USERTRIM_SHIFT                    (18U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_USERTRIM_MASK                     (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_USERTRIM_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_TSTREF_SHIFT                      (29U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_TSTREF_MASK                       (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_TSTREF_SHIFT)
#define PERI_OPAMP_OPAMP1_CSR_BIT_CALOUT_SHIFT                      (30U)
#define PERI_OPAMP_OPAMP1_CSR_BIT_CALOUT_MASK                       (((1U<<1)-1) << PERI_OPAMP_OPAMP1_CSR_BIT_CALOUT_SHIFT)

/*--- register OPAMP1_OTR -------------------------------------------------*/
#define PERI_OPAMP_OPAMP1_OTR_BIT_TRIMOFFSETN_SHIFT                 (0U)
#define PERI_OPAMP_OPAMP1_OTR_BIT_TRIMOFFSETN_MASK                  (((1U<<5)-1) << PERI_OPAMP_OPAMP1_OTR_BIT_TRIMOFFSETN_SHIFT)
#define PERI_OPAMP_OPAMP1_OTR_BIT_TRIMOFFSETP_SHIFT                 (8U)
#define PERI_OPAMP_OPAMP1_OTR_BIT_TRIMOFFSETP_MASK                  (((1U<<5)-1) << PERI_OPAMP_OPAMP1_OTR_BIT_TRIMOFFSETP_SHIFT)

/*--- register OPAMP1_HSOTR -------------------------------------------------*/
#define PERI_OPAMP_OPAMP1_HSOTR_BIT_TRIMLPOFFSETN_SHIFT             (0U)
#define PERI_OPAMP_OPAMP1_HSOTR_BIT_TRIMLPOFFSETN_MASK              (((1U<<5)-1) << PERI_OPAMP_OPAMP1_HSOTR_BIT_TRIMLPOFFSETN_SHIFT)
#define PERI_OPAMP_OPAMP1_HSOTR_BIT_TRIMLPOFFSETP_SHIFT             (8U)
#define PERI_OPAMP_OPAMP1_HSOTR_BIT_TRIMLPOFFSETP_MASK              (((1U<<5)-1) << PERI_OPAMP_OPAMP1_HSOTR_BIT_TRIMLPOFFSETP_SHIFT)

/*--- register OPAMP2_CSR -------------------------------------------------*/
#define PERI_OPAMP_OPAMP2_CSR_BIT_OPAEN_SHIFT                       (0U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_OPAEN_MASK                        (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_OPAEN_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_FORCE_VP_SHIFT                    (1U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_FORCE_VP_MASK                     (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_FORCE_VP_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_VM_SEL_SHIFT                      (5U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_VM_SEL_MASK                       (((1U<<2)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_VM_SEL_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_OPAHSM_SHIFT                      (8U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_OPAHSM_MASK                       (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_OPAHSM_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_CALON_SHIFT                       (11U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_CALON_MASK                        (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_CALON_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_CALSEL_SHIFT                      (12U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_CALSEL_MASK                       (((1U<<2)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_CALSEL_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_PGA_GAIN_SHIFT                    (14U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_PGA_GAIN_MASK                     (((1U<<4)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_PGA_GAIN_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_USERTRIM_SHIFT                    (18U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_USERTRIM_MASK                     (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_USERTRIM_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_TSTREF_SHIFT                      (29U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_TSTREF_MASK                       (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_TSTREF_SHIFT)
#define PERI_OPAMP_OPAMP2_CSR_BIT_CALOUT_SHIFT                      (30U)
#define PERI_OPAMP_OPAMP2_CSR_BIT_CALOUT_MASK                       (((1U<<1)-1) << PERI_OPAMP_OPAMP2_CSR_BIT_CALOUT_SHIFT)

