minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OPAMP2_OTR -------------------------------------------------*/
#define PERI_OPAMP_OPAMP2_OTR_BIT_TRIMOFFSETN_SHIFT                 (0U)
#define PERI_OPAMP_OPAMP2_OTR_BIT_TRIMOFFSETN_MASK                  (((1U<<5)-1) << PERI_OPAMP_OPAMP2_OTR_BIT_TRIMOFFSETN_SHIFT)
#define PERI_OPAMP_OPAMP2_OTR_BIT_TRIMOFFSETP_SHIFT                 (8U)
#define PERI_OPAMP_OPAMP2_OTR_BIT_TRIMOFFSETP_MASK                  (((1U<<5)-1) << PERI_OPAMP_OPAMP2_OTR_BIT_TRIMOFFSETP_SHIFT)

/*--- register OPAMP2_HSOTR -------------------------------------------------*/
#define PERI_OPAMP_OPAMP2_HSOTR_BIT_TRIMLPOFFSETN_SHIFT             (0U)
#define PERI_OPAMP_OPAMP2_HSOTR_BIT_TRIMLPOFFSETN_MASK              (((1U<<5)-1) << PERI_OPAMP_OPAMP2_HSOTR_BIT_TRIMLPOFFSETN_SHIFT)
#define PERI_OPAMP_OPAMP2_HSOTR_BIT_TRIMLPOFFSETP_SHIFT             (8U)
#define PERI_OPAMP_OPAMP2_HSOTR_BIT_TRIMLPOFFSETP_MASK              (((1U<<5)-1) << PERI_OPAMP_OPAMP2_HSOTR_BIT_TRIMLPOFFSETP_SHIFT)

/*--- register OTG_HS_DCFG -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_DSPD_SHIFT              (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_DSPD_MASK               (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_DSPD_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_NZLSOHSK_SHIFT          (2U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_NZLSOHSK_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_NZLSOHSK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_DAD_SHIFT               (4U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_DAD_MASK                (((1U<<7)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_DAD_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_PFIVL_SHIFT             (11U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_PFIVL_MASK              (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_PFIVL_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_PERSCHIVL_SHIFT         (24U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_PERSCHIVL_MASK          (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCFG_BIT_PERSCHIVL_SHIFT)

/*--- register OTG_HS_DCTL -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_RWUSIG_SHIFT            (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_RWUSIG_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_RWUSIG_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SDIS_SHIFT              (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SDIS_MASK               (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SDIS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_GINSTS_SHIFT            (2U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_GINSTS_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_GINSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_GONSTS_SHIFT            (3U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_GONSTS_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_GONSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_TCTL_SHIFT              (4U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_TCTL_MASK               (((1U<<3)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_TCTL_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SGINAK_SHIFT            (7U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SGINAK_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SGINAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_CGINAK_SHIFT            (8U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_CGINAK_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_CGINAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SGONAK_SHIFT            (9U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SGONAK_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_SGONAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_CGONAK_SHIFT            (10U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_CGONAK_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_CGONAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_POPRGDNE_SHIFT          (11U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_POPRGDNE_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DCTL_BIT_POPRGDNE_SHIFT)

/*--- register OTG_HS_DSTS -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_SUSPSTS_SHIFT           (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_SUSPSTS_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_SUSPSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_ENUMSPD_SHIFT           (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_ENUMSPD_MASK            (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_ENUMSPD_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_EERR_SHIFT              (3U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_EERR_MASK               (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_EERR_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_FNSOF_SHIFT             (8U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_FNSOF_MASK              (((1U<<14)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DSTS_BIT_FNSOF_SHIFT)

/*--- register OTG_HS_DIEPMSK -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_XFRCM_SHIFT          (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_XFRCM_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_XFRCM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_EPDM_SHIFT           (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_EPDM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_EPDM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_TOM_SHIFT            (3U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_TOM_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_TOM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_ITTXFEMSK_SHIFT      (4U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_ITTXFEMSK_MASK       (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_ITTXFEMSK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_INEPNMM_SHIFT        (5U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_INEPNMM_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_INEPNMM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_INEPNEM_SHIFT        (6U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_INEPNEM_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_INEPNEM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_TXFURM_SHIFT         (8U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_TXFURM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_TXFURM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_BIM_SHIFT            (9U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_BIM_MASK             (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIT_BIM_SHIFT)

/*--- register OTG_HS_DOEPMSK -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_XFRCM_SHIFT          (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_XFRCM_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_XFRCM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_EPDM_SHIFT           (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_EPDM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_EPDM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_STUPM_SHIFT          (3U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_STUPM_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_STUPM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_OTEPDM_SHIFT         (4U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_OTEPDM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_OTEPDM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_B2BSTUP_SHIFT        (6U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_B2BSTUP_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_B2BSTUP_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_OPEM_SHIFT           (8U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_OPEM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_OPEM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_BOIM_SHIFT           (9U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_BOIM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BIT_BOIM_SHIFT)

