minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_DAINT -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINT_BIT_IEPINT_SHIFT           (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINT_BIT_IEPINT_MASK            (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DAINT_BIT_IEPINT_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINT_BIT_OEPINT_SHIFT           (16U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINT_BIT_OEPINT_MASK            (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DAINT_BIT_OEPINT_SHIFT)

/*--- register OTG_HS_DAINTMSK -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINTMSK_BIT_IEPM_SHIFT          (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINTMSK_BIT_IEPM_MASK           (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DAINTMSK_BIT_IEPM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINTMSK_BIT_OEPM_SHIFT          (16U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DAINTMSK_BIT_OEPM_MASK           (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DAINTMSK_BIT_OEPM_SHIFT)

/*--- register OTG_HS_DVBUSDIS -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_BIT_VBUSDT_SHIFT        (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_BIT_VBUSDT_MASK         (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_BIT_VBUSDT_SHIFT)

/*--- register OTG_HS_DVBUSPULSE -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_BIT_DVBUSP_SHIFT      (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_BIT_DVBUSP_MASK       (((1U<<12)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_BIT_DVBUSP_SHIFT)

/*--- register OTG_HS_DTHRCTL -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_NONISOTHREN_SHIFT    (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_NONISOTHREN_MASK     (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_NONISOTHREN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_ISOTHREN_SHIFT       (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_ISOTHREN_MASK        (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_ISOTHREN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_TXTHRLEN_SHIFT       (2U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_TXTHRLEN_MASK        (((1U<<9)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_TXTHRLEN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_RXTHREN_SHIFT        (16U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_RXTHREN_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_RXTHREN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_RXTHRLEN_SHIFT       (17U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_RXTHRLEN_MASK        (((1U<<9)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_RXTHRLEN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_ARPEN_SHIFT          (27U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_ARPEN_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTHRCTL_BIT_ARPEN_SHIFT)

/*--- register OTG_HS_DIEPEMPMSK -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_BIT_INEPTXFEM_SHIFT   (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_BIT_INEPTXFEM_MASK    (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_BIT_INEPTXFEM_SHIFT)

/*--- register OTG_HS_DEACHINT -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINT_BIT_IEP1INT_SHIFT       (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINT_BIT_IEP1INT_MASK        (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINT_BIT_IEP1INT_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINT_BIT_OEP1INT_SHIFT       (17U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINT_BIT_OEP1INT_MASK        (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINT_BIT_OEP1INT_SHIFT)

/*--- register OTG_HS_DEACHINTMSK -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_BIT_IEP1INTM_SHIFT   (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_BIT_IEP1INTM_MASK    (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_BIT_IEP1INTM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_BIT_OEP1INTM_SHIFT   (17U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_BIT_OEP1INTM_MASK    (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_BIT_OEP1INTM_SHIFT)

/*--- register OTG_HS_DIEPCTL0 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_MPSIZ_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_USBAEP_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_NAKSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPTYP_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_STALL_SHIFT         (21U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_STALL_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_TXFNUM_SHIFT        (22U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_TXFNUM_MASK         (((1U<<4)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_TXFNUM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_CNAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SNAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_SODDFRM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPDIS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DIEPINT0 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_XFRC_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_EPDISD_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TOC_SHIFT           (3U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TOC_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TOC_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_ITTXFE_SHIFT        (4U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_ITTXFE_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_ITTXFE_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_INEPNE_SHIFT        (6U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_INEPNE_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_INEPNE_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TXFE_SHIFT          (7U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TXFE_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TXFE_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TXFIFOUDRN_SHIFT    (8U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TXFIFOUDRN_MASK     (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_TXFIFOUDRN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_BNA_SHIFT           (9U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_BNA_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_BNA_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_PKTDRPSTS_SHIFT     (11U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_PKTDRPSTS_MASK      (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_PKTDRPSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_BERR_SHIFT          (12U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_BERR_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_BERR_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_NAK_SHIFT           (13U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_NAK_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BIT_NAK_SHIFT)

/*--- register OTG_HS_DIEPTSIZ0 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_BIT_XFRSIZ_SHIFT       (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_BIT_XFRSIZ_MASK        (((1U<<7)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_BIT_XFRSIZ_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_BIT_PKTCNT_SHIFT       (19U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_BIT_PKTCNT_MASK        (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_BIT_PKTCNT_SHIFT)

/*--- register OTG_HS_DIEPDMA1 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_BIT_DMAADDR_SHIFT       (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_BIT_DMAADDR_MASK        (((1U<<32)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_BIT_DMAADDR_SHIFT)

/*--- register OTG_HS_DTXFSTS0 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_BIT_INEPTFSAV_SHIFT     (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_BIT_INEPTFSAV_MASK      (((1U<<16)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_BIT_INEPTFSAV_SHIFT)

/*--- register OTG_HS_DIEPCTL1 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_MPSIZ_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_USBAEP_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_NAKSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPTYP_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_STALL_SHIFT         (21U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_STALL_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_TXFNUM_SHIFT        (22U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_TXFNUM_MASK         (((1U<<4)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_TXFNUM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_CNAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SNAK_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_SODDFRM_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPDIS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DIEPINT1 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_XFRC_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_EPDISD_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TOC_SHIFT           (3U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TOC_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TOC_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_ITTXFE_SHIFT        (4U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_ITTXFE_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_ITTXFE_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_INEPNE_SHIFT        (6U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_INEPNE_MASK         (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_INEPNE_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TXFE_SHIFT          (7U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TXFE_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TXFE_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TXFIFOUDRN_SHIFT    (8U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TXFIFOUDRN_MASK     (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_TXFIFOUDRN_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_BNA_SHIFT           (9U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_BNA_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_BNA_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_PKTDRPSTS_SHIFT     (11U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_PKTDRPSTS_MASK      (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_PKTDRPSTS_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_BERR_SHIFT          (12U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_BERR_MASK           (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_BERR_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_NAK_SHIFT           (13U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_NAK_MASK            (((1U<<1)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BIT_NAK_SHIFT)

/*--- register OTG_HS_DIEPTSIZ1 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_XFRSIZ_SHIFT       (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_XFRSIZ_MASK        (((1U<<19)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_XFRSIZ_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_PKTCNT_SHIFT       (19U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_PKTCNT_MASK        (((1U<<10)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_PKTCNT_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_MCNT_SHIFT         (29U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_MCNT_MASK          (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_BIT_MCNT_SHIFT)

