minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_DOEPTSIZ7 -------------------------------------------------*/
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_XFRSIZ_SHIFT       (0U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_XFRSIZ_MASK        (((1U<<19)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_XFRSIZ_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_PKTCNT_SHIFT       (19U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_PKTCNT_MASK        (((1U<<10)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_PKTCNT_SHIFT)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_RXDPID_STUPCNT_SHIFT (29U)
#define PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_RXDPID_STUPCNT_MASK (((1U<<2)-1) << PERI_OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_BIT_RXDPID_STUPCNT_SHIFT)

/*--- register OTG_HS_GOTGCTL -------------------------------------------------*/
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_SRQSCS_SHIFT         (0U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_SRQSCS_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_SRQSCS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_SRQ_SHIFT            (1U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_SRQ_MASK             (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_SRQ_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_VBVALOEN_SHIFT       (2U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_VBVALOEN_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_VBVALOEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_VBVALOVAL_SHIFT      (3U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_VBVALOVAL_MASK       (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_VBVALOVAL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_AVALOEN_SHIFT        (4U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_AVALOEN_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_AVALOEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_AVALOVAL_SHIFT       (5U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_AVALOVAL_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_AVALOVAL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BVALOEN_SHIFT        (6U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BVALOEN_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BVALOEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BVALOVAL_SHIFT       (7U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BVALOVAL_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BVALOVAL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HNGSCS_SHIFT         (8U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HNGSCS_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HNGSCS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HNPRQ_SHIFT          (9U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HNPRQ_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HNPRQ_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HSHNPEN_SHIFT        (10U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HSHNPEN_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_HSHNPEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_DHNPEN_SHIFT         (11U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_DHNPEN_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_DHNPEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_EHEN_SHIFT           (12U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_EHEN_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_EHEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_CIDSTS_SHIFT         (16U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_CIDSTS_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_CIDSTS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_DBCT_SHIFT           (17U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_DBCT_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_DBCT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_ASVLD_SHIFT          (18U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_ASVLD_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_ASVLD_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BSVLD_SHIFT          (19U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BSVLD_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_BSVLD_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_OTGVER_SHIFT         (20U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_OTGVER_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_OTGVER_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_CURMOD_SHIFT         (21U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_CURMOD_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGCTL_BIT_CURMOD_SHIFT)

/*--- register OTG_HS_GOTGINT -------------------------------------------------*/
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_SEDET_SHIFT          (2U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_SEDET_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_SEDET_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_SRSSCHG_SHIFT        (8U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_SRSSCHG_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_SRSSCHG_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_HNSSCHG_SHIFT        (9U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_HNSSCHG_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_HNSSCHG_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_HNGDET_SHIFT         (17U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_HNGDET_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_HNGDET_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_ADTOCHG_SHIFT        (18U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_ADTOCHG_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_ADTOCHG_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_DBCDNE_SHIFT         (19U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_DBCDNE_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_DBCDNE_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_IDCHNG_SHIFT         (20U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_IDCHNG_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GOTGINT_BIT_IDCHNG_SHIFT)

/*--- register OTG_HS_GAHBCFG -------------------------------------------------*/
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_GINT_SHIFT           (0U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_GINT_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_GINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_HBSTLEN_SHIFT        (1U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_HBSTLEN_MASK         (((1U<<4)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_HBSTLEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_DMAEN_SHIFT          (5U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_DMAEN_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_DMAEN_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_TXFELVL_SHIFT        (7U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_TXFELVL_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_TXFELVL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_PTXFELVL_SHIFT       (8U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_PTXFELVL_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GAHBCFG_BIT_PTXFELVL_SHIFT)

/*--- register OTG_HS_GUSBCFG -------------------------------------------------*/
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TOCAL_SHIFT          (0U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TOCAL_MASK           (((1U<<3)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TOCAL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PHYSEL_SHIFT         (6U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PHYSEL_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PHYSEL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_SRPCAP_SHIFT         (8U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_SRPCAP_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_SRPCAP_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_HNPCAP_SHIFT         (9U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_HNPCAP_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_HNPCAP_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TRDT_SHIFT           (10U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TRDT_MASK            (((1U<<4)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TRDT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PHYLPCS_SHIFT        (15U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PHYLPCS_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PHYLPCS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIFSLS_SHIFT       (17U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIFSLS_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIFSLS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIAR_SHIFT         (18U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIAR_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIAR_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPICSM_SHIFT        (19U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPICSM_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPICSM_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIEVBUSD_SHIFT     (20U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIEVBUSD_MASK      (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIEVBUSD_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIEVBUSI_SHIFT     (21U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIEVBUSI_MASK      (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIEVBUSI_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TSDPS_SHIFT          (22U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TSDPS_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_TSDPS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PCCI_SHIFT           (23U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PCCI_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PCCI_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PTCI_SHIFT           (24U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PTCI_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_PTCI_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIIPD_SHIFT        (25U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIIPD_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_ULPIIPD_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_FHMOD_SHIFT          (29U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_FHMOD_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_FHMOD_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_FDMOD_SHIFT          (30U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_FDMOD_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GUSBCFG_BIT_FDMOD_SHIFT)

/*--- register OTG_HS_GRSTCTL -------------------------------------------------*/
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_CSRST_SHIFT          (0U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_CSRST_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_CSRST_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_HSRST_SHIFT          (1U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_HSRST_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_HSRST_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_FCRST_SHIFT          (2U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_FCRST_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_FCRST_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_RXFFLSH_SHIFT        (4U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_RXFFLSH_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_RXFFLSH_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_TXFFLSH_SHIFT        (5U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_TXFFLSH_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_TXFFLSH_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_TXFNUM_SHIFT         (6U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_TXFNUM_MASK          (((1U<<5)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_TXFNUM_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_DMAREQ_SHIFT         (30U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_DMAREQ_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_DMAREQ_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_AHBIDL_SHIFT         (31U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_AHBIDL_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GRSTCTL_BIT_AHBIDL_SHIFT)

/*--- register OTG_HS_GINTSTS -------------------------------------------------*/
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_CMOD_SHIFT           (0U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_CMOD_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_CMOD_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_MMIS_SHIFT           (1U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_MMIS_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_MMIS_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_OTGINT_SHIFT         (2U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_OTGINT_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_OTGINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_SOF_SHIFT            (3U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_SOF_MASK             (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_SOF_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_RXFLVL_SHIFT         (4U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_RXFLVL_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_RXFLVL_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_NPTXFE_SHIFT         (5U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_NPTXFE_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_NPTXFE_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_GINAKEFF_SHIFT       (6U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_GINAKEFF_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_GINAKEFF_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_BOUTNAKEFF_SHIFT     (7U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_BOUTNAKEFF_MASK      (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_BOUTNAKEFF_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ESUSP_SHIFT          (10U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ESUSP_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ESUSP_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_USBSUSP_SHIFT        (11U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_USBSUSP_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_USBSUSP_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_USBRST_SHIFT         (12U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_USBRST_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_USBRST_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ENUMDNE_SHIFT        (13U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ENUMDNE_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ENUMDNE_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ISOODRP_SHIFT        (14U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ISOODRP_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_ISOODRP_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_EOPF_SHIFT           (15U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_EOPF_MASK            (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_EOPF_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_IEPINT_SHIFT         (18U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_IEPINT_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_IEPINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_OEPINT_SHIFT         (19U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_OEPINT_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_OEPINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_IISOIXFR_SHIFT       (20U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_IISOIXFR_MASK        (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_IISOIXFR_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_PXFR_INCOMPISOOUT_SHIFT (21U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_PXFR_INCOMPISOOUT_MASK (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_PXFR_INCOMPISOOUT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_DATAFSUSP_SHIFT      (22U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_DATAFSUSP_MASK       (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_DATAFSUSP_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_HPRTINT_SHIFT        (24U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_HPRTINT_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_HPRTINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_HCINT_SHIFT          (25U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_HCINT_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_HCINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_PTXFE_SHIFT          (26U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_PTXFE_MASK           (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_PTXFE_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_CIDSCHG_SHIFT        (28U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_CIDSCHG_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_CIDSCHG_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_DISCINT_SHIFT        (29U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_DISCINT_MASK         (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_DISCINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_SRQINT_SHIFT         (30U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_SRQINT_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_SRQINT_SHIFT)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_WKUINT_SHIFT         (31U)
#define PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_WKUINT_MASK          (((1U<<1)-1) << PERI_OTG1_HS_GLOBAL_OTG_HS_GINTSTS_BIT_WKUINT_SHIFT)

