minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_HCCHAR1 -------------------------------------------------*/
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_MPSIZ_SHIFT            (0U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_MPSIZ_MASK             (((1U<<11)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_MPSIZ_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPNUM_SHIFT            (11U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPNUM_MASK             (((1U<<4)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPNUM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPDIR_SHIFT            (15U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPDIR_MASK             (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPDIR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_LSDEV_SHIFT            (17U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_LSDEV_MASK             (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_LSDEV_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPTYP_SHIFT            (18U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPTYP_MASK             (((1U<<2)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_EPTYP_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_MC_SHIFT               (20U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_MC_MASK                (((1U<<2)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_MC_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_DAD_SHIFT              (22U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_DAD_MASK               (((1U<<7)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_DAD_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_ODDFRM_SHIFT           (29U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_ODDFRM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_ODDFRM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_CHDIS_SHIFT            (30U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_CHDIS_MASK             (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_CHDIS_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_CHENA_SHIFT            (31U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_CHENA_MASK             (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCCHAR1_BIT_CHENA_SHIFT)

/*--- register OTG_HS_HCSPLT1 -------------------------------------------------*/
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_PRTADDR_SHIFT          (0U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_PRTADDR_MASK           (((1U<<7)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_PRTADDR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_HUBADDR_SHIFT          (7U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_HUBADDR_MASK           (((1U<<7)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_HUBADDR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_XACTPOS_SHIFT          (14U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_XACTPOS_MASK           (((1U<<2)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_XACTPOS_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_COMPLSPLT_SHIFT        (16U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_COMPLSPLT_MASK         (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_COMPLSPLT_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_SPLITEN_SHIFT          (31U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_SPLITEN_MASK           (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCSPLT1_BIT_SPLITEN_SHIFT)

/*--- register OTG_HS_HCINT1 -------------------------------------------------*/
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_XFRC_SHIFT              (0U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_XFRC_MASK               (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_XFRC_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_CHH_SHIFT               (1U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_CHH_MASK                (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_CHH_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_AHBERR_SHIFT            (2U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_AHBERR_MASK             (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_AHBERR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_STALL_SHIFT             (3U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_STALL_MASK              (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_STALL_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_NAK_SHIFT               (4U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_NAK_MASK                (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_NAK_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_ACK_SHIFT               (5U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_ACK_MASK                (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_ACK_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_NYET_SHIFT              (6U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_NYET_MASK               (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_NYET_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_TXERR_SHIFT             (7U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_TXERR_MASK              (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_TXERR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_BBERR_SHIFT             (8U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_BBERR_MASK              (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_BBERR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_FRMOR_SHIFT             (9U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_FRMOR_MASK              (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_FRMOR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_DTERR_SHIFT             (10U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_DTERR_MASK              (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINT1_BIT_DTERR_SHIFT)

/*--- register OTG_HS_HCINTMSK1 -------------------------------------------------*/
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_XFRCM_SHIFT          (0U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_XFRCM_MASK           (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_XFRCM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_CHHM_SHIFT           (1U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_CHHM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_CHHM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_AHBERR_SHIFT         (2U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_AHBERR_MASK          (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_AHBERR_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_STALLM_SHIFT         (3U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_STALLM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_STALLM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_NAKM_SHIFT           (4U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_NAKM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_NAKM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_ACKM_SHIFT           (5U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_ACKM_MASK            (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_ACKM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_NYET_SHIFT           (6U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_NYET_MASK            (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_NYET_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_TXERRM_SHIFT         (7U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_TXERRM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_TXERRM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_BBERRM_SHIFT         (8U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_BBERRM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_BBERRM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_FRMORM_SHIFT         (9U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_FRMORM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_FRMORM_SHIFT)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_DTERRM_SHIFT         (10U)
#define PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_DTERRM_MASK          (((1U<<1)-1) << PERI_OTG1_HS_HOST_OTG_HS_HCINTMSK1_BIT_DTERRM_SHIFT)

