minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_DIEPCTL6 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_MPSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_USBAEP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_NAKSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPTYP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_STALL_SHIFT         (21U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_STALL_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_TXFNUM_SHIFT        (22U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_TXFNUM_MASK         (((1U<<4)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_TXFNUM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_CNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_SODDFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL6_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DIEPINT6 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_XFRC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_EPDISD_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TOC_SHIFT           (3U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TOC_MASK            (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TOC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_ITTXFE_SHIFT        (4U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_ITTXFE_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_ITTXFE_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_INEPNE_SHIFT        (6U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_INEPNE_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_INEPNE_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TXFE_SHIFT          (7U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TXFE_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TXFE_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TXFIFOUDRN_SHIFT    (8U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TXFIFOUDRN_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_TXFIFOUDRN_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_BNA_SHIFT           (9U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_BNA_MASK            (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_BNA_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_PKTDRPSTS_SHIFT     (11U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_PKTDRPSTS_MASK      (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_PKTDRPSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_BERR_SHIFT          (12U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_BERR_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_BERR_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_NAK_SHIFT           (13U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_NAK_MASK            (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT6_BIT_NAK_SHIFT)

/*--- register OTG_HS_DIEPCTL7 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_MPSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_USBAEP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_NAKSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPTYP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_STALL_SHIFT         (21U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_STALL_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_TXFNUM_SHIFT        (22U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_TXFNUM_MASK         (((1U<<4)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_TXFNUM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_CNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_SODDFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPCTL7_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DIEPINT7 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_XFRC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_EPDISD_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TOC_SHIFT           (3U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TOC_MASK            (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TOC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_ITTXFE_SHIFT        (4U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_ITTXFE_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_ITTXFE_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_INEPNE_SHIFT        (6U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_INEPNE_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_INEPNE_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TXFE_SHIFT          (7U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TXFE_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TXFE_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TXFIFOUDRN_SHIFT    (8U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TXFIFOUDRN_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_TXFIFOUDRN_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_BNA_SHIFT           (9U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_BNA_MASK            (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_BNA_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_PKTDRPSTS_SHIFT     (11U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_PKTDRPSTS_MASK      (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_PKTDRPSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_BERR_SHIFT          (12U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_BERR_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_BERR_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_NAK_SHIFT           (13U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_NAK_MASK            (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DIEPINT7_BIT_NAK_SHIFT)

