minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_DOEPCTL5 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_MPSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_USBAEP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_NAKSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPTYP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SNPM_SHIFT          (20U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SNPM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SNPM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_STALL_SHIFT         (21U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_STALL_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_CNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_SODDFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL5_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DOEPINT5 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_XFRC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_EPDISD_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_STUP_SHIFT          (3U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_STUP_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_STUP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_OTEPDIS_SHIFT       (4U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_OTEPDIS_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_OTEPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_B2BSTUP_SHIFT       (6U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_B2BSTUP_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_B2BSTUP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_NYET_SHIFT          (14U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_NYET_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT5_BIT_NYET_SHIFT)

/*--- register OTG_HS_DOEPTSIZ5 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_XFRSIZ_SHIFT       (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_XFRSIZ_MASK        (((1U<<19)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_XFRSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_PKTCNT_SHIFT       (19U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_PKTCNT_MASK        (((1U<<10)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_PKTCNT_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_RXDPID_STUPCNT_SHIFT (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_RXDPID_STUPCNT_MASK (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ5_BIT_RXDPID_STUPCNT_SHIFT)

/*--- register OTG_HS_DOEPCTL6 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_MPSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_USBAEP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_NAKSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPTYP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SNPM_SHIFT          (20U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SNPM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SNPM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_STALL_SHIFT         (21U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_STALL_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_CNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_SODDFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL6_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DOEPINT6 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_XFRC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_EPDISD_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_STUP_SHIFT          (3U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_STUP_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_STUP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_OTEPDIS_SHIFT       (4U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_OTEPDIS_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_OTEPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_B2BSTUP_SHIFT       (6U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_B2BSTUP_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_B2BSTUP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_NYET_SHIFT          (14U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_NYET_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT6_BIT_NYET_SHIFT)

/*--- register OTG_HS_DOEPTSIZ6 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_XFRSIZ_SHIFT       (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_XFRSIZ_MASK        (((1U<<19)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_XFRSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_PKTCNT_SHIFT       (19U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_PKTCNT_MASK        (((1U<<10)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_PKTCNT_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_RXDPID_STUPCNT_SHIFT (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_RXDPID_STUPCNT_MASK (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPTSIZ6_BIT_RXDPID_STUPCNT_SHIFT)

/*--- register OTG_HS_DOEPCTL7 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_MPSIZ_SHIFT         (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_MPSIZ_MASK          (((1U<<11)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_MPSIZ_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_USBAEP_SHIFT        (15U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_USBAEP_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_USBAEP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EONUM_DPID_SHIFT    (16U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EONUM_DPID_MASK     (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EONUM_DPID_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_NAKSTS_SHIFT        (17U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_NAKSTS_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_NAKSTS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPTYP_SHIFT         (18U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPTYP_MASK          (((1U<<2)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPTYP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SNPM_SHIFT          (20U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SNPM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SNPM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_STALL_SHIFT         (21U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_STALL_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_STALL_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_CNAK_SHIFT          (26U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_CNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_CNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SNAK_SHIFT          (27U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SNAK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SNAK_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SD0PID_SEVNFRM_SHIFT (28U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SD0PID_SEVNFRM_MASK (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SD0PID_SEVNFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SODDFRM_SHIFT       (29U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SODDFRM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_SODDFRM_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPDIS_SHIFT         (30U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPDIS_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPENA_SHIFT         (31U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPENA_MASK          (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPCTL7_BIT_EPENA_SHIFT)

/*--- register OTG_HS_DOEPINT7 -------------------------------------------------*/
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_XFRC_SHIFT          (0U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_XFRC_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_XFRC_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_EPDISD_SHIFT        (1U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_EPDISD_MASK         (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_EPDISD_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_STUP_SHIFT          (3U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_STUP_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_STUP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_OTEPDIS_SHIFT       (4U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_OTEPDIS_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_OTEPDIS_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_B2BSTUP_SHIFT       (6U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_B2BSTUP_MASK        (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_B2BSTUP_SHIFT)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_NYET_SHIFT          (14U)
#define PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_NYET_MASK           (((1U<<1)-1) << PERI_OTG2_HS_DEVICE_OTG_HS_DOEPINT7_BIT_NYET_SHIFT)

