minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_GINTMSK -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_MMISM_SHIFT          (1U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_MMISM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_MMISM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_OTGINT_SHIFT         (2U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_OTGINT_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_OTGINT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_SOFM_SHIFT           (3U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_SOFM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_SOFM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_RXFLVLM_SHIFT        (4U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_RXFLVLM_MASK         (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_RXFLVLM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_NPTXFEM_SHIFT        (5U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_NPTXFEM_MASK         (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_NPTXFEM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_GINAKEFFM_SHIFT      (6U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_GINAKEFFM_MASK       (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_GINAKEFFM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_GONAKEFFM_SHIFT      (7U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_GONAKEFFM_MASK       (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_GONAKEFFM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ESUSPM_SHIFT         (10U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ESUSPM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ESUSPM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_USBSUSPM_SHIFT       (11U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_USBSUSPM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_USBSUSPM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_USBRST_SHIFT         (12U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_USBRST_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_USBRST_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ENUMDNEM_SHIFT       (13U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ENUMDNEM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ENUMDNEM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ISOODRPM_SHIFT       (14U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ISOODRPM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_ISOODRPM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_EOPFM_SHIFT          (15U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_EOPFM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_EOPFM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_IEPINT_SHIFT         (18U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_IEPINT_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_IEPINT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_OEPINT_SHIFT         (19U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_OEPINT_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_OEPINT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_IISOIXFRM_SHIFT      (20U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_IISOIXFRM_MASK       (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_IISOIXFRM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PXFRM_IISOOXFRM_SHIFT (21U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PXFRM_IISOOXFRM_MASK (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PXFRM_IISOOXFRM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_FSUSPM_SHIFT         (22U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_FSUSPM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_FSUSPM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_RSTDE_SHIFT          (23U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_RSTDE_MASK           (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_RSTDE_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PRTIM_SHIFT          (24U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PRTIM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PRTIM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_HCIM_SHIFT           (25U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_HCIM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_HCIM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PTXFEM_SHIFT         (26U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PTXFEM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_PTXFEM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_LPMINTM_SHIFT        (27U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_LPMINTM_MASK         (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_LPMINTM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_CIDSCHGM_SHIFT       (28U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_CIDSCHGM_MASK        (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_CIDSCHGM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_DISCINT_SHIFT        (29U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_DISCINT_MASK         (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_DISCINT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_SRQIM_SHIFT          (30U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_SRQIM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_SRQIM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_WUIM_SHIFT           (31U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_WUIM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GINTMSK_BIT_WUIM_SHIFT)

/*--- register OTG_HS_GRXSTSR_Host -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_CHNUM_SHIFT     (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_CHNUM_MASK      (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_CHNUM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_BCNT_SHIFT      (4U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_BCNT_MASK       (((1U<<11)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_BCNT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_DPID_SHIFT      (15U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_DPID_MASK       (((1U<<2)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_DPID_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_PKTSTS_SHIFT    (17U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_PKTSTS_MASK     (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_HOST_BIT_PKTSTS_SHIFT)

