minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_GRXSTSR_Device -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_EPNUM_SHIFT   (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_EPNUM_MASK    (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_EPNUM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_BCNT_SHIFT    (4U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_BCNT_MASK     (((1U<<11)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_BCNT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_DPID_SHIFT    (15U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_DPID_MASK     (((1U<<2)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_DPID_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_PKTSTS_SHIFT  (17U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_PKTSTS_MASK   (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_PKTSTS_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_FRMNUM_SHIFT  (21U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_FRMNUM_MASK   (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSR_DEVICE_BIT_FRMNUM_SHIFT)

/*--- register OTG_HS_GRXSTSP_Host -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_CHNUM_SHIFT     (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_CHNUM_MASK      (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_CHNUM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_BCNT_SHIFT      (4U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_BCNT_MASK       (((1U<<11)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_BCNT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_DPID_SHIFT      (15U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_DPID_MASK       (((1U<<2)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_DPID_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_PKTSTS_SHIFT    (17U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_PKTSTS_MASK     (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_HOST_BIT_PKTSTS_SHIFT)

/*--- register OTG_HS_GRXSTSP_Device -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_EPNUM_SHIFT   (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_EPNUM_MASK    (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_EPNUM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_BCNT_SHIFT    (4U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_BCNT_MASK     (((1U<<11)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_BCNT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_DPID_SHIFT    (15U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_DPID_MASK     (((1U<<2)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_DPID_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_PKTSTS_SHIFT  (17U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_PKTSTS_MASK   (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_PKTSTS_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_FRMNUM_SHIFT  (21U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_FRMNUM_MASK   (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXSTSP_DEVICE_BIT_FRMNUM_SHIFT)

/*--- register OTG_HS_GRXFSIZ -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXFSIZ_BIT_RXFD_SHIFT           (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GRXFSIZ_BIT_RXFD_MASK            (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GRXFSIZ_BIT_RXFD_SHIFT)

/*--- register OTG_HS_HNPTXFSIZ_Host -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_HOST_BIT_NPTXFSA_SHIFT (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_HOST_BIT_NPTXFSA_MASK  (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_HOST_BIT_NPTXFSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_HOST_BIT_NPTXFD_SHIFT  (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_HOST_BIT_NPTXFD_MASK   (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_HNPTXFSIZ_HOST_BIT_NPTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF0_Device -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_DEVICE_BIT_TX0FSA_SHIFT (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_DEVICE_BIT_TX0FSA_MASK  (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_DEVICE_BIT_TX0FSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_DEVICE_BIT_TX0FD_SHIFT  (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_DEVICE_BIT_TX0FD_MASK   (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF0_DEVICE_BIT_TX0FD_SHIFT)

/*--- register OTG_HS_GNPTXSTS -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTXFSAV_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTXFSAV_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTXFSAV_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTQXSAV_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTQXSAV_MASK       (((1U<<8)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTQXSAV_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTXQTOP_SHIFT      (24U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTXQTOP_MASK       (((1U<<7)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GNPTXSTS_BIT_NPTXQTOP_SHIFT)

/*--- register OTG_HS_GCCFG -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_DCDET_SHIFT            (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_DCDET_MASK             (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_DCDET_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PDET_SHIFT             (1U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PDET_MASK              (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PDET_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_SDET_SHIFT             (2U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_SDET_MASK              (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_SDET_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PS2DET_SHIFT           (3U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PS2DET_MASK            (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PS2DET_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PWRDWN_SHIFT           (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PWRDWN_MASK            (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PWRDWN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_BCDEN_SHIFT            (17U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_BCDEN_MASK             (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_BCDEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_DCDEN_SHIFT            (18U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_DCDEN_MASK             (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_DCDEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PDEN_SHIFT             (19U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PDEN_MASK              (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_PDEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_SDEN_SHIFT             (20U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_SDEN_MASK              (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_SDEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_VBDEN_SHIFT            (21U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_VBDEN_MASK             (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GCCFG_BIT_VBDEN_SHIFT)

/*--- register OTG_HS_CID -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_CID_BIT_PRODUCT_ID_SHIFT         (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_CID_BIT_PRODUCT_ID_MASK          (((1U<<32)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_CID_BIT_PRODUCT_ID_SHIFT)

