minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_GLPMCFG -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMEN_SHIFT          (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMEN_MASK           (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMACK_SHIFT         (1U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMACK_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMACK_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_BESL_SHIFT           (2U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_BESL_MASK            (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_BESL_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_REMWAKE_SHIFT        (6U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_REMWAKE_MASK         (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_REMWAKE_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1SSEN_SHIFT         (7U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1SSEN_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1SSEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_BESLTHRS_SHIFT       (8U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_BESLTHRS_MASK        (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_BESLTHRS_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1DSEN_SHIFT         (12U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1DSEN_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1DSEN_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRST_SHIFT         (13U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRST_MASK          (((1U<<2)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRST_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_SLPSTS_SHIFT         (15U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_SLPSTS_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_SLPSTS_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1RSMOK_SHIFT        (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1RSMOK_MASK         (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_L1RSMOK_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMCHIDX_SHIFT       (17U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMCHIDX_MASK        (((1U<<4)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMCHIDX_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRCNT_SHIFT        (21U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRCNT_MASK         (((1U<<3)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRCNT_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_SNDLPM_SHIFT         (24U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_SNDLPM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_SNDLPM_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRCNTSTS_SHIFT     (25U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRCNTSTS_MASK      (((1U<<3)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_LPMRCNTSTS_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_ENBESL_SHIFT         (28U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_ENBESL_MASK          (((1U<<1)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BIT_ENBESL_SHIFT)

/*--- register OTG_HS_HPTXFSIZ -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_BIT_PTXSA_SHIFT         (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_BIT_PTXSA_MASK          (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_BIT_PTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_BIT_PTXFD_SHIFT         (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_BIT_PTXFD_MASK          (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_BIT_PTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF1 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_BIT_INEPTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF2 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_BIT_INEPTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF3 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_BIT_INEPTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF4 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_BIT_INEPTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF5 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF5_BIT_INEPTXFD_SHIFT)

/*--- register OTG_HS_DIEPTXF6 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF6_BIT_INEPTXFD_SHIFT)

