minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_DIEPTXF7 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_BIT_INEPTXSA_SHIFT      (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_BIT_INEPTXSA_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_BIT_INEPTXFD_SHIFT      (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_BIT_INEPTXFD_MASK       (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_HS_DIEPTXF7_BIT_INEPTXFD_SHIFT)

/*--- register OTG_DIEPTXF8 -------------------------------------------------*/
#define PERI_OTG2_HS_GLOBAL_OTG_DIEPTXF8_BIT_INEPTXSA_SHIFT         (0U)
#define PERI_OTG2_HS_GLOBAL_OTG_DIEPTXF8_BIT_INEPTXSA_MASK          (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_DIEPTXF8_BIT_INEPTXSA_SHIFT)
#define PERI_OTG2_HS_GLOBAL_OTG_DIEPTXF8_BIT_INEPTXFD_SHIFT         (16U)
#define PERI_OTG2_HS_GLOBAL_OTG_DIEPTXF8_BIT_INEPTXFD_MASK          (((1U<<16)-1) << PERI_OTG2_HS_GLOBAL_OTG_DIEPTXF8_BIT_INEPTXFD_SHIFT)

/*--- register OTG_HS_HCFG -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCFG_BIT_FSLSPCS_SHIFT             (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCFG_BIT_FSLSPCS_MASK              (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCFG_BIT_FSLSPCS_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCFG_BIT_FSLSS_SHIFT               (2U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCFG_BIT_FSLSS_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCFG_BIT_FSLSS_SHIFT)

/*--- register OTG_HS_HFIR -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HFIR_BIT_FRIVL_SHIFT               (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HFIR_BIT_FRIVL_MASK                (((1U<<16)-1) << PERI_OTG2_HS_HOST_OTG_HS_HFIR_BIT_FRIVL_SHIFT)

/*--- register OTG_HS_HFNUM -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HFNUM_BIT_FRNUM_SHIFT              (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HFNUM_BIT_FRNUM_MASK               (((1U<<16)-1) << PERI_OTG2_HS_HOST_OTG_HS_HFNUM_BIT_FRNUM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HFNUM_BIT_FTREM_SHIFT              (16U)
#define PERI_OTG2_HS_HOST_OTG_HS_HFNUM_BIT_FTREM_MASK               (((1U<<16)-1) << PERI_OTG2_HS_HOST_OTG_HS_HFNUM_BIT_FTREM_SHIFT)

/*--- register OTG_HS_HPTXSTS -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXFSAVL_SHIFT         (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXFSAVL_MASK          (((1U<<16)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXFSAVL_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXQSAV_SHIFT          (16U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXQSAV_MASK           (((1U<<8)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXQSAV_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXQTOP_SHIFT          (24U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXQTOP_MASK           (((1U<<8)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPTXSTS_BIT_PTXQTOP_SHIFT)

/*--- register OTG_HS_HAINT -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HAINT_BIT_HAINT_SHIFT              (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HAINT_BIT_HAINT_MASK               (((1U<<16)-1) << PERI_OTG2_HS_HOST_OTG_HS_HAINT_BIT_HAINT_SHIFT)

/*--- register OTG_HS_HAINTMSK -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HAINTMSK_BIT_HAINTM_SHIFT          (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HAINTMSK_BIT_HAINTM_MASK           (((1U<<16)-1) << PERI_OTG2_HS_HOST_OTG_HS_HAINTMSK_BIT_HAINTM_SHIFT)

/*--- register OTG_HS_HPRT -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PCSTS_SHIFT               (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PCSTS_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PCSTS_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PCDET_SHIFT               (1U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PCDET_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PCDET_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PENA_SHIFT                (2U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PENA_MASK                 (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PENA_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PENCHNG_SHIFT             (3U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PENCHNG_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PENCHNG_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_POCA_SHIFT                (4U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_POCA_MASK                 (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_POCA_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_POCCHNG_SHIFT             (5U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_POCCHNG_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_POCCHNG_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PRES_SHIFT                (6U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PRES_MASK                 (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PRES_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PSUSP_SHIFT               (7U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PSUSP_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PSUSP_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PRST_SHIFT                (8U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PRST_MASK                 (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PRST_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PLSTS_SHIFT               (10U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PLSTS_MASK                (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PLSTS_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PPWR_SHIFT                (12U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PPWR_MASK                 (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PPWR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PTCTL_SHIFT               (13U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PTCTL_MASK                (((1U<<4)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PTCTL_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PSPD_SHIFT                (17U)
#define PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PSPD_MASK                 (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HPRT_BIT_PSPD_SHIFT)

/*--- register OTG_HS_HCCHAR0 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_MPSIZ_SHIFT            (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_MPSIZ_MASK             (((1U<<11)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_MPSIZ_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPNUM_SHIFT            (11U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPNUM_MASK             (((1U<<4)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPNUM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPDIR_SHIFT            (15U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPDIR_MASK             (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPDIR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_LSDEV_SHIFT            (17U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_LSDEV_MASK             (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_LSDEV_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPTYP_SHIFT            (18U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPTYP_MASK             (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_EPTYP_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_MC_SHIFT               (20U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_MC_MASK                (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_MC_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_DAD_SHIFT              (22U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_DAD_MASK               (((1U<<7)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_DAD_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_ODDFRM_SHIFT           (29U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_ODDFRM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_ODDFRM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_CHDIS_SHIFT            (30U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_CHDIS_MASK             (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_CHDIS_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_CHENA_SHIFT            (31U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_CHENA_MASK             (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCCHAR0_BIT_CHENA_SHIFT)

