minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_HCSPLT0 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_PRTADDR_SHIFT          (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_PRTADDR_MASK           (((1U<<7)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_PRTADDR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_HUBADDR_SHIFT          (7U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_HUBADDR_MASK           (((1U<<7)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_HUBADDR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_XACTPOS_SHIFT          (14U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_XACTPOS_MASK           (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_XACTPOS_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_COMPLSPLT_SHIFT        (16U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_COMPLSPLT_MASK         (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_COMPLSPLT_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_SPLITEN_SHIFT          (31U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_SPLITEN_MASK           (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCSPLT0_BIT_SPLITEN_SHIFT)

/*--- register OTG_HS_HCINT0 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_XFRC_SHIFT              (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_XFRC_MASK               (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_XFRC_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_CHH_SHIFT               (1U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_CHH_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_CHH_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_AHBERR_SHIFT            (2U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_AHBERR_MASK             (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_AHBERR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_STALL_SHIFT             (3U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_STALL_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_STALL_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_NAK_SHIFT               (4U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_NAK_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_NAK_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_ACK_SHIFT               (5U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_ACK_MASK                (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_ACK_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_NYET_SHIFT              (6U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_NYET_MASK               (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_NYET_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_TXERR_SHIFT             (7U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_TXERR_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_TXERR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_BBERR_SHIFT             (8U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_BBERR_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_BBERR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_FRMOR_SHIFT             (9U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_FRMOR_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_FRMOR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_DTERR_SHIFT             (10U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_DTERR_MASK              (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINT0_BIT_DTERR_SHIFT)

/*--- register OTG_HS_HCINTMSK0 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_XFRCM_SHIFT          (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_XFRCM_MASK           (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_XFRCM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_CHHM_SHIFT           (1U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_CHHM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_CHHM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_AHBERR_SHIFT         (2U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_AHBERR_MASK          (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_AHBERR_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_STALLM_SHIFT         (3U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_STALLM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_STALLM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_NAKM_SHIFT           (4U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_NAKM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_NAKM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_ACKM_SHIFT           (5U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_ACKM_MASK            (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_ACKM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_NYET_SHIFT           (6U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_NYET_MASK            (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_NYET_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_TXERRM_SHIFT         (7U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_TXERRM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_TXERRM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_BBERRM_SHIFT         (8U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_BBERRM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_BBERRM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_FRMORM_SHIFT         (9U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_FRMORM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_FRMORM_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_DTERRM_SHIFT         (10U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_DTERRM_MASK          (((1U<<1)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCINTMSK0_BIT_DTERRM_SHIFT)

/*--- register OTG_HS_HCTSIZ0 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_XFRSIZ_SHIFT           (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_XFRSIZ_MASK            (((1U<<19)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_XFRSIZ_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_PKTCNT_SHIFT           (19U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_PKTCNT_MASK            (((1U<<10)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_PKTCNT_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_DPID_SHIFT             (29U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_DPID_MASK              (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ0_BIT_DPID_SHIFT)

/*--- register OTG_HS_HCDMA0 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCDMA0_BIT_DMAADDR_SHIFT           (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCDMA0_BIT_DMAADDR_MASK            (((1U<<32)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCDMA0_BIT_DMAADDR_SHIFT)

