minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OTG_HS_HCTSIZ15 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_XFRSIZ_SHIFT          (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_XFRSIZ_MASK           (((1U<<19)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_XFRSIZ_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_PKTCNT_SHIFT          (19U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_PKTCNT_MASK           (((1U<<10)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_PKTCNT_SHIFT)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_DPID_SHIFT            (29U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_DPID_MASK             (((1U<<2)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCTSIZ15_BIT_DPID_SHIFT)

/*--- register OTG_HS_HCDMA15 -------------------------------------------------*/
#define PERI_OTG2_HS_HOST_OTG_HS_HCDMA15_BIT_DMAADDR_SHIFT          (0U)
#define PERI_OTG2_HS_HOST_OTG_HS_HCDMA15_BIT_DMAADDR_MASK           (((1U<<32)-1) << PERI_OTG2_HS_HOST_OTG_HS_HCDMA15_BIT_DMAADDR_SHIFT)

/*--- register OTG_HS_PCGCR -------------------------------------------------*/
#define PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_STPPCLK_SHIFT          (0U)
#define PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_STPPCLK_MASK           (((1U<<1)-1) << PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_STPPCLK_SHIFT)
#define PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_GATEHCLK_SHIFT         (1U)
#define PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_GATEHCLK_MASK          (((1U<<1)-1) << PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_GATEHCLK_SHIFT)
#define PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_PHYSUSP_SHIFT          (4U)
#define PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_PHYSUSP_MASK           (((1U<<1)-1) << PERI_OTG2_HS_PWRCLK_OTG_HS_PCGCR_BIT_PHYSUSP_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_PWR_CR1_BIT_LPDS_SHIFT                                 (0U)
#define PERI_PWR_CR1_BIT_LPDS_MASK                                  (((1U<<1)-1) << PERI_PWR_CR1_BIT_LPDS_SHIFT)
#define PERI_PWR_CR1_BIT_PVDE_SHIFT                                 (4U)
#define PERI_PWR_CR1_BIT_PVDE_MASK                                  (((1U<<1)-1) << PERI_PWR_CR1_BIT_PVDE_SHIFT)
#define PERI_PWR_CR1_BIT_PLS_SHIFT                                  (5U)
#define PERI_PWR_CR1_BIT_PLS_MASK                                   (((1U<<3)-1) << PERI_PWR_CR1_BIT_PLS_SHIFT)
#define PERI_PWR_CR1_BIT_DBP_SHIFT                                  (8U)
#define PERI_PWR_CR1_BIT_DBP_MASK                                   (((1U<<1)-1) << PERI_PWR_CR1_BIT_DBP_SHIFT)
#define PERI_PWR_CR1_BIT_FLPS_SHIFT                                 (9U)
#define PERI_PWR_CR1_BIT_FLPS_MASK                                  (((1U<<1)-1) << PERI_PWR_CR1_BIT_FLPS_SHIFT)
#define PERI_PWR_CR1_BIT_SVOS_SHIFT                                 (14U)
#define PERI_PWR_CR1_BIT_SVOS_MASK                                  (((1U<<2)-1) << PERI_PWR_CR1_BIT_SVOS_SHIFT)
#define PERI_PWR_CR1_BIT_AVDEN_SHIFT                                (16U)
#define PERI_PWR_CR1_BIT_AVDEN_MASK                                 (((1U<<1)-1) << PERI_PWR_CR1_BIT_AVDEN_SHIFT)
#define PERI_PWR_CR1_BIT_ALS_SHIFT                                  (17U)
#define PERI_PWR_CR1_BIT_ALS_MASK                                   (((1U<<2)-1) << PERI_PWR_CR1_BIT_ALS_SHIFT)

/*--- register CSR1 -------------------------------------------------*/
#define PERI_PWR_CSR1_BIT_PVDO_SHIFT                                (4U)
#define PERI_PWR_CSR1_BIT_PVDO_MASK                                 (((1U<<1)-1) << PERI_PWR_CSR1_BIT_PVDO_SHIFT)
#define PERI_PWR_CSR1_BIT_ACTVOSRDY_SHIFT                           (13U)
#define PERI_PWR_CSR1_BIT_ACTVOSRDY_MASK                            (((1U<<1)-1) << PERI_PWR_CSR1_BIT_ACTVOSRDY_SHIFT)
#define PERI_PWR_CSR1_BIT_ACTVOS_SHIFT                              (14U)
#define PERI_PWR_CSR1_BIT_ACTVOS_MASK                               (((1U<<2)-1) << PERI_PWR_CSR1_BIT_ACTVOS_SHIFT)
#define PERI_PWR_CSR1_BIT_AVDO_SHIFT                                (16U)
#define PERI_PWR_CSR1_BIT_AVDO_MASK                                 (((1U<<1)-1) << PERI_PWR_CSR1_BIT_AVDO_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_PWR_CR2_BIT_BREN_SHIFT                                 (0U)
#define PERI_PWR_CR2_BIT_BREN_MASK                                  (((1U<<1)-1) << PERI_PWR_CR2_BIT_BREN_SHIFT)
#define PERI_PWR_CR2_BIT_MONEN_SHIFT                                (4U)
#define PERI_PWR_CR2_BIT_MONEN_MASK                                 (((1U<<1)-1) << PERI_PWR_CR2_BIT_MONEN_SHIFT)
#define PERI_PWR_CR2_BIT_BRRDY_SHIFT                                (16U)
#define PERI_PWR_CR2_BIT_BRRDY_MASK                                 (((1U<<1)-1) << PERI_PWR_CR2_BIT_BRRDY_SHIFT)
#define PERI_PWR_CR2_BIT_VBATL_SHIFT                                (20U)
#define PERI_PWR_CR2_BIT_VBATL_MASK                                 (((1U<<1)-1) << PERI_PWR_CR2_BIT_VBATL_SHIFT)
#define PERI_PWR_CR2_BIT_VBATH_SHIFT                                (21U)
#define PERI_PWR_CR2_BIT_VBATH_MASK                                 (((1U<<1)-1) << PERI_PWR_CR2_BIT_VBATH_SHIFT)
#define PERI_PWR_CR2_BIT_TEMPL_SHIFT                                (22U)
#define PERI_PWR_CR2_BIT_TEMPL_MASK                                 (((1U<<1)-1) << PERI_PWR_CR2_BIT_TEMPL_SHIFT)
#define PERI_PWR_CR2_BIT_TEMPH_SHIFT                                (23U)
#define PERI_PWR_CR2_BIT_TEMPH_MASK                                 (((1U<<1)-1) << PERI_PWR_CR2_BIT_TEMPH_SHIFT)

/*--- register CR3 -------------------------------------------------*/
#define PERI_PWR_CR3_BIT_BYPASS_SHIFT                               (0U)
#define PERI_PWR_CR3_BIT_BYPASS_MASK                                (((1U<<1)-1) << PERI_PWR_CR3_BIT_BYPASS_SHIFT)
#define PERI_PWR_CR3_BIT_LDOEN_SHIFT                                (1U)
#define PERI_PWR_CR3_BIT_LDOEN_MASK                                 (((1U<<1)-1) << PERI_PWR_CR3_BIT_LDOEN_SHIFT)
#define PERI_PWR_CR3_BIT_SCUEN_SHIFT                                (2U)
#define PERI_PWR_CR3_BIT_SCUEN_MASK                                 (((1U<<1)-1) << PERI_PWR_CR3_BIT_SCUEN_SHIFT)
#define PERI_PWR_CR3_BIT_VBE_SHIFT                                  (8U)
#define PERI_PWR_CR3_BIT_VBE_MASK                                   (((1U<<1)-1) << PERI_PWR_CR3_BIT_VBE_SHIFT)
#define PERI_PWR_CR3_BIT_VBRS_SHIFT                                 (9U)
#define PERI_PWR_CR3_BIT_VBRS_MASK                                  (((1U<<1)-1) << PERI_PWR_CR3_BIT_VBRS_SHIFT)
#define PERI_PWR_CR3_BIT_USB33DEN_SHIFT                             (24U)
#define PERI_PWR_CR3_BIT_USB33DEN_MASK                              (((1U<<1)-1) << PERI_PWR_CR3_BIT_USB33DEN_SHIFT)
#define PERI_PWR_CR3_BIT_USBREGEN_SHIFT                             (25U)
#define PERI_PWR_CR3_BIT_USBREGEN_MASK                              (((1U<<1)-1) << PERI_PWR_CR3_BIT_USBREGEN_SHIFT)
#define PERI_PWR_CR3_BIT_USB33RDY_SHIFT                             (26U)
#define PERI_PWR_CR3_BIT_USB33RDY_MASK                              (((1U<<1)-1) << PERI_PWR_CR3_BIT_USB33RDY_SHIFT)

/*--- register CPUCR -------------------------------------------------*/
#define PERI_PWR_CPUCR_BIT_PDDS_D1_SHIFT                            (0U)
#define PERI_PWR_CPUCR_BIT_PDDS_D1_MASK                             (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_PDDS_D1_SHIFT)
#define PERI_PWR_CPUCR_BIT_PDDS_D2_SHIFT                            (1U)
#define PERI_PWR_CPUCR_BIT_PDDS_D2_MASK                             (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_PDDS_D2_SHIFT)
#define PERI_PWR_CPUCR_BIT_PDDS_D3_SHIFT                            (2U)
#define PERI_PWR_CPUCR_BIT_PDDS_D3_MASK                             (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_PDDS_D3_SHIFT)
#define PERI_PWR_CPUCR_BIT_STOPF_SHIFT                              (5U)
#define PERI_PWR_CPUCR_BIT_STOPF_MASK                               (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_STOPF_SHIFT)
#define PERI_PWR_CPUCR_BIT_SBF_SHIFT                                (6U)
#define PERI_PWR_CPUCR_BIT_SBF_MASK                                 (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_SBF_SHIFT)
#define PERI_PWR_CPUCR_BIT_SBF_D1_SHIFT                             (7U)
#define PERI_PWR_CPUCR_BIT_SBF_D1_MASK                              (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_SBF_D1_SHIFT)
#define PERI_PWR_CPUCR_BIT_SBF_D2_SHIFT                             (8U)
#define PERI_PWR_CPUCR_BIT_SBF_D2_MASK                              (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_SBF_D2_SHIFT)
#define PERI_PWR_CPUCR_BIT_CSSF_SHIFT                               (9U)
#define PERI_PWR_CPUCR_BIT_CSSF_MASK                                (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_CSSF_SHIFT)
#define PERI_PWR_CPUCR_BIT_RUN_D3_SHIFT                             (11U)
#define PERI_PWR_CPUCR_BIT_RUN_D3_MASK                              (((1U<<1)-1) << PERI_PWR_CPUCR_BIT_RUN_D3_SHIFT)

/*--- register D3CR -------------------------------------------------*/
#define PERI_PWR_D3CR_BIT_VOSRDY_SHIFT                              (13U)
#define PERI_PWR_D3CR_BIT_VOSRDY_MASK                               (((1U<<1)-1) << PERI_PWR_D3CR_BIT_VOSRDY_SHIFT)
#define PERI_PWR_D3CR_BIT_VOS_SHIFT                                 (14U)
#define PERI_PWR_D3CR_BIT_VOS_MASK                                  (((1U<<2)-1) << PERI_PWR_D3CR_BIT_VOS_SHIFT)

