minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register WKUPCR -------------------------------------------------*/
#define PERI_PWR_WKUPCR_BIT_WKUPC_SHIFT                             (0U)
#define PERI_PWR_WKUPCR_BIT_WKUPC_MASK                              (((1U<<6)-1) << PERI_PWR_WKUPCR_BIT_WKUPC_SHIFT)

/*--- register WKUPFR -------------------------------------------------*/
#define PERI_PWR_WKUPFR_BIT_WKUPF1_SHIFT                            (0U)
#define PERI_PWR_WKUPFR_BIT_WKUPF1_MASK                             (((1U<<1)-1) << PERI_PWR_WKUPFR_BIT_WKUPF1_SHIFT)
#define PERI_PWR_WKUPFR_BIT_WKUPF2_SHIFT                            (1U)
#define PERI_PWR_WKUPFR_BIT_WKUPF2_MASK                             (((1U<<1)-1) << PERI_PWR_WKUPFR_BIT_WKUPF2_SHIFT)
#define PERI_PWR_WKUPFR_BIT_WKUPF3_SHIFT                            (2U)
#define PERI_PWR_WKUPFR_BIT_WKUPF3_MASK                             (((1U<<1)-1) << PERI_PWR_WKUPFR_BIT_WKUPF3_SHIFT)
#define PERI_PWR_WKUPFR_BIT_WKUPF4_SHIFT                            (3U)
#define PERI_PWR_WKUPFR_BIT_WKUPF4_MASK                             (((1U<<1)-1) << PERI_PWR_WKUPFR_BIT_WKUPF4_SHIFT)
#define PERI_PWR_WKUPFR_BIT_WKUPF5_SHIFT                            (4U)
#define PERI_PWR_WKUPFR_BIT_WKUPF5_MASK                             (((1U<<1)-1) << PERI_PWR_WKUPFR_BIT_WKUPF5_SHIFT)
#define PERI_PWR_WKUPFR_BIT_WKUPF6_SHIFT                            (5U)
#define PERI_PWR_WKUPFR_BIT_WKUPF6_MASK                             (((1U<<1)-1) << PERI_PWR_WKUPFR_BIT_WKUPF6_SHIFT)

/*--- register WKUPEPR -------------------------------------------------*/
#define PERI_PWR_WKUPEPR_BIT_WKUPEN1_SHIFT                          (0U)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN1_MASK                           (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPEN1_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN2_SHIFT                          (1U)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN2_MASK                           (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPEN2_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN3_SHIFT                          (2U)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN3_MASK                           (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPEN3_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN4_SHIFT                          (3U)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN4_MASK                           (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPEN4_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN5_SHIFT                          (4U)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN5_MASK                           (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPEN5_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN6_SHIFT                          (5U)
#define PERI_PWR_WKUPEPR_BIT_WKUPEN6_MASK                           (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPEN6_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPP1_SHIFT                           (8U)
#define PERI_PWR_WKUPEPR_BIT_WKUPP1_MASK                            (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPP1_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPP2_SHIFT                           (9U)
#define PERI_PWR_WKUPEPR_BIT_WKUPP2_MASK                            (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPP2_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPP3_SHIFT                           (10U)
#define PERI_PWR_WKUPEPR_BIT_WKUPP3_MASK                            (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPP3_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPP4_SHIFT                           (11U)
#define PERI_PWR_WKUPEPR_BIT_WKUPP4_MASK                            (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPP4_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPP5_SHIFT                           (12U)
#define PERI_PWR_WKUPEPR_BIT_WKUPP5_MASK                            (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPP5_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPP6_SHIFT                           (13U)
#define PERI_PWR_WKUPEPR_BIT_WKUPP6_MASK                            (((1U<<1)-1) << PERI_PWR_WKUPEPR_BIT_WKUPP6_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD1_SHIFT                        (16U)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD1_MASK                         (((1U<<2)-1) << PERI_PWR_WKUPEPR_BIT_WKUPPUPD1_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD2_SHIFT                        (18U)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD2_MASK                         (((1U<<2)-1) << PERI_PWR_WKUPEPR_BIT_WKUPPUPD2_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD3_SHIFT                        (20U)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD3_MASK                         (((1U<<2)-1) << PERI_PWR_WKUPEPR_BIT_WKUPPUPD3_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD4_SHIFT                        (22U)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD4_MASK                         (((1U<<2)-1) << PERI_PWR_WKUPEPR_BIT_WKUPPUPD4_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD5_SHIFT                        (24U)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD5_MASK                         (((1U<<2)-1) << PERI_PWR_WKUPEPR_BIT_WKUPPUPD5_SHIFT)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD6_SHIFT                        (26U)
#define PERI_PWR_WKUPEPR_BIT_WKUPPUPD6_MASK                         (((1U<<2)-1) << PERI_PWR_WKUPEPR_BIT_WKUPPUPD6_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_QUADSPI_CR_BIT_EN_SHIFT                                (0U)
#define PERI_QUADSPI_CR_BIT_EN_MASK                                 (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_EN_SHIFT)
#define PERI_QUADSPI_CR_BIT_ABORT_SHIFT                             (1U)
#define PERI_QUADSPI_CR_BIT_ABORT_MASK                              (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_ABORT_SHIFT)
#define PERI_QUADSPI_CR_BIT_DMAEN_SHIFT                             (2U)
#define PERI_QUADSPI_CR_BIT_DMAEN_MASK                              (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_DMAEN_SHIFT)
#define PERI_QUADSPI_CR_BIT_TCEN_SHIFT                              (3U)
#define PERI_QUADSPI_CR_BIT_TCEN_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_TCEN_SHIFT)
#define PERI_QUADSPI_CR_BIT_SSHIFT_SHIFT                            (4U)
#define PERI_QUADSPI_CR_BIT_SSHIFT_MASK                             (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_SSHIFT_SHIFT)
#define PERI_QUADSPI_CR_BIT_DFM_SHIFT                               (6U)
#define PERI_QUADSPI_CR_BIT_DFM_MASK                                (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_DFM_SHIFT)
#define PERI_QUADSPI_CR_BIT_FSEL_SHIFT                              (7U)
#define PERI_QUADSPI_CR_BIT_FSEL_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_FSEL_SHIFT)
#define PERI_QUADSPI_CR_BIT_FTHRES_SHIFT                            (8U)
#define PERI_QUADSPI_CR_BIT_FTHRES_MASK                             (((1U<<5)-1) << PERI_QUADSPI_CR_BIT_FTHRES_SHIFT)
#define PERI_QUADSPI_CR_BIT_TEIE_SHIFT                              (16U)
#define PERI_QUADSPI_CR_BIT_TEIE_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_TEIE_SHIFT)
#define PERI_QUADSPI_CR_BIT_TCIE_SHIFT                              (17U)
#define PERI_QUADSPI_CR_BIT_TCIE_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_TCIE_SHIFT)
#define PERI_QUADSPI_CR_BIT_FTIE_SHIFT                              (18U)
#define PERI_QUADSPI_CR_BIT_FTIE_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_FTIE_SHIFT)
#define PERI_QUADSPI_CR_BIT_SMIE_SHIFT                              (19U)
#define PERI_QUADSPI_CR_BIT_SMIE_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_SMIE_SHIFT)
#define PERI_QUADSPI_CR_BIT_TOIE_SHIFT                              (20U)
#define PERI_QUADSPI_CR_BIT_TOIE_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_TOIE_SHIFT)
#define PERI_QUADSPI_CR_BIT_APMS_SHIFT                              (22U)
#define PERI_QUADSPI_CR_BIT_APMS_MASK                               (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_APMS_SHIFT)
#define PERI_QUADSPI_CR_BIT_PMM_SHIFT                               (23U)
#define PERI_QUADSPI_CR_BIT_PMM_MASK                                (((1U<<1)-1) << PERI_QUADSPI_CR_BIT_PMM_SHIFT)
#define PERI_QUADSPI_CR_BIT_PRESCALER_SHIFT                         (24U)
#define PERI_QUADSPI_CR_BIT_PRESCALER_MASK                          (((1U<<8)-1) << PERI_QUADSPI_CR_BIT_PRESCALER_SHIFT)

/*--- register DCR -------------------------------------------------*/
#define PERI_QUADSPI_DCR_BIT_CKMODE_SHIFT                           (0U)
#define PERI_QUADSPI_DCR_BIT_CKMODE_MASK                            (((1U<<1)-1) << PERI_QUADSPI_DCR_BIT_CKMODE_SHIFT)
#define PERI_QUADSPI_DCR_BIT_CSHT_SHIFT                             (8U)
#define PERI_QUADSPI_DCR_BIT_CSHT_MASK                              (((1U<<3)-1) << PERI_QUADSPI_DCR_BIT_CSHT_SHIFT)
#define PERI_QUADSPI_DCR_BIT_FSIZE_SHIFT                            (16U)
#define PERI_QUADSPI_DCR_BIT_FSIZE_MASK                             (((1U<<5)-1) << PERI_QUADSPI_DCR_BIT_FSIZE_SHIFT)

