minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_QUADSPI_SR_BIT_TEF_SHIFT                               (0U)
#define PERI_QUADSPI_SR_BIT_TEF_MASK                                (((1U<<1)-1) << PERI_QUADSPI_SR_BIT_TEF_SHIFT)
#define PERI_QUADSPI_SR_BIT_TCF_SHIFT                               (1U)
#define PERI_QUADSPI_SR_BIT_TCF_MASK                                (((1U<<1)-1) << PERI_QUADSPI_SR_BIT_TCF_SHIFT)
#define PERI_QUADSPI_SR_BIT_FTF_SHIFT                               (2U)
#define PERI_QUADSPI_SR_BIT_FTF_MASK                                (((1U<<1)-1) << PERI_QUADSPI_SR_BIT_FTF_SHIFT)
#define PERI_QUADSPI_SR_BIT_SMF_SHIFT                               (3U)
#define PERI_QUADSPI_SR_BIT_SMF_MASK                                (((1U<<1)-1) << PERI_QUADSPI_SR_BIT_SMF_SHIFT)
#define PERI_QUADSPI_SR_BIT_TOF_SHIFT                               (4U)
#define PERI_QUADSPI_SR_BIT_TOF_MASK                                (((1U<<1)-1) << PERI_QUADSPI_SR_BIT_TOF_SHIFT)
#define PERI_QUADSPI_SR_BIT_BUSY_SHIFT                              (5U)
#define PERI_QUADSPI_SR_BIT_BUSY_MASK                               (((1U<<1)-1) << PERI_QUADSPI_SR_BIT_BUSY_SHIFT)
#define PERI_QUADSPI_SR_BIT_FLEVEL_SHIFT                            (8U)
#define PERI_QUADSPI_SR_BIT_FLEVEL_MASK                             (((1U<<6)-1) << PERI_QUADSPI_SR_BIT_FLEVEL_SHIFT)

/*--- register FCR -------------------------------------------------*/
#define PERI_QUADSPI_FCR_BIT_CTEF_SHIFT                             (0U)
#define PERI_QUADSPI_FCR_BIT_CTEF_MASK                              (((1U<<1)-1) << PERI_QUADSPI_FCR_BIT_CTEF_SHIFT)
#define PERI_QUADSPI_FCR_BIT_CTCF_SHIFT                             (1U)
#define PERI_QUADSPI_FCR_BIT_CTCF_MASK                              (((1U<<1)-1) << PERI_QUADSPI_FCR_BIT_CTCF_SHIFT)
#define PERI_QUADSPI_FCR_BIT_CSMF_SHIFT                             (3U)
#define PERI_QUADSPI_FCR_BIT_CSMF_MASK                              (((1U<<1)-1) << PERI_QUADSPI_FCR_BIT_CSMF_SHIFT)
#define PERI_QUADSPI_FCR_BIT_CTOF_SHIFT                             (4U)
#define PERI_QUADSPI_FCR_BIT_CTOF_MASK                              (((1U<<1)-1) << PERI_QUADSPI_FCR_BIT_CTOF_SHIFT)

/*--- register DLR -------------------------------------------------*/
#define PERI_QUADSPI_DLR_BIT_DL_SHIFT                               (0U)
#define PERI_QUADSPI_DLR_BIT_DL_MASK                                (((1U<<32)-1) << PERI_QUADSPI_DLR_BIT_DL_SHIFT)

/*--- register CCR -------------------------------------------------*/
#define PERI_QUADSPI_CCR_BIT_INSTRUCTION_SHIFT                      (0U)
#define PERI_QUADSPI_CCR_BIT_INSTRUCTION_MASK                       (((1U<<8)-1) << PERI_QUADSPI_CCR_BIT_INSTRUCTION_SHIFT)
#define PERI_QUADSPI_CCR_BIT_IMODE_SHIFT                            (8U)
#define PERI_QUADSPI_CCR_BIT_IMODE_MASK                             (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_IMODE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_ADMODE_SHIFT                           (10U)
#define PERI_QUADSPI_CCR_BIT_ADMODE_MASK                            (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_ADMODE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_ADSIZE_SHIFT                           (12U)
#define PERI_QUADSPI_CCR_BIT_ADSIZE_MASK                            (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_ADSIZE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_ABMODE_SHIFT                           (14U)
#define PERI_QUADSPI_CCR_BIT_ABMODE_MASK                            (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_ABMODE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_ABSIZE_SHIFT                           (16U)
#define PERI_QUADSPI_CCR_BIT_ABSIZE_MASK                            (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_ABSIZE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_DCYC_SHIFT                             (18U)
#define PERI_QUADSPI_CCR_BIT_DCYC_MASK                              (((1U<<5)-1) << PERI_QUADSPI_CCR_BIT_DCYC_SHIFT)
#define PERI_QUADSPI_CCR_BIT_DMODE_SHIFT                            (24U)
#define PERI_QUADSPI_CCR_BIT_DMODE_MASK                             (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_DMODE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_FMODE_SHIFT                            (26U)
#define PERI_QUADSPI_CCR_BIT_FMODE_MASK                             (((1U<<2)-1) << PERI_QUADSPI_CCR_BIT_FMODE_SHIFT)
#define PERI_QUADSPI_CCR_BIT_SIOO_SHIFT                             (28U)
#define PERI_QUADSPI_CCR_BIT_SIOO_MASK                              (((1U<<1)-1) << PERI_QUADSPI_CCR_BIT_SIOO_SHIFT)
#define PERI_QUADSPI_CCR_BIT_DHHC_SHIFT                             (30U)
#define PERI_QUADSPI_CCR_BIT_DHHC_MASK                              (((1U<<1)-1) << PERI_QUADSPI_CCR_BIT_DHHC_SHIFT)
#define PERI_QUADSPI_CCR_BIT_DDRM_SHIFT                             (31U)
#define PERI_QUADSPI_CCR_BIT_DDRM_MASK                              (((1U<<1)-1) << PERI_QUADSPI_CCR_BIT_DDRM_SHIFT)

/*--- register AR -------------------------------------------------*/
#define PERI_QUADSPI_AR_BIT_ADDRESS_SHIFT                           (0U)
#define PERI_QUADSPI_AR_BIT_ADDRESS_MASK                            (((1U<<32)-1) << PERI_QUADSPI_AR_BIT_ADDRESS_SHIFT)

/*--- register ABR -------------------------------------------------*/
#define PERI_QUADSPI_ABR_BIT_ALTERNATE_SHIFT                        (0U)
#define PERI_QUADSPI_ABR_BIT_ALTERNATE_MASK                         (((1U<<32)-1) << PERI_QUADSPI_ABR_BIT_ALTERNATE_SHIFT)

/*--- register DR -------------------------------------------------*/
#define PERI_QUADSPI_DR_BIT_DATA_SHIFT                              (0U)
#define PERI_QUADSPI_DR_BIT_DATA_MASK                               (((1U<<32)-1) << PERI_QUADSPI_DR_BIT_DATA_SHIFT)

/*--- register PSMKR -------------------------------------------------*/
#define PERI_QUADSPI_PSMKR_BIT_MASK_SHIFT                           (0U)
#define PERI_QUADSPI_PSMKR_BIT_MASK_MASK                            (((1U<<32)-1) << PERI_QUADSPI_PSMKR_BIT_MASK_SHIFT)

/*--- register PSMAR -------------------------------------------------*/
#define PERI_QUADSPI_PSMAR_BIT_MATCH_SHIFT                          (0U)
#define PERI_QUADSPI_PSMAR_BIT_MATCH_MASK                           (((1U<<32)-1) << PERI_QUADSPI_PSMAR_BIT_MATCH_SHIFT)

