minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register M1FDRH -------------------------------------------------*/
#define PERI_RAMECC2_M1FDRH_BIT_FDATAH_SHIFT                        (0U)
#define PERI_RAMECC2_M1FDRH_BIT_FDATAH_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M1FDRH_BIT_FDATAH_SHIFT)

/*--- register M1FECR -------------------------------------------------*/
#define PERI_RAMECC2_M1FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC2_M1FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M1FECR_BIT_FEC_SHIFT)

/*--- register M2CR -------------------------------------------------*/
#define PERI_RAMECC2_M2CR_BIT_ECCSEIE_SHIFT                         (2U)
#define PERI_RAMECC2_M2CR_BIT_ECCSEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M2CR_BIT_ECCSEIE_SHIFT)
#define PERI_RAMECC2_M2CR_BIT_ECCDEIE_SHIFT                         (3U)
#define PERI_RAMECC2_M2CR_BIT_ECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M2CR_BIT_ECCDEIE_SHIFT)
#define PERI_RAMECC2_M2CR_BIT_ECCDEBWIE_SHIFT                       (4U)
#define PERI_RAMECC2_M2CR_BIT_ECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC2_M2CR_BIT_ECCDEBWIE_SHIFT)
#define PERI_RAMECC2_M2CR_BIT_ECCELEN_SHIFT                         (5U)
#define PERI_RAMECC2_M2CR_BIT_ECCELEN_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M2CR_BIT_ECCELEN_SHIFT)

/*--- register M2SR -------------------------------------------------*/
#define PERI_RAMECC2_M2SR_BIT_SEDCF_SHIFT                           (0U)
#define PERI_RAMECC2_M2SR_BIT_SEDCF_MASK                            (((1U<<1)-1) << PERI_RAMECC2_M2SR_BIT_SEDCF_SHIFT)
#define PERI_RAMECC2_M2SR_BIT_DEDF_SHIFT                            (1U)
#define PERI_RAMECC2_M2SR_BIT_DEDF_MASK                             (((1U<<1)-1) << PERI_RAMECC2_M2SR_BIT_DEDF_SHIFT)
#define PERI_RAMECC2_M2SR_BIT_DEBWDF_SHIFT                          (2U)
#define PERI_RAMECC2_M2SR_BIT_DEBWDF_MASK                           (((1U<<1)-1) << PERI_RAMECC2_M2SR_BIT_DEBWDF_SHIFT)

/*--- register M2FAR -------------------------------------------------*/
#define PERI_RAMECC2_M2FAR_BIT_FADD_SHIFT                           (0U)
#define PERI_RAMECC2_M2FAR_BIT_FADD_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M2FAR_BIT_FADD_SHIFT)

/*--- register M2FDRL -------------------------------------------------*/
#define PERI_RAMECC2_M2FDRL_BIT_FDATAL_SHIFT                        (0U)
#define PERI_RAMECC2_M2FDRL_BIT_FDATAL_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M2FDRL_BIT_FDATAL_SHIFT)

/*--- register M2FDRH -------------------------------------------------*/
#define PERI_RAMECC2_M2FDRH_BIT_FDATAH_SHIFT                        (0U)
#define PERI_RAMECC2_M2FDRH_BIT_FDATAH_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M2FDRH_BIT_FDATAH_SHIFT)

/*--- register M2FECR -------------------------------------------------*/
#define PERI_RAMECC2_M2FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC2_M2FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M2FECR_BIT_FEC_SHIFT)

/*--- register M3CR -------------------------------------------------*/
#define PERI_RAMECC2_M3CR_BIT_ECCSEIE_SHIFT                         (2U)
#define PERI_RAMECC2_M3CR_BIT_ECCSEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M3CR_BIT_ECCSEIE_SHIFT)
#define PERI_RAMECC2_M3CR_BIT_ECCDEIE_SHIFT                         (3U)
#define PERI_RAMECC2_M3CR_BIT_ECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M3CR_BIT_ECCDEIE_SHIFT)
#define PERI_RAMECC2_M3CR_BIT_ECCDEBWIE_SHIFT                       (4U)
#define PERI_RAMECC2_M3CR_BIT_ECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC2_M3CR_BIT_ECCDEBWIE_SHIFT)
#define PERI_RAMECC2_M3CR_BIT_ECCELEN_SHIFT                         (5U)
#define PERI_RAMECC2_M3CR_BIT_ECCELEN_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M3CR_BIT_ECCELEN_SHIFT)

/*--- register M3SR -------------------------------------------------*/
#define PERI_RAMECC2_M3SR_BIT_SEDCF_SHIFT                           (0U)
#define PERI_RAMECC2_M3SR_BIT_SEDCF_MASK                            (((1U<<1)-1) << PERI_RAMECC2_M3SR_BIT_SEDCF_SHIFT)
#define PERI_RAMECC2_M3SR_BIT_DEDF_SHIFT                            (1U)
#define PERI_RAMECC2_M3SR_BIT_DEDF_MASK                             (((1U<<1)-1) << PERI_RAMECC2_M3SR_BIT_DEDF_SHIFT)
#define PERI_RAMECC2_M3SR_BIT_DEBWDF_SHIFT                          (2U)
#define PERI_RAMECC2_M3SR_BIT_DEBWDF_MASK                           (((1U<<1)-1) << PERI_RAMECC2_M3SR_BIT_DEBWDF_SHIFT)

/*--- register M3FAR -------------------------------------------------*/
#define PERI_RAMECC2_M3FAR_BIT_FADD_SHIFT                           (0U)
#define PERI_RAMECC2_M3FAR_BIT_FADD_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M3FAR_BIT_FADD_SHIFT)

/*--- register M3FDRL -------------------------------------------------*/
#define PERI_RAMECC2_M3FDRL_BIT_FDATAL_SHIFT                        (0U)
#define PERI_RAMECC2_M3FDRL_BIT_FDATAL_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M3FDRL_BIT_FDATAL_SHIFT)

/*--- register M3FDRH -------------------------------------------------*/
#define PERI_RAMECC2_M3FDRH_BIT_FDATAH_SHIFT                        (0U)
#define PERI_RAMECC2_M3FDRH_BIT_FDATAH_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M3FDRH_BIT_FDATAH_SHIFT)

/*--- register M3FECR -------------------------------------------------*/
#define PERI_RAMECC2_M3FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC2_M3FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M3FECR_BIT_FEC_SHIFT)

/*--- register M4CR -------------------------------------------------*/
#define PERI_RAMECC2_M4CR_BIT_ECCSEIE_SHIFT                         (2U)
#define PERI_RAMECC2_M4CR_BIT_ECCSEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M4CR_BIT_ECCSEIE_SHIFT)
#define PERI_RAMECC2_M4CR_BIT_ECCDEIE_SHIFT                         (3U)
#define PERI_RAMECC2_M4CR_BIT_ECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M4CR_BIT_ECCDEIE_SHIFT)
#define PERI_RAMECC2_M4CR_BIT_ECCDEBWIE_SHIFT                       (4U)
#define PERI_RAMECC2_M4CR_BIT_ECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC2_M4CR_BIT_ECCDEBWIE_SHIFT)
#define PERI_RAMECC2_M4CR_BIT_ECCELEN_SHIFT                         (5U)
#define PERI_RAMECC2_M4CR_BIT_ECCELEN_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M4CR_BIT_ECCELEN_SHIFT)

/*--- register M4SR -------------------------------------------------*/
#define PERI_RAMECC2_M4SR_BIT_SEDCF_SHIFT                           (0U)
#define PERI_RAMECC2_M4SR_BIT_SEDCF_MASK                            (((1U<<1)-1) << PERI_RAMECC2_M4SR_BIT_SEDCF_SHIFT)
#define PERI_RAMECC2_M4SR_BIT_DEDF_SHIFT                            (1U)
#define PERI_RAMECC2_M4SR_BIT_DEDF_MASK                             (((1U<<1)-1) << PERI_RAMECC2_M4SR_BIT_DEDF_SHIFT)
#define PERI_RAMECC2_M4SR_BIT_DEBWDF_SHIFT                          (2U)
#define PERI_RAMECC2_M4SR_BIT_DEBWDF_MASK                           (((1U<<1)-1) << PERI_RAMECC2_M4SR_BIT_DEBWDF_SHIFT)

/*--- register M4FAR -------------------------------------------------*/
#define PERI_RAMECC2_M4FAR_BIT_FADD_SHIFT                           (0U)
#define PERI_RAMECC2_M4FAR_BIT_FADD_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M4FAR_BIT_FADD_SHIFT)

/*--- register M4FDRL -------------------------------------------------*/
#define PERI_RAMECC2_M4FDRL_BIT_FDATAL_SHIFT                        (0U)
#define PERI_RAMECC2_M4FDRL_BIT_FDATAL_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M4FDRL_BIT_FDATAL_SHIFT)

