minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register M4FDRH -------------------------------------------------*/
#define PERI_RAMECC2_M4FDRH_BIT_FDATAH_SHIFT                        (0U)
#define PERI_RAMECC2_M4FDRH_BIT_FDATAH_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M4FDRH_BIT_FDATAH_SHIFT)

/*--- register M4FECR -------------------------------------------------*/
#define PERI_RAMECC2_M4FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC2_M4FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M4FECR_BIT_FEC_SHIFT)

/*--- register M5CR -------------------------------------------------*/
#define PERI_RAMECC2_M5CR_BIT_ECCSEIE_SHIFT                         (2U)
#define PERI_RAMECC2_M5CR_BIT_ECCSEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M5CR_BIT_ECCSEIE_SHIFT)
#define PERI_RAMECC2_M5CR_BIT_ECCDEIE_SHIFT                         (3U)
#define PERI_RAMECC2_M5CR_BIT_ECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M5CR_BIT_ECCDEIE_SHIFT)
#define PERI_RAMECC2_M5CR_BIT_ECCDEBWIE_SHIFT                       (4U)
#define PERI_RAMECC2_M5CR_BIT_ECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC2_M5CR_BIT_ECCDEBWIE_SHIFT)
#define PERI_RAMECC2_M5CR_BIT_ECCELEN_SHIFT                         (5U)
#define PERI_RAMECC2_M5CR_BIT_ECCELEN_MASK                          (((1U<<1)-1) << PERI_RAMECC2_M5CR_BIT_ECCELEN_SHIFT)

/*--- register M5SR -------------------------------------------------*/
#define PERI_RAMECC2_M5SR_BIT_SEDCF_SHIFT                           (0U)
#define PERI_RAMECC2_M5SR_BIT_SEDCF_MASK                            (((1U<<1)-1) << PERI_RAMECC2_M5SR_BIT_SEDCF_SHIFT)
#define PERI_RAMECC2_M5SR_BIT_DEDF_SHIFT                            (1U)
#define PERI_RAMECC2_M5SR_BIT_DEDF_MASK                             (((1U<<1)-1) << PERI_RAMECC2_M5SR_BIT_DEDF_SHIFT)
#define PERI_RAMECC2_M5SR_BIT_DEBWDF_SHIFT                          (2U)
#define PERI_RAMECC2_M5SR_BIT_DEBWDF_MASK                           (((1U<<1)-1) << PERI_RAMECC2_M5SR_BIT_DEBWDF_SHIFT)

/*--- register M5FAR -------------------------------------------------*/
#define PERI_RAMECC2_M5FAR_BIT_FADD_SHIFT                           (0U)
#define PERI_RAMECC2_M5FAR_BIT_FADD_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M5FAR_BIT_FADD_SHIFT)

/*--- register M5FDRL -------------------------------------------------*/
#define PERI_RAMECC2_M5FDRL_BIT_FDATAL_SHIFT                        (0U)
#define PERI_RAMECC2_M5FDRL_BIT_FDATAL_MASK                         (((1U<<32)-1) << PERI_RAMECC2_M5FDRL_BIT_FDATAL_SHIFT)

/*--- register M5FDRH -------------------------------------------------*/
#define PERI_RAMECC2_M5FDRH_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC2_M5FDRH_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M5FDRH_BIT_FEC_SHIFT)

/*--- register M5FECR -------------------------------------------------*/
#define PERI_RAMECC2_M5FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC2_M5FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC2_M5FECR_BIT_FEC_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_RAMECC3_IER_BIT_GIE_SHIFT                              (0U)
#define PERI_RAMECC3_IER_BIT_GIE_MASK                               (((1U<<1)-1) << PERI_RAMECC3_IER_BIT_GIE_SHIFT)
#define PERI_RAMECC3_IER_BIT_GECCSEIE__SHIFT                        (1U)
#define PERI_RAMECC3_IER_BIT_GECCSEIE__MASK                         (((1U<<1)-1) << PERI_RAMECC3_IER_BIT_GECCSEIE__SHIFT)
#define PERI_RAMECC3_IER_BIT_GECCDEIE_SHIFT                         (2U)
#define PERI_RAMECC3_IER_BIT_GECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC3_IER_BIT_GECCDEIE_SHIFT)
#define PERI_RAMECC3_IER_BIT_GECCDEBWIE_SHIFT                       (3U)
#define PERI_RAMECC3_IER_BIT_GECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC3_IER_BIT_GECCDEBWIE_SHIFT)

/*--- register M1CR -------------------------------------------------*/
#define PERI_RAMECC3_M1CR_BIT_ECCSEIE_SHIFT                         (2U)
#define PERI_RAMECC3_M1CR_BIT_ECCSEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC3_M1CR_BIT_ECCSEIE_SHIFT)
#define PERI_RAMECC3_M1CR_BIT_ECCDEIE_SHIFT                         (3U)
#define PERI_RAMECC3_M1CR_BIT_ECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC3_M1CR_BIT_ECCDEIE_SHIFT)
#define PERI_RAMECC3_M1CR_BIT_ECCDEBWIE_SHIFT                       (4U)
#define PERI_RAMECC3_M1CR_BIT_ECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC3_M1CR_BIT_ECCDEBWIE_SHIFT)
#define PERI_RAMECC3_M1CR_BIT_ECCELEN_SHIFT                         (5U)
#define PERI_RAMECC3_M1CR_BIT_ECCELEN_MASK                          (((1U<<1)-1) << PERI_RAMECC3_M1CR_BIT_ECCELEN_SHIFT)

/*--- register M1SR -------------------------------------------------*/
#define PERI_RAMECC3_M1SR_BIT_SEDCF_SHIFT                           (0U)
#define PERI_RAMECC3_M1SR_BIT_SEDCF_MASK                            (((1U<<1)-1) << PERI_RAMECC3_M1SR_BIT_SEDCF_SHIFT)
#define PERI_RAMECC3_M1SR_BIT_DEDF_SHIFT                            (1U)
#define PERI_RAMECC3_M1SR_BIT_DEDF_MASK                             (((1U<<1)-1) << PERI_RAMECC3_M1SR_BIT_DEDF_SHIFT)
#define PERI_RAMECC3_M1SR_BIT_DEBWDF_SHIFT                          (2U)
#define PERI_RAMECC3_M1SR_BIT_DEBWDF_MASK                           (((1U<<1)-1) << PERI_RAMECC3_M1SR_BIT_DEBWDF_SHIFT)

/*--- register M1FAR -------------------------------------------------*/
#define PERI_RAMECC3_M1FAR_BIT_FADD_SHIFT                           (0U)
#define PERI_RAMECC3_M1FAR_BIT_FADD_MASK                            (((1U<<32)-1) << PERI_RAMECC3_M1FAR_BIT_FADD_SHIFT)

/*--- register M1FDRL -------------------------------------------------*/
#define PERI_RAMECC3_M1FDRL_BIT_FDATAL_SHIFT                        (0U)
#define PERI_RAMECC3_M1FDRL_BIT_FDATAL_MASK                         (((1U<<32)-1) << PERI_RAMECC3_M1FDRL_BIT_FDATAL_SHIFT)

/*--- register M1FDRH -------------------------------------------------*/
#define PERI_RAMECC3_M1FDRH_BIT_FDATAH_SHIFT                        (0U)
#define PERI_RAMECC3_M1FDRH_BIT_FDATAH_MASK                         (((1U<<32)-1) << PERI_RAMECC3_M1FDRH_BIT_FDATAH_SHIFT)

/*--- register M1FECR -------------------------------------------------*/
#define PERI_RAMECC3_M1FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC3_M1FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC3_M1FECR_BIT_FEC_SHIFT)

/*--- register M2CR -------------------------------------------------*/
#define PERI_RAMECC3_M2CR_BIT_ECCSEIE_SHIFT                         (2U)
#define PERI_RAMECC3_M2CR_BIT_ECCSEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC3_M2CR_BIT_ECCSEIE_SHIFT)
#define PERI_RAMECC3_M2CR_BIT_ECCDEIE_SHIFT                         (3U)
#define PERI_RAMECC3_M2CR_BIT_ECCDEIE_MASK                          (((1U<<1)-1) << PERI_RAMECC3_M2CR_BIT_ECCDEIE_SHIFT)
#define PERI_RAMECC3_M2CR_BIT_ECCDEBWIE_SHIFT                       (4U)
#define PERI_RAMECC3_M2CR_BIT_ECCDEBWIE_MASK                        (((1U<<1)-1) << PERI_RAMECC3_M2CR_BIT_ECCDEBWIE_SHIFT)
#define PERI_RAMECC3_M2CR_BIT_ECCELEN_SHIFT                         (5U)
#define PERI_RAMECC3_M2CR_BIT_ECCELEN_MASK                          (((1U<<1)-1) << PERI_RAMECC3_M2CR_BIT_ECCELEN_SHIFT)

/*--- register M2SR -------------------------------------------------*/
#define PERI_RAMECC3_M2SR_BIT_SEDCF_SHIFT                           (0U)
#define PERI_RAMECC3_M2SR_BIT_SEDCF_MASK                            (((1U<<1)-1) << PERI_RAMECC3_M2SR_BIT_SEDCF_SHIFT)
#define PERI_RAMECC3_M2SR_BIT_DEDF_SHIFT                            (1U)
#define PERI_RAMECC3_M2SR_BIT_DEDF_MASK                             (((1U<<1)-1) << PERI_RAMECC3_M2SR_BIT_DEDF_SHIFT)
#define PERI_RAMECC3_M2SR_BIT_DEBWDF_SHIFT                          (2U)
#define PERI_RAMECC3_M2SR_BIT_DEBWDF_MASK                           (((1U<<1)-1) << PERI_RAMECC3_M2SR_BIT_DEBWDF_SHIFT)

