minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register M2FAR -------------------------------------------------*/
#define PERI_RAMECC3_M2FAR_BIT_FADD_SHIFT                           (0U)
#define PERI_RAMECC3_M2FAR_BIT_FADD_MASK                            (((1U<<32)-1) << PERI_RAMECC3_M2FAR_BIT_FADD_SHIFT)

/*--- register M2FDRL -------------------------------------------------*/
#define PERI_RAMECC3_M2FDRL_BIT_FDATAL_SHIFT                        (0U)
#define PERI_RAMECC3_M2FDRL_BIT_FDATAL_MASK                         (((1U<<32)-1) << PERI_RAMECC3_M2FDRL_BIT_FDATAL_SHIFT)

/*--- register M2FDRH -------------------------------------------------*/
#define PERI_RAMECC3_M2FDRH_BIT_FDATAH_SHIFT                        (0U)
#define PERI_RAMECC3_M2FDRH_BIT_FDATAH_MASK                         (((1U<<32)-1) << PERI_RAMECC3_M2FDRH_BIT_FDATAH_SHIFT)

/*--- register M2FECR -------------------------------------------------*/
#define PERI_RAMECC3_M2FECR_BIT_FEC_SHIFT                           (0U)
#define PERI_RAMECC3_M2FECR_BIT_FEC_MASK                            (((1U<<32)-1) << PERI_RAMECC3_M2FECR_BIT_FEC_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_RCC_CR_BIT_HSION_SHIFT                                 (0U)
#define PERI_RCC_CR_BIT_HSION_MASK                                  (((1U<<1)-1) << PERI_RCC_CR_BIT_HSION_SHIFT)
#define PERI_RCC_CR_BIT_HSIKERON_SHIFT                              (1U)
#define PERI_RCC_CR_BIT_HSIKERON_MASK                               (((1U<<1)-1) << PERI_RCC_CR_BIT_HSIKERON_SHIFT)
#define PERI_RCC_CR_BIT_HSIRDY_SHIFT                                (2U)
#define PERI_RCC_CR_BIT_HSIRDY_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_HSIRDY_SHIFT)
#define PERI_RCC_CR_BIT_HSIDIV_SHIFT                                (3U)
#define PERI_RCC_CR_BIT_HSIDIV_MASK                                 (((1U<<2)-1) << PERI_RCC_CR_BIT_HSIDIV_SHIFT)
#define PERI_RCC_CR_BIT_HSIDIVF_SHIFT                               (5U)
#define PERI_RCC_CR_BIT_HSIDIVF_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_HSIDIVF_SHIFT)
#define PERI_RCC_CR_BIT_CSION_SHIFT                                 (7U)
#define PERI_RCC_CR_BIT_CSION_MASK                                  (((1U<<1)-1) << PERI_RCC_CR_BIT_CSION_SHIFT)
#define PERI_RCC_CR_BIT_CSIRDY_SHIFT                                (8U)
#define PERI_RCC_CR_BIT_CSIRDY_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_CSIRDY_SHIFT)
#define PERI_RCC_CR_BIT_CSIKERON_SHIFT                              (9U)
#define PERI_RCC_CR_BIT_CSIKERON_MASK                               (((1U<<1)-1) << PERI_RCC_CR_BIT_CSIKERON_SHIFT)
#define PERI_RCC_CR_BIT_RC48ON_SHIFT                                (12U)
#define PERI_RCC_CR_BIT_RC48ON_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_RC48ON_SHIFT)
#define PERI_RCC_CR_BIT_RC48RDY_SHIFT                               (13U)
#define PERI_RCC_CR_BIT_RC48RDY_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_RC48RDY_SHIFT)
#define PERI_RCC_CR_BIT_D1CKRDY_SHIFT                               (14U)
#define PERI_RCC_CR_BIT_D1CKRDY_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_D1CKRDY_SHIFT)
#define PERI_RCC_CR_BIT_D2CKRDY_SHIFT                               (15U)
#define PERI_RCC_CR_BIT_D2CKRDY_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_D2CKRDY_SHIFT)
#define PERI_RCC_CR_BIT_HSEON_SHIFT                                 (16U)
#define PERI_RCC_CR_BIT_HSEON_MASK                                  (((1U<<1)-1) << PERI_RCC_CR_BIT_HSEON_SHIFT)
#define PERI_RCC_CR_BIT_HSERDY_SHIFT                                (17U)
#define PERI_RCC_CR_BIT_HSERDY_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_HSERDY_SHIFT)
#define PERI_RCC_CR_BIT_HSEBYP_SHIFT                                (18U)
#define PERI_RCC_CR_BIT_HSEBYP_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_HSEBYP_SHIFT)
#define PERI_RCC_CR_BIT_HSECSSON_SHIFT                              (19U)
#define PERI_RCC_CR_BIT_HSECSSON_MASK                               (((1U<<1)-1) << PERI_RCC_CR_BIT_HSECSSON_SHIFT)
#define PERI_RCC_CR_BIT_PLL1ON_SHIFT                                (24U)
#define PERI_RCC_CR_BIT_PLL1ON_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_PLL1ON_SHIFT)
#define PERI_RCC_CR_BIT_PLL1RDY_SHIFT                               (25U)
#define PERI_RCC_CR_BIT_PLL1RDY_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_PLL1RDY_SHIFT)
#define PERI_RCC_CR_BIT_PLL2ON_SHIFT                                (26U)
#define PERI_RCC_CR_BIT_PLL2ON_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_PLL2ON_SHIFT)
#define PERI_RCC_CR_BIT_PLL2RDY_SHIFT                               (27U)
#define PERI_RCC_CR_BIT_PLL2RDY_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_PLL2RDY_SHIFT)
#define PERI_RCC_CR_BIT_PLL3ON_SHIFT                                (28U)
#define PERI_RCC_CR_BIT_PLL3ON_MASK                                 (((1U<<1)-1) << PERI_RCC_CR_BIT_PLL3ON_SHIFT)
#define PERI_RCC_CR_BIT_PLL3RDY_SHIFT                               (29U)
#define PERI_RCC_CR_BIT_PLL3RDY_MASK                                (((1U<<1)-1) << PERI_RCC_CR_BIT_PLL3RDY_SHIFT)

/*--- register ICSCR -------------------------------------------------*/
#define PERI_RCC_ICSCR_BIT_HSICAL_SHIFT                             (0U)
#define PERI_RCC_ICSCR_BIT_HSICAL_MASK                              (((1U<<12)-1) << PERI_RCC_ICSCR_BIT_HSICAL_SHIFT)
#define PERI_RCC_ICSCR_BIT_HSITRIM_SHIFT                            (12U)
#define PERI_RCC_ICSCR_BIT_HSITRIM_MASK                             (((1U<<6)-1) << PERI_RCC_ICSCR_BIT_HSITRIM_SHIFT)
#define PERI_RCC_ICSCR_BIT_CSICAL_SHIFT                             (18U)
#define PERI_RCC_ICSCR_BIT_CSICAL_MASK                              (((1U<<8)-1) << PERI_RCC_ICSCR_BIT_CSICAL_SHIFT)
#define PERI_RCC_ICSCR_BIT_CSITRIM_SHIFT                            (26U)
#define PERI_RCC_ICSCR_BIT_CSITRIM_MASK                             (((1U<<5)-1) << PERI_RCC_ICSCR_BIT_CSITRIM_SHIFT)

/*--- register HSICFGR -------------------------------------------------*/
#define PERI_RCC_HSICFGR_BIT_HSICAL_SHIFT                           (0U)
#define PERI_RCC_HSICFGR_BIT_HSICAL_MASK                            (((1U<<12)-1) << PERI_RCC_HSICFGR_BIT_HSICAL_SHIFT)
#define PERI_RCC_HSICFGR_BIT_HSITRIM_SHIFT                          (24U)
#define PERI_RCC_HSICFGR_BIT_HSITRIM_MASK                           (((1U<<7)-1) << PERI_RCC_HSICFGR_BIT_HSITRIM_SHIFT)

/*--- register CRRCR -------------------------------------------------*/
#define PERI_RCC_CRRCR_BIT_RC48CAL_SHIFT                            (0U)
#define PERI_RCC_CRRCR_BIT_RC48CAL_MASK                             (((1U<<10)-1) << PERI_RCC_CRRCR_BIT_RC48CAL_SHIFT)

/*--- register CFGR -------------------------------------------------*/
#define PERI_RCC_CFGR_BIT_SW_SHIFT                                  (0U)
#define PERI_RCC_CFGR_BIT_SW_MASK                                   (((1U<<3)-1) << PERI_RCC_CFGR_BIT_SW_SHIFT)
#define PERI_RCC_CFGR_BIT_SWS_SHIFT                                 (3U)
#define PERI_RCC_CFGR_BIT_SWS_MASK                                  (((1U<<3)-1) << PERI_RCC_CFGR_BIT_SWS_SHIFT)
#define PERI_RCC_CFGR_BIT_STOPWUCK_SHIFT                            (6U)
#define PERI_RCC_CFGR_BIT_STOPWUCK_MASK                             (((1U<<1)-1) << PERI_RCC_CFGR_BIT_STOPWUCK_SHIFT)
#define PERI_RCC_CFGR_BIT_STOPKERWUCK_SHIFT                         (7U)
#define PERI_RCC_CFGR_BIT_STOPKERWUCK_MASK                          (((1U<<1)-1) << PERI_RCC_CFGR_BIT_STOPKERWUCK_SHIFT)
#define PERI_RCC_CFGR_BIT_RTCPRE_SHIFT                              (8U)
#define PERI_RCC_CFGR_BIT_RTCPRE_MASK                               (((1U<<6)-1) << PERI_RCC_CFGR_BIT_RTCPRE_SHIFT)
#define PERI_RCC_CFGR_BIT_HRTIMSEL_SHIFT                            (14U)
#define PERI_RCC_CFGR_BIT_HRTIMSEL_MASK                             (((1U<<1)-1) << PERI_RCC_CFGR_BIT_HRTIMSEL_SHIFT)
#define PERI_RCC_CFGR_BIT_TIMPRE_SHIFT                              (15U)
#define PERI_RCC_CFGR_BIT_TIMPRE_MASK                               (((1U<<1)-1) << PERI_RCC_CFGR_BIT_TIMPRE_SHIFT)
#define PERI_RCC_CFGR_BIT_MCO1PRE_SHIFT                             (18U)
#define PERI_RCC_CFGR_BIT_MCO1PRE_MASK                              (((1U<<4)-1) << PERI_RCC_CFGR_BIT_MCO1PRE_SHIFT)
#define PERI_RCC_CFGR_BIT_MCO1SEL_SHIFT                             (22U)
#define PERI_RCC_CFGR_BIT_MCO1SEL_MASK                              (((1U<<3)-1) << PERI_RCC_CFGR_BIT_MCO1SEL_SHIFT)
#define PERI_RCC_CFGR_BIT_MCO2PRE_SHIFT                             (25U)
#define PERI_RCC_CFGR_BIT_MCO2PRE_MASK                              (((1U<<4)-1) << PERI_RCC_CFGR_BIT_MCO2PRE_SHIFT)
#define PERI_RCC_CFGR_BIT_MCO2SEL_SHIFT                             (29U)
#define PERI_RCC_CFGR_BIT_MCO2SEL_MASK                              (((1U<<3)-1) << PERI_RCC_CFGR_BIT_MCO2SEL_SHIFT)

/*--- register D1CFGR -------------------------------------------------*/
#define PERI_RCC_D1CFGR_BIT_HPRE_SHIFT                              (0U)
#define PERI_RCC_D1CFGR_BIT_HPRE_MASK                               (((1U<<4)-1) << PERI_RCC_D1CFGR_BIT_HPRE_SHIFT)
#define PERI_RCC_D1CFGR_BIT_D1PPRE_SHIFT                            (4U)
#define PERI_RCC_D1CFGR_BIT_D1PPRE_MASK                             (((1U<<3)-1) << PERI_RCC_D1CFGR_BIT_D1PPRE_SHIFT)
#define PERI_RCC_D1CFGR_BIT_D1CPRE_SHIFT                            (8U)
#define PERI_RCC_D1CFGR_BIT_D1CPRE_MASK                             (((1U<<4)-1) << PERI_RCC_D1CFGR_BIT_D1CPRE_SHIFT)

/*--- register D2CFGR -------------------------------------------------*/
#define PERI_RCC_D2CFGR_BIT_D2PPRE1_SHIFT                           (4U)
#define PERI_RCC_D2CFGR_BIT_D2PPRE1_MASK                            (((1U<<3)-1) << PERI_RCC_D2CFGR_BIT_D2PPRE1_SHIFT)
#define PERI_RCC_D2CFGR_BIT_D2PPRE2_SHIFT                           (8U)
#define PERI_RCC_D2CFGR_BIT_D2PPRE2_MASK                            (((1U<<3)-1) << PERI_RCC_D2CFGR_BIT_D2PPRE2_SHIFT)

/*--- register D3CFGR -------------------------------------------------*/
#define PERI_RCC_D3CFGR_BIT_D3PPRE_SHIFT                            (4U)
#define PERI_RCC_D3CFGR_BIT_D3PPRE_MASK                             (((1U<<3)-1) << PERI_RCC_D3CFGR_BIT_D3PPRE_SHIFT)

/*--- register PLLCKSELR -------------------------------------------------*/
#define PERI_RCC_PLLCKSELR_BIT_PLLSRC_SHIFT                         (0U)
#define PERI_RCC_PLLCKSELR_BIT_PLLSRC_MASK                          (((1U<<2)-1) << PERI_RCC_PLLCKSELR_BIT_PLLSRC_SHIFT)
#define PERI_RCC_PLLCKSELR_BIT_DIVM1_SHIFT                          (4U)
#define PERI_RCC_PLLCKSELR_BIT_DIVM1_MASK                           (((1U<<6)-1) << PERI_RCC_PLLCKSELR_BIT_DIVM1_SHIFT)
#define PERI_RCC_PLLCKSELR_BIT_DIVM2_SHIFT                          (12U)
#define PERI_RCC_PLLCKSELR_BIT_DIVM2_MASK                           (((1U<<6)-1) << PERI_RCC_PLLCKSELR_BIT_DIVM2_SHIFT)
#define PERI_RCC_PLLCKSELR_BIT_DIVM3_SHIFT                          (20U)
#define PERI_RCC_PLLCKSELR_BIT_DIVM3_MASK                           (((1U<<6)-1) << PERI_RCC_PLLCKSELR_BIT_DIVM3_SHIFT)

