minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register PLLCFGR -------------------------------------------------*/
#define PERI_RCC_PLLCFGR_BIT_PLL1FRACEN_SHIFT                       (0U)
#define PERI_RCC_PLLCFGR_BIT_PLL1FRACEN_MASK                        (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_PLL1FRACEN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL1VCOSEL_SHIFT                       (1U)
#define PERI_RCC_PLLCFGR_BIT_PLL1VCOSEL_MASK                        (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_PLL1VCOSEL_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL1RGE_SHIFT                          (2U)
#define PERI_RCC_PLLCFGR_BIT_PLL1RGE_MASK                           (((1U<<2)-1) << PERI_RCC_PLLCFGR_BIT_PLL1RGE_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL2FRACEN_SHIFT                       (4U)
#define PERI_RCC_PLLCFGR_BIT_PLL2FRACEN_MASK                        (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_PLL2FRACEN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL2VCOSEL_SHIFT                       (5U)
#define PERI_RCC_PLLCFGR_BIT_PLL2VCOSEL_MASK                        (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_PLL2VCOSEL_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL2RGE_SHIFT                          (6U)
#define PERI_RCC_PLLCFGR_BIT_PLL2RGE_MASK                           (((1U<<2)-1) << PERI_RCC_PLLCFGR_BIT_PLL2RGE_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL3FRACEN_SHIFT                       (8U)
#define PERI_RCC_PLLCFGR_BIT_PLL3FRACEN_MASK                        (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_PLL3FRACEN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL3VCOSEL_SHIFT                       (9U)
#define PERI_RCC_PLLCFGR_BIT_PLL3VCOSEL_MASK                        (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_PLL3VCOSEL_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_PLL3RGE_SHIFT                          (10U)
#define PERI_RCC_PLLCFGR_BIT_PLL3RGE_MASK                           (((1U<<2)-1) << PERI_RCC_PLLCFGR_BIT_PLL3RGE_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVP1EN_SHIFT                          (16U)
#define PERI_RCC_PLLCFGR_BIT_DIVP1EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVP1EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVQ1EN_SHIFT                          (17U)
#define PERI_RCC_PLLCFGR_BIT_DIVQ1EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVQ1EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVR1EN_SHIFT                          (18U)
#define PERI_RCC_PLLCFGR_BIT_DIVR1EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVR1EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVP2EN_SHIFT                          (19U)
#define PERI_RCC_PLLCFGR_BIT_DIVP2EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVP2EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVQ2EN_SHIFT                          (20U)
#define PERI_RCC_PLLCFGR_BIT_DIVQ2EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVQ2EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVR2EN_SHIFT                          (21U)
#define PERI_RCC_PLLCFGR_BIT_DIVR2EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVR2EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVP3EN_SHIFT                          (22U)
#define PERI_RCC_PLLCFGR_BIT_DIVP3EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVP3EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVQ3EN_SHIFT                          (23U)
#define PERI_RCC_PLLCFGR_BIT_DIVQ3EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVQ3EN_SHIFT)
#define PERI_RCC_PLLCFGR_BIT_DIVR3EN_SHIFT                          (24U)
#define PERI_RCC_PLLCFGR_BIT_DIVR3EN_MASK                           (((1U<<1)-1) << PERI_RCC_PLLCFGR_BIT_DIVR3EN_SHIFT)

/*--- register PLL1DIVR -------------------------------------------------*/
#define PERI_RCC_PLL1DIVR_BIT_DIVN1_SHIFT                           (0U)
#define PERI_RCC_PLL1DIVR_BIT_DIVN1_MASK                            (((1U<<9)-1) << PERI_RCC_PLL1DIVR_BIT_DIVN1_SHIFT)
#define PERI_RCC_PLL1DIVR_BIT_DIVP1_SHIFT                           (9U)
#define PERI_RCC_PLL1DIVR_BIT_DIVP1_MASK                            (((1U<<7)-1) << PERI_RCC_PLL1DIVR_BIT_DIVP1_SHIFT)
#define PERI_RCC_PLL1DIVR_BIT_DIVQ1_SHIFT                           (16U)
#define PERI_RCC_PLL1DIVR_BIT_DIVQ1_MASK                            (((1U<<7)-1) << PERI_RCC_PLL1DIVR_BIT_DIVQ1_SHIFT)
#define PERI_RCC_PLL1DIVR_BIT_DIVR1_SHIFT                           (24U)
#define PERI_RCC_PLL1DIVR_BIT_DIVR1_MASK                            (((1U<<7)-1) << PERI_RCC_PLL1DIVR_BIT_DIVR1_SHIFT)

/*--- register PLL1FRACR -------------------------------------------------*/
#define PERI_RCC_PLL1FRACR_BIT_FRACN1_SHIFT                         (3U)
#define PERI_RCC_PLL1FRACR_BIT_FRACN1_MASK                          (((1U<<13)-1) << PERI_RCC_PLL1FRACR_BIT_FRACN1_SHIFT)

/*--- register PLL2DIVR -------------------------------------------------*/
#define PERI_RCC_PLL2DIVR_BIT_DIVN2_SHIFT                           (0U)
#define PERI_RCC_PLL2DIVR_BIT_DIVN2_MASK                            (((1U<<9)-1) << PERI_RCC_PLL2DIVR_BIT_DIVN2_SHIFT)
#define PERI_RCC_PLL2DIVR_BIT_DIVP2_SHIFT                           (9U)
#define PERI_RCC_PLL2DIVR_BIT_DIVP2_MASK                            (((1U<<7)-1) << PERI_RCC_PLL2DIVR_BIT_DIVP2_SHIFT)
#define PERI_RCC_PLL2DIVR_BIT_DIVQ2_SHIFT                           (16U)
#define PERI_RCC_PLL2DIVR_BIT_DIVQ2_MASK                            (((1U<<7)-1) << PERI_RCC_PLL2DIVR_BIT_DIVQ2_SHIFT)
#define PERI_RCC_PLL2DIVR_BIT_DIVR2_SHIFT                           (24U)
#define PERI_RCC_PLL2DIVR_BIT_DIVR2_MASK                            (((1U<<7)-1) << PERI_RCC_PLL2DIVR_BIT_DIVR2_SHIFT)

/*--- register PLL2FRACR -------------------------------------------------*/
#define PERI_RCC_PLL2FRACR_BIT_FRACN2_SHIFT                         (3U)
#define PERI_RCC_PLL2FRACR_BIT_FRACN2_MASK                          (((1U<<13)-1) << PERI_RCC_PLL2FRACR_BIT_FRACN2_SHIFT)

/*--- register PLL3DIVR -------------------------------------------------*/
#define PERI_RCC_PLL3DIVR_BIT_DIVN3_SHIFT                           (0U)
#define PERI_RCC_PLL3DIVR_BIT_DIVN3_MASK                            (((1U<<9)-1) << PERI_RCC_PLL3DIVR_BIT_DIVN3_SHIFT)
#define PERI_RCC_PLL3DIVR_BIT_DIVP3_SHIFT                           (9U)
#define PERI_RCC_PLL3DIVR_BIT_DIVP3_MASK                            (((1U<<7)-1) << PERI_RCC_PLL3DIVR_BIT_DIVP3_SHIFT)
#define PERI_RCC_PLL3DIVR_BIT_DIVQ3_SHIFT                           (16U)
#define PERI_RCC_PLL3DIVR_BIT_DIVQ3_MASK                            (((1U<<7)-1) << PERI_RCC_PLL3DIVR_BIT_DIVQ3_SHIFT)
#define PERI_RCC_PLL3DIVR_BIT_DIVR3_SHIFT                           (24U)
#define PERI_RCC_PLL3DIVR_BIT_DIVR3_MASK                            (((1U<<7)-1) << PERI_RCC_PLL3DIVR_BIT_DIVR3_SHIFT)

/*--- register PLL3FRACR -------------------------------------------------*/
#define PERI_RCC_PLL3FRACR_BIT_FRACN3_SHIFT                         (3U)
#define PERI_RCC_PLL3FRACR_BIT_FRACN3_MASK                          (((1U<<13)-1) << PERI_RCC_PLL3FRACR_BIT_FRACN3_SHIFT)

/*--- register D1CCIPR -------------------------------------------------*/
#define PERI_RCC_D1CCIPR_BIT_FMCSEL_SHIFT                           (0U)
#define PERI_RCC_D1CCIPR_BIT_FMCSEL_MASK                            (((1U<<2)-1) << PERI_RCC_D1CCIPR_BIT_FMCSEL_SHIFT)
#define PERI_RCC_D1CCIPR_BIT_QSPISEL_SHIFT                          (4U)
#define PERI_RCC_D1CCIPR_BIT_QSPISEL_MASK                           (((1U<<2)-1) << PERI_RCC_D1CCIPR_BIT_QSPISEL_SHIFT)
#define PERI_RCC_D1CCIPR_BIT_SDMMCSEL_SHIFT                         (16U)
#define PERI_RCC_D1CCIPR_BIT_SDMMCSEL_MASK                          (((1U<<1)-1) << PERI_RCC_D1CCIPR_BIT_SDMMCSEL_SHIFT)
#define PERI_RCC_D1CCIPR_BIT_CKPERSEL_SHIFT                         (28U)
#define PERI_RCC_D1CCIPR_BIT_CKPERSEL_MASK                          (((1U<<2)-1) << PERI_RCC_D1CCIPR_BIT_CKPERSEL_SHIFT)

/*--- register D2CCIP1R -------------------------------------------------*/
#define PERI_RCC_D2CCIP1R_BIT_SAI1SEL_SHIFT                         (0U)
#define PERI_RCC_D2CCIP1R_BIT_SAI1SEL_MASK                          (((1U<<3)-1) << PERI_RCC_D2CCIP1R_BIT_SAI1SEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_SAI23SEL_SHIFT                        (6U)
#define PERI_RCC_D2CCIP1R_BIT_SAI23SEL_MASK                         (((1U<<3)-1) << PERI_RCC_D2CCIP1R_BIT_SAI23SEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_SPI123SEL_SHIFT                       (12U)
#define PERI_RCC_D2CCIP1R_BIT_SPI123SEL_MASK                        (((1U<<3)-1) << PERI_RCC_D2CCIP1R_BIT_SPI123SEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_SPI45SEL_SHIFT                        (16U)
#define PERI_RCC_D2CCIP1R_BIT_SPI45SEL_MASK                         (((1U<<3)-1) << PERI_RCC_D2CCIP1R_BIT_SPI45SEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_SPDIFSEL_SHIFT                        (20U)
#define PERI_RCC_D2CCIP1R_BIT_SPDIFSEL_MASK                         (((1U<<2)-1) << PERI_RCC_D2CCIP1R_BIT_SPDIFSEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_DFSDM1SEL_SHIFT                       (24U)
#define PERI_RCC_D2CCIP1R_BIT_DFSDM1SEL_MASK                        (((1U<<1)-1) << PERI_RCC_D2CCIP1R_BIT_DFSDM1SEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_FDCANSEL_SHIFT                        (28U)
#define PERI_RCC_D2CCIP1R_BIT_FDCANSEL_MASK                         (((1U<<2)-1) << PERI_RCC_D2CCIP1R_BIT_FDCANSEL_SHIFT)
#define PERI_RCC_D2CCIP1R_BIT_SWPSEL_SHIFT                          (31U)
#define PERI_RCC_D2CCIP1R_BIT_SWPSEL_MASK                           (((1U<<1)-1) << PERI_RCC_D2CCIP1R_BIT_SWPSEL_SHIFT)

/*--- register D2CCIP2R -------------------------------------------------*/
#define PERI_RCC_D2CCIP2R_BIT_USART234578SEL_SHIFT                  (0U)
#define PERI_RCC_D2CCIP2R_BIT_USART234578SEL_MASK                   (((1U<<3)-1) << PERI_RCC_D2CCIP2R_BIT_USART234578SEL_SHIFT)
#define PERI_RCC_D2CCIP2R_BIT_USART16SEL_SHIFT                      (3U)
#define PERI_RCC_D2CCIP2R_BIT_USART16SEL_MASK                       (((1U<<3)-1) << PERI_RCC_D2CCIP2R_BIT_USART16SEL_SHIFT)
#define PERI_RCC_D2CCIP2R_BIT_RNGSEL_SHIFT                          (8U)
#define PERI_RCC_D2CCIP2R_BIT_RNGSEL_MASK                           (((1U<<2)-1) << PERI_RCC_D2CCIP2R_BIT_RNGSEL_SHIFT)
#define PERI_RCC_D2CCIP2R_BIT_I2C123SEL_SHIFT                       (12U)
#define PERI_RCC_D2CCIP2R_BIT_I2C123SEL_MASK                        (((1U<<2)-1) << PERI_RCC_D2CCIP2R_BIT_I2C123SEL_SHIFT)
#define PERI_RCC_D2CCIP2R_BIT_USBSEL_SHIFT                          (20U)
#define PERI_RCC_D2CCIP2R_BIT_USBSEL_MASK                           (((1U<<2)-1) << PERI_RCC_D2CCIP2R_BIT_USBSEL_SHIFT)
#define PERI_RCC_D2CCIP2R_BIT_CECSEL_SHIFT                          (22U)
#define PERI_RCC_D2CCIP2R_BIT_CECSEL_MASK                           (((1U<<2)-1) << PERI_RCC_D2CCIP2R_BIT_CECSEL_SHIFT)
#define PERI_RCC_D2CCIP2R_BIT_LPTIM1SEL_SHIFT                       (28U)
#define PERI_RCC_D2CCIP2R_BIT_LPTIM1SEL_MASK                        (((1U<<3)-1) << PERI_RCC_D2CCIP2R_BIT_LPTIM1SEL_SHIFT)

/*--- register D3CCIPR -------------------------------------------------*/
#define PERI_RCC_D3CCIPR_BIT_LPUART1SEL_SHIFT                       (0U)
#define PERI_RCC_D3CCIPR_BIT_LPUART1SEL_MASK                        (((1U<<3)-1) << PERI_RCC_D3CCIPR_BIT_LPUART1SEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_I2C4SEL_SHIFT                          (8U)
#define PERI_RCC_D3CCIPR_BIT_I2C4SEL_MASK                           (((1U<<2)-1) << PERI_RCC_D3CCIPR_BIT_I2C4SEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_LPTIM2SEL_SHIFT                        (10U)
#define PERI_RCC_D3CCIPR_BIT_LPTIM2SEL_MASK                         (((1U<<3)-1) << PERI_RCC_D3CCIPR_BIT_LPTIM2SEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_LPTIM345SEL_SHIFT                      (13U)
#define PERI_RCC_D3CCIPR_BIT_LPTIM345SEL_MASK                       (((1U<<3)-1) << PERI_RCC_D3CCIPR_BIT_LPTIM345SEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_ADCSEL_SHIFT                           (16U)
#define PERI_RCC_D3CCIPR_BIT_ADCSEL_MASK                            (((1U<<2)-1) << PERI_RCC_D3CCIPR_BIT_ADCSEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_SAI4ASEL_SHIFT                         (21U)
#define PERI_RCC_D3CCIPR_BIT_SAI4ASEL_MASK                          (((1U<<3)-1) << PERI_RCC_D3CCIPR_BIT_SAI4ASEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_SAI4BSEL_SHIFT                         (24U)
#define PERI_RCC_D3CCIPR_BIT_SAI4BSEL_MASK                          (((1U<<3)-1) << PERI_RCC_D3CCIPR_BIT_SAI4BSEL_SHIFT)
#define PERI_RCC_D3CCIPR_BIT_SPI6SEL_SHIFT                          (28U)
#define PERI_RCC_D3CCIPR_BIT_SPI6SEL_MASK                           (((1U<<3)-1) << PERI_RCC_D3CCIPR_BIT_SPI6SEL_SHIFT)

/*--- register CIER -------------------------------------------------*/
#define PERI_RCC_CIER_BIT_LSIRDYIE_SHIFT                            (0U)
#define PERI_RCC_CIER_BIT_LSIRDYIE_MASK                             (((1U<<1)-1) << PERI_RCC_CIER_BIT_LSIRDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_LSERDYIE_SHIFT                            (1U)
#define PERI_RCC_CIER_BIT_LSERDYIE_MASK                             (((1U<<1)-1) << PERI_RCC_CIER_BIT_LSERDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_HSIRDYIE_SHIFT                            (2U)
#define PERI_RCC_CIER_BIT_HSIRDYIE_MASK                             (((1U<<1)-1) << PERI_RCC_CIER_BIT_HSIRDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_HSERDYIE_SHIFT                            (3U)
#define PERI_RCC_CIER_BIT_HSERDYIE_MASK                             (((1U<<1)-1) << PERI_RCC_CIER_BIT_HSERDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_CSIRDYIE_SHIFT                            (4U)
#define PERI_RCC_CIER_BIT_CSIRDYIE_MASK                             (((1U<<1)-1) << PERI_RCC_CIER_BIT_CSIRDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_RC48RDYIE_SHIFT                           (5U)
#define PERI_RCC_CIER_BIT_RC48RDYIE_MASK                            (((1U<<1)-1) << PERI_RCC_CIER_BIT_RC48RDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_PLL1RDYIE_SHIFT                           (6U)
#define PERI_RCC_CIER_BIT_PLL1RDYIE_MASK                            (((1U<<1)-1) << PERI_RCC_CIER_BIT_PLL1RDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_PLL2RDYIE_SHIFT                           (7U)
#define PERI_RCC_CIER_BIT_PLL2RDYIE_MASK                            (((1U<<1)-1) << PERI_RCC_CIER_BIT_PLL2RDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_PLL3RDYIE_SHIFT                           (8U)
#define PERI_RCC_CIER_BIT_PLL3RDYIE_MASK                            (((1U<<1)-1) << PERI_RCC_CIER_BIT_PLL3RDYIE_SHIFT)
#define PERI_RCC_CIER_BIT_LSECSSIE_SHIFT                            (9U)
#define PERI_RCC_CIER_BIT_LSECSSIE_MASK                             (((1U<<1)-1) << PERI_RCC_CIER_BIT_LSECSSIE_SHIFT)

