minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CIFR -------------------------------------------------*/
#define PERI_RCC_CIFR_BIT_LSIRDYF_SHIFT                             (0U)
#define PERI_RCC_CIFR_BIT_LSIRDYF_MASK                              (((1U<<1)-1) << PERI_RCC_CIFR_BIT_LSIRDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_LSERDYF_SHIFT                             (1U)
#define PERI_RCC_CIFR_BIT_LSERDYF_MASK                              (((1U<<1)-1) << PERI_RCC_CIFR_BIT_LSERDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_HSIRDYF_SHIFT                             (2U)
#define PERI_RCC_CIFR_BIT_HSIRDYF_MASK                              (((1U<<1)-1) << PERI_RCC_CIFR_BIT_HSIRDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_HSERDYF_SHIFT                             (3U)
#define PERI_RCC_CIFR_BIT_HSERDYF_MASK                              (((1U<<1)-1) << PERI_RCC_CIFR_BIT_HSERDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_CSIRDY_SHIFT                              (4U)
#define PERI_RCC_CIFR_BIT_CSIRDY_MASK                               (((1U<<1)-1) << PERI_RCC_CIFR_BIT_CSIRDY_SHIFT)
#define PERI_RCC_CIFR_BIT_RC48RDYF_SHIFT                            (5U)
#define PERI_RCC_CIFR_BIT_RC48RDYF_MASK                             (((1U<<1)-1) << PERI_RCC_CIFR_BIT_RC48RDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_PLL1RDYF_SHIFT                            (6U)
#define PERI_RCC_CIFR_BIT_PLL1RDYF_MASK                             (((1U<<1)-1) << PERI_RCC_CIFR_BIT_PLL1RDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_PLL2RDYF_SHIFT                            (7U)
#define PERI_RCC_CIFR_BIT_PLL2RDYF_MASK                             (((1U<<1)-1) << PERI_RCC_CIFR_BIT_PLL2RDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_PLL3RDYF_SHIFT                            (8U)
#define PERI_RCC_CIFR_BIT_PLL3RDYF_MASK                             (((1U<<1)-1) << PERI_RCC_CIFR_BIT_PLL3RDYF_SHIFT)
#define PERI_RCC_CIFR_BIT_LSECSSF_SHIFT                             (9U)
#define PERI_RCC_CIFR_BIT_LSECSSF_MASK                              (((1U<<1)-1) << PERI_RCC_CIFR_BIT_LSECSSF_SHIFT)
#define PERI_RCC_CIFR_BIT_HSECSSF_SHIFT                             (10U)
#define PERI_RCC_CIFR_BIT_HSECSSF_MASK                              (((1U<<1)-1) << PERI_RCC_CIFR_BIT_HSECSSF_SHIFT)

/*--- register CICR -------------------------------------------------*/
#define PERI_RCC_CICR_BIT_LSIRDYC_SHIFT                             (0U)
#define PERI_RCC_CICR_BIT_LSIRDYC_MASK                              (((1U<<1)-1) << PERI_RCC_CICR_BIT_LSIRDYC_SHIFT)
#define PERI_RCC_CICR_BIT_LSERDYC_SHIFT                             (1U)
#define PERI_RCC_CICR_BIT_LSERDYC_MASK                              (((1U<<1)-1) << PERI_RCC_CICR_BIT_LSERDYC_SHIFT)
#define PERI_RCC_CICR_BIT_HSIRDYC_SHIFT                             (2U)
#define PERI_RCC_CICR_BIT_HSIRDYC_MASK                              (((1U<<1)-1) << PERI_RCC_CICR_BIT_HSIRDYC_SHIFT)
#define PERI_RCC_CICR_BIT_HSERDYC_SHIFT                             (3U)
#define PERI_RCC_CICR_BIT_HSERDYC_MASK                              (((1U<<1)-1) << PERI_RCC_CICR_BIT_HSERDYC_SHIFT)
#define PERI_RCC_CICR_BIT_HSE_READY_INTERRUPT_CLEAR_SHIFT           (4U)
#define PERI_RCC_CICR_BIT_HSE_READY_INTERRUPT_CLEAR_MASK            (((1U<<1)-1) << PERI_RCC_CICR_BIT_HSE_READY_INTERRUPT_CLEAR_SHIFT)
#define PERI_RCC_CICR_BIT_RC48RDYC_SHIFT                            (5U)
#define PERI_RCC_CICR_BIT_RC48RDYC_MASK                             (((1U<<1)-1) << PERI_RCC_CICR_BIT_RC48RDYC_SHIFT)
#define PERI_RCC_CICR_BIT_PLL1RDYC_SHIFT                            (6U)
#define PERI_RCC_CICR_BIT_PLL1RDYC_MASK                             (((1U<<1)-1) << PERI_RCC_CICR_BIT_PLL1RDYC_SHIFT)
#define PERI_RCC_CICR_BIT_PLL2RDYC_SHIFT                            (7U)
#define PERI_RCC_CICR_BIT_PLL2RDYC_MASK                             (((1U<<1)-1) << PERI_RCC_CICR_BIT_PLL2RDYC_SHIFT)
#define PERI_RCC_CICR_BIT_PLL3RDYC_SHIFT                            (8U)
#define PERI_RCC_CICR_BIT_PLL3RDYC_MASK                             (((1U<<1)-1) << PERI_RCC_CICR_BIT_PLL3RDYC_SHIFT)
#define PERI_RCC_CICR_BIT_LSECSSC_SHIFT                             (9U)
#define PERI_RCC_CICR_BIT_LSECSSC_MASK                              (((1U<<1)-1) << PERI_RCC_CICR_BIT_LSECSSC_SHIFT)
#define PERI_RCC_CICR_BIT_HSECSSC_SHIFT                             (10U)
#define PERI_RCC_CICR_BIT_HSECSSC_MASK                              (((1U<<1)-1) << PERI_RCC_CICR_BIT_HSECSSC_SHIFT)

/*--- register BDCR -------------------------------------------------*/
#define PERI_RCC_BDCR_BIT_LSEON_SHIFT                               (0U)
#define PERI_RCC_BDCR_BIT_LSEON_MASK                                (((1U<<1)-1) << PERI_RCC_BDCR_BIT_LSEON_SHIFT)
#define PERI_RCC_BDCR_BIT_LSERDY_SHIFT                              (1U)
#define PERI_RCC_BDCR_BIT_LSERDY_MASK                               (((1U<<1)-1) << PERI_RCC_BDCR_BIT_LSERDY_SHIFT)
#define PERI_RCC_BDCR_BIT_LSEBYP_SHIFT                              (2U)
#define PERI_RCC_BDCR_BIT_LSEBYP_MASK                               (((1U<<1)-1) << PERI_RCC_BDCR_BIT_LSEBYP_SHIFT)
#define PERI_RCC_BDCR_BIT_LSEDRV_SHIFT                              (3U)
#define PERI_RCC_BDCR_BIT_LSEDRV_MASK                               (((1U<<2)-1) << PERI_RCC_BDCR_BIT_LSEDRV_SHIFT)
#define PERI_RCC_BDCR_BIT_LSECSSON_SHIFT                            (5U)
#define PERI_RCC_BDCR_BIT_LSECSSON_MASK                             (((1U<<1)-1) << PERI_RCC_BDCR_BIT_LSECSSON_SHIFT)
#define PERI_RCC_BDCR_BIT_LSECSSD_SHIFT                             (6U)
#define PERI_RCC_BDCR_BIT_LSECSSD_MASK                              (((1U<<1)-1) << PERI_RCC_BDCR_BIT_LSECSSD_SHIFT)
#define PERI_RCC_BDCR_BIT_RTCSRC_SHIFT                              (8U)
#define PERI_RCC_BDCR_BIT_RTCSRC_MASK                               (((1U<<2)-1) << PERI_RCC_BDCR_BIT_RTCSRC_SHIFT)
#define PERI_RCC_BDCR_BIT_RTCEN_SHIFT                               (15U)
#define PERI_RCC_BDCR_BIT_RTCEN_MASK                                (((1U<<1)-1) << PERI_RCC_BDCR_BIT_RTCEN_SHIFT)
#define PERI_RCC_BDCR_BIT_VSWRST_SHIFT                              (16U)
#define PERI_RCC_BDCR_BIT_VSWRST_MASK                               (((1U<<1)-1) << PERI_RCC_BDCR_BIT_VSWRST_SHIFT)

/*--- register CSR -------------------------------------------------*/
#define PERI_RCC_CSR_BIT_LSION_SHIFT                                (0U)
#define PERI_RCC_CSR_BIT_LSION_MASK                                 (((1U<<1)-1) << PERI_RCC_CSR_BIT_LSION_SHIFT)
#define PERI_RCC_CSR_BIT_LSIRDY_SHIFT                               (1U)
#define PERI_RCC_CSR_BIT_LSIRDY_MASK                                (((1U<<1)-1) << PERI_RCC_CSR_BIT_LSIRDY_SHIFT)

/*--- register AHB3RSTR -------------------------------------------------*/
#define PERI_RCC_AHB3RSTR_BIT_MDMARST_SHIFT                         (0U)
#define PERI_RCC_AHB3RSTR_BIT_MDMARST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_MDMARST_SHIFT)
#define PERI_RCC_AHB3RSTR_BIT_DMA2DRST_SHIFT                        (4U)
#define PERI_RCC_AHB3RSTR_BIT_DMA2DRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_DMA2DRST_SHIFT)
#define PERI_RCC_AHB3RSTR_BIT_JPGDECRST_SHIFT                       (5U)
#define PERI_RCC_AHB3RSTR_BIT_JPGDECRST_MASK                        (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_JPGDECRST_SHIFT)
#define PERI_RCC_AHB3RSTR_BIT_FMCRST_SHIFT                          (12U)
#define PERI_RCC_AHB3RSTR_BIT_FMCRST_MASK                           (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_FMCRST_SHIFT)
#define PERI_RCC_AHB3RSTR_BIT_QSPIRST_SHIFT                         (14U)
#define PERI_RCC_AHB3RSTR_BIT_QSPIRST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_QSPIRST_SHIFT)
#define PERI_RCC_AHB3RSTR_BIT_SDMMC1RST_SHIFT                       (16U)
#define PERI_RCC_AHB3RSTR_BIT_SDMMC1RST_MASK                        (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_SDMMC1RST_SHIFT)
#define PERI_RCC_AHB3RSTR_BIT_CPURST_SHIFT                          (31U)
#define PERI_RCC_AHB3RSTR_BIT_CPURST_MASK                           (((1U<<1)-1) << PERI_RCC_AHB3RSTR_BIT_CPURST_SHIFT)

/*--- register AHB1RSTR -------------------------------------------------*/
#define PERI_RCC_AHB1RSTR_BIT_DMA1RST_SHIFT                         (0U)
#define PERI_RCC_AHB1RSTR_BIT_DMA1RST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB1RSTR_BIT_DMA1RST_SHIFT)
#define PERI_RCC_AHB1RSTR_BIT_DMA2RST_SHIFT                         (1U)
#define PERI_RCC_AHB1RSTR_BIT_DMA2RST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB1RSTR_BIT_DMA2RST_SHIFT)
#define PERI_RCC_AHB1RSTR_BIT_ADC12RST_SHIFT                        (5U)
#define PERI_RCC_AHB1RSTR_BIT_ADC12RST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB1RSTR_BIT_ADC12RST_SHIFT)
#define PERI_RCC_AHB1RSTR_BIT_ETH1MACRST_SHIFT                      (15U)
#define PERI_RCC_AHB1RSTR_BIT_ETH1MACRST_MASK                       (((1U<<1)-1) << PERI_RCC_AHB1RSTR_BIT_ETH1MACRST_SHIFT)
#define PERI_RCC_AHB1RSTR_BIT_USB1OTGRST_SHIFT                      (25U)
#define PERI_RCC_AHB1RSTR_BIT_USB1OTGRST_MASK                       (((1U<<1)-1) << PERI_RCC_AHB1RSTR_BIT_USB1OTGRST_SHIFT)
#define PERI_RCC_AHB1RSTR_BIT_USB2OTGRST_SHIFT                      (27U)
#define PERI_RCC_AHB1RSTR_BIT_USB2OTGRST_MASK                       (((1U<<1)-1) << PERI_RCC_AHB1RSTR_BIT_USB2OTGRST_SHIFT)

/*--- register AHB2RSTR -------------------------------------------------*/
#define PERI_RCC_AHB2RSTR_BIT_CAMITFRST_SHIFT                       (0U)
#define PERI_RCC_AHB2RSTR_BIT_CAMITFRST_MASK                        (((1U<<1)-1) << PERI_RCC_AHB2RSTR_BIT_CAMITFRST_SHIFT)
#define PERI_RCC_AHB2RSTR_BIT_CRYPTRST_SHIFT                        (4U)
#define PERI_RCC_AHB2RSTR_BIT_CRYPTRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB2RSTR_BIT_CRYPTRST_SHIFT)
#define PERI_RCC_AHB2RSTR_BIT_HASHRST_SHIFT                         (5U)
#define PERI_RCC_AHB2RSTR_BIT_HASHRST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB2RSTR_BIT_HASHRST_SHIFT)
#define PERI_RCC_AHB2RSTR_BIT_RNGRST_SHIFT                          (6U)
#define PERI_RCC_AHB2RSTR_BIT_RNGRST_MASK                           (((1U<<1)-1) << PERI_RCC_AHB2RSTR_BIT_RNGRST_SHIFT)
#define PERI_RCC_AHB2RSTR_BIT_SDMMC2RST_SHIFT                       (9U)
#define PERI_RCC_AHB2RSTR_BIT_SDMMC2RST_MASK                        (((1U<<1)-1) << PERI_RCC_AHB2RSTR_BIT_SDMMC2RST_SHIFT)

/*--- register AHB4RSTR -------------------------------------------------*/
#define PERI_RCC_AHB4RSTR_BIT_GPIOARST_SHIFT                        (0U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOARST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOARST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOBRST_SHIFT                        (1U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOBRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOBRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOCRST_SHIFT                        (2U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOCRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOCRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIODRST_SHIFT                        (3U)
#define PERI_RCC_AHB4RSTR_BIT_GPIODRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIODRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOERST_SHIFT                        (4U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOERST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOERST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOFRST_SHIFT                        (5U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOFRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOFRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOGRST_SHIFT                        (6U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOGRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOGRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOHRST_SHIFT                        (7U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOHRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOHRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOIRST_SHIFT                        (8U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOIRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOIRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOJRST_SHIFT                        (9U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOJRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOJRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_GPIOKRST_SHIFT                        (10U)
#define PERI_RCC_AHB4RSTR_BIT_GPIOKRST_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_GPIOKRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_CRCRST_SHIFT                          (19U)
#define PERI_RCC_AHB4RSTR_BIT_CRCRST_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_CRCRST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_BDMARST_SHIFT                         (21U)
#define PERI_RCC_AHB4RSTR_BIT_BDMARST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_BDMARST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_ADC3RST_SHIFT                         (24U)
#define PERI_RCC_AHB4RSTR_BIT_ADC3RST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_ADC3RST_SHIFT)
#define PERI_RCC_AHB4RSTR_BIT_HSEMRST_SHIFT                         (25U)
#define PERI_RCC_AHB4RSTR_BIT_HSEMRST_MASK                          (((1U<<1)-1) << PERI_RCC_AHB4RSTR_BIT_HSEMRST_SHIFT)

/*--- register APB3RSTR -------------------------------------------------*/
#define PERI_RCC_APB3RSTR_BIT_LTDCRST_SHIFT                         (3U)
#define PERI_RCC_APB3RSTR_BIT_LTDCRST_MASK                          (((1U<<1)-1) << PERI_RCC_APB3RSTR_BIT_LTDCRST_SHIFT)

/*--- register APB1LRSTR -------------------------------------------------*/
#define PERI_RCC_APB1LRSTR_BIT_TIM2RST_SHIFT                        (0U)
#define PERI_RCC_APB1LRSTR_BIT_TIM2RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM2RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM3RST_SHIFT                        (1U)
#define PERI_RCC_APB1LRSTR_BIT_TIM3RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM3RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM4RST_SHIFT                        (2U)
#define PERI_RCC_APB1LRSTR_BIT_TIM4RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM4RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM5RST_SHIFT                        (3U)
#define PERI_RCC_APB1LRSTR_BIT_TIM5RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM5RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM6RST_SHIFT                        (4U)
#define PERI_RCC_APB1LRSTR_BIT_TIM6RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM6RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM7RST_SHIFT                        (5U)
#define PERI_RCC_APB1LRSTR_BIT_TIM7RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM7RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM12RST_SHIFT                       (6U)
#define PERI_RCC_APB1LRSTR_BIT_TIM12RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM12RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM13RST_SHIFT                       (7U)
#define PERI_RCC_APB1LRSTR_BIT_TIM13RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM13RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_TIM14RST_SHIFT                       (8U)
#define PERI_RCC_APB1LRSTR_BIT_TIM14RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_TIM14RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_LPTIM1RST_SHIFT                      (9U)
#define PERI_RCC_APB1LRSTR_BIT_LPTIM1RST_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_LPTIM1RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_SPI2RST_SHIFT                        (14U)
#define PERI_RCC_APB1LRSTR_BIT_SPI2RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_SPI2RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_SPI3RST_SHIFT                        (15U)
#define PERI_RCC_APB1LRSTR_BIT_SPI3RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_SPI3RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_SPDIFRXRST_SHIFT                     (16U)
#define PERI_RCC_APB1LRSTR_BIT_SPDIFRXRST_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_SPDIFRXRST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_USART2RST_SHIFT                      (17U)
#define PERI_RCC_APB1LRSTR_BIT_USART2RST_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_USART2RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_USART3RST_SHIFT                      (18U)
#define PERI_RCC_APB1LRSTR_BIT_USART3RST_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_USART3RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_UART4RST_SHIFT                       (19U)
#define PERI_RCC_APB1LRSTR_BIT_UART4RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_UART4RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_UART5RST_SHIFT                       (20U)
#define PERI_RCC_APB1LRSTR_BIT_UART5RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_UART5RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_I2C1RST_SHIFT                        (21U)
#define PERI_RCC_APB1LRSTR_BIT_I2C1RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_I2C1RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_I2C2RST_SHIFT                        (22U)
#define PERI_RCC_APB1LRSTR_BIT_I2C2RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_I2C2RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_I2C3RST_SHIFT                        (23U)
#define PERI_RCC_APB1LRSTR_BIT_I2C3RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_I2C3RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_CECRST_SHIFT                         (27U)
#define PERI_RCC_APB1LRSTR_BIT_CECRST_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_CECRST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_DAC12RST_SHIFT                       (29U)
#define PERI_RCC_APB1LRSTR_BIT_DAC12RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_DAC12RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_USART7RST_SHIFT                      (30U)
#define PERI_RCC_APB1LRSTR_BIT_USART7RST_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_USART7RST_SHIFT)
#define PERI_RCC_APB1LRSTR_BIT_USART8RST_SHIFT                      (31U)
#define PERI_RCC_APB1LRSTR_BIT_USART8RST_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LRSTR_BIT_USART8RST_SHIFT)

/*--- register APB1HRSTR -------------------------------------------------*/
#define PERI_RCC_APB1HRSTR_BIT_CRSRST_SHIFT                         (1U)
#define PERI_RCC_APB1HRSTR_BIT_CRSRST_MASK                          (((1U<<1)-1) << PERI_RCC_APB1HRSTR_BIT_CRSRST_SHIFT)
#define PERI_RCC_APB1HRSTR_BIT_SWPRST_SHIFT                         (2U)
#define PERI_RCC_APB1HRSTR_BIT_SWPRST_MASK                          (((1U<<1)-1) << PERI_RCC_APB1HRSTR_BIT_SWPRST_SHIFT)
#define PERI_RCC_APB1HRSTR_BIT_OPAMPRST_SHIFT                       (4U)
#define PERI_RCC_APB1HRSTR_BIT_OPAMPRST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1HRSTR_BIT_OPAMPRST_SHIFT)
#define PERI_RCC_APB1HRSTR_BIT_MDIOSRST_SHIFT                       (5U)
#define PERI_RCC_APB1HRSTR_BIT_MDIOSRST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1HRSTR_BIT_MDIOSRST_SHIFT)
#define PERI_RCC_APB1HRSTR_BIT_FDCANRST_SHIFT                       (8U)
#define PERI_RCC_APB1HRSTR_BIT_FDCANRST_MASK                        (((1U<<1)-1) << PERI_RCC_APB1HRSTR_BIT_FDCANRST_SHIFT)

/*--- register APB2RSTR -------------------------------------------------*/
#define PERI_RCC_APB2RSTR_BIT_TIM1RST_SHIFT                         (0U)
#define PERI_RCC_APB2RSTR_BIT_TIM1RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_TIM1RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_TIM8RST_SHIFT                         (1U)
#define PERI_RCC_APB2RSTR_BIT_TIM8RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_TIM8RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_USART1RST_SHIFT                       (4U)
#define PERI_RCC_APB2RSTR_BIT_USART1RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_USART1RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_USART6RST_SHIFT                       (5U)
#define PERI_RCC_APB2RSTR_BIT_USART6RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_USART6RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_SPI1RST_SHIFT                         (12U)
#define PERI_RCC_APB2RSTR_BIT_SPI1RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_SPI1RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_SPI4RST_SHIFT                         (13U)
#define PERI_RCC_APB2RSTR_BIT_SPI4RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_SPI4RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_TIM15RST_SHIFT                        (16U)
#define PERI_RCC_APB2RSTR_BIT_TIM15RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_TIM15RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_TIM16RST_SHIFT                        (17U)
#define PERI_RCC_APB2RSTR_BIT_TIM16RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_TIM16RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_TIM17RST_SHIFT                        (18U)
#define PERI_RCC_APB2RSTR_BIT_TIM17RST_MASK                         (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_TIM17RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_SPI5RST_SHIFT                         (20U)
#define PERI_RCC_APB2RSTR_BIT_SPI5RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_SPI5RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_SAI1RST_SHIFT                         (22U)
#define PERI_RCC_APB2RSTR_BIT_SAI1RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_SAI1RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_SAI2RST_SHIFT                         (23U)
#define PERI_RCC_APB2RSTR_BIT_SAI2RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_SAI2RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_SAI3RST_SHIFT                         (24U)
#define PERI_RCC_APB2RSTR_BIT_SAI3RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_SAI3RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_DFSDM1RST_SHIFT                       (28U)
#define PERI_RCC_APB2RSTR_BIT_DFSDM1RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_DFSDM1RST_SHIFT)
#define PERI_RCC_APB2RSTR_BIT_HRTIMRST_SHIFT                        (29U)
#define PERI_RCC_APB2RSTR_BIT_HRTIMRST_MASK                         (((1U<<1)-1) << PERI_RCC_APB2RSTR_BIT_HRTIMRST_SHIFT)

