minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register APB4RSTR -------------------------------------------------*/
#define PERI_RCC_APB4RSTR_BIT_SYSCFGRST_SHIFT                       (1U)
#define PERI_RCC_APB4RSTR_BIT_SYSCFGRST_MASK                        (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_SYSCFGRST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_LPUART1RST_SHIFT                      (3U)
#define PERI_RCC_APB4RSTR_BIT_LPUART1RST_MASK                       (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_LPUART1RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_SPI6RST_SHIFT                         (5U)
#define PERI_RCC_APB4RSTR_BIT_SPI6RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_SPI6RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_I2C4RST_SHIFT                         (7U)
#define PERI_RCC_APB4RSTR_BIT_I2C4RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_I2C4RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_LPTIM2RST_SHIFT                       (9U)
#define PERI_RCC_APB4RSTR_BIT_LPTIM2RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_LPTIM2RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_LPTIM3RST_SHIFT                       (10U)
#define PERI_RCC_APB4RSTR_BIT_LPTIM3RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_LPTIM3RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_LPTIM4RST_SHIFT                       (11U)
#define PERI_RCC_APB4RSTR_BIT_LPTIM4RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_LPTIM4RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_LPTIM5RST_SHIFT                       (12U)
#define PERI_RCC_APB4RSTR_BIT_LPTIM5RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_LPTIM5RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_COMP12RST_SHIFT                       (14U)
#define PERI_RCC_APB4RSTR_BIT_COMP12RST_MASK                        (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_COMP12RST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_VREFRST_SHIFT                         (15U)
#define PERI_RCC_APB4RSTR_BIT_VREFRST_MASK                          (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_VREFRST_SHIFT)
#define PERI_RCC_APB4RSTR_BIT_SAI4RST_SHIFT                         (21U)
#define PERI_RCC_APB4RSTR_BIT_SAI4RST_MASK                          (((1U<<1)-1) << PERI_RCC_APB4RSTR_BIT_SAI4RST_SHIFT)

/*--- register GCR -------------------------------------------------*/
#define PERI_RCC_GCR_BIT_WW1RSC_SHIFT                               (0U)
#define PERI_RCC_GCR_BIT_WW1RSC_MASK                                (((1U<<1)-1) << PERI_RCC_GCR_BIT_WW1RSC_SHIFT)

/*--- register D3AMR -------------------------------------------------*/
#define PERI_RCC_D3AMR_BIT_BDMAAMEN_SHIFT                           (0U)
#define PERI_RCC_D3AMR_BIT_BDMAAMEN_MASK                            (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_BDMAAMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_LPUART1AMEN_SHIFT                        (3U)
#define PERI_RCC_D3AMR_BIT_LPUART1AMEN_MASK                         (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_LPUART1AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_SPI6AMEN_SHIFT                           (5U)
#define PERI_RCC_D3AMR_BIT_SPI6AMEN_MASK                            (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_SPI6AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_I2C4AMEN_SHIFT                           (7U)
#define PERI_RCC_D3AMR_BIT_I2C4AMEN_MASK                            (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_I2C4AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_LPTIM2AMEN_SHIFT                         (9U)
#define PERI_RCC_D3AMR_BIT_LPTIM2AMEN_MASK                          (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_LPTIM2AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_LPTIM3AMEN_SHIFT                         (10U)
#define PERI_RCC_D3AMR_BIT_LPTIM3AMEN_MASK                          (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_LPTIM3AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_LPTIM4AMEN_SHIFT                         (11U)
#define PERI_RCC_D3AMR_BIT_LPTIM4AMEN_MASK                          (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_LPTIM4AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_LPTIM5AMEN_SHIFT                         (12U)
#define PERI_RCC_D3AMR_BIT_LPTIM5AMEN_MASK                          (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_LPTIM5AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_COMP12AMEN_SHIFT                         (14U)
#define PERI_RCC_D3AMR_BIT_COMP12AMEN_MASK                          (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_COMP12AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_VREFAMEN_SHIFT                           (15U)
#define PERI_RCC_D3AMR_BIT_VREFAMEN_MASK                            (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_VREFAMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_RTCAMEN_SHIFT                            (16U)
#define PERI_RCC_D3AMR_BIT_RTCAMEN_MASK                             (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_RTCAMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_CRCAMEN_SHIFT                            (19U)
#define PERI_RCC_D3AMR_BIT_CRCAMEN_MASK                             (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_CRCAMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_SAI4AMEN_SHIFT                           (21U)
#define PERI_RCC_D3AMR_BIT_SAI4AMEN_MASK                            (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_SAI4AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_ADC3AMEN_SHIFT                           (24U)
#define PERI_RCC_D3AMR_BIT_ADC3AMEN_MASK                            (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_ADC3AMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_BKPRAMAMEN_SHIFT                         (28U)
#define PERI_RCC_D3AMR_BIT_BKPRAMAMEN_MASK                          (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_BKPRAMAMEN_SHIFT)
#define PERI_RCC_D3AMR_BIT_SRAM4AMEN_SHIFT                          (29U)
#define PERI_RCC_D3AMR_BIT_SRAM4AMEN_MASK                           (((1U<<1)-1) << PERI_RCC_D3AMR_BIT_SRAM4AMEN_SHIFT)

/*--- register RSR -------------------------------------------------*/
#define PERI_RCC_RSR_BIT_RMVF_SHIFT                                 (16U)
#define PERI_RCC_RSR_BIT_RMVF_MASK                                  (((1U<<1)-1) << PERI_RCC_RSR_BIT_RMVF_SHIFT)
#define PERI_RCC_RSR_BIT_CPURSTF_SHIFT                              (17U)
#define PERI_RCC_RSR_BIT_CPURSTF_MASK                               (((1U<<1)-1) << PERI_RCC_RSR_BIT_CPURSTF_SHIFT)
#define PERI_RCC_RSR_BIT_D1RSTF_SHIFT                               (19U)
#define PERI_RCC_RSR_BIT_D1RSTF_MASK                                (((1U<<1)-1) << PERI_RCC_RSR_BIT_D1RSTF_SHIFT)
#define PERI_RCC_RSR_BIT_D2RSTF_SHIFT                               (20U)
#define PERI_RCC_RSR_BIT_D2RSTF_MASK                                (((1U<<1)-1) << PERI_RCC_RSR_BIT_D2RSTF_SHIFT)
#define PERI_RCC_RSR_BIT_BORRSTF_SHIFT                              (21U)
#define PERI_RCC_RSR_BIT_BORRSTF_MASK                               (((1U<<1)-1) << PERI_RCC_RSR_BIT_BORRSTF_SHIFT)
#define PERI_RCC_RSR_BIT_PINRSTF_SHIFT                              (22U)
#define PERI_RCC_RSR_BIT_PINRSTF_MASK                               (((1U<<1)-1) << PERI_RCC_RSR_BIT_PINRSTF_SHIFT)
#define PERI_RCC_RSR_BIT_PORRSTF_SHIFT                              (23U)
#define PERI_RCC_RSR_BIT_PORRSTF_MASK                               (((1U<<1)-1) << PERI_RCC_RSR_BIT_PORRSTF_SHIFT)
#define PERI_RCC_RSR_BIT_SFTRSTF_SHIFT                              (24U)
#define PERI_RCC_RSR_BIT_SFTRSTF_MASK                               (((1U<<1)-1) << PERI_RCC_RSR_BIT_SFTRSTF_SHIFT)
#define PERI_RCC_RSR_BIT_IWDG1RSTF_SHIFT                            (26U)
#define PERI_RCC_RSR_BIT_IWDG1RSTF_MASK                             (((1U<<1)-1) << PERI_RCC_RSR_BIT_IWDG1RSTF_SHIFT)
#define PERI_RCC_RSR_BIT_WWDG1RSTF_SHIFT                            (28U)
#define PERI_RCC_RSR_BIT_WWDG1RSTF_MASK                             (((1U<<1)-1) << PERI_RCC_RSR_BIT_WWDG1RSTF_SHIFT)
#define PERI_RCC_RSR_BIT_LPWRRSTF_SHIFT                             (30U)
#define PERI_RCC_RSR_BIT_LPWRRSTF_MASK                              (((1U<<1)-1) << PERI_RCC_RSR_BIT_LPWRRSTF_SHIFT)

