minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register AHB3ENR -------------------------------------------------*/
#define PERI_RCC_AHB3ENR_BIT_MDMAEN_SHIFT                           (0U)
#define PERI_RCC_AHB3ENR_BIT_MDMAEN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB3ENR_BIT_MDMAEN_SHIFT)
#define PERI_RCC_AHB3ENR_BIT_DMA2DEN_SHIFT                          (4U)
#define PERI_RCC_AHB3ENR_BIT_DMA2DEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB3ENR_BIT_DMA2DEN_SHIFT)
#define PERI_RCC_AHB3ENR_BIT_JPGDECEN_SHIFT                         (5U)
#define PERI_RCC_AHB3ENR_BIT_JPGDECEN_MASK                          (((1U<<1)-1) << PERI_RCC_AHB3ENR_BIT_JPGDECEN_SHIFT)
#define PERI_RCC_AHB3ENR_BIT_FMCEN_SHIFT                            (12U)
#define PERI_RCC_AHB3ENR_BIT_FMCEN_MASK                             (((1U<<1)-1) << PERI_RCC_AHB3ENR_BIT_FMCEN_SHIFT)
#define PERI_RCC_AHB3ENR_BIT_QSPIEN_SHIFT                           (14U)
#define PERI_RCC_AHB3ENR_BIT_QSPIEN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB3ENR_BIT_QSPIEN_SHIFT)
#define PERI_RCC_AHB3ENR_BIT_SDMMC1EN_SHIFT                         (16U)
#define PERI_RCC_AHB3ENR_BIT_SDMMC1EN_MASK                          (((1U<<1)-1) << PERI_RCC_AHB3ENR_BIT_SDMMC1EN_SHIFT)

/*--- register AHB1ENR -------------------------------------------------*/
#define PERI_RCC_AHB1ENR_BIT_DMA1EN_SHIFT                           (0U)
#define PERI_RCC_AHB1ENR_BIT_DMA1EN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_DMA1EN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_DMA2EN_SHIFT                           (1U)
#define PERI_RCC_AHB1ENR_BIT_DMA2EN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_DMA2EN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_ADC12EN_SHIFT                          (5U)
#define PERI_RCC_AHB1ENR_BIT_ADC12EN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_ADC12EN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_ETH1MACEN_SHIFT                        (15U)
#define PERI_RCC_AHB1ENR_BIT_ETH1MACEN_MASK                         (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_ETH1MACEN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_ETH1TXEN_SHIFT                         (16U)
#define PERI_RCC_AHB1ENR_BIT_ETH1TXEN_MASK                          (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_ETH1TXEN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_ETH1RXEN_SHIFT                         (17U)
#define PERI_RCC_AHB1ENR_BIT_ETH1RXEN_MASK                          (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_ETH1RXEN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_USB1OTGHSEN_SHIFT                      (25U)
#define PERI_RCC_AHB1ENR_BIT_USB1OTGHSEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_USB1OTGHSEN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_USB1OTGHSULPIEN_SHIFT                  (26U)
#define PERI_RCC_AHB1ENR_BIT_USB1OTGHSULPIEN_MASK                   (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_USB1OTGHSULPIEN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_USB2OTGHSEN_SHIFT                      (27U)
#define PERI_RCC_AHB1ENR_BIT_USB2OTGHSEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_USB2OTGHSEN_SHIFT)
#define PERI_RCC_AHB1ENR_BIT_USB2OTGHSULPIEN_SHIFT                  (28U)
#define PERI_RCC_AHB1ENR_BIT_USB2OTGHSULPIEN_MASK                   (((1U<<1)-1) << PERI_RCC_AHB1ENR_BIT_USB2OTGHSULPIEN_SHIFT)

/*--- register AHB2ENR -------------------------------------------------*/
#define PERI_RCC_AHB2ENR_BIT_DCMIEN_SHIFT                           (0U)
#define PERI_RCC_AHB2ENR_BIT_DCMIEN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_DCMIEN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_CRYPTEN_SHIFT                          (4U)
#define PERI_RCC_AHB2ENR_BIT_CRYPTEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_CRYPTEN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_HASHEN_SHIFT                           (5U)
#define PERI_RCC_AHB2ENR_BIT_HASHEN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_HASHEN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_RNGEN_SHIFT                            (6U)
#define PERI_RCC_AHB2ENR_BIT_RNGEN_MASK                             (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_RNGEN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_SDMMC2EN_SHIFT                         (9U)
#define PERI_RCC_AHB2ENR_BIT_SDMMC2EN_MASK                          (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_SDMMC2EN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_SRAM1EN_SHIFT                          (29U)
#define PERI_RCC_AHB2ENR_BIT_SRAM1EN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_SRAM1EN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_SRAM2EN_SHIFT                          (30U)
#define PERI_RCC_AHB2ENR_BIT_SRAM2EN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_SRAM2EN_SHIFT)
#define PERI_RCC_AHB2ENR_BIT_SRAM3EN_SHIFT                          (31U)
#define PERI_RCC_AHB2ENR_BIT_SRAM3EN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB2ENR_BIT_SRAM3EN_SHIFT)

/*--- register AHB4ENR -------------------------------------------------*/
#define PERI_RCC_AHB4ENR_BIT_GPIOAEN_SHIFT                          (0U)
#define PERI_RCC_AHB4ENR_BIT_GPIOAEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOAEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOBEN_SHIFT                          (1U)
#define PERI_RCC_AHB4ENR_BIT_GPIOBEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOBEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOCEN_SHIFT                          (2U)
#define PERI_RCC_AHB4ENR_BIT_GPIOCEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOCEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIODEN_SHIFT                          (3U)
#define PERI_RCC_AHB4ENR_BIT_GPIODEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIODEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOEEN_SHIFT                          (4U)
#define PERI_RCC_AHB4ENR_BIT_GPIOEEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOEEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOFEN_SHIFT                          (5U)
#define PERI_RCC_AHB4ENR_BIT_GPIOFEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOFEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOGEN_SHIFT                          (6U)
#define PERI_RCC_AHB4ENR_BIT_GPIOGEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOGEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOHEN_SHIFT                          (7U)
#define PERI_RCC_AHB4ENR_BIT_GPIOHEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOHEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOIEN_SHIFT                          (8U)
#define PERI_RCC_AHB4ENR_BIT_GPIOIEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOIEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOJEN_SHIFT                          (9U)
#define PERI_RCC_AHB4ENR_BIT_GPIOJEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOJEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_GPIOKEN_SHIFT                          (10U)
#define PERI_RCC_AHB4ENR_BIT_GPIOKEN_MASK                           (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_GPIOKEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_CRCEN_SHIFT                            (19U)
#define PERI_RCC_AHB4ENR_BIT_CRCEN_MASK                             (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_CRCEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_BDMAEN_SHIFT                           (21U)
#define PERI_RCC_AHB4ENR_BIT_BDMAEN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_BDMAEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_ADC3EN_SHIFT                           (24U)
#define PERI_RCC_AHB4ENR_BIT_ADC3EN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_ADC3EN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_HSEMEN_SHIFT                           (25U)
#define PERI_RCC_AHB4ENR_BIT_HSEMEN_MASK                            (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_HSEMEN_SHIFT)
#define PERI_RCC_AHB4ENR_BIT_BKPRAMEN_SHIFT                         (28U)
#define PERI_RCC_AHB4ENR_BIT_BKPRAMEN_MASK                          (((1U<<1)-1) << PERI_RCC_AHB4ENR_BIT_BKPRAMEN_SHIFT)

/*--- register APB3ENR -------------------------------------------------*/
#define PERI_RCC_APB3ENR_BIT_LTDCEN_SHIFT                           (3U)
#define PERI_RCC_APB3ENR_BIT_LTDCEN_MASK                            (((1U<<1)-1) << PERI_RCC_APB3ENR_BIT_LTDCEN_SHIFT)
#define PERI_RCC_APB3ENR_BIT_WWDG1EN_SHIFT                          (6U)
#define PERI_RCC_APB3ENR_BIT_WWDG1EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB3ENR_BIT_WWDG1EN_SHIFT)

/*--- register APB1LENR -------------------------------------------------*/
#define PERI_RCC_APB1LENR_BIT_TIM2EN_SHIFT                          (0U)
#define PERI_RCC_APB1LENR_BIT_TIM2EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM2EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM3EN_SHIFT                          (1U)
#define PERI_RCC_APB1LENR_BIT_TIM3EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM3EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM4EN_SHIFT                          (2U)
#define PERI_RCC_APB1LENR_BIT_TIM4EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM4EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM5EN_SHIFT                          (3U)
#define PERI_RCC_APB1LENR_BIT_TIM5EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM5EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM6EN_SHIFT                          (4U)
#define PERI_RCC_APB1LENR_BIT_TIM6EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM6EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM7EN_SHIFT                          (5U)
#define PERI_RCC_APB1LENR_BIT_TIM7EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM7EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM12EN_SHIFT                         (6U)
#define PERI_RCC_APB1LENR_BIT_TIM12EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM12EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM13EN_SHIFT                         (7U)
#define PERI_RCC_APB1LENR_BIT_TIM13EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM13EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_TIM14EN_SHIFT                         (8U)
#define PERI_RCC_APB1LENR_BIT_TIM14EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_TIM14EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_LPTIM1EN_SHIFT                        (9U)
#define PERI_RCC_APB1LENR_BIT_LPTIM1EN_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_LPTIM1EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_SPI2EN_SHIFT                          (14U)
#define PERI_RCC_APB1LENR_BIT_SPI2EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_SPI2EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_SPI3EN_SHIFT                          (15U)
#define PERI_RCC_APB1LENR_BIT_SPI3EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_SPI3EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_SPDIFRXEN_SHIFT                       (16U)
#define PERI_RCC_APB1LENR_BIT_SPDIFRXEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_SPDIFRXEN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_USART2EN_SHIFT                        (17U)
#define PERI_RCC_APB1LENR_BIT_USART2EN_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_USART2EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_USART3EN_SHIFT                        (18U)
#define PERI_RCC_APB1LENR_BIT_USART3EN_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_USART3EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_UART4EN_SHIFT                         (19U)
#define PERI_RCC_APB1LENR_BIT_UART4EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_UART4EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_UART5EN_SHIFT                         (20U)
#define PERI_RCC_APB1LENR_BIT_UART5EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_UART5EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_I2C1EN_SHIFT                          (21U)
#define PERI_RCC_APB1LENR_BIT_I2C1EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_I2C1EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_I2C2EN_SHIFT                          (22U)
#define PERI_RCC_APB1LENR_BIT_I2C2EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_I2C2EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_I2C3EN_SHIFT                          (23U)
#define PERI_RCC_APB1LENR_BIT_I2C3EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_I2C3EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_CECEN_SHIFT                           (27U)
#define PERI_RCC_APB1LENR_BIT_CECEN_MASK                            (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_CECEN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_DAC12EN_SHIFT                         (29U)
#define PERI_RCC_APB1LENR_BIT_DAC12EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_DAC12EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_USART7EN_SHIFT                        (30U)
#define PERI_RCC_APB1LENR_BIT_USART7EN_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_USART7EN_SHIFT)
#define PERI_RCC_APB1LENR_BIT_USART8EN_SHIFT                        (31U)
#define PERI_RCC_APB1LENR_BIT_USART8EN_MASK                         (((1U<<1)-1) << PERI_RCC_APB1LENR_BIT_USART8EN_SHIFT)

/*--- register APB1HENR -------------------------------------------------*/
#define PERI_RCC_APB1HENR_BIT_CRSEN_SHIFT                           (1U)
#define PERI_RCC_APB1HENR_BIT_CRSEN_MASK                            (((1U<<1)-1) << PERI_RCC_APB1HENR_BIT_CRSEN_SHIFT)
#define PERI_RCC_APB1HENR_BIT_SWPEN_SHIFT                           (2U)
#define PERI_RCC_APB1HENR_BIT_SWPEN_MASK                            (((1U<<1)-1) << PERI_RCC_APB1HENR_BIT_SWPEN_SHIFT)
#define PERI_RCC_APB1HENR_BIT_OPAMPEN_SHIFT                         (4U)
#define PERI_RCC_APB1HENR_BIT_OPAMPEN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1HENR_BIT_OPAMPEN_SHIFT)
#define PERI_RCC_APB1HENR_BIT_MDIOSEN_SHIFT                         (5U)
#define PERI_RCC_APB1HENR_BIT_MDIOSEN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1HENR_BIT_MDIOSEN_SHIFT)
#define PERI_RCC_APB1HENR_BIT_FDCANEN_SHIFT                         (8U)
#define PERI_RCC_APB1HENR_BIT_FDCANEN_MASK                          (((1U<<1)-1) << PERI_RCC_APB1HENR_BIT_FDCANEN_SHIFT)

/*--- register APB2ENR -------------------------------------------------*/
#define PERI_RCC_APB2ENR_BIT_TIM1EN_SHIFT                           (0U)
#define PERI_RCC_APB2ENR_BIT_TIM1EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_TIM1EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_TIM8EN_SHIFT                           (1U)
#define PERI_RCC_APB2ENR_BIT_TIM8EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_TIM8EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_USART1EN_SHIFT                         (4U)
#define PERI_RCC_APB2ENR_BIT_USART1EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_USART1EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_USART6EN_SHIFT                         (5U)
#define PERI_RCC_APB2ENR_BIT_USART6EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_USART6EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_SPI1EN_SHIFT                           (12U)
#define PERI_RCC_APB2ENR_BIT_SPI1EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_SPI1EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_SPI4EN_SHIFT                           (13U)
#define PERI_RCC_APB2ENR_BIT_SPI4EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_SPI4EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_TIM15EN_SHIFT                          (16U)
#define PERI_RCC_APB2ENR_BIT_TIM15EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_TIM15EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_TIM16EN_SHIFT                          (17U)
#define PERI_RCC_APB2ENR_BIT_TIM16EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_TIM16EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_TIM17EN_SHIFT                          (18U)
#define PERI_RCC_APB2ENR_BIT_TIM17EN_MASK                           (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_TIM17EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_SPI5EN_SHIFT                           (20U)
#define PERI_RCC_APB2ENR_BIT_SPI5EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_SPI5EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_SAI1EN_SHIFT                           (22U)
#define PERI_RCC_APB2ENR_BIT_SAI1EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_SAI1EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_SAI2EN_SHIFT                           (23U)
#define PERI_RCC_APB2ENR_BIT_SAI2EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_SAI2EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_SAI3EN_SHIFT                           (24U)
#define PERI_RCC_APB2ENR_BIT_SAI3EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_SAI3EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_DFSDM1EN_SHIFT                         (28U)
#define PERI_RCC_APB2ENR_BIT_DFSDM1EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_DFSDM1EN_SHIFT)
#define PERI_RCC_APB2ENR_BIT_HRTIMEN_SHIFT                          (29U)
#define PERI_RCC_APB2ENR_BIT_HRTIMEN_MASK                           (((1U<<1)-1) << PERI_RCC_APB2ENR_BIT_HRTIMEN_SHIFT)

