minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register APB4ENR -------------------------------------------------*/
#define PERI_RCC_APB4ENR_BIT_SYSCFGEN_SHIFT                         (1U)
#define PERI_RCC_APB4ENR_BIT_SYSCFGEN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_SYSCFGEN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_LPUART1EN_SHIFT                        (3U)
#define PERI_RCC_APB4ENR_BIT_LPUART1EN_MASK                         (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_LPUART1EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_SPI6EN_SHIFT                           (5U)
#define PERI_RCC_APB4ENR_BIT_SPI6EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_SPI6EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_I2C4EN_SHIFT                           (7U)
#define PERI_RCC_APB4ENR_BIT_I2C4EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_I2C4EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_LPTIM2EN_SHIFT                         (9U)
#define PERI_RCC_APB4ENR_BIT_LPTIM2EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_LPTIM2EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_LPTIM3EN_SHIFT                         (10U)
#define PERI_RCC_APB4ENR_BIT_LPTIM3EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_LPTIM3EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_LPTIM4EN_SHIFT                         (11U)
#define PERI_RCC_APB4ENR_BIT_LPTIM4EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_LPTIM4EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_LPTIM5EN_SHIFT                         (12U)
#define PERI_RCC_APB4ENR_BIT_LPTIM5EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_LPTIM5EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_COMP12EN_SHIFT                         (14U)
#define PERI_RCC_APB4ENR_BIT_COMP12EN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_COMP12EN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_VREFEN_SHIFT                           (15U)
#define PERI_RCC_APB4ENR_BIT_VREFEN_MASK                            (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_VREFEN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_RTCAPBEN_SHIFT                         (16U)
#define PERI_RCC_APB4ENR_BIT_RTCAPBEN_MASK                          (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_RTCAPBEN_SHIFT)
#define PERI_RCC_APB4ENR_BIT_SAI4EN_SHIFT                           (21U)
#define PERI_RCC_APB4ENR_BIT_SAI4EN_MASK                            (((1U<<1)-1) << PERI_RCC_APB4ENR_BIT_SAI4EN_SHIFT)

/*--- register AHB3LPENR -------------------------------------------------*/
#define PERI_RCC_AHB3LPENR_BIT_MDMALPEN_SHIFT                       (0U)
#define PERI_RCC_AHB3LPENR_BIT_MDMALPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_MDMALPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_DMA2DLPEN_SHIFT                      (4U)
#define PERI_RCC_AHB3LPENR_BIT_DMA2DLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_DMA2DLPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_JPGDECLPEN_SHIFT                     (5U)
#define PERI_RCC_AHB3LPENR_BIT_JPGDECLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_JPGDECLPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_FLASHLPEN_SHIFT                      (8U)
#define PERI_RCC_AHB3LPENR_BIT_FLASHLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_FLASHLPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_FMCLPEN_SHIFT                        (12U)
#define PERI_RCC_AHB3LPENR_BIT_FMCLPEN_MASK                         (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_FMCLPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_QSPILPEN_SHIFT                       (14U)
#define PERI_RCC_AHB3LPENR_BIT_QSPILPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_QSPILPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_SDMMC1LPEN_SHIFT                     (16U)
#define PERI_RCC_AHB3LPENR_BIT_SDMMC1LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_SDMMC1LPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_D1DTCM1LPEN_SHIFT                    (28U)
#define PERI_RCC_AHB3LPENR_BIT_D1DTCM1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_D1DTCM1LPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_DTCM2LPEN_SHIFT                      (29U)
#define PERI_RCC_AHB3LPENR_BIT_DTCM2LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_DTCM2LPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_ITCMLPEN_SHIFT                       (30U)
#define PERI_RCC_AHB3LPENR_BIT_ITCMLPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_ITCMLPEN_SHIFT)
#define PERI_RCC_AHB3LPENR_BIT_AXISRAMLPEN_SHIFT                    (31U)
#define PERI_RCC_AHB3LPENR_BIT_AXISRAMLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_AHB3LPENR_BIT_AXISRAMLPEN_SHIFT)

/*--- register AHB1LPENR -------------------------------------------------*/
#define PERI_RCC_AHB1LPENR_BIT_DMA1LPEN_SHIFT                       (0U)
#define PERI_RCC_AHB1LPENR_BIT_DMA1LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_DMA1LPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_DMA2LPEN_SHIFT                       (1U)
#define PERI_RCC_AHB1LPENR_BIT_DMA2LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_DMA2LPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_ADC12LPEN_SHIFT                      (5U)
#define PERI_RCC_AHB1LPENR_BIT_ADC12LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_ADC12LPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_ETH1MACLPEN_SHIFT                    (15U)
#define PERI_RCC_AHB1LPENR_BIT_ETH1MACLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_ETH1MACLPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_ETH1TXLPEN_SHIFT                     (16U)
#define PERI_RCC_AHB1LPENR_BIT_ETH1TXLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_ETH1TXLPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_ETH1RXLPEN_SHIFT                     (17U)
#define PERI_RCC_AHB1LPENR_BIT_ETH1RXLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_ETH1RXLPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_USB1OTGHSLPEN_SHIFT                  (25U)
#define PERI_RCC_AHB1LPENR_BIT_USB1OTGHSLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_USB1OTGHSLPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_USB1OTGHSULPILPEN_SHIFT              (26U)
#define PERI_RCC_AHB1LPENR_BIT_USB1OTGHSULPILPEN_MASK               (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_USB1OTGHSULPILPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_USB2OTGHSLPEN_SHIFT                  (27U)
#define PERI_RCC_AHB1LPENR_BIT_USB2OTGHSLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_USB2OTGHSLPEN_SHIFT)
#define PERI_RCC_AHB1LPENR_BIT_USB2OTGHSULPILPEN_SHIFT              (28U)
#define PERI_RCC_AHB1LPENR_BIT_USB2OTGHSULPILPEN_MASK               (((1U<<1)-1) << PERI_RCC_AHB1LPENR_BIT_USB2OTGHSULPILPEN_SHIFT)

