minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register AHB2LPENR -------------------------------------------------*/
#define PERI_RCC_AHB2LPENR_BIT_CAMITFLPEN_SHIFT                     (0U)
#define PERI_RCC_AHB2LPENR_BIT_CAMITFLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_CAMITFLPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_CRYPTLPEN_SHIFT                      (4U)
#define PERI_RCC_AHB2LPENR_BIT_CRYPTLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_CRYPTLPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_HASHLPEN_SHIFT                       (5U)
#define PERI_RCC_AHB2LPENR_BIT_HASHLPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_HASHLPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_RNGLPEN_SHIFT                        (6U)
#define PERI_RCC_AHB2LPENR_BIT_RNGLPEN_MASK                         (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_RNGLPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_SDMMC2LPEN_SHIFT                     (9U)
#define PERI_RCC_AHB2LPENR_BIT_SDMMC2LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_SDMMC2LPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_SRAM1LPEN_SHIFT                      (29U)
#define PERI_RCC_AHB2LPENR_BIT_SRAM1LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_SRAM1LPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_SRAM2LPEN_SHIFT                      (30U)
#define PERI_RCC_AHB2LPENR_BIT_SRAM2LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_SRAM2LPEN_SHIFT)
#define PERI_RCC_AHB2LPENR_BIT_SRAM3LPEN_SHIFT                      (31U)
#define PERI_RCC_AHB2LPENR_BIT_SRAM3LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB2LPENR_BIT_SRAM3LPEN_SHIFT)

/*--- register AHB4LPENR -------------------------------------------------*/
#define PERI_RCC_AHB4LPENR_BIT_GPIOALPEN_SHIFT                      (0U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOALPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOALPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOBLPEN_SHIFT                      (1U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOBLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOBLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOCLPEN_SHIFT                      (2U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOCLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOCLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIODLPEN_SHIFT                      (3U)
#define PERI_RCC_AHB4LPENR_BIT_GPIODLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIODLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOELPEN_SHIFT                      (4U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOELPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOELPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOFLPEN_SHIFT                      (5U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOFLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOFLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOGLPEN_SHIFT                      (6U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOGLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOGLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOHLPEN_SHIFT                      (7U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOHLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOHLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOILPEN_SHIFT                      (8U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOILPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOILPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOJLPEN_SHIFT                      (9U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOJLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOJLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_GPIOKLPEN_SHIFT                      (10U)
#define PERI_RCC_AHB4LPENR_BIT_GPIOKLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_GPIOKLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_CRCLPEN_SHIFT                        (19U)
#define PERI_RCC_AHB4LPENR_BIT_CRCLPEN_MASK                         (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_CRCLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_BDMALPEN_SHIFT                       (21U)
#define PERI_RCC_AHB4LPENR_BIT_BDMALPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_BDMALPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_ADC3LPEN_SHIFT                       (24U)
#define PERI_RCC_AHB4LPENR_BIT_ADC3LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_ADC3LPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_BKPRAMLPEN_SHIFT                     (28U)
#define PERI_RCC_AHB4LPENR_BIT_BKPRAMLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_BKPRAMLPEN_SHIFT)
#define PERI_RCC_AHB4LPENR_BIT_SRAM4LPEN_SHIFT                      (29U)
#define PERI_RCC_AHB4LPENR_BIT_SRAM4LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_AHB4LPENR_BIT_SRAM4LPEN_SHIFT)

/*--- register APB3LPENR -------------------------------------------------*/
#define PERI_RCC_APB3LPENR_BIT_LTDCLPEN_SHIFT                       (3U)
#define PERI_RCC_APB3LPENR_BIT_LTDCLPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB3LPENR_BIT_LTDCLPEN_SHIFT)
#define PERI_RCC_APB3LPENR_BIT_WWDG1LPEN_SHIFT                      (6U)
#define PERI_RCC_APB3LPENR_BIT_WWDG1LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB3LPENR_BIT_WWDG1LPEN_SHIFT)

/*--- register APB1LLPENR -------------------------------------------------*/
#define PERI_RCC_APB1LLPENR_BIT_TIM2LPEN_SHIFT                      (0U)
#define PERI_RCC_APB1LLPENR_BIT_TIM2LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM2LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM3LPEN_SHIFT                      (1U)
#define PERI_RCC_APB1LLPENR_BIT_TIM3LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM3LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM4LPEN_SHIFT                      (2U)
#define PERI_RCC_APB1LLPENR_BIT_TIM4LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM4LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM5LPEN_SHIFT                      (3U)
#define PERI_RCC_APB1LLPENR_BIT_TIM5LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM5LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM6LPEN_SHIFT                      (4U)
#define PERI_RCC_APB1LLPENR_BIT_TIM6LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM6LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM7LPEN_SHIFT                      (5U)
#define PERI_RCC_APB1LLPENR_BIT_TIM7LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM7LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM12LPEN_SHIFT                     (6U)
#define PERI_RCC_APB1LLPENR_BIT_TIM12LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM12LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM13LPEN_SHIFT                     (7U)
#define PERI_RCC_APB1LLPENR_BIT_TIM13LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM13LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_TIM14LPEN_SHIFT                     (8U)
#define PERI_RCC_APB1LLPENR_BIT_TIM14LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_TIM14LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_LPTIM1LPEN_SHIFT                    (9U)
#define PERI_RCC_APB1LLPENR_BIT_LPTIM1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_LPTIM1LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_SPI2LPEN_SHIFT                      (14U)
#define PERI_RCC_APB1LLPENR_BIT_SPI2LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_SPI2LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_SPI3LPEN_SHIFT                      (15U)
#define PERI_RCC_APB1LLPENR_BIT_SPI3LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_SPI3LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_SPDIFRXLPEN_SHIFT                   (16U)
#define PERI_RCC_APB1LLPENR_BIT_SPDIFRXLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_SPDIFRXLPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_USART2LPEN_SHIFT                    (17U)
#define PERI_RCC_APB1LLPENR_BIT_USART2LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_USART2LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_USART3LPEN_SHIFT                    (18U)
#define PERI_RCC_APB1LLPENR_BIT_USART3LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_USART3LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_UART4LPEN_SHIFT                     (19U)
#define PERI_RCC_APB1LLPENR_BIT_UART4LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_UART4LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_UART5LPEN_SHIFT                     (20U)
#define PERI_RCC_APB1LLPENR_BIT_UART5LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_UART5LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_I2C1LPEN_SHIFT                      (21U)
#define PERI_RCC_APB1LLPENR_BIT_I2C1LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_I2C1LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_I2C2LPEN_SHIFT                      (22U)
#define PERI_RCC_APB1LLPENR_BIT_I2C2LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_I2C2LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_I2C3LPEN_SHIFT                      (23U)
#define PERI_RCC_APB1LLPENR_BIT_I2C3LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_I2C3LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_HDMICECLPEN_SHIFT                   (27U)
#define PERI_RCC_APB1LLPENR_BIT_HDMICECLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_HDMICECLPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_DAC12LPEN_SHIFT                     (29U)
#define PERI_RCC_APB1LLPENR_BIT_DAC12LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_DAC12LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_USART7LPEN_SHIFT                    (30U)
#define PERI_RCC_APB1LLPENR_BIT_USART7LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_USART7LPEN_SHIFT)
#define PERI_RCC_APB1LLPENR_BIT_USART8LPEN_SHIFT                    (31U)
#define PERI_RCC_APB1LLPENR_BIT_USART8LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_APB1LLPENR_BIT_USART8LPEN_SHIFT)

/*--- register APB1HLPENR -------------------------------------------------*/
#define PERI_RCC_APB1HLPENR_BIT_CRSLPEN_SHIFT                       (1U)
#define PERI_RCC_APB1HLPENR_BIT_CRSLPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB1HLPENR_BIT_CRSLPEN_SHIFT)
#define PERI_RCC_APB1HLPENR_BIT_SWPLPEN_SHIFT                       (2U)
#define PERI_RCC_APB1HLPENR_BIT_SWPLPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB1HLPENR_BIT_SWPLPEN_SHIFT)
#define PERI_RCC_APB1HLPENR_BIT_OPAMPLPEN_SHIFT                     (4U)
#define PERI_RCC_APB1HLPENR_BIT_OPAMPLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1HLPENR_BIT_OPAMPLPEN_SHIFT)
#define PERI_RCC_APB1HLPENR_BIT_MDIOSLPEN_SHIFT                     (5U)
#define PERI_RCC_APB1HLPENR_BIT_MDIOSLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1HLPENR_BIT_MDIOSLPEN_SHIFT)
#define PERI_RCC_APB1HLPENR_BIT_FDCANLPEN_SHIFT                     (8U)
#define PERI_RCC_APB1HLPENR_BIT_FDCANLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB1HLPENR_BIT_FDCANLPEN_SHIFT)

/*--- register APB2LPENR -------------------------------------------------*/
#define PERI_RCC_APB2LPENR_BIT_TIM1LPEN_SHIFT                       (0U)
#define PERI_RCC_APB2LPENR_BIT_TIM1LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_TIM1LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_TIM8LPEN_SHIFT                       (1U)
#define PERI_RCC_APB2LPENR_BIT_TIM8LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_TIM8LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_USART1LPEN_SHIFT                     (4U)
#define PERI_RCC_APB2LPENR_BIT_USART1LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_USART1LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_USART6LPEN_SHIFT                     (5U)
#define PERI_RCC_APB2LPENR_BIT_USART6LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_USART6LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_SPI1LPEN_SHIFT                       (12U)
#define PERI_RCC_APB2LPENR_BIT_SPI1LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_SPI1LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_SPI4LPEN_SHIFT                       (13U)
#define PERI_RCC_APB2LPENR_BIT_SPI4LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_SPI4LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_TIM15LPEN_SHIFT                      (16U)
#define PERI_RCC_APB2LPENR_BIT_TIM15LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_TIM15LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_TIM16LPEN_SHIFT                      (17U)
#define PERI_RCC_APB2LPENR_BIT_TIM16LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_TIM16LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_TIM17LPEN_SHIFT                      (18U)
#define PERI_RCC_APB2LPENR_BIT_TIM17LPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_TIM17LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_SPI5LPEN_SHIFT                       (20U)
#define PERI_RCC_APB2LPENR_BIT_SPI5LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_SPI5LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_SAI1LPEN_SHIFT                       (22U)
#define PERI_RCC_APB2LPENR_BIT_SAI1LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_SAI1LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_SAI2LPEN_SHIFT                       (23U)
#define PERI_RCC_APB2LPENR_BIT_SAI2LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_SAI2LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_SAI3LPEN_SHIFT                       (24U)
#define PERI_RCC_APB2LPENR_BIT_SAI3LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_SAI3LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_DFSDM1LPEN_SHIFT                     (28U)
#define PERI_RCC_APB2LPENR_BIT_DFSDM1LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_DFSDM1LPEN_SHIFT)
#define PERI_RCC_APB2LPENR_BIT_HRTIMLPEN_SHIFT                      (29U)
#define PERI_RCC_APB2LPENR_BIT_HRTIMLPEN_MASK                       (((1U<<1)-1) << PERI_RCC_APB2LPENR_BIT_HRTIMLPEN_SHIFT)

/*--- register APB4LPENR -------------------------------------------------*/
#define PERI_RCC_APB4LPENR_BIT_SYSCFGLPEN_SHIFT                     (1U)
#define PERI_RCC_APB4LPENR_BIT_SYSCFGLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_SYSCFGLPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_LPUART1LPEN_SHIFT                    (3U)
#define PERI_RCC_APB4LPENR_BIT_LPUART1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_LPUART1LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_SPI6LPEN_SHIFT                       (5U)
#define PERI_RCC_APB4LPENR_BIT_SPI6LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_SPI6LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_I2C4LPEN_SHIFT                       (7U)
#define PERI_RCC_APB4LPENR_BIT_I2C4LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_I2C4LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_LPTIM2LPEN_SHIFT                     (9U)
#define PERI_RCC_APB4LPENR_BIT_LPTIM2LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_LPTIM2LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_LPTIM3LPEN_SHIFT                     (10U)
#define PERI_RCC_APB4LPENR_BIT_LPTIM3LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_LPTIM3LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_LPTIM4LPEN_SHIFT                     (11U)
#define PERI_RCC_APB4LPENR_BIT_LPTIM4LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_LPTIM4LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_LPTIM5LPEN_SHIFT                     (12U)
#define PERI_RCC_APB4LPENR_BIT_LPTIM5LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_LPTIM5LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_COMP12LPEN_SHIFT                     (14U)
#define PERI_RCC_APB4LPENR_BIT_COMP12LPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_COMP12LPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_VREFLPEN_SHIFT                       (15U)
#define PERI_RCC_APB4LPENR_BIT_VREFLPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_VREFLPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_RTCAPBLPEN_SHIFT                     (16U)
#define PERI_RCC_APB4LPENR_BIT_RTCAPBLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_RTCAPBLPEN_SHIFT)
#define PERI_RCC_APB4LPENR_BIT_SAI4LPEN_SHIFT                       (21U)
#define PERI_RCC_APB4LPENR_BIT_SAI4LPEN_MASK                        (((1U<<1)-1) << PERI_RCC_APB4LPENR_BIT_SAI4LPEN_SHIFT)

/*--- register C1_RSR -------------------------------------------------*/
#define PERI_RCC_C1_RSR_BIT_RMVF_SHIFT                              (16U)
#define PERI_RCC_C1_RSR_BIT_RMVF_MASK                               (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_RMVF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_CPURSTF_SHIFT                           (17U)
#define PERI_RCC_C1_RSR_BIT_CPURSTF_MASK                            (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_CPURSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_D1RSTF_SHIFT                            (19U)
#define PERI_RCC_C1_RSR_BIT_D1RSTF_MASK                             (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_D1RSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_D2RSTF_SHIFT                            (20U)
#define PERI_RCC_C1_RSR_BIT_D2RSTF_MASK                             (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_D2RSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_BORRSTF_SHIFT                           (21U)
#define PERI_RCC_C1_RSR_BIT_BORRSTF_MASK                            (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_BORRSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_PINRSTF_SHIFT                           (22U)
#define PERI_RCC_C1_RSR_BIT_PINRSTF_MASK                            (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_PINRSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_PORRSTF_SHIFT                           (23U)
#define PERI_RCC_C1_RSR_BIT_PORRSTF_MASK                            (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_PORRSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_SFTRSTF_SHIFT                           (24U)
#define PERI_RCC_C1_RSR_BIT_SFTRSTF_MASK                            (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_SFTRSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_IWDG1RSTF_SHIFT                         (26U)
#define PERI_RCC_C1_RSR_BIT_IWDG1RSTF_MASK                          (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_IWDG1RSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_WWDG1RSTF_SHIFT                         (28U)
#define PERI_RCC_C1_RSR_BIT_WWDG1RSTF_MASK                          (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_WWDG1RSTF_SHIFT)
#define PERI_RCC_C1_RSR_BIT_LPWRRSTF_SHIFT                          (30U)
#define PERI_RCC_C1_RSR_BIT_LPWRRSTF_MASK                           (((1U<<1)-1) << PERI_RCC_C1_RSR_BIT_LPWRRSTF_SHIFT)

/*--- register C1_AHB3ENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB3ENR_BIT_MDMAEN_SHIFT                        (0U)
#define PERI_RCC_C1_AHB3ENR_BIT_MDMAEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB3ENR_BIT_MDMAEN_SHIFT)
#define PERI_RCC_C1_AHB3ENR_BIT_DMA2DEN_SHIFT                       (4U)
#define PERI_RCC_C1_AHB3ENR_BIT_DMA2DEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB3ENR_BIT_DMA2DEN_SHIFT)
#define PERI_RCC_C1_AHB3ENR_BIT_JPGDECEN_SHIFT                      (5U)
#define PERI_RCC_C1_AHB3ENR_BIT_JPGDECEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_AHB3ENR_BIT_JPGDECEN_SHIFT)
#define PERI_RCC_C1_AHB3ENR_BIT_FMCEN_SHIFT                         (12U)
#define PERI_RCC_C1_AHB3ENR_BIT_FMCEN_MASK                          (((1U<<1)-1) << PERI_RCC_C1_AHB3ENR_BIT_FMCEN_SHIFT)
#define PERI_RCC_C1_AHB3ENR_BIT_QSPIEN_SHIFT                        (14U)
#define PERI_RCC_C1_AHB3ENR_BIT_QSPIEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB3ENR_BIT_QSPIEN_SHIFT)
#define PERI_RCC_C1_AHB3ENR_BIT_SDMMC1EN_SHIFT                      (16U)
#define PERI_RCC_C1_AHB3ENR_BIT_SDMMC1EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_AHB3ENR_BIT_SDMMC1EN_SHIFT)

/*--- register C1_AHB1ENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB1ENR_BIT_DMA1EN_SHIFT                        (0U)
#define PERI_RCC_C1_AHB1ENR_BIT_DMA1EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_DMA1EN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_DMA2EN_SHIFT                        (1U)
#define PERI_RCC_C1_AHB1ENR_BIT_DMA2EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_DMA2EN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_ADC12EN_SHIFT                       (5U)
#define PERI_RCC_C1_AHB1ENR_BIT_ADC12EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_ADC12EN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_ETH1MACEN_SHIFT                     (15U)
#define PERI_RCC_C1_AHB1ENR_BIT_ETH1MACEN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_ETH1MACEN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_ETH1TXEN_SHIFT                      (16U)
#define PERI_RCC_C1_AHB1ENR_BIT_ETH1TXEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_ETH1TXEN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_ETH1RXEN_SHIFT                      (17U)
#define PERI_RCC_C1_AHB1ENR_BIT_ETH1RXEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_ETH1RXEN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_USB1OTGHSEN_SHIFT                   (25U)
#define PERI_RCC_C1_AHB1ENR_BIT_USB1OTGHSEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_USB1OTGHSEN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_USB1OTGHSULPIEN_SHIFT               (26U)
#define PERI_RCC_C1_AHB1ENR_BIT_USB1OTGHSULPIEN_MASK                (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_USB1OTGHSULPIEN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_USB2OTGHSEN_SHIFT                   (27U)
#define PERI_RCC_C1_AHB1ENR_BIT_USB2OTGHSEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_USB2OTGHSEN_SHIFT)
#define PERI_RCC_C1_AHB1ENR_BIT_USB2OTGHSULPIEN_SHIFT               (28U)
#define PERI_RCC_C1_AHB1ENR_BIT_USB2OTGHSULPIEN_MASK                (((1U<<1)-1) << PERI_RCC_C1_AHB1ENR_BIT_USB2OTGHSULPIEN_SHIFT)

/*--- register C1_AHB2ENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB2ENR_BIT_DCMIEN_SHIFT                        (0U)
#define PERI_RCC_C1_AHB2ENR_BIT_DCMIEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_DCMIEN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_CRYPTEN_SHIFT                       (4U)
#define PERI_RCC_C1_AHB2ENR_BIT_CRYPTEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_CRYPTEN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_HASHEN_SHIFT                        (5U)
#define PERI_RCC_C1_AHB2ENR_BIT_HASHEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_HASHEN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_RNGEN_SHIFT                         (6U)
#define PERI_RCC_C1_AHB2ENR_BIT_RNGEN_MASK                          (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_RNGEN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_SDMMC2EN_SHIFT                      (9U)
#define PERI_RCC_C1_AHB2ENR_BIT_SDMMC2EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_SDMMC2EN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_SRAM1EN_SHIFT                       (29U)
#define PERI_RCC_C1_AHB2ENR_BIT_SRAM1EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_SRAM1EN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_SRAM2EN_SHIFT                       (30U)
#define PERI_RCC_C1_AHB2ENR_BIT_SRAM2EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_SRAM2EN_SHIFT)
#define PERI_RCC_C1_AHB2ENR_BIT_SRAM3EN_SHIFT                       (31U)
#define PERI_RCC_C1_AHB2ENR_BIT_SRAM3EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB2ENR_BIT_SRAM3EN_SHIFT)

