minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register C1_AHB4ENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOAEN_SHIFT                       (0U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOAEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOAEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOBEN_SHIFT                       (1U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOBEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOBEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOCEN_SHIFT                       (2U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOCEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOCEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIODEN_SHIFT                       (3U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIODEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIODEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOEEN_SHIFT                       (4U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOEEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOEEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOFEN_SHIFT                       (5U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOFEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOFEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOGEN_SHIFT                       (6U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOGEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOGEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOHEN_SHIFT                       (7U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOHEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOHEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOIEN_SHIFT                       (8U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOIEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOIEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOJEN_SHIFT                       (9U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOJEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOJEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOKEN_SHIFT                       (10U)
#define PERI_RCC_C1_AHB4ENR_BIT_GPIOKEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_GPIOKEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_CRCEN_SHIFT                         (19U)
#define PERI_RCC_C1_AHB4ENR_BIT_CRCEN_MASK                          (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_CRCEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_BDMAEN_SHIFT                        (21U)
#define PERI_RCC_C1_AHB4ENR_BIT_BDMAEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_BDMAEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_ADC3EN_SHIFT                        (24U)
#define PERI_RCC_C1_AHB4ENR_BIT_ADC3EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_ADC3EN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_HSEMEN_SHIFT                        (25U)
#define PERI_RCC_C1_AHB4ENR_BIT_HSEMEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_HSEMEN_SHIFT)
#define PERI_RCC_C1_AHB4ENR_BIT_BKPRAMEN_SHIFT                      (28U)
#define PERI_RCC_C1_AHB4ENR_BIT_BKPRAMEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_AHB4ENR_BIT_BKPRAMEN_SHIFT)

/*--- register C1_APB3ENR -------------------------------------------------*/
#define PERI_RCC_C1_APB3ENR_BIT_LTDCEN_SHIFT                        (3U)
#define PERI_RCC_C1_APB3ENR_BIT_LTDCEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB3ENR_BIT_LTDCEN_SHIFT)
#define PERI_RCC_C1_APB3ENR_BIT_WWDG1EN_SHIFT                       (6U)
#define PERI_RCC_C1_APB3ENR_BIT_WWDG1EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB3ENR_BIT_WWDG1EN_SHIFT)

/*--- register C1_APB1LENR -------------------------------------------------*/
#define PERI_RCC_C1_APB1LENR_BIT_TIM2EN_SHIFT                       (0U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM2EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM2EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM3EN_SHIFT                       (1U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM3EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM3EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM4EN_SHIFT                       (2U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM4EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM4EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM5EN_SHIFT                       (3U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM5EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM5EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM6EN_SHIFT                       (4U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM6EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM6EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM7EN_SHIFT                       (5U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM7EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM7EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM12EN_SHIFT                      (6U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM12EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM12EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM13EN_SHIFT                      (7U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM13EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM13EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_TIM14EN_SHIFT                      (8U)
#define PERI_RCC_C1_APB1LENR_BIT_TIM14EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_TIM14EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_LPTIM1EN_SHIFT                     (9U)
#define PERI_RCC_C1_APB1LENR_BIT_LPTIM1EN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_LPTIM1EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_SPI2EN_SHIFT                       (14U)
#define PERI_RCC_C1_APB1LENR_BIT_SPI2EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_SPI2EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_SPI3EN_SHIFT                       (15U)
#define PERI_RCC_C1_APB1LENR_BIT_SPI3EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_SPI3EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_SPDIFRXEN_SHIFT                    (16U)
#define PERI_RCC_C1_APB1LENR_BIT_SPDIFRXEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_SPDIFRXEN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_USART2EN_SHIFT                     (17U)
#define PERI_RCC_C1_APB1LENR_BIT_USART2EN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_USART2EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_USART3EN_SHIFT                     (18U)
#define PERI_RCC_C1_APB1LENR_BIT_USART3EN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_USART3EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_UART4EN_SHIFT                      (19U)
#define PERI_RCC_C1_APB1LENR_BIT_UART4EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_UART4EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_UART5EN_SHIFT                      (20U)
#define PERI_RCC_C1_APB1LENR_BIT_UART5EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_UART5EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_I2C1EN_SHIFT                       (21U)
#define PERI_RCC_C1_APB1LENR_BIT_I2C1EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_I2C1EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_I2C2EN_SHIFT                       (22U)
#define PERI_RCC_C1_APB1LENR_BIT_I2C2EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_I2C2EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_I2C3EN_SHIFT                       (23U)
#define PERI_RCC_C1_APB1LENR_BIT_I2C3EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_I2C3EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_HDMICECEN_SHIFT                    (27U)
#define PERI_RCC_C1_APB1LENR_BIT_HDMICECEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_HDMICECEN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_DAC12EN_SHIFT                      (29U)
#define PERI_RCC_C1_APB1LENR_BIT_DAC12EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_DAC12EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_USART7EN_SHIFT                     (30U)
#define PERI_RCC_C1_APB1LENR_BIT_USART7EN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_USART7EN_SHIFT)
#define PERI_RCC_C1_APB1LENR_BIT_USART8EN_SHIFT                     (31U)
#define PERI_RCC_C1_APB1LENR_BIT_USART8EN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_APB1LENR_BIT_USART8EN_SHIFT)

/*--- register C1_APB1HENR -------------------------------------------------*/
#define PERI_RCC_C1_APB1HENR_BIT_CRSEN_SHIFT                        (1U)
#define PERI_RCC_C1_APB1HENR_BIT_CRSEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB1HENR_BIT_CRSEN_SHIFT)
#define PERI_RCC_C1_APB1HENR_BIT_SWPEN_SHIFT                        (2U)
#define PERI_RCC_C1_APB1HENR_BIT_SWPEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB1HENR_BIT_SWPEN_SHIFT)
#define PERI_RCC_C1_APB1HENR_BIT_OPAMPEN_SHIFT                      (4U)
#define PERI_RCC_C1_APB1HENR_BIT_OPAMPEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1HENR_BIT_OPAMPEN_SHIFT)
#define PERI_RCC_C1_APB1HENR_BIT_MDIOSEN_SHIFT                      (5U)
#define PERI_RCC_C1_APB1HENR_BIT_MDIOSEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1HENR_BIT_MDIOSEN_SHIFT)
#define PERI_RCC_C1_APB1HENR_BIT_FDCANEN_SHIFT                      (8U)
#define PERI_RCC_C1_APB1HENR_BIT_FDCANEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB1HENR_BIT_FDCANEN_SHIFT)

/*--- register C1_APB2ENR -------------------------------------------------*/
#define PERI_RCC_C1_APB2ENR_BIT_TIM1EN_SHIFT                        (0U)
#define PERI_RCC_C1_APB2ENR_BIT_TIM1EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_TIM1EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_TIM8EN_SHIFT                        (1U)
#define PERI_RCC_C1_APB2ENR_BIT_TIM8EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_TIM8EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_USART1EN_SHIFT                      (4U)
#define PERI_RCC_C1_APB2ENR_BIT_USART1EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_USART1EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_USART6EN_SHIFT                      (5U)
#define PERI_RCC_C1_APB2ENR_BIT_USART6EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_USART6EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_SPI1EN_SHIFT                        (12U)
#define PERI_RCC_C1_APB2ENR_BIT_SPI1EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_SPI1EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_SPI4EN_SHIFT                        (13U)
#define PERI_RCC_C1_APB2ENR_BIT_SPI4EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_SPI4EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_TIM15EN_SHIFT                       (16U)
#define PERI_RCC_C1_APB2ENR_BIT_TIM15EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_TIM15EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_TIM16EN_SHIFT                       (17U)
#define PERI_RCC_C1_APB2ENR_BIT_TIM16EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_TIM16EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_TIM17EN_SHIFT                       (18U)
#define PERI_RCC_C1_APB2ENR_BIT_TIM17EN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_TIM17EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_SPI5EN_SHIFT                        (20U)
#define PERI_RCC_C1_APB2ENR_BIT_SPI5EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_SPI5EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_SAI1EN_SHIFT                        (22U)
#define PERI_RCC_C1_APB2ENR_BIT_SAI1EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_SAI1EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_SAI2EN_SHIFT                        (23U)
#define PERI_RCC_C1_APB2ENR_BIT_SAI2EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_SAI2EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_SAI3EN_SHIFT                        (24U)
#define PERI_RCC_C1_APB2ENR_BIT_SAI3EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_SAI3EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_DFSDM1EN_SHIFT                      (28U)
#define PERI_RCC_C1_APB2ENR_BIT_DFSDM1EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_DFSDM1EN_SHIFT)
#define PERI_RCC_C1_APB2ENR_BIT_HRTIMEN_SHIFT                       (29U)
#define PERI_RCC_C1_APB2ENR_BIT_HRTIMEN_MASK                        (((1U<<1)-1) << PERI_RCC_C1_APB2ENR_BIT_HRTIMEN_SHIFT)

/*--- register C1_APB4ENR -------------------------------------------------*/
#define PERI_RCC_C1_APB4ENR_BIT_SYSCFGEN_SHIFT                      (1U)
#define PERI_RCC_C1_APB4ENR_BIT_SYSCFGEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_SYSCFGEN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_LPUART1EN_SHIFT                     (3U)
#define PERI_RCC_C1_APB4ENR_BIT_LPUART1EN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_LPUART1EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_SPI6EN_SHIFT                        (5U)
#define PERI_RCC_C1_APB4ENR_BIT_SPI6EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_SPI6EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_I2C4EN_SHIFT                        (7U)
#define PERI_RCC_C1_APB4ENR_BIT_I2C4EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_I2C4EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM2EN_SHIFT                      (9U)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM2EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_LPTIM2EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM3EN_SHIFT                      (10U)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM3EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_LPTIM3EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM4EN_SHIFT                      (11U)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM4EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_LPTIM4EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM5EN_SHIFT                      (12U)
#define PERI_RCC_C1_APB4ENR_BIT_LPTIM5EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_LPTIM5EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_COMP12EN_SHIFT                      (14U)
#define PERI_RCC_C1_APB4ENR_BIT_COMP12EN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_COMP12EN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_VREFEN_SHIFT                        (15U)
#define PERI_RCC_C1_APB4ENR_BIT_VREFEN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_VREFEN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_RTCAPBEN_SHIFT                      (16U)
#define PERI_RCC_C1_APB4ENR_BIT_RTCAPBEN_MASK                       (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_RTCAPBEN_SHIFT)
#define PERI_RCC_C1_APB4ENR_BIT_SAI4EN_SHIFT                        (21U)
#define PERI_RCC_C1_APB4ENR_BIT_SAI4EN_MASK                         (((1U<<1)-1) << PERI_RCC_C1_APB4ENR_BIT_SAI4EN_SHIFT)

