minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register C1_AHB3LPENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB3LPENR_BIT_MDMALPEN_SHIFT                    (0U)
#define PERI_RCC_C1_AHB3LPENR_BIT_MDMALPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_MDMALPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_DMA2DLPEN_SHIFT                   (4U)
#define PERI_RCC_C1_AHB3LPENR_BIT_DMA2DLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_DMA2DLPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_JPGDECLPEN_SHIFT                  (5U)
#define PERI_RCC_C1_AHB3LPENR_BIT_JPGDECLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_JPGDECLPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_FLITFLPEN_SHIFT                   (8U)
#define PERI_RCC_C1_AHB3LPENR_BIT_FLITFLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_FLITFLPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_FMCLPEN_SHIFT                     (12U)
#define PERI_RCC_C1_AHB3LPENR_BIT_FMCLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_FMCLPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_QSPILPEN_SHIFT                    (14U)
#define PERI_RCC_C1_AHB3LPENR_BIT_QSPILPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_QSPILPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_SDMMC1LPEN_SHIFT                  (16U)
#define PERI_RCC_C1_AHB3LPENR_BIT_SDMMC1LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_SDMMC1LPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_D1DTCM1LPEN_SHIFT                 (28U)
#define PERI_RCC_C1_AHB3LPENR_BIT_D1DTCM1LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_D1DTCM1LPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_DTCM2LPEN_SHIFT                   (29U)
#define PERI_RCC_C1_AHB3LPENR_BIT_DTCM2LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_DTCM2LPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_ITCMLPEN_SHIFT                    (30U)
#define PERI_RCC_C1_AHB3LPENR_BIT_ITCMLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_ITCMLPEN_SHIFT)
#define PERI_RCC_C1_AHB3LPENR_BIT_AXISRAMLPEN_SHIFT                 (31U)
#define PERI_RCC_C1_AHB3LPENR_BIT_AXISRAMLPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_AHB3LPENR_BIT_AXISRAMLPEN_SHIFT)

/*--- register C1_AHB1LPENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB1LPENR_BIT_DMA1LPEN_SHIFT                    (0U)
#define PERI_RCC_C1_AHB1LPENR_BIT_DMA1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_DMA1LPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_DMA2LPEN_SHIFT                    (1U)
#define PERI_RCC_C1_AHB1LPENR_BIT_DMA2LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_DMA2LPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_ADC12LPEN_SHIFT                   (5U)
#define PERI_RCC_C1_AHB1LPENR_BIT_ADC12LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_ADC12LPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_ETH1MACLPEN_SHIFT                 (15U)
#define PERI_RCC_C1_AHB1LPENR_BIT_ETH1MACLPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_ETH1MACLPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_ETH1TXLPEN_SHIFT                  (16U)
#define PERI_RCC_C1_AHB1LPENR_BIT_ETH1TXLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_ETH1TXLPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_ETH1RXLPEN_SHIFT                  (17U)
#define PERI_RCC_C1_AHB1LPENR_BIT_ETH1RXLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_ETH1RXLPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB1OTGLPEN_SHIFT                 (25U)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB1OTGLPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_USB1OTGLPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB1ULPILPEN_SHIFT                (26U)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB1ULPILPEN_MASK                 (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_USB1ULPILPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB2OTGLPEN_SHIFT                 (27U)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB2OTGLPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_USB2OTGLPEN_SHIFT)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB2ULPILPEN_SHIFT                (28U)
#define PERI_RCC_C1_AHB1LPENR_BIT_USB2ULPILPEN_MASK                 (((1U<<1)-1) << PERI_RCC_C1_AHB1LPENR_BIT_USB2ULPILPEN_SHIFT)

/*--- register C1_AHB2LPENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB2LPENR_BIT_CAMITFLPEN_SHIFT                  (0U)
#define PERI_RCC_C1_AHB2LPENR_BIT_CAMITFLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_CAMITFLPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_CRYPTLPEN_SHIFT                   (4U)
#define PERI_RCC_C1_AHB2LPENR_BIT_CRYPTLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_CRYPTLPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_HASHLPEN_SHIFT                    (5U)
#define PERI_RCC_C1_AHB2LPENR_BIT_HASHLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_HASHLPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_RNGLPEN_SHIFT                     (6U)
#define PERI_RCC_C1_AHB2LPENR_BIT_RNGLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_RNGLPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_SDMMC2LPEN_SHIFT                  (9U)
#define PERI_RCC_C1_AHB2LPENR_BIT_SDMMC2LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_SDMMC2LPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_SRAM1LPEN_SHIFT                   (29U)
#define PERI_RCC_C1_AHB2LPENR_BIT_SRAM1LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_SRAM1LPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_SRAM2LPEN_SHIFT                   (30U)
#define PERI_RCC_C1_AHB2LPENR_BIT_SRAM2LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_SRAM2LPEN_SHIFT)
#define PERI_RCC_C1_AHB2LPENR_BIT_SRAM3LPEN_SHIFT                   (31U)
#define PERI_RCC_C1_AHB2LPENR_BIT_SRAM3LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB2LPENR_BIT_SRAM3LPEN_SHIFT)

