minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register C1_AHB4LPENR -------------------------------------------------*/
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOALPEN_SHIFT                   (0U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOALPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOALPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOBLPEN_SHIFT                   (1U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOBLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOBLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOCLPEN_SHIFT                   (2U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOCLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOCLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIODLPEN_SHIFT                   (3U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIODLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIODLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOELPEN_SHIFT                   (4U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOELPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOELPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOFLPEN_SHIFT                   (5U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOFLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOFLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOGLPEN_SHIFT                   (6U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOGLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOGLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOHLPEN_SHIFT                   (7U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOHLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOHLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOILPEN_SHIFT                   (8U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOILPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOILPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOJLPEN_SHIFT                   (9U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOJLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOJLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOKLPEN_SHIFT                   (10U)
#define PERI_RCC_C1_AHB4LPENR_BIT_GPIOKLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_GPIOKLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_CRCLPEN_SHIFT                     (19U)
#define PERI_RCC_C1_AHB4LPENR_BIT_CRCLPEN_MASK                      (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_CRCLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_BDMALPEN_SHIFT                    (21U)
#define PERI_RCC_C1_AHB4LPENR_BIT_BDMALPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_BDMALPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_ADC3LPEN_SHIFT                    (24U)
#define PERI_RCC_C1_AHB4LPENR_BIT_ADC3LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_ADC3LPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_BKPRAMLPEN_SHIFT                  (28U)
#define PERI_RCC_C1_AHB4LPENR_BIT_BKPRAMLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_BKPRAMLPEN_SHIFT)
#define PERI_RCC_C1_AHB4LPENR_BIT_SRAM4LPEN_SHIFT                   (29U)
#define PERI_RCC_C1_AHB4LPENR_BIT_SRAM4LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_AHB4LPENR_BIT_SRAM4LPEN_SHIFT)

/*--- register C1_APB3LPENR -------------------------------------------------*/
#define PERI_RCC_C1_APB3LPENR_BIT_LTDCLPEN_SHIFT                    (3U)
#define PERI_RCC_C1_APB3LPENR_BIT_LTDCLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB3LPENR_BIT_LTDCLPEN_SHIFT)
#define PERI_RCC_C1_APB3LPENR_BIT_WWDG1LPEN_SHIFT                   (6U)
#define PERI_RCC_C1_APB3LPENR_BIT_WWDG1LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB3LPENR_BIT_WWDG1LPEN_SHIFT)

/*--- register C1_APB1LLPENR -------------------------------------------------*/
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM2LPEN_SHIFT                   (0U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM2LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM2LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM3LPEN_SHIFT                   (1U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM3LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM3LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM4LPEN_SHIFT                   (2U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM4LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM4LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM5LPEN_SHIFT                   (3U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM5LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM5LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM6LPEN_SHIFT                   (4U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM6LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM6LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM7LPEN_SHIFT                   (5U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM7LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM7LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM12LPEN_SHIFT                  (6U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM12LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM12LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM13LPEN_SHIFT                  (7U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM13LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM13LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM14LPEN_SHIFT                  (8U)
#define PERI_RCC_C1_APB1LLPENR_BIT_TIM14LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_TIM14LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_LPTIM1LPEN_SHIFT                 (9U)
#define PERI_RCC_C1_APB1LLPENR_BIT_LPTIM1LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_LPTIM1LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_SPI2LPEN_SHIFT                   (14U)
#define PERI_RCC_C1_APB1LLPENR_BIT_SPI2LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_SPI2LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_SPI3LPEN_SHIFT                   (15U)
#define PERI_RCC_C1_APB1LLPENR_BIT_SPI3LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_SPI3LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_SPDIFRXLPEN_SHIFT                (16U)
#define PERI_RCC_C1_APB1LLPENR_BIT_SPDIFRXLPEN_MASK                 (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_SPDIFRXLPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART2LPEN_SHIFT                 (17U)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART2LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_USART2LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART3LPEN_SHIFT                 (18U)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART3LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_USART3LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_UART4LPEN_SHIFT                  (19U)
#define PERI_RCC_C1_APB1LLPENR_BIT_UART4LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_UART4LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_UART5LPEN_SHIFT                  (20U)
#define PERI_RCC_C1_APB1LLPENR_BIT_UART5LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_UART5LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_I2C1LPEN_SHIFT                   (21U)
#define PERI_RCC_C1_APB1LLPENR_BIT_I2C1LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_I2C1LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_I2C2LPEN_SHIFT                   (22U)
#define PERI_RCC_C1_APB1LLPENR_BIT_I2C2LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_I2C2LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_I2C3LPEN_SHIFT                   (23U)
#define PERI_RCC_C1_APB1LLPENR_BIT_I2C3LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_I2C3LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_HDMICECLPEN_SHIFT                (27U)
#define PERI_RCC_C1_APB1LLPENR_BIT_HDMICECLPEN_MASK                 (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_HDMICECLPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_DAC12LPEN_SHIFT                  (29U)
#define PERI_RCC_C1_APB1LLPENR_BIT_DAC12LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_DAC12LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART7LPEN_SHIFT                 (30U)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART7LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_USART7LPEN_SHIFT)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART8LPEN_SHIFT                 (31U)
#define PERI_RCC_C1_APB1LLPENR_BIT_USART8LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_APB1LLPENR_BIT_USART8LPEN_SHIFT)

