minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register C1_APB1HLPENR -------------------------------------------------*/
#define PERI_RCC_C1_APB1HLPENR_BIT_CRSLPEN_SHIFT                    (1U)
#define PERI_RCC_C1_APB1HLPENR_BIT_CRSLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB1HLPENR_BIT_CRSLPEN_SHIFT)
#define PERI_RCC_C1_APB1HLPENR_BIT_SWPLPEN_SHIFT                    (2U)
#define PERI_RCC_C1_APB1HLPENR_BIT_SWPLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB1HLPENR_BIT_SWPLPEN_SHIFT)
#define PERI_RCC_C1_APB1HLPENR_BIT_OPAMPLPEN_SHIFT                  (4U)
#define PERI_RCC_C1_APB1HLPENR_BIT_OPAMPLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1HLPENR_BIT_OPAMPLPEN_SHIFT)
#define PERI_RCC_C1_APB1HLPENR_BIT_MDIOSLPEN_SHIFT                  (5U)
#define PERI_RCC_C1_APB1HLPENR_BIT_MDIOSLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1HLPENR_BIT_MDIOSLPEN_SHIFT)
#define PERI_RCC_C1_APB1HLPENR_BIT_FDCANLPEN_SHIFT                  (8U)
#define PERI_RCC_C1_APB1HLPENR_BIT_FDCANLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB1HLPENR_BIT_FDCANLPEN_SHIFT)

/*--- register C1_APB2LPENR -------------------------------------------------*/
#define PERI_RCC_C1_APB2LPENR_BIT_TIM1LPEN_SHIFT                    (0U)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_TIM1LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM8LPEN_SHIFT                    (1U)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM8LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_TIM8LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_USART1LPEN_SHIFT                  (4U)
#define PERI_RCC_C1_APB2LPENR_BIT_USART1LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_USART1LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_USART6LPEN_SHIFT                  (5U)
#define PERI_RCC_C1_APB2LPENR_BIT_USART6LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_USART6LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_SPI1LPEN_SHIFT                    (12U)
#define PERI_RCC_C1_APB2LPENR_BIT_SPI1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_SPI1LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_SPI4LPEN_SHIFT                    (13U)
#define PERI_RCC_C1_APB2LPENR_BIT_SPI4LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_SPI4LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM15LPEN_SHIFT                   (16U)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM15LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_TIM15LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM16LPEN_SHIFT                   (17U)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM16LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_TIM16LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM17LPEN_SHIFT                   (18U)
#define PERI_RCC_C1_APB2LPENR_BIT_TIM17LPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_TIM17LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_SPI5LPEN_SHIFT                    (20U)
#define PERI_RCC_C1_APB2LPENR_BIT_SPI5LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_SPI5LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_SAI1LPEN_SHIFT                    (22U)
#define PERI_RCC_C1_APB2LPENR_BIT_SAI1LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_SAI1LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_SAI2LPEN_SHIFT                    (23U)
#define PERI_RCC_C1_APB2LPENR_BIT_SAI2LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_SAI2LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_SAI3LPEN_SHIFT                    (24U)
#define PERI_RCC_C1_APB2LPENR_BIT_SAI3LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_SAI3LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_DFSDM1LPEN_SHIFT                  (28U)
#define PERI_RCC_C1_APB2LPENR_BIT_DFSDM1LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_DFSDM1LPEN_SHIFT)
#define PERI_RCC_C1_APB2LPENR_BIT_HRTIMLPEN_SHIFT                   (29U)
#define PERI_RCC_C1_APB2LPENR_BIT_HRTIMLPEN_MASK                    (((1U<<1)-1) << PERI_RCC_C1_APB2LPENR_BIT_HRTIMLPEN_SHIFT)

/*--- register C1_APB4LPENR -------------------------------------------------*/
#define PERI_RCC_C1_APB4LPENR_BIT_SYSCFGLPEN_SHIFT                  (1U)
#define PERI_RCC_C1_APB4LPENR_BIT_SYSCFGLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_SYSCFGLPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_LPUART1LPEN_SHIFT                 (3U)
#define PERI_RCC_C1_APB4LPENR_BIT_LPUART1LPEN_MASK                  (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_LPUART1LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_SPI6LPEN_SHIFT                    (5U)
#define PERI_RCC_C1_APB4LPENR_BIT_SPI6LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_SPI6LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_I2C4LPEN_SHIFT                    (7U)
#define PERI_RCC_C1_APB4LPENR_BIT_I2C4LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_I2C4LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM2LPEN_SHIFT                  (9U)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM2LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_LPTIM2LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM3LPEN_SHIFT                  (10U)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM3LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_LPTIM3LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM4LPEN_SHIFT                  (11U)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM4LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_LPTIM4LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM5LPEN_SHIFT                  (12U)
#define PERI_RCC_C1_APB4LPENR_BIT_LPTIM5LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_LPTIM5LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_COMP12LPEN_SHIFT                  (14U)
#define PERI_RCC_C1_APB4LPENR_BIT_COMP12LPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_COMP12LPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_VREFLPEN_SHIFT                    (15U)
#define PERI_RCC_C1_APB4LPENR_BIT_VREFLPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_VREFLPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_RTCAPBLPEN_SHIFT                  (16U)
#define PERI_RCC_C1_APB4LPENR_BIT_RTCAPBLPEN_MASK                   (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_RTCAPBLPEN_SHIFT)
#define PERI_RCC_C1_APB4LPENR_BIT_SAI4LPEN_SHIFT                    (21U)
#define PERI_RCC_C1_APB4LPENR_BIT_SAI4LPEN_MASK                     (((1U<<1)-1) << PERI_RCC_C1_APB4LPENR_BIT_SAI4LPEN_SHIFT)

