minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_RNG_CR_BIT_RNGEN_SHIFT                                 (2U)
#define PERI_RNG_CR_BIT_RNGEN_MASK                                  (((1U<<1)-1) << PERI_RNG_CR_BIT_RNGEN_SHIFT)
#define PERI_RNG_CR_BIT_IE_SHIFT                                    (3U)
#define PERI_RNG_CR_BIT_IE_MASK                                     (((1U<<1)-1) << PERI_RNG_CR_BIT_IE_SHIFT)
#define PERI_RNG_CR_BIT_CED_SHIFT                                   (5U)
#define PERI_RNG_CR_BIT_CED_MASK                                    (((1U<<1)-1) << PERI_RNG_CR_BIT_CED_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_RNG_SR_BIT_DRDY_SHIFT                                  (0U)
#define PERI_RNG_SR_BIT_DRDY_MASK                                   (((1U<<1)-1) << PERI_RNG_SR_BIT_DRDY_SHIFT)
#define PERI_RNG_SR_BIT_CECS_SHIFT                                  (1U)
#define PERI_RNG_SR_BIT_CECS_MASK                                   (((1U<<1)-1) << PERI_RNG_SR_BIT_CECS_SHIFT)
#define PERI_RNG_SR_BIT_SECS_SHIFT                                  (2U)
#define PERI_RNG_SR_BIT_SECS_MASK                                   (((1U<<1)-1) << PERI_RNG_SR_BIT_SECS_SHIFT)
#define PERI_RNG_SR_BIT_CEIS_SHIFT                                  (5U)
#define PERI_RNG_SR_BIT_CEIS_MASK                                   (((1U<<1)-1) << PERI_RNG_SR_BIT_CEIS_SHIFT)
#define PERI_RNG_SR_BIT_SEIS_SHIFT                                  (6U)
#define PERI_RNG_SR_BIT_SEIS_MASK                                   (((1U<<1)-1) << PERI_RNG_SR_BIT_SEIS_SHIFT)

/*--- register DR -------------------------------------------------*/
#define PERI_RNG_DR_BIT_RNDATA_SHIFT                                (0U)
#define PERI_RNG_DR_BIT_RNDATA_MASK                                 (((1U<<32)-1) << PERI_RNG_DR_BIT_RNDATA_SHIFT)

/*--- register RTC_TR -------------------------------------------------*/
#define PERI_RTC_RTC_TR_BIT_SU_SHIFT                                (0U)
#define PERI_RTC_RTC_TR_BIT_SU_MASK                                 (((1U<<4)-1) << PERI_RTC_RTC_TR_BIT_SU_SHIFT)
#define PERI_RTC_RTC_TR_BIT_ST_SHIFT                                (4U)
#define PERI_RTC_RTC_TR_BIT_ST_MASK                                 (((1U<<3)-1) << PERI_RTC_RTC_TR_BIT_ST_SHIFT)
#define PERI_RTC_RTC_TR_BIT_MNU_SHIFT                               (8U)
#define PERI_RTC_RTC_TR_BIT_MNU_MASK                                (((1U<<4)-1) << PERI_RTC_RTC_TR_BIT_MNU_SHIFT)
#define PERI_RTC_RTC_TR_BIT_MNT_SHIFT                               (12U)
#define PERI_RTC_RTC_TR_BIT_MNT_MASK                                (((1U<<3)-1) << PERI_RTC_RTC_TR_BIT_MNT_SHIFT)
#define PERI_RTC_RTC_TR_BIT_HU_SHIFT                                (16U)
#define PERI_RTC_RTC_TR_BIT_HU_MASK                                 (((1U<<4)-1) << PERI_RTC_RTC_TR_BIT_HU_SHIFT)
#define PERI_RTC_RTC_TR_BIT_HT_SHIFT                                (20U)
#define PERI_RTC_RTC_TR_BIT_HT_MASK                                 (((1U<<2)-1) << PERI_RTC_RTC_TR_BIT_HT_SHIFT)
#define PERI_RTC_RTC_TR_BIT_PM_SHIFT                                (22U)
#define PERI_RTC_RTC_TR_BIT_PM_MASK                                 (((1U<<1)-1) << PERI_RTC_RTC_TR_BIT_PM_SHIFT)

/*--- register RTC_DR -------------------------------------------------*/
#define PERI_RTC_RTC_DR_BIT_DU_SHIFT                                (0U)
#define PERI_RTC_RTC_DR_BIT_DU_MASK                                 (((1U<<4)-1) << PERI_RTC_RTC_DR_BIT_DU_SHIFT)
#define PERI_RTC_RTC_DR_BIT_DT_SHIFT                                (4U)
#define PERI_RTC_RTC_DR_BIT_DT_MASK                                 (((1U<<2)-1) << PERI_RTC_RTC_DR_BIT_DT_SHIFT)
#define PERI_RTC_RTC_DR_BIT_MU_SHIFT                                (8U)
#define PERI_RTC_RTC_DR_BIT_MU_MASK                                 (((1U<<4)-1) << PERI_RTC_RTC_DR_BIT_MU_SHIFT)
#define PERI_RTC_RTC_DR_BIT_MT_SHIFT                                (12U)
#define PERI_RTC_RTC_DR_BIT_MT_MASK                                 (((1U<<1)-1) << PERI_RTC_RTC_DR_BIT_MT_SHIFT)
#define PERI_RTC_RTC_DR_BIT_WDU_SHIFT                               (13U)
#define PERI_RTC_RTC_DR_BIT_WDU_MASK                                (((1U<<3)-1) << PERI_RTC_RTC_DR_BIT_WDU_SHIFT)
#define PERI_RTC_RTC_DR_BIT_YU_SHIFT                                (16U)
#define PERI_RTC_RTC_DR_BIT_YU_MASK                                 (((1U<<4)-1) << PERI_RTC_RTC_DR_BIT_YU_SHIFT)
#define PERI_RTC_RTC_DR_BIT_YT_SHIFT                                (20U)
#define PERI_RTC_RTC_DR_BIT_YT_MASK                                 (((1U<<4)-1) << PERI_RTC_RTC_DR_BIT_YT_SHIFT)

/*--- register RTC_CR -------------------------------------------------*/
#define PERI_RTC_RTC_CR_BIT_WUCKSEL_SHIFT                           (0U)
#define PERI_RTC_RTC_CR_BIT_WUCKSEL_MASK                            (((1U<<3)-1) << PERI_RTC_RTC_CR_BIT_WUCKSEL_SHIFT)
#define PERI_RTC_RTC_CR_BIT_TSEDGE_SHIFT                            (3U)
#define PERI_RTC_RTC_CR_BIT_TSEDGE_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_TSEDGE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_REFCKON_SHIFT                           (4U)
#define PERI_RTC_RTC_CR_BIT_REFCKON_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_REFCKON_SHIFT)
#define PERI_RTC_RTC_CR_BIT_BYPSHAD_SHIFT                           (5U)
#define PERI_RTC_RTC_CR_BIT_BYPSHAD_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_BYPSHAD_SHIFT)
#define PERI_RTC_RTC_CR_BIT_FMT_SHIFT                               (6U)
#define PERI_RTC_RTC_CR_BIT_FMT_MASK                                (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_FMT_SHIFT)
#define PERI_RTC_RTC_CR_BIT_ALRAE_SHIFT                             (8U)
#define PERI_RTC_RTC_CR_BIT_ALRAE_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_ALRAE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_ALRBE_SHIFT                             (9U)
#define PERI_RTC_RTC_CR_BIT_ALRBE_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_ALRBE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_WUTE_SHIFT                              (10U)
#define PERI_RTC_RTC_CR_BIT_WUTE_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_WUTE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_TSE_SHIFT                               (11U)
#define PERI_RTC_RTC_CR_BIT_TSE_MASK                                (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_TSE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_ALRAIE_SHIFT                            (12U)
#define PERI_RTC_RTC_CR_BIT_ALRAIE_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_ALRAIE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_ALRBIE_SHIFT                            (13U)
#define PERI_RTC_RTC_CR_BIT_ALRBIE_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_ALRBIE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_WUTIE_SHIFT                             (14U)
#define PERI_RTC_RTC_CR_BIT_WUTIE_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_WUTIE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_TSIE_SHIFT                              (15U)
#define PERI_RTC_RTC_CR_BIT_TSIE_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_TSIE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_ADD1H_SHIFT                             (16U)
#define PERI_RTC_RTC_CR_BIT_ADD1H_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_ADD1H_SHIFT)
#define PERI_RTC_RTC_CR_BIT_SUB1H_SHIFT                             (17U)
#define PERI_RTC_RTC_CR_BIT_SUB1H_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_SUB1H_SHIFT)
#define PERI_RTC_RTC_CR_BIT_BKP_SHIFT                               (18U)
#define PERI_RTC_RTC_CR_BIT_BKP_MASK                                (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_BKP_SHIFT)
#define PERI_RTC_RTC_CR_BIT_COSEL_SHIFT                             (19U)
#define PERI_RTC_RTC_CR_BIT_COSEL_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_COSEL_SHIFT)
#define PERI_RTC_RTC_CR_BIT_POL_SHIFT                               (20U)
#define PERI_RTC_RTC_CR_BIT_POL_MASK                                (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_POL_SHIFT)
#define PERI_RTC_RTC_CR_BIT_OSEL_SHIFT                              (21U)
#define PERI_RTC_RTC_CR_BIT_OSEL_MASK                               (((1U<<2)-1) << PERI_RTC_RTC_CR_BIT_OSEL_SHIFT)
#define PERI_RTC_RTC_CR_BIT_COE_SHIFT                               (23U)
#define PERI_RTC_RTC_CR_BIT_COE_MASK                                (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_COE_SHIFT)
#define PERI_RTC_RTC_CR_BIT_ITSE_SHIFT                              (24U)
#define PERI_RTC_RTC_CR_BIT_ITSE_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_CR_BIT_ITSE_SHIFT)

/*--- register RTC_ISR -------------------------------------------------*/
#define PERI_RTC_RTC_ISR_BIT_ALRAWF_SHIFT                           (0U)
#define PERI_RTC_RTC_ISR_BIT_ALRAWF_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_ALRAWF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_ALRBWF_SHIFT                           (1U)
#define PERI_RTC_RTC_ISR_BIT_ALRBWF_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_ALRBWF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_WUTWF_SHIFT                            (2U)
#define PERI_RTC_RTC_ISR_BIT_WUTWF_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_WUTWF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_SHPF_SHIFT                             (3U)
#define PERI_RTC_RTC_ISR_BIT_SHPF_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_SHPF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_INITS_SHIFT                            (4U)
#define PERI_RTC_RTC_ISR_BIT_INITS_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_INITS_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_RSF_SHIFT                              (5U)
#define PERI_RTC_RTC_ISR_BIT_RSF_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_RSF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_INITF_SHIFT                            (6U)
#define PERI_RTC_RTC_ISR_BIT_INITF_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_INITF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_INIT_SHIFT                             (7U)
#define PERI_RTC_RTC_ISR_BIT_INIT_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_INIT_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_ALRAF_SHIFT                            (8U)
#define PERI_RTC_RTC_ISR_BIT_ALRAF_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_ALRAF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_ALRBF_SHIFT                            (9U)
#define PERI_RTC_RTC_ISR_BIT_ALRBF_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_ALRBF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_WUTF_SHIFT                             (10U)
#define PERI_RTC_RTC_ISR_BIT_WUTF_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_WUTF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_TSF_SHIFT                              (11U)
#define PERI_RTC_RTC_ISR_BIT_TSF_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_TSF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_TSOVF_SHIFT                            (12U)
#define PERI_RTC_RTC_ISR_BIT_TSOVF_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_TSOVF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_TAMP1F_SHIFT                           (13U)
#define PERI_RTC_RTC_ISR_BIT_TAMP1F_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_TAMP1F_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_TAMP2F_SHIFT                           (14U)
#define PERI_RTC_RTC_ISR_BIT_TAMP2F_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_TAMP2F_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_TAMP3F_SHIFT                           (15U)
#define PERI_RTC_RTC_ISR_BIT_TAMP3F_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_TAMP3F_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_RECALPF_SHIFT                          (16U)
#define PERI_RTC_RTC_ISR_BIT_RECALPF_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_RECALPF_SHIFT)
#define PERI_RTC_RTC_ISR_BIT_ITSF_SHIFT                             (17U)
#define PERI_RTC_RTC_ISR_BIT_ITSF_MASK                              (((1U<<1)-1) << PERI_RTC_RTC_ISR_BIT_ITSF_SHIFT)

/*--- register RTC_PRER -------------------------------------------------*/
#define PERI_RTC_RTC_PRER_BIT_PREDIV_S_SHIFT                        (0U)
#define PERI_RTC_RTC_PRER_BIT_PREDIV_S_MASK                         (((1U<<15)-1) << PERI_RTC_RTC_PRER_BIT_PREDIV_S_SHIFT)
#define PERI_RTC_RTC_PRER_BIT_PREDIV_A_SHIFT                        (16U)
#define PERI_RTC_RTC_PRER_BIT_PREDIV_A_MASK                         (((1U<<7)-1) << PERI_RTC_RTC_PRER_BIT_PREDIV_A_SHIFT)

