minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RTC_WUTR -------------------------------------------------*/
#define PERI_RTC_RTC_WUTR_BIT_WUT_SHIFT                             (0U)
#define PERI_RTC_RTC_WUTR_BIT_WUT_MASK                              (((1U<<16)-1) << PERI_RTC_RTC_WUTR_BIT_WUT_SHIFT)

/*--- register RTC_ALRMAR -------------------------------------------------*/
#define PERI_RTC_RTC_ALRMAR_BIT_SU_SHIFT                            (0U)
#define PERI_RTC_RTC_ALRMAR_BIT_SU_MASK                             (((1U<<4)-1) << PERI_RTC_RTC_ALRMAR_BIT_SU_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_ST_SHIFT                            (4U)
#define PERI_RTC_RTC_ALRMAR_BIT_ST_MASK                             (((1U<<3)-1) << PERI_RTC_RTC_ALRMAR_BIT_ST_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK1_SHIFT                          (7U)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK1_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMAR_BIT_MSK1_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_MNU_SHIFT                           (8U)
#define PERI_RTC_RTC_ALRMAR_BIT_MNU_MASK                            (((1U<<4)-1) << PERI_RTC_RTC_ALRMAR_BIT_MNU_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_MNT_SHIFT                           (12U)
#define PERI_RTC_RTC_ALRMAR_BIT_MNT_MASK                            (((1U<<3)-1) << PERI_RTC_RTC_ALRMAR_BIT_MNT_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK2_SHIFT                          (15U)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK2_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMAR_BIT_MSK2_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_HU_SHIFT                            (16U)
#define PERI_RTC_RTC_ALRMAR_BIT_HU_MASK                             (((1U<<4)-1) << PERI_RTC_RTC_ALRMAR_BIT_HU_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_HT_SHIFT                            (20U)
#define PERI_RTC_RTC_ALRMAR_BIT_HT_MASK                             (((1U<<2)-1) << PERI_RTC_RTC_ALRMAR_BIT_HT_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_PM_SHIFT                            (22U)
#define PERI_RTC_RTC_ALRMAR_BIT_PM_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ALRMAR_BIT_PM_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK3_SHIFT                          (23U)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK3_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMAR_BIT_MSK3_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_DU_SHIFT                            (24U)
#define PERI_RTC_RTC_ALRMAR_BIT_DU_MASK                             (((1U<<4)-1) << PERI_RTC_RTC_ALRMAR_BIT_DU_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_DT_SHIFT                            (28U)
#define PERI_RTC_RTC_ALRMAR_BIT_DT_MASK                             (((1U<<2)-1) << PERI_RTC_RTC_ALRMAR_BIT_DT_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_WDSEL_SHIFT                         (30U)
#define PERI_RTC_RTC_ALRMAR_BIT_WDSEL_MASK                          (((1U<<1)-1) << PERI_RTC_RTC_ALRMAR_BIT_WDSEL_SHIFT)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK4_SHIFT                          (31U)
#define PERI_RTC_RTC_ALRMAR_BIT_MSK4_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMAR_BIT_MSK4_SHIFT)

/*--- register RTC_ALRMBR -------------------------------------------------*/
#define PERI_RTC_RTC_ALRMBR_BIT_SU_SHIFT                            (0U)
#define PERI_RTC_RTC_ALRMBR_BIT_SU_MASK                             (((1U<<4)-1) << PERI_RTC_RTC_ALRMBR_BIT_SU_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_ST_SHIFT                            (4U)
#define PERI_RTC_RTC_ALRMBR_BIT_ST_MASK                             (((1U<<3)-1) << PERI_RTC_RTC_ALRMBR_BIT_ST_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK1_SHIFT                          (7U)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK1_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMBR_BIT_MSK1_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_MNU_SHIFT                           (8U)
#define PERI_RTC_RTC_ALRMBR_BIT_MNU_MASK                            (((1U<<4)-1) << PERI_RTC_RTC_ALRMBR_BIT_MNU_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_MNT_SHIFT                           (12U)
#define PERI_RTC_RTC_ALRMBR_BIT_MNT_MASK                            (((1U<<3)-1) << PERI_RTC_RTC_ALRMBR_BIT_MNT_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK2_SHIFT                          (15U)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK2_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMBR_BIT_MSK2_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_HU_SHIFT                            (16U)
#define PERI_RTC_RTC_ALRMBR_BIT_HU_MASK                             (((1U<<4)-1) << PERI_RTC_RTC_ALRMBR_BIT_HU_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_HT_SHIFT                            (20U)
#define PERI_RTC_RTC_ALRMBR_BIT_HT_MASK                             (((1U<<2)-1) << PERI_RTC_RTC_ALRMBR_BIT_HT_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_PM_SHIFT                            (22U)
#define PERI_RTC_RTC_ALRMBR_BIT_PM_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_ALRMBR_BIT_PM_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK3_SHIFT                          (23U)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK3_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMBR_BIT_MSK3_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_DU_SHIFT                            (24U)
#define PERI_RTC_RTC_ALRMBR_BIT_DU_MASK                             (((1U<<4)-1) << PERI_RTC_RTC_ALRMBR_BIT_DU_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_DT_SHIFT                            (28U)
#define PERI_RTC_RTC_ALRMBR_BIT_DT_MASK                             (((1U<<2)-1) << PERI_RTC_RTC_ALRMBR_BIT_DT_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_WDSEL_SHIFT                         (30U)
#define PERI_RTC_RTC_ALRMBR_BIT_WDSEL_MASK                          (((1U<<1)-1) << PERI_RTC_RTC_ALRMBR_BIT_WDSEL_SHIFT)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK4_SHIFT                          (31U)
#define PERI_RTC_RTC_ALRMBR_BIT_MSK4_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_ALRMBR_BIT_MSK4_SHIFT)

/*--- register RTC_WPR -------------------------------------------------*/
#define PERI_RTC_RTC_WPR_BIT_KEY_SHIFT                              (0U)
#define PERI_RTC_RTC_WPR_BIT_KEY_MASK                               (((1U<<8)-1) << PERI_RTC_RTC_WPR_BIT_KEY_SHIFT)

/*--- register RTC_SSR -------------------------------------------------*/
#define PERI_RTC_RTC_SSR_BIT_SS_SHIFT                               (0U)
#define PERI_RTC_RTC_SSR_BIT_SS_MASK                                (((1U<<16)-1) << PERI_RTC_RTC_SSR_BIT_SS_SHIFT)

/*--- register RTC_SHIFTR -------------------------------------------------*/
#define PERI_RTC_RTC_SHIFTR_BIT_SUBFS_SHIFT                         (0U)
#define PERI_RTC_RTC_SHIFTR_BIT_SUBFS_MASK                          (((1U<<15)-1) << PERI_RTC_RTC_SHIFTR_BIT_SUBFS_SHIFT)
#define PERI_RTC_RTC_SHIFTR_BIT_ADD1S_SHIFT                         (31U)
#define PERI_RTC_RTC_SHIFTR_BIT_ADD1S_MASK                          (((1U<<1)-1) << PERI_RTC_RTC_SHIFTR_BIT_ADD1S_SHIFT)

/*--- register RTC_TSTR -------------------------------------------------*/
#define PERI_RTC_RTC_TSTR_BIT_SU_SHIFT                              (0U)
#define PERI_RTC_RTC_TSTR_BIT_SU_MASK                               (((1U<<4)-1) << PERI_RTC_RTC_TSTR_BIT_SU_SHIFT)
#define PERI_RTC_RTC_TSTR_BIT_ST_SHIFT                              (4U)
#define PERI_RTC_RTC_TSTR_BIT_ST_MASK                               (((1U<<3)-1) << PERI_RTC_RTC_TSTR_BIT_ST_SHIFT)
#define PERI_RTC_RTC_TSTR_BIT_MNU_SHIFT                             (8U)
#define PERI_RTC_RTC_TSTR_BIT_MNU_MASK                              (((1U<<4)-1) << PERI_RTC_RTC_TSTR_BIT_MNU_SHIFT)
#define PERI_RTC_RTC_TSTR_BIT_MNT_SHIFT                             (12U)
#define PERI_RTC_RTC_TSTR_BIT_MNT_MASK                              (((1U<<3)-1) << PERI_RTC_RTC_TSTR_BIT_MNT_SHIFT)
#define PERI_RTC_RTC_TSTR_BIT_HU_SHIFT                              (16U)
#define PERI_RTC_RTC_TSTR_BIT_HU_MASK                               (((1U<<4)-1) << PERI_RTC_RTC_TSTR_BIT_HU_SHIFT)
#define PERI_RTC_RTC_TSTR_BIT_HT_SHIFT                              (20U)
#define PERI_RTC_RTC_TSTR_BIT_HT_MASK                               (((1U<<2)-1) << PERI_RTC_RTC_TSTR_BIT_HT_SHIFT)
#define PERI_RTC_RTC_TSTR_BIT_PM_SHIFT                              (22U)
#define PERI_RTC_RTC_TSTR_BIT_PM_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_TSTR_BIT_PM_SHIFT)

/*--- register RTC_TSDR -------------------------------------------------*/
#define PERI_RTC_RTC_TSDR_BIT_DU_SHIFT                              (0U)
#define PERI_RTC_RTC_TSDR_BIT_DU_MASK                               (((1U<<4)-1) << PERI_RTC_RTC_TSDR_BIT_DU_SHIFT)
#define PERI_RTC_RTC_TSDR_BIT_DT_SHIFT                              (4U)
#define PERI_RTC_RTC_TSDR_BIT_DT_MASK                               (((1U<<2)-1) << PERI_RTC_RTC_TSDR_BIT_DT_SHIFT)
#define PERI_RTC_RTC_TSDR_BIT_MU_SHIFT                              (8U)
#define PERI_RTC_RTC_TSDR_BIT_MU_MASK                               (((1U<<4)-1) << PERI_RTC_RTC_TSDR_BIT_MU_SHIFT)
#define PERI_RTC_RTC_TSDR_BIT_MT_SHIFT                              (12U)
#define PERI_RTC_RTC_TSDR_BIT_MT_MASK                               (((1U<<1)-1) << PERI_RTC_RTC_TSDR_BIT_MT_SHIFT)
#define PERI_RTC_RTC_TSDR_BIT_WDU_SHIFT                             (13U)
#define PERI_RTC_RTC_TSDR_BIT_WDU_MASK                              (((1U<<3)-1) << PERI_RTC_RTC_TSDR_BIT_WDU_SHIFT)

/*--- register RTC_TSSSR -------------------------------------------------*/
#define PERI_RTC_RTC_TSSSR_BIT_SS_SHIFT                             (0U)
#define PERI_RTC_RTC_TSSSR_BIT_SS_MASK                              (((1U<<16)-1) << PERI_RTC_RTC_TSSSR_BIT_SS_SHIFT)

/*--- register RTC_CALR -------------------------------------------------*/
#define PERI_RTC_RTC_CALR_BIT_CALM_SHIFT                            (0U)
#define PERI_RTC_RTC_CALR_BIT_CALM_MASK                             (((1U<<9)-1) << PERI_RTC_RTC_CALR_BIT_CALM_SHIFT)
#define PERI_RTC_RTC_CALR_BIT_CALW16_SHIFT                          (13U)
#define PERI_RTC_RTC_CALR_BIT_CALW16_MASK                           (((1U<<1)-1) << PERI_RTC_RTC_CALR_BIT_CALW16_SHIFT)
#define PERI_RTC_RTC_CALR_BIT_CALW8_SHIFT                           (14U)
#define PERI_RTC_RTC_CALR_BIT_CALW8_MASK                            (((1U<<1)-1) << PERI_RTC_RTC_CALR_BIT_CALW8_SHIFT)
#define PERI_RTC_RTC_CALR_BIT_CALP_SHIFT                            (15U)
#define PERI_RTC_RTC_CALR_BIT_CALP_MASK                             (((1U<<1)-1) << PERI_RTC_RTC_CALR_BIT_CALP_SHIFT)

/*--- register RTC_TAMPCR -------------------------------------------------*/
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1E_SHIFT                        (0U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1E_MASK                         (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP1E_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1TRG_SHIFT                      (1U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1TRG_MASK                       (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP1TRG_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPIE_SHIFT                        (2U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPIE_MASK                         (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMPIE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2E_SHIFT                        (3U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2E_MASK                         (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP2E_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2TRG_SHIFT                      (4U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2TRG_MASK                       (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP2TRG_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3E_SHIFT                        (5U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3E_MASK                         (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP3E_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3TRG_SHIFT                      (6U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3TRG_MASK                       (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP3TRG_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPTS_SHIFT                        (7U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPTS_MASK                         (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMPTS_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPFREQ_SHIFT                      (8U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPFREQ_MASK                       (((1U<<3)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMPFREQ_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPFLT_SHIFT                       (11U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPFLT_MASK                        (((1U<<2)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMPFLT_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPPRCH_SHIFT                      (13U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPPRCH_MASK                       (((1U<<2)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMPPRCH_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPPUDIS_SHIFT                     (15U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMPPUDIS_MASK                      (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMPPUDIS_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1IE_SHIFT                       (16U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1IE_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP1IE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1NOERASE_SHIFT                  (17U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1NOERASE_MASK                   (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP1NOERASE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1MF_SHIFT                       (18U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP1MF_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP1MF_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2IE_SHIFT                       (19U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2IE_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP2IE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2NOERASE_SHIFT                  (20U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2NOERASE_MASK                   (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP2NOERASE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2MF_SHIFT                       (21U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP2MF_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP2MF_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3IE_SHIFT                       (22U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3IE_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP3IE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3NOERASE_SHIFT                  (23U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3NOERASE_MASK                   (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP3NOERASE_SHIFT)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3MF_SHIFT                       (24U)
#define PERI_RTC_RTC_TAMPCR_BIT_TAMP3MF_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_TAMPCR_BIT_TAMP3MF_SHIFT)

/*--- register RTC_ALRMASSR -------------------------------------------------*/
#define PERI_RTC_RTC_ALRMASSR_BIT_SS_SHIFT                          (0U)
#define PERI_RTC_RTC_ALRMASSR_BIT_SS_MASK                           (((1U<<15)-1) << PERI_RTC_RTC_ALRMASSR_BIT_SS_SHIFT)
#define PERI_RTC_RTC_ALRMASSR_BIT_MASKSS_SHIFT                      (24U)
#define PERI_RTC_RTC_ALRMASSR_BIT_MASKSS_MASK                       (((1U<<4)-1) << PERI_RTC_RTC_ALRMASSR_BIT_MASKSS_SHIFT)

/*--- register RTC_ALRMBSSR -------------------------------------------------*/
#define PERI_RTC_RTC_ALRMBSSR_BIT_SS_SHIFT                          (0U)
#define PERI_RTC_RTC_ALRMBSSR_BIT_SS_MASK                           (((1U<<15)-1) << PERI_RTC_RTC_ALRMBSSR_BIT_SS_SHIFT)
#define PERI_RTC_RTC_ALRMBSSR_BIT_MASKSS_SHIFT                      (24U)
#define PERI_RTC_RTC_ALRMBSSR_BIT_MASKSS_MASK                       (((1U<<4)-1) << PERI_RTC_RTC_ALRMBSSR_BIT_MASKSS_SHIFT)

/*--- register RTC_OR -------------------------------------------------*/
#define PERI_RTC_RTC_OR_BIT_RTC_ALARM_TYPE_SHIFT                    (0U)
#define PERI_RTC_RTC_OR_BIT_RTC_ALARM_TYPE_MASK                     (((1U<<1)-1) << PERI_RTC_RTC_OR_BIT_RTC_ALARM_TYPE_SHIFT)
#define PERI_RTC_RTC_OR_BIT_RTC_OUT_RMP_SHIFT                       (1U)
#define PERI_RTC_RTC_OR_BIT_RTC_OUT_RMP_MASK                        (((1U<<1)-1) << PERI_RTC_RTC_OR_BIT_RTC_OUT_RMP_SHIFT)

/*--- register RTC_BKP0R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP0R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP0R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP0R_BIT_BKP_SHIFT)

/*--- register RTC_BKP1R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP1R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP1R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP1R_BIT_BKP_SHIFT)

/*--- register RTC_BKP2R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP2R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP2R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP2R_BIT_BKP_SHIFT)

/*--- register RTC_BKP3R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP3R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP3R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP3R_BIT_BKP_SHIFT)

/*--- register RTC_BKP4R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP4R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP4R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP4R_BIT_BKP_SHIFT)

/*--- register RTC_BKP5R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP5R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP5R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP5R_BIT_BKP_SHIFT)

/*--- register RTC_BKP6R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP6R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP6R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP6R_BIT_BKP_SHIFT)

/*--- register RTC_BKP7R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP7R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP7R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP7R_BIT_BKP_SHIFT)

/*--- register RTC_BKP8R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP8R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP8R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP8R_BIT_BKP_SHIFT)

/*--- register RTC_BKP9R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP9R_BIT_BKP_SHIFT                            (0U)
#define PERI_RTC_RTC_BKP9R_BIT_BKP_MASK                             (((1U<<32)-1) << PERI_RTC_RTC_BKP9R_BIT_BKP_SHIFT)

