minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RTC_BKP10R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP10R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP10R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP10R_BIT_BKP_SHIFT)

/*--- register RTC_BKP11R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP11R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP11R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP11R_BIT_BKP_SHIFT)

/*--- register RTC_BKP12R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP12R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP12R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP12R_BIT_BKP_SHIFT)

/*--- register RTC_BKP13R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP13R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP13R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP13R_BIT_BKP_SHIFT)

/*--- register RTC_BKP14R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP14R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP14R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP14R_BIT_BKP_SHIFT)

/*--- register RTC_BKP15R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP15R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP15R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP15R_BIT_BKP_SHIFT)

/*--- register RTC_BKP16R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP16R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP16R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP16R_BIT_BKP_SHIFT)

/*--- register RTC_BKP17R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP17R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP17R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP17R_BIT_BKP_SHIFT)

/*--- register RTC_BKP18R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP18R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP18R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP18R_BIT_BKP_SHIFT)

/*--- register RTC_BKP19R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP19R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP19R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP19R_BIT_BKP_SHIFT)

/*--- register RTC_BKP20R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP20R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP20R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP20R_BIT_BKP_SHIFT)

/*--- register RTC_BKP21R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP21R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP21R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP21R_BIT_BKP_SHIFT)

/*--- register RTC_BKP22R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP22R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP22R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP22R_BIT_BKP_SHIFT)

/*--- register RTC_BKP23R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP23R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP23R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP23R_BIT_BKP_SHIFT)

/*--- register RTC_BKP24R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP24R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP24R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP24R_BIT_BKP_SHIFT)

/*--- register RTC_BKP25R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP25R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP25R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP25R_BIT_BKP_SHIFT)

/*--- register RTC_BKP26R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP26R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP26R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP26R_BIT_BKP_SHIFT)

/*--- register RTC_BKP27R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP27R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP27R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP27R_BIT_BKP_SHIFT)

/*--- register RTC_BKP28R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP28R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP28R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP28R_BIT_BKP_SHIFT)

/*--- register RTC_BKP29R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP29R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP29R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP29R_BIT_BKP_SHIFT)

/*--- register RTC_BKP30R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP30R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP30R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP30R_BIT_BKP_SHIFT)

/*--- register RTC_BKP31R -------------------------------------------------*/
#define PERI_RTC_RTC_BKP31R_BIT_BKP_SHIFT                           (0U)
#define PERI_RTC_RTC_BKP31R_BIT_BKP_MASK                            (((1U<<32)-1) << PERI_RTC_RTC_BKP31R_BIT_BKP_SHIFT)

/*--- register SAI_GCR -------------------------------------------------*/
#define PERI_SAI1_SAI_GCR_BIT_SYNCIN_SHIFT                          (0U)
#define PERI_SAI1_SAI_GCR_BIT_SYNCIN_MASK                           (((1U<<2)-1) << PERI_SAI1_SAI_GCR_BIT_SYNCIN_SHIFT)
#define PERI_SAI1_SAI_GCR_BIT_SYNCOUT_SHIFT                         (4U)
#define PERI_SAI1_SAI_GCR_BIT_SYNCOUT_MASK                          (((1U<<2)-1) << PERI_SAI1_SAI_GCR_BIT_SYNCOUT_SHIFT)

/*--- register SAI_ACR1 -------------------------------------------------*/
#define PERI_SAI1_SAI_ACR1_BIT_MODE_SHIFT                           (0U)
#define PERI_SAI1_SAI_ACR1_BIT_MODE_MASK                            (((1U<<2)-1) << PERI_SAI1_SAI_ACR1_BIT_MODE_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_PRTCFG_SHIFT                         (2U)
#define PERI_SAI1_SAI_ACR1_BIT_PRTCFG_MASK                          (((1U<<2)-1) << PERI_SAI1_SAI_ACR1_BIT_PRTCFG_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_DS_SHIFT                             (5U)
#define PERI_SAI1_SAI_ACR1_BIT_DS_MASK                              (((1U<<3)-1) << PERI_SAI1_SAI_ACR1_BIT_DS_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_LSBFIRST_SHIFT                       (8U)
#define PERI_SAI1_SAI_ACR1_BIT_LSBFIRST_MASK                        (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_LSBFIRST_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_CKSTR_SHIFT                          (9U)
#define PERI_SAI1_SAI_ACR1_BIT_CKSTR_MASK                           (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_CKSTR_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_SYNCEN_SHIFT                         (10U)
#define PERI_SAI1_SAI_ACR1_BIT_SYNCEN_MASK                          (((1U<<2)-1) << PERI_SAI1_SAI_ACR1_BIT_SYNCEN_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_MONO_SHIFT                           (12U)
#define PERI_SAI1_SAI_ACR1_BIT_MONO_MASK                            (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_MONO_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_OUTDRIV_SHIFT                        (13U)
#define PERI_SAI1_SAI_ACR1_BIT_OUTDRIV_MASK                         (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_OUTDRIV_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_SAIXEN_SHIFT                         (16U)
#define PERI_SAI1_SAI_ACR1_BIT_SAIXEN_MASK                          (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_SAIXEN_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_DMAEN_SHIFT                          (17U)
#define PERI_SAI1_SAI_ACR1_BIT_DMAEN_MASK                           (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_DMAEN_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_NOMCK_SHIFT                          (19U)
#define PERI_SAI1_SAI_ACR1_BIT_NOMCK_MASK                           (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_NOMCK_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_MCKDIV_SHIFT                         (20U)
#define PERI_SAI1_SAI_ACR1_BIT_MCKDIV_MASK                          (((1U<<4)-1) << PERI_SAI1_SAI_ACR1_BIT_MCKDIV_SHIFT)
#define PERI_SAI1_SAI_ACR1_BIT_OSR_SHIFT                            (26U)
#define PERI_SAI1_SAI_ACR1_BIT_OSR_MASK                             (((1U<<1)-1) << PERI_SAI1_SAI_ACR1_BIT_OSR_SHIFT)

/*--- register SAI_ACR2 -------------------------------------------------*/
#define PERI_SAI1_SAI_ACR2_BIT_FTH_SHIFT                            (0U)
#define PERI_SAI1_SAI_ACR2_BIT_FTH_MASK                             (((1U<<3)-1) << PERI_SAI1_SAI_ACR2_BIT_FTH_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_FFLUSH_SHIFT                         (3U)
#define PERI_SAI1_SAI_ACR2_BIT_FFLUSH_MASK                          (((1U<<1)-1) << PERI_SAI1_SAI_ACR2_BIT_FFLUSH_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_TRIS_SHIFT                           (4U)
#define PERI_SAI1_SAI_ACR2_BIT_TRIS_MASK                            (((1U<<1)-1) << PERI_SAI1_SAI_ACR2_BIT_TRIS_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_MUTE_SHIFT                           (5U)
#define PERI_SAI1_SAI_ACR2_BIT_MUTE_MASK                            (((1U<<1)-1) << PERI_SAI1_SAI_ACR2_BIT_MUTE_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_MUTEVAL_SHIFT                        (6U)
#define PERI_SAI1_SAI_ACR2_BIT_MUTEVAL_MASK                         (((1U<<1)-1) << PERI_SAI1_SAI_ACR2_BIT_MUTEVAL_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_MUTECNT_SHIFT                        (7U)
#define PERI_SAI1_SAI_ACR2_BIT_MUTECNT_MASK                         (((1U<<6)-1) << PERI_SAI1_SAI_ACR2_BIT_MUTECNT_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_CPL_SHIFT                            (13U)
#define PERI_SAI1_SAI_ACR2_BIT_CPL_MASK                             (((1U<<1)-1) << PERI_SAI1_SAI_ACR2_BIT_CPL_SHIFT)
#define PERI_SAI1_SAI_ACR2_BIT_COMP_SHIFT                           (14U)
#define PERI_SAI1_SAI_ACR2_BIT_COMP_MASK                            (((1U<<2)-1) << PERI_SAI1_SAI_ACR2_BIT_COMP_SHIFT)

/*--- register SAI_AFRCR -------------------------------------------------*/
#define PERI_SAI1_SAI_AFRCR_BIT_FRL_SHIFT                           (0U)
#define PERI_SAI1_SAI_AFRCR_BIT_FRL_MASK                            (((1U<<8)-1) << PERI_SAI1_SAI_AFRCR_BIT_FRL_SHIFT)
#define PERI_SAI1_SAI_AFRCR_BIT_FSALL_SHIFT                         (8U)
#define PERI_SAI1_SAI_AFRCR_BIT_FSALL_MASK                          (((1U<<7)-1) << PERI_SAI1_SAI_AFRCR_BIT_FSALL_SHIFT)
#define PERI_SAI1_SAI_AFRCR_BIT_FSDEF_SHIFT                         (16U)
#define PERI_SAI1_SAI_AFRCR_BIT_FSDEF_MASK                          (((1U<<1)-1) << PERI_SAI1_SAI_AFRCR_BIT_FSDEF_SHIFT)
#define PERI_SAI1_SAI_AFRCR_BIT_FSPOL_SHIFT                         (17U)
#define PERI_SAI1_SAI_AFRCR_BIT_FSPOL_MASK                          (((1U<<1)-1) << PERI_SAI1_SAI_AFRCR_BIT_FSPOL_SHIFT)
#define PERI_SAI1_SAI_AFRCR_BIT_FSOFF_SHIFT                         (18U)
#define PERI_SAI1_SAI_AFRCR_BIT_FSOFF_MASK                          (((1U<<1)-1) << PERI_SAI1_SAI_AFRCR_BIT_FSOFF_SHIFT)

