minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SAI_ASLOTR -------------------------------------------------*/
#define PERI_SAI3_SAI_ASLOTR_BIT_FBOFF_SHIFT                        (0U)
#define PERI_SAI3_SAI_ASLOTR_BIT_FBOFF_MASK                         (((1U<<5)-1) << PERI_SAI3_SAI_ASLOTR_BIT_FBOFF_SHIFT)
#define PERI_SAI3_SAI_ASLOTR_BIT_SLOTSZ_SHIFT                       (6U)
#define PERI_SAI3_SAI_ASLOTR_BIT_SLOTSZ_MASK                        (((1U<<2)-1) << PERI_SAI3_SAI_ASLOTR_BIT_SLOTSZ_SHIFT)
#define PERI_SAI3_SAI_ASLOTR_BIT_NBSLOT_SHIFT                       (8U)
#define PERI_SAI3_SAI_ASLOTR_BIT_NBSLOT_MASK                        (((1U<<4)-1) << PERI_SAI3_SAI_ASLOTR_BIT_NBSLOT_SHIFT)
#define PERI_SAI3_SAI_ASLOTR_BIT_SLOTEN_SHIFT                       (16U)
#define PERI_SAI3_SAI_ASLOTR_BIT_SLOTEN_MASK                        (((1U<<16)-1) << PERI_SAI3_SAI_ASLOTR_BIT_SLOTEN_SHIFT)

/*--- register SAI_AIM -------------------------------------------------*/
#define PERI_SAI3_SAI_AIM_BIT_OVRUDRIE_SHIFT                        (0U)
#define PERI_SAI3_SAI_AIM_BIT_OVRUDRIE_MASK                         (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_OVRUDRIE_SHIFT)
#define PERI_SAI3_SAI_AIM_BIT_MUTEDETIE_SHIFT                       (1U)
#define PERI_SAI3_SAI_AIM_BIT_MUTEDETIE_MASK                        (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_MUTEDETIE_SHIFT)
#define PERI_SAI3_SAI_AIM_BIT_WCKCFGIE_SHIFT                        (2U)
#define PERI_SAI3_SAI_AIM_BIT_WCKCFGIE_MASK                         (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_WCKCFGIE_SHIFT)
#define PERI_SAI3_SAI_AIM_BIT_FREQIE_SHIFT                          (3U)
#define PERI_SAI3_SAI_AIM_BIT_FREQIE_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_FREQIE_SHIFT)
#define PERI_SAI3_SAI_AIM_BIT_CNRDYIE_SHIFT                         (4U)
#define PERI_SAI3_SAI_AIM_BIT_CNRDYIE_MASK                          (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_CNRDYIE_SHIFT)
#define PERI_SAI3_SAI_AIM_BIT_AFSDETIE_SHIFT                        (5U)
#define PERI_SAI3_SAI_AIM_BIT_AFSDETIE_MASK                         (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_AFSDETIE_SHIFT)
#define PERI_SAI3_SAI_AIM_BIT_LFSDETIE_SHIFT                        (6U)
#define PERI_SAI3_SAI_AIM_BIT_LFSDETIE_MASK                         (((1U<<1)-1) << PERI_SAI3_SAI_AIM_BIT_LFSDETIE_SHIFT)

/*--- register SAI_ASR -------------------------------------------------*/
#define PERI_SAI3_SAI_ASR_BIT_OVRUDR_SHIFT                          (0U)
#define PERI_SAI3_SAI_ASR_BIT_OVRUDR_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_OVRUDR_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_MUTEDET_SHIFT                         (1U)
#define PERI_SAI3_SAI_ASR_BIT_MUTEDET_MASK                          (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_MUTEDET_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_WCKCFG_SHIFT                          (2U)
#define PERI_SAI3_SAI_ASR_BIT_WCKCFG_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_WCKCFG_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_FREQ_SHIFT                            (3U)
#define PERI_SAI3_SAI_ASR_BIT_FREQ_MASK                             (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_FREQ_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_CNRDY_SHIFT                           (4U)
#define PERI_SAI3_SAI_ASR_BIT_CNRDY_MASK                            (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_CNRDY_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_AFSDET_SHIFT                          (5U)
#define PERI_SAI3_SAI_ASR_BIT_AFSDET_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_AFSDET_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_LFSDET_SHIFT                          (6U)
#define PERI_SAI3_SAI_ASR_BIT_LFSDET_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_ASR_BIT_LFSDET_SHIFT)
#define PERI_SAI3_SAI_ASR_BIT_FLVL_SHIFT                            (16U)
#define PERI_SAI3_SAI_ASR_BIT_FLVL_MASK                             (((1U<<3)-1) << PERI_SAI3_SAI_ASR_BIT_FLVL_SHIFT)

/*--- register SAI_ACLRFR -------------------------------------------------*/
#define PERI_SAI3_SAI_ACLRFR_BIT_COVRUDR_SHIFT                      (0U)
#define PERI_SAI3_SAI_ACLRFR_BIT_COVRUDR_MASK                       (((1U<<1)-1) << PERI_SAI3_SAI_ACLRFR_BIT_COVRUDR_SHIFT)
#define PERI_SAI3_SAI_ACLRFR_BIT_CMUTEDET_SHIFT                     (1U)
#define PERI_SAI3_SAI_ACLRFR_BIT_CMUTEDET_MASK                      (((1U<<1)-1) << PERI_SAI3_SAI_ACLRFR_BIT_CMUTEDET_SHIFT)
#define PERI_SAI3_SAI_ACLRFR_BIT_CWCKCFG_SHIFT                      (2U)
#define PERI_SAI3_SAI_ACLRFR_BIT_CWCKCFG_MASK                       (((1U<<1)-1) << PERI_SAI3_SAI_ACLRFR_BIT_CWCKCFG_SHIFT)
#define PERI_SAI3_SAI_ACLRFR_BIT_CCNRDY_SHIFT                       (4U)
#define PERI_SAI3_SAI_ACLRFR_BIT_CCNRDY_MASK                        (((1U<<1)-1) << PERI_SAI3_SAI_ACLRFR_BIT_CCNRDY_SHIFT)
#define PERI_SAI3_SAI_ACLRFR_BIT_CAFSDET_SHIFT                      (5U)
#define PERI_SAI3_SAI_ACLRFR_BIT_CAFSDET_MASK                       (((1U<<1)-1) << PERI_SAI3_SAI_ACLRFR_BIT_CAFSDET_SHIFT)
#define PERI_SAI3_SAI_ACLRFR_BIT_CLFSDET_SHIFT                      (6U)
#define PERI_SAI3_SAI_ACLRFR_BIT_CLFSDET_MASK                       (((1U<<1)-1) << PERI_SAI3_SAI_ACLRFR_BIT_CLFSDET_SHIFT)

/*--- register SAI_ADR -------------------------------------------------*/
#define PERI_SAI3_SAI_ADR_BIT_DATA_SHIFT                            (0U)
#define PERI_SAI3_SAI_ADR_BIT_DATA_MASK                             (((1U<<32)-1) << PERI_SAI3_SAI_ADR_BIT_DATA_SHIFT)

/*--- register SAI_BCR1 -------------------------------------------------*/
#define PERI_SAI3_SAI_BCR1_BIT_MODE_SHIFT                           (0U)
#define PERI_SAI3_SAI_BCR1_BIT_MODE_MASK                            (((1U<<2)-1) << PERI_SAI3_SAI_BCR1_BIT_MODE_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_PRTCFG_SHIFT                         (2U)
#define PERI_SAI3_SAI_BCR1_BIT_PRTCFG_MASK                          (((1U<<2)-1) << PERI_SAI3_SAI_BCR1_BIT_PRTCFG_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_DS_SHIFT                             (5U)
#define PERI_SAI3_SAI_BCR1_BIT_DS_MASK                              (((1U<<3)-1) << PERI_SAI3_SAI_BCR1_BIT_DS_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_LSBFIRST_SHIFT                       (8U)
#define PERI_SAI3_SAI_BCR1_BIT_LSBFIRST_MASK                        (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_LSBFIRST_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_CKSTR_SHIFT                          (9U)
#define PERI_SAI3_SAI_BCR1_BIT_CKSTR_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_CKSTR_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_SYNCEN_SHIFT                         (10U)
#define PERI_SAI3_SAI_BCR1_BIT_SYNCEN_MASK                          (((1U<<2)-1) << PERI_SAI3_SAI_BCR1_BIT_SYNCEN_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_MONO_SHIFT                           (12U)
#define PERI_SAI3_SAI_BCR1_BIT_MONO_MASK                            (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_MONO_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_OUTDRIV_SHIFT                        (13U)
#define PERI_SAI3_SAI_BCR1_BIT_OUTDRIV_MASK                         (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_OUTDRIV_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_SAIXEN_SHIFT                         (16U)
#define PERI_SAI3_SAI_BCR1_BIT_SAIXEN_MASK                          (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_SAIXEN_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_DMAEN_SHIFT                          (17U)
#define PERI_SAI3_SAI_BCR1_BIT_DMAEN_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_DMAEN_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_NOMCK_SHIFT                          (19U)
#define PERI_SAI3_SAI_BCR1_BIT_NOMCK_MASK                           (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_NOMCK_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_MCKDIV_SHIFT                         (20U)
#define PERI_SAI3_SAI_BCR1_BIT_MCKDIV_MASK                          (((1U<<4)-1) << PERI_SAI3_SAI_BCR1_BIT_MCKDIV_SHIFT)
#define PERI_SAI3_SAI_BCR1_BIT_OSR_SHIFT                            (26U)
#define PERI_SAI3_SAI_BCR1_BIT_OSR_MASK                             (((1U<<1)-1) << PERI_SAI3_SAI_BCR1_BIT_OSR_SHIFT)

