minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SAI_BCR2 -------------------------------------------------*/
#define PERI_SAI4_SAI_BCR2_BIT_FTH_SHIFT                            (0U)
#define PERI_SAI4_SAI_BCR2_BIT_FTH_MASK                             (((1U<<3)-1) << PERI_SAI4_SAI_BCR2_BIT_FTH_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_FFLUSH_SHIFT                         (3U)
#define PERI_SAI4_SAI_BCR2_BIT_FFLUSH_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_BCR2_BIT_FFLUSH_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_TRIS_SHIFT                           (4U)
#define PERI_SAI4_SAI_BCR2_BIT_TRIS_MASK                            (((1U<<1)-1) << PERI_SAI4_SAI_BCR2_BIT_TRIS_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_MUTE_SHIFT                           (5U)
#define PERI_SAI4_SAI_BCR2_BIT_MUTE_MASK                            (((1U<<1)-1) << PERI_SAI4_SAI_BCR2_BIT_MUTE_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_MUTEVAL_SHIFT                        (6U)
#define PERI_SAI4_SAI_BCR2_BIT_MUTEVAL_MASK                         (((1U<<1)-1) << PERI_SAI4_SAI_BCR2_BIT_MUTEVAL_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_MUTECNT_SHIFT                        (7U)
#define PERI_SAI4_SAI_BCR2_BIT_MUTECNT_MASK                         (((1U<<6)-1) << PERI_SAI4_SAI_BCR2_BIT_MUTECNT_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_CPL_SHIFT                            (13U)
#define PERI_SAI4_SAI_BCR2_BIT_CPL_MASK                             (((1U<<1)-1) << PERI_SAI4_SAI_BCR2_BIT_CPL_SHIFT)
#define PERI_SAI4_SAI_BCR2_BIT_COMP_SHIFT                           (14U)
#define PERI_SAI4_SAI_BCR2_BIT_COMP_MASK                            (((1U<<2)-1) << PERI_SAI4_SAI_BCR2_BIT_COMP_SHIFT)

/*--- register SAI_BFRCR -------------------------------------------------*/
#define PERI_SAI4_SAI_BFRCR_BIT_FRL_SHIFT                           (0U)
#define PERI_SAI4_SAI_BFRCR_BIT_FRL_MASK                            (((1U<<8)-1) << PERI_SAI4_SAI_BFRCR_BIT_FRL_SHIFT)
#define PERI_SAI4_SAI_BFRCR_BIT_FSALL_SHIFT                         (8U)
#define PERI_SAI4_SAI_BFRCR_BIT_FSALL_MASK                          (((1U<<7)-1) << PERI_SAI4_SAI_BFRCR_BIT_FSALL_SHIFT)
#define PERI_SAI4_SAI_BFRCR_BIT_FSDEF_SHIFT                         (16U)
#define PERI_SAI4_SAI_BFRCR_BIT_FSDEF_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_BFRCR_BIT_FSDEF_SHIFT)
#define PERI_SAI4_SAI_BFRCR_BIT_FSPOL_SHIFT                         (17U)
#define PERI_SAI4_SAI_BFRCR_BIT_FSPOL_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_BFRCR_BIT_FSPOL_SHIFT)
#define PERI_SAI4_SAI_BFRCR_BIT_FSOFF_SHIFT                         (18U)
#define PERI_SAI4_SAI_BFRCR_BIT_FSOFF_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_BFRCR_BIT_FSOFF_SHIFT)

/*--- register SAI_BSLOTR -------------------------------------------------*/
#define PERI_SAI4_SAI_BSLOTR_BIT_FBOFF_SHIFT                        (0U)
#define PERI_SAI4_SAI_BSLOTR_BIT_FBOFF_MASK                         (((1U<<5)-1) << PERI_SAI4_SAI_BSLOTR_BIT_FBOFF_SHIFT)
#define PERI_SAI4_SAI_BSLOTR_BIT_SLOTSZ_SHIFT                       (6U)
#define PERI_SAI4_SAI_BSLOTR_BIT_SLOTSZ_MASK                        (((1U<<2)-1) << PERI_SAI4_SAI_BSLOTR_BIT_SLOTSZ_SHIFT)
#define PERI_SAI4_SAI_BSLOTR_BIT_NBSLOT_SHIFT                       (8U)
#define PERI_SAI4_SAI_BSLOTR_BIT_NBSLOT_MASK                        (((1U<<4)-1) << PERI_SAI4_SAI_BSLOTR_BIT_NBSLOT_SHIFT)
#define PERI_SAI4_SAI_BSLOTR_BIT_SLOTEN_SHIFT                       (16U)
#define PERI_SAI4_SAI_BSLOTR_BIT_SLOTEN_MASK                        (((1U<<16)-1) << PERI_SAI4_SAI_BSLOTR_BIT_SLOTEN_SHIFT)

/*--- register SAI_BIM -------------------------------------------------*/
#define PERI_SAI4_SAI_BIM_BIT_OVRUDRIE_SHIFT                        (0U)
#define PERI_SAI4_SAI_BIM_BIT_OVRUDRIE_MASK                         (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_OVRUDRIE_SHIFT)
#define PERI_SAI4_SAI_BIM_BIT_MUTEDETIE_SHIFT                       (1U)
#define PERI_SAI4_SAI_BIM_BIT_MUTEDETIE_MASK                        (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_MUTEDETIE_SHIFT)
#define PERI_SAI4_SAI_BIM_BIT_WCKCFGIE_SHIFT                        (2U)
#define PERI_SAI4_SAI_BIM_BIT_WCKCFGIE_MASK                         (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_WCKCFGIE_SHIFT)
#define PERI_SAI4_SAI_BIM_BIT_FREQIE_SHIFT                          (3U)
#define PERI_SAI4_SAI_BIM_BIT_FREQIE_MASK                           (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_FREQIE_SHIFT)
#define PERI_SAI4_SAI_BIM_BIT_CNRDYIE_SHIFT                         (4U)
#define PERI_SAI4_SAI_BIM_BIT_CNRDYIE_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_CNRDYIE_SHIFT)
#define PERI_SAI4_SAI_BIM_BIT_AFSDETIE_SHIFT                        (5U)
#define PERI_SAI4_SAI_BIM_BIT_AFSDETIE_MASK                         (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_AFSDETIE_SHIFT)
#define PERI_SAI4_SAI_BIM_BIT_LFSDETIE_SHIFT                        (6U)
#define PERI_SAI4_SAI_BIM_BIT_LFSDETIE_MASK                         (((1U<<1)-1) << PERI_SAI4_SAI_BIM_BIT_LFSDETIE_SHIFT)

/*--- register SAI_BSR -------------------------------------------------*/
#define PERI_SAI4_SAI_BSR_BIT_OVRUDR_SHIFT                          (0U)
#define PERI_SAI4_SAI_BSR_BIT_OVRUDR_MASK                           (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_OVRUDR_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_MUTEDET_SHIFT                         (1U)
#define PERI_SAI4_SAI_BSR_BIT_MUTEDET_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_MUTEDET_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_WCKCFG_SHIFT                          (2U)
#define PERI_SAI4_SAI_BSR_BIT_WCKCFG_MASK                           (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_WCKCFG_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_FREQ_SHIFT                            (3U)
#define PERI_SAI4_SAI_BSR_BIT_FREQ_MASK                             (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_FREQ_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_CNRDY_SHIFT                           (4U)
#define PERI_SAI4_SAI_BSR_BIT_CNRDY_MASK                            (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_CNRDY_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_AFSDET_SHIFT                          (5U)
#define PERI_SAI4_SAI_BSR_BIT_AFSDET_MASK                           (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_AFSDET_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_LFSDET_SHIFT                          (6U)
#define PERI_SAI4_SAI_BSR_BIT_LFSDET_MASK                           (((1U<<1)-1) << PERI_SAI4_SAI_BSR_BIT_LFSDET_SHIFT)
#define PERI_SAI4_SAI_BSR_BIT_FLVL_SHIFT                            (16U)
#define PERI_SAI4_SAI_BSR_BIT_FLVL_MASK                             (((1U<<3)-1) << PERI_SAI4_SAI_BSR_BIT_FLVL_SHIFT)

/*--- register SAI_BCLRFR -------------------------------------------------*/
#define PERI_SAI4_SAI_BCLRFR_BIT_COVRUDR_SHIFT                      (0U)
#define PERI_SAI4_SAI_BCLRFR_BIT_COVRUDR_MASK                       (((1U<<1)-1) << PERI_SAI4_SAI_BCLRFR_BIT_COVRUDR_SHIFT)
#define PERI_SAI4_SAI_BCLRFR_BIT_CMUTEDET_SHIFT                     (1U)
#define PERI_SAI4_SAI_BCLRFR_BIT_CMUTEDET_MASK                      (((1U<<1)-1) << PERI_SAI4_SAI_BCLRFR_BIT_CMUTEDET_SHIFT)
#define PERI_SAI4_SAI_BCLRFR_BIT_CWCKCFG_SHIFT                      (2U)
#define PERI_SAI4_SAI_BCLRFR_BIT_CWCKCFG_MASK                       (((1U<<1)-1) << PERI_SAI4_SAI_BCLRFR_BIT_CWCKCFG_SHIFT)
#define PERI_SAI4_SAI_BCLRFR_BIT_CCNRDY_SHIFT                       (4U)
#define PERI_SAI4_SAI_BCLRFR_BIT_CCNRDY_MASK                        (((1U<<1)-1) << PERI_SAI4_SAI_BCLRFR_BIT_CCNRDY_SHIFT)
#define PERI_SAI4_SAI_BCLRFR_BIT_CAFSDET_SHIFT                      (5U)
#define PERI_SAI4_SAI_BCLRFR_BIT_CAFSDET_MASK                       (((1U<<1)-1) << PERI_SAI4_SAI_BCLRFR_BIT_CAFSDET_SHIFT)
#define PERI_SAI4_SAI_BCLRFR_BIT_CLFSDET_SHIFT                      (6U)
#define PERI_SAI4_SAI_BCLRFR_BIT_CLFSDET_MASK                       (((1U<<1)-1) << PERI_SAI4_SAI_BCLRFR_BIT_CLFSDET_SHIFT)

/*--- register SAI_BDR -------------------------------------------------*/
#define PERI_SAI4_SAI_BDR_BIT_DATA_SHIFT                            (0U)
#define PERI_SAI4_SAI_BDR_BIT_DATA_MASK                             (((1U<<32)-1) << PERI_SAI4_SAI_BDR_BIT_DATA_SHIFT)

/*--- register SAI_PDMCR -------------------------------------------------*/
#define PERI_SAI4_SAI_PDMCR_BIT_PDMEN_SHIFT                         (0U)
#define PERI_SAI4_SAI_PDMCR_BIT_PDMEN_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_PDMCR_BIT_PDMEN_SHIFT)
#define PERI_SAI4_SAI_PDMCR_BIT_MICNBR_SHIFT                        (4U)
#define PERI_SAI4_SAI_PDMCR_BIT_MICNBR_MASK                         (((1U<<2)-1) << PERI_SAI4_SAI_PDMCR_BIT_MICNBR_SHIFT)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN1_SHIFT                         (8U)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN1_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_PDMCR_BIT_CKEN1_SHIFT)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN2_SHIFT                         (9U)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN2_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_PDMCR_BIT_CKEN2_SHIFT)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN3_SHIFT                         (10U)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN3_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_PDMCR_BIT_CKEN3_SHIFT)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN4_SHIFT                         (11U)
#define PERI_SAI4_SAI_PDMCR_BIT_CKEN4_MASK                          (((1U<<1)-1) << PERI_SAI4_SAI_PDMCR_BIT_CKEN4_SHIFT)

/*--- register SAI_PDMDLY -------------------------------------------------*/
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM1L_SHIFT                       (0U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM1L_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM1L_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM1R_SHIFT                       (4U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM1R_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM1R_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM2L_SHIFT                       (8U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM2L_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM2L_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM2R_SHIFT                       (12U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM2R_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM2R_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM3L_SHIFT                       (16U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM3L_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM3L_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM3R_SHIFT                       (20U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM3R_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM3R_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM4L_SHIFT                       (24U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM4L_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM4L_SHIFT)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM4R_SHIFT                       (28U)
#define PERI_SAI4_SAI_PDMDLY_BIT_DLYM4R_MASK                        (((1U<<3)-1) << PERI_SAI4_SAI_PDMDLY_BIT_DLYM4R_SHIFT)

/*--- register POWER -------------------------------------------------*/
#define PERI_SDMMC1_POWER_BIT_PWRCTRL_SHIFT                         (0U)
#define PERI_SDMMC1_POWER_BIT_PWRCTRL_MASK                          (((1U<<2)-1) << PERI_SDMMC1_POWER_BIT_PWRCTRL_SHIFT)
#define PERI_SDMMC1_POWER_BIT_VSWITCH_SHIFT                         (2U)
#define PERI_SDMMC1_POWER_BIT_VSWITCH_MASK                          (((1U<<1)-1) << PERI_SDMMC1_POWER_BIT_VSWITCH_SHIFT)
#define PERI_SDMMC1_POWER_BIT_VSWITCHEN_SHIFT                       (3U)
#define PERI_SDMMC1_POWER_BIT_VSWITCHEN_MASK                        (((1U<<1)-1) << PERI_SDMMC1_POWER_BIT_VSWITCHEN_SHIFT)
#define PERI_SDMMC1_POWER_BIT_DIRPOL_SHIFT                          (4U)
#define PERI_SDMMC1_POWER_BIT_DIRPOL_MASK                           (((1U<<1)-1) << PERI_SDMMC1_POWER_BIT_DIRPOL_SHIFT)

