minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CLKCR -------------------------------------------------*/
#define PERI_SDMMC1_CLKCR_BIT_CLKDIV_SHIFT                          (0U)
#define PERI_SDMMC1_CLKCR_BIT_CLKDIV_MASK                           (((1U<<10)-1) << PERI_SDMMC1_CLKCR_BIT_CLKDIV_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_PWRSAV_SHIFT                          (12U)
#define PERI_SDMMC1_CLKCR_BIT_PWRSAV_MASK                           (((1U<<1)-1) << PERI_SDMMC1_CLKCR_BIT_PWRSAV_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_WIDBUS_SHIFT                          (14U)
#define PERI_SDMMC1_CLKCR_BIT_WIDBUS_MASK                           (((1U<<2)-1) << PERI_SDMMC1_CLKCR_BIT_WIDBUS_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_NEGEDGE_SHIFT                         (16U)
#define PERI_SDMMC1_CLKCR_BIT_NEGEDGE_MASK                          (((1U<<1)-1) << PERI_SDMMC1_CLKCR_BIT_NEGEDGE_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_HWFC_EN_SHIFT                         (17U)
#define PERI_SDMMC1_CLKCR_BIT_HWFC_EN_MASK                          (((1U<<1)-1) << PERI_SDMMC1_CLKCR_BIT_HWFC_EN_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_DDR_SHIFT                             (18U)
#define PERI_SDMMC1_CLKCR_BIT_DDR_MASK                              (((1U<<1)-1) << PERI_SDMMC1_CLKCR_BIT_DDR_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_BUSSPEED_SHIFT                        (19U)
#define PERI_SDMMC1_CLKCR_BIT_BUSSPEED_MASK                         (((1U<<1)-1) << PERI_SDMMC1_CLKCR_BIT_BUSSPEED_SHIFT)
#define PERI_SDMMC1_CLKCR_BIT_SELCLKRX_SHIFT                        (20U)
#define PERI_SDMMC1_CLKCR_BIT_SELCLKRX_MASK                         (((1U<<2)-1) << PERI_SDMMC1_CLKCR_BIT_SELCLKRX_SHIFT)

/*--- register ARGR -------------------------------------------------*/
#define PERI_SDMMC1_ARGR_BIT_CMDARG_SHIFT                           (0U)
#define PERI_SDMMC1_ARGR_BIT_CMDARG_MASK                            (((1U<<32)-1) << PERI_SDMMC1_ARGR_BIT_CMDARG_SHIFT)

/*--- register CMDR -------------------------------------------------*/
#define PERI_SDMMC1_CMDR_BIT_CMDINDEX_SHIFT                         (0U)
#define PERI_SDMMC1_CMDR_BIT_CMDINDEX_MASK                          (((1U<<6)-1) << PERI_SDMMC1_CMDR_BIT_CMDINDEX_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_CMDTRANS_SHIFT                         (6U)
#define PERI_SDMMC1_CMDR_BIT_CMDTRANS_MASK                          (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_CMDTRANS_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_CMDSTOP_SHIFT                          (7U)
#define PERI_SDMMC1_CMDR_BIT_CMDSTOP_MASK                           (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_CMDSTOP_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_WAITRESP_SHIFT                         (8U)
#define PERI_SDMMC1_CMDR_BIT_WAITRESP_MASK                          (((1U<<2)-1) << PERI_SDMMC1_CMDR_BIT_WAITRESP_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_WAITINT_SHIFT                          (10U)
#define PERI_SDMMC1_CMDR_BIT_WAITINT_MASK                           (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_WAITINT_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_WAITPEND_SHIFT                         (11U)
#define PERI_SDMMC1_CMDR_BIT_WAITPEND_MASK                          (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_WAITPEND_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_CPSMEN_SHIFT                           (12U)
#define PERI_SDMMC1_CMDR_BIT_CPSMEN_MASK                            (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_CPSMEN_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_DTHOLD_SHIFT                           (13U)
#define PERI_SDMMC1_CMDR_BIT_DTHOLD_MASK                            (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_DTHOLD_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_BOOTMODE_SHIFT                         (14U)
#define PERI_SDMMC1_CMDR_BIT_BOOTMODE_MASK                          (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_BOOTMODE_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_BOOTEN_SHIFT                           (15U)
#define PERI_SDMMC1_CMDR_BIT_BOOTEN_MASK                            (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_BOOTEN_SHIFT)
#define PERI_SDMMC1_CMDR_BIT_CMDSUSPEND_SHIFT                       (16U)
#define PERI_SDMMC1_CMDR_BIT_CMDSUSPEND_MASK                        (((1U<<1)-1) << PERI_SDMMC1_CMDR_BIT_CMDSUSPEND_SHIFT)

/*--- register RESPCMDR -------------------------------------------------*/
#define PERI_SDMMC1_RESPCMDR_BIT_RESPCMD_SHIFT                      (0U)
#define PERI_SDMMC1_RESPCMDR_BIT_RESPCMD_MASK                       (((1U<<6)-1) << PERI_SDMMC1_RESPCMDR_BIT_RESPCMD_SHIFT)

/*--- register RESP1R -------------------------------------------------*/
#define PERI_SDMMC1_RESP1R_BIT_CARDSTATUS1_SHIFT                    (0U)
#define PERI_SDMMC1_RESP1R_BIT_CARDSTATUS1_MASK                     (((1U<<32)-1) << PERI_SDMMC1_RESP1R_BIT_CARDSTATUS1_SHIFT)

/*--- register RESP2R -------------------------------------------------*/
#define PERI_SDMMC1_RESP2R_BIT_CARDSTATUS2_SHIFT                    (0U)
#define PERI_SDMMC1_RESP2R_BIT_CARDSTATUS2_MASK                     (((1U<<32)-1) << PERI_SDMMC1_RESP2R_BIT_CARDSTATUS2_SHIFT)

/*--- register RESP3R -------------------------------------------------*/
#define PERI_SDMMC1_RESP3R_BIT_CARDSTATUS3_SHIFT                    (0U)
#define PERI_SDMMC1_RESP3R_BIT_CARDSTATUS3_MASK                     (((1U<<32)-1) << PERI_SDMMC1_RESP3R_BIT_CARDSTATUS3_SHIFT)

/*--- register RESP4R -------------------------------------------------*/
#define PERI_SDMMC1_RESP4R_BIT_CARDSTATUS4_SHIFT                    (0U)
#define PERI_SDMMC1_RESP4R_BIT_CARDSTATUS4_MASK                     (((1U<<32)-1) << PERI_SDMMC1_RESP4R_BIT_CARDSTATUS4_SHIFT)

/*--- register DTIMER -------------------------------------------------*/
#define PERI_SDMMC1_DTIMER_BIT_DATATIME_SHIFT                       (0U)
#define PERI_SDMMC1_DTIMER_BIT_DATATIME_MASK                        (((1U<<32)-1) << PERI_SDMMC1_DTIMER_BIT_DATATIME_SHIFT)

/*--- register DLENR -------------------------------------------------*/
#define PERI_SDMMC1_DLENR_BIT_DATALENGTH_SHIFT                      (0U)
#define PERI_SDMMC1_DLENR_BIT_DATALENGTH_MASK                       (((1U<<25)-1) << PERI_SDMMC1_DLENR_BIT_DATALENGTH_SHIFT)

