minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register DCTRL -------------------------------------------------*/
#define PERI_SDMMC1_DCTRL_BIT_DTEN_SHIFT                            (0U)
#define PERI_SDMMC1_DCTRL_BIT_DTEN_MASK                             (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_DTEN_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_DTDIR_SHIFT                           (1U)
#define PERI_SDMMC1_DCTRL_BIT_DTDIR_MASK                            (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_DTDIR_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_DTMODE_SHIFT                          (2U)
#define PERI_SDMMC1_DCTRL_BIT_DTMODE_MASK                           (((1U<<2)-1) << PERI_SDMMC1_DCTRL_BIT_DTMODE_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_DBLOCKSIZE_SHIFT                      (4U)
#define PERI_SDMMC1_DCTRL_BIT_DBLOCKSIZE_MASK                       (((1U<<4)-1) << PERI_SDMMC1_DCTRL_BIT_DBLOCKSIZE_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_RWSTART_SHIFT                         (8U)
#define PERI_SDMMC1_DCTRL_BIT_RWSTART_MASK                          (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_RWSTART_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_RWSTOP_SHIFT                          (9U)
#define PERI_SDMMC1_DCTRL_BIT_RWSTOP_MASK                           (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_RWSTOP_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_RWMOD_SHIFT                           (10U)
#define PERI_SDMMC1_DCTRL_BIT_RWMOD_MASK                            (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_RWMOD_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_SDIOEN_SHIFT                          (11U)
#define PERI_SDMMC1_DCTRL_BIT_SDIOEN_MASK                           (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_SDIOEN_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_BOOTACKEN_SHIFT                       (12U)
#define PERI_SDMMC1_DCTRL_BIT_BOOTACKEN_MASK                        (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_BOOTACKEN_SHIFT)
#define PERI_SDMMC1_DCTRL_BIT_FIFORST_SHIFT                         (13U)
#define PERI_SDMMC1_DCTRL_BIT_FIFORST_MASK                          (((1U<<1)-1) << PERI_SDMMC1_DCTRL_BIT_FIFORST_SHIFT)

/*--- register DCNTR -------------------------------------------------*/
#define PERI_SDMMC1_DCNTR_BIT_DATACOUNT_SHIFT                       (0U)
#define PERI_SDMMC1_DCNTR_BIT_DATACOUNT_MASK                        (((1U<<25)-1) << PERI_SDMMC1_DCNTR_BIT_DATACOUNT_SHIFT)

/*--- register STAR -------------------------------------------------*/
#define PERI_SDMMC1_STAR_BIT_CCRCFAIL_SHIFT                         (0U)
#define PERI_SDMMC1_STAR_BIT_CCRCFAIL_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_CCRCFAIL_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DCRCFAIL_SHIFT                         (1U)
#define PERI_SDMMC1_STAR_BIT_DCRCFAIL_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DCRCFAIL_SHIFT)
#define PERI_SDMMC1_STAR_BIT_CTIMEOUT_SHIFT                         (2U)
#define PERI_SDMMC1_STAR_BIT_CTIMEOUT_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_CTIMEOUT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DTIMEOUT_SHIFT                         (3U)
#define PERI_SDMMC1_STAR_BIT_DTIMEOUT_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DTIMEOUT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_TXUNDERR_SHIFT                         (4U)
#define PERI_SDMMC1_STAR_BIT_TXUNDERR_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_TXUNDERR_SHIFT)
#define PERI_SDMMC1_STAR_BIT_RXOVERR_SHIFT                          (5U)
#define PERI_SDMMC1_STAR_BIT_RXOVERR_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_RXOVERR_SHIFT)
#define PERI_SDMMC1_STAR_BIT_CMDREND_SHIFT                          (6U)
#define PERI_SDMMC1_STAR_BIT_CMDREND_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_CMDREND_SHIFT)
#define PERI_SDMMC1_STAR_BIT_CMDSENT_SHIFT                          (7U)
#define PERI_SDMMC1_STAR_BIT_CMDSENT_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_CMDSENT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DATAEND_SHIFT                          (8U)
#define PERI_SDMMC1_STAR_BIT_DATAEND_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DATAEND_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DHOLD_SHIFT                            (9U)
#define PERI_SDMMC1_STAR_BIT_DHOLD_MASK                             (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DHOLD_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DBCKEND_SHIFT                          (10U)
#define PERI_SDMMC1_STAR_BIT_DBCKEND_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DBCKEND_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DABORT_SHIFT                           (11U)
#define PERI_SDMMC1_STAR_BIT_DABORT_MASK                            (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DABORT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_DPSMACT_SHIFT                          (12U)
#define PERI_SDMMC1_STAR_BIT_DPSMACT_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_DPSMACT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_CPSMACT_SHIFT                          (13U)
#define PERI_SDMMC1_STAR_BIT_CPSMACT_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_CPSMACT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_TXFIFOHE_SHIFT                         (14U)
#define PERI_SDMMC1_STAR_BIT_TXFIFOHE_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_TXFIFOHE_SHIFT)
#define PERI_SDMMC1_STAR_BIT_RXFIFOHF_SHIFT                         (15U)
#define PERI_SDMMC1_STAR_BIT_RXFIFOHF_MASK                          (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_RXFIFOHF_SHIFT)
#define PERI_SDMMC1_STAR_BIT_TXFIFOF_SHIFT                          (16U)
#define PERI_SDMMC1_STAR_BIT_TXFIFOF_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_TXFIFOF_SHIFT)
#define PERI_SDMMC1_STAR_BIT_RXFIFOF_SHIFT                          (17U)
#define PERI_SDMMC1_STAR_BIT_RXFIFOF_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_RXFIFOF_SHIFT)
#define PERI_SDMMC1_STAR_BIT_TXFIFOE_SHIFT                          (18U)
#define PERI_SDMMC1_STAR_BIT_TXFIFOE_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_TXFIFOE_SHIFT)
#define PERI_SDMMC1_STAR_BIT_RXFIFOE_SHIFT                          (19U)
#define PERI_SDMMC1_STAR_BIT_RXFIFOE_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_RXFIFOE_SHIFT)
#define PERI_SDMMC1_STAR_BIT_BUSYD0_SHIFT                           (20U)
#define PERI_SDMMC1_STAR_BIT_BUSYD0_MASK                            (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_BUSYD0_SHIFT)
#define PERI_SDMMC1_STAR_BIT_BUSYD0END_SHIFT                        (21U)
#define PERI_SDMMC1_STAR_BIT_BUSYD0END_MASK                         (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_BUSYD0END_SHIFT)
#define PERI_SDMMC1_STAR_BIT_SDIOIT_SHIFT                           (22U)
#define PERI_SDMMC1_STAR_BIT_SDIOIT_MASK                            (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_SDIOIT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_ACKFAIL_SHIFT                          (23U)
#define PERI_SDMMC1_STAR_BIT_ACKFAIL_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_ACKFAIL_SHIFT)
#define PERI_SDMMC1_STAR_BIT_ACKTIMEOUT_SHIFT                       (24U)
#define PERI_SDMMC1_STAR_BIT_ACKTIMEOUT_MASK                        (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_ACKTIMEOUT_SHIFT)
#define PERI_SDMMC1_STAR_BIT_VSWEND_SHIFT                           (25U)
#define PERI_SDMMC1_STAR_BIT_VSWEND_MASK                            (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_VSWEND_SHIFT)
#define PERI_SDMMC1_STAR_BIT_CKSTOP_SHIFT                           (26U)
#define PERI_SDMMC1_STAR_BIT_CKSTOP_MASK                            (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_CKSTOP_SHIFT)
#define PERI_SDMMC1_STAR_BIT_IDMATE_SHIFT                           (27U)
#define PERI_SDMMC1_STAR_BIT_IDMATE_MASK                            (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_IDMATE_SHIFT)
#define PERI_SDMMC1_STAR_BIT_IDMABTC_SHIFT                          (28U)
#define PERI_SDMMC1_STAR_BIT_IDMABTC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_STAR_BIT_IDMABTC_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_SDMMC1_ICR_BIT_CCRCFAILC_SHIFT                         (0U)
#define PERI_SDMMC1_ICR_BIT_CCRCFAILC_MASK                          (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_CCRCFAILC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_DCRCFAILC_SHIFT                         (1U)
#define PERI_SDMMC1_ICR_BIT_DCRCFAILC_MASK                          (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_DCRCFAILC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_CTIMEOUTC_SHIFT                         (2U)
#define PERI_SDMMC1_ICR_BIT_CTIMEOUTC_MASK                          (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_CTIMEOUTC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_DTIMEOUTC_SHIFT                         (3U)
#define PERI_SDMMC1_ICR_BIT_DTIMEOUTC_MASK                          (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_DTIMEOUTC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_TXUNDERRC_SHIFT                         (4U)
#define PERI_SDMMC1_ICR_BIT_TXUNDERRC_MASK                          (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_TXUNDERRC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_RXOVERRC_SHIFT                          (5U)
#define PERI_SDMMC1_ICR_BIT_RXOVERRC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_RXOVERRC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_CMDRENDC_SHIFT                          (6U)
#define PERI_SDMMC1_ICR_BIT_CMDRENDC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_CMDRENDC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_CMDSENTC_SHIFT                          (7U)
#define PERI_SDMMC1_ICR_BIT_CMDSENTC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_CMDSENTC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_DATAENDC_SHIFT                          (8U)
#define PERI_SDMMC1_ICR_BIT_DATAENDC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_DATAENDC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_DHOLDC_SHIFT                            (9U)
#define PERI_SDMMC1_ICR_BIT_DHOLDC_MASK                             (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_DHOLDC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_DBCKENDC_SHIFT                          (10U)
#define PERI_SDMMC1_ICR_BIT_DBCKENDC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_DBCKENDC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_DABORTC_SHIFT                           (11U)
#define PERI_SDMMC1_ICR_BIT_DABORTC_MASK                            (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_DABORTC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_BUSYD0ENDC_SHIFT                        (21U)
#define PERI_SDMMC1_ICR_BIT_BUSYD0ENDC_MASK                         (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_BUSYD0ENDC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_SDIOITC_SHIFT                           (22U)
#define PERI_SDMMC1_ICR_BIT_SDIOITC_MASK                            (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_SDIOITC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_ACKFAILC_SHIFT                          (23U)
#define PERI_SDMMC1_ICR_BIT_ACKFAILC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_ACKFAILC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_ACKTIMEOUTC_SHIFT                       (24U)
#define PERI_SDMMC1_ICR_BIT_ACKTIMEOUTC_MASK                        (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_ACKTIMEOUTC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_VSWENDC_SHIFT                           (25U)
#define PERI_SDMMC1_ICR_BIT_VSWENDC_MASK                            (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_VSWENDC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_CKSTOPC_SHIFT                           (26U)
#define PERI_SDMMC1_ICR_BIT_CKSTOPC_MASK                            (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_CKSTOPC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_IDMATEC_SHIFT                           (27U)
#define PERI_SDMMC1_ICR_BIT_IDMATEC_MASK                            (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_IDMATEC_SHIFT)
#define PERI_SDMMC1_ICR_BIT_IDMABTCC_SHIFT                          (28U)
#define PERI_SDMMC1_ICR_BIT_IDMABTCC_MASK                           (((1U<<1)-1) << PERI_SDMMC1_ICR_BIT_IDMABTCC_SHIFT)

/*--- register MASKR -------------------------------------------------*/
#define PERI_SDMMC1_MASKR_BIT_CCRCFAILIE_SHIFT                      (0U)
#define PERI_SDMMC1_MASKR_BIT_CCRCFAILIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_CCRCFAILIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_DCRCFAILIE_SHIFT                      (1U)
#define PERI_SDMMC1_MASKR_BIT_DCRCFAILIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_DCRCFAILIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_CTIMEOUTIE_SHIFT                      (2U)
#define PERI_SDMMC1_MASKR_BIT_CTIMEOUTIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_CTIMEOUTIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_DTIMEOUTIE_SHIFT                      (3U)
#define PERI_SDMMC1_MASKR_BIT_DTIMEOUTIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_DTIMEOUTIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_TXUNDERRIE_SHIFT                      (4U)
#define PERI_SDMMC1_MASKR_BIT_TXUNDERRIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_TXUNDERRIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_RXOVERRIE_SHIFT                       (5U)
#define PERI_SDMMC1_MASKR_BIT_RXOVERRIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_RXOVERRIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_CMDRENDIE_SHIFT                       (6U)
#define PERI_SDMMC1_MASKR_BIT_CMDRENDIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_CMDRENDIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_CMDSENTIE_SHIFT                       (7U)
#define PERI_SDMMC1_MASKR_BIT_CMDSENTIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_CMDSENTIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_DATAENDIE_SHIFT                       (8U)
#define PERI_SDMMC1_MASKR_BIT_DATAENDIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_DATAENDIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_DHOLDIE_SHIFT                         (9U)
#define PERI_SDMMC1_MASKR_BIT_DHOLDIE_MASK                          (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_DHOLDIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_DBCKENDIE_SHIFT                       (10U)
#define PERI_SDMMC1_MASKR_BIT_DBCKENDIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_DBCKENDIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_DABORTIE_SHIFT                        (11U)
#define PERI_SDMMC1_MASKR_BIT_DABORTIE_MASK                         (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_DABORTIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_TXFIFOHEIE_SHIFT                      (14U)
#define PERI_SDMMC1_MASKR_BIT_TXFIFOHEIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_TXFIFOHEIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_RXFIFOHFIE_SHIFT                      (15U)
#define PERI_SDMMC1_MASKR_BIT_RXFIFOHFIE_MASK                       (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_RXFIFOHFIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_RXFIFOFIE_SHIFT                       (17U)
#define PERI_SDMMC1_MASKR_BIT_RXFIFOFIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_RXFIFOFIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_TXFIFOEIE_SHIFT                       (18U)
#define PERI_SDMMC1_MASKR_BIT_TXFIFOEIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_TXFIFOEIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_BUSYD0ENDIE_SHIFT                     (21U)
#define PERI_SDMMC1_MASKR_BIT_BUSYD0ENDIE_MASK                      (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_BUSYD0ENDIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_SDIOITIE_SHIFT                        (22U)
#define PERI_SDMMC1_MASKR_BIT_SDIOITIE_MASK                         (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_SDIOITIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_ACKFAILIE_SHIFT                       (23U)
#define PERI_SDMMC1_MASKR_BIT_ACKFAILIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_ACKFAILIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_ACKTIMEOUTIE_SHIFT                    (24U)
#define PERI_SDMMC1_MASKR_BIT_ACKTIMEOUTIE_MASK                     (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_ACKTIMEOUTIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_VSWENDIE_SHIFT                        (25U)
#define PERI_SDMMC1_MASKR_BIT_VSWENDIE_MASK                         (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_VSWENDIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_CKSTOPIE_SHIFT                        (26U)
#define PERI_SDMMC1_MASKR_BIT_CKSTOPIE_MASK                         (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_CKSTOPIE_SHIFT)
#define PERI_SDMMC1_MASKR_BIT_IDMABTCIE_SHIFT                       (28U)
#define PERI_SDMMC1_MASKR_BIT_IDMABTCIE_MASK                        (((1U<<1)-1) << PERI_SDMMC1_MASKR_BIT_IDMABTCIE_SHIFT)

