minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register ACKTIMER -------------------------------------------------*/
#define PERI_SDMMC1_ACKTIMER_BIT_ACKTIME_SHIFT                      (0U)
#define PERI_SDMMC1_ACKTIMER_BIT_ACKTIME_MASK                       (((1U<<25)-1) << PERI_SDMMC1_ACKTIMER_BIT_ACKTIME_SHIFT)

/*--- register IDMACTRLR -------------------------------------------------*/
#define PERI_SDMMC1_IDMACTRLR_BIT_IDMAEN_SHIFT                      (0U)
#define PERI_SDMMC1_IDMACTRLR_BIT_IDMAEN_MASK                       (((1U<<1)-1) << PERI_SDMMC1_IDMACTRLR_BIT_IDMAEN_SHIFT)
#define PERI_SDMMC1_IDMACTRLR_BIT_IDMABMODE_SHIFT                   (1U)
#define PERI_SDMMC1_IDMACTRLR_BIT_IDMABMODE_MASK                    (((1U<<1)-1) << PERI_SDMMC1_IDMACTRLR_BIT_IDMABMODE_SHIFT)
#define PERI_SDMMC1_IDMACTRLR_BIT_IDMABACT_SHIFT                    (2U)
#define PERI_SDMMC1_IDMACTRLR_BIT_IDMABACT_MASK                     (((1U<<1)-1) << PERI_SDMMC1_IDMACTRLR_BIT_IDMABACT_SHIFT)

/*--- register IDMABSIZER -------------------------------------------------*/
#define PERI_SDMMC1_IDMABSIZER_BIT_IDMABNDT_SHIFT                   (5U)
#define PERI_SDMMC1_IDMABSIZER_BIT_IDMABNDT_MASK                    (((1U<<8)-1) << PERI_SDMMC1_IDMABSIZER_BIT_IDMABNDT_SHIFT)

/*--- register IDMABASE0R -------------------------------------------------*/
#define PERI_SDMMC1_IDMABASE0R_BIT_IDMABASE0_SHIFT                  (0U)
#define PERI_SDMMC1_IDMABASE0R_BIT_IDMABASE0_MASK                   (((1U<<32)-1) << PERI_SDMMC1_IDMABASE0R_BIT_IDMABASE0_SHIFT)

/*--- register IDMABASE1R -------------------------------------------------*/
#define PERI_SDMMC1_IDMABASE1R_BIT_IDMABASE1_SHIFT                  (0U)
#define PERI_SDMMC1_IDMABASE1R_BIT_IDMABASE1_MASK                   (((1U<<32)-1) << PERI_SDMMC1_IDMABASE1R_BIT_IDMABASE1_SHIFT)

/*--- register FIFOR -------------------------------------------------*/
#define PERI_SDMMC1_FIFOR_BIT_FIFODATA_SHIFT                        (0U)
#define PERI_SDMMC1_FIFOR_BIT_FIFODATA_MASK                         (((1U<<32)-1) << PERI_SDMMC1_FIFOR_BIT_FIFODATA_SHIFT)

/*--- register VER -------------------------------------------------*/
#define PERI_SDMMC1_VER_BIT_MINREV_SHIFT                            (0U)
#define PERI_SDMMC1_VER_BIT_MINREV_MASK                             (((1U<<4)-1) << PERI_SDMMC1_VER_BIT_MINREV_SHIFT)
#define PERI_SDMMC1_VER_BIT_MAJREV_SHIFT                            (4U)
#define PERI_SDMMC1_VER_BIT_MAJREV_MASK                             (((1U<<4)-1) << PERI_SDMMC1_VER_BIT_MAJREV_SHIFT)

/*--- register ID -------------------------------------------------*/
#define PERI_SDMMC1_ID_BIT_IP_ID_SHIFT                              (0U)
#define PERI_SDMMC1_ID_BIT_IP_ID_MASK                               (((1U<<32)-1) << PERI_SDMMC1_ID_BIT_IP_ID_SHIFT)

/*--- register POWER -------------------------------------------------*/
#define PERI_SDMMC2_POWER_BIT_PWRCTRL_SHIFT                         (0U)
#define PERI_SDMMC2_POWER_BIT_PWRCTRL_MASK                          (((1U<<2)-1) << PERI_SDMMC2_POWER_BIT_PWRCTRL_SHIFT)
#define PERI_SDMMC2_POWER_BIT_VSWITCH_SHIFT                         (2U)
#define PERI_SDMMC2_POWER_BIT_VSWITCH_MASK                          (((1U<<1)-1) << PERI_SDMMC2_POWER_BIT_VSWITCH_SHIFT)
#define PERI_SDMMC2_POWER_BIT_VSWITCHEN_SHIFT                       (3U)
#define PERI_SDMMC2_POWER_BIT_VSWITCHEN_MASK                        (((1U<<1)-1) << PERI_SDMMC2_POWER_BIT_VSWITCHEN_SHIFT)
#define PERI_SDMMC2_POWER_BIT_DIRPOL_SHIFT                          (4U)
#define PERI_SDMMC2_POWER_BIT_DIRPOL_MASK                           (((1U<<1)-1) << PERI_SDMMC2_POWER_BIT_DIRPOL_SHIFT)

/*--- register CLKCR -------------------------------------------------*/
#define PERI_SDMMC2_CLKCR_BIT_CLKDIV_SHIFT                          (0U)
#define PERI_SDMMC2_CLKCR_BIT_CLKDIV_MASK                           (((1U<<10)-1) << PERI_SDMMC2_CLKCR_BIT_CLKDIV_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_PWRSAV_SHIFT                          (12U)
#define PERI_SDMMC2_CLKCR_BIT_PWRSAV_MASK                           (((1U<<1)-1) << PERI_SDMMC2_CLKCR_BIT_PWRSAV_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_WIDBUS_SHIFT                          (14U)
#define PERI_SDMMC2_CLKCR_BIT_WIDBUS_MASK                           (((1U<<2)-1) << PERI_SDMMC2_CLKCR_BIT_WIDBUS_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_NEGEDGE_SHIFT                         (16U)
#define PERI_SDMMC2_CLKCR_BIT_NEGEDGE_MASK                          (((1U<<1)-1) << PERI_SDMMC2_CLKCR_BIT_NEGEDGE_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_HWFC_EN_SHIFT                         (17U)
#define PERI_SDMMC2_CLKCR_BIT_HWFC_EN_MASK                          (((1U<<1)-1) << PERI_SDMMC2_CLKCR_BIT_HWFC_EN_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_DDR_SHIFT                             (18U)
#define PERI_SDMMC2_CLKCR_BIT_DDR_MASK                              (((1U<<1)-1) << PERI_SDMMC2_CLKCR_BIT_DDR_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_BUSSPEED_SHIFT                        (19U)
#define PERI_SDMMC2_CLKCR_BIT_BUSSPEED_MASK                         (((1U<<1)-1) << PERI_SDMMC2_CLKCR_BIT_BUSSPEED_SHIFT)
#define PERI_SDMMC2_CLKCR_BIT_SELCLKRX_SHIFT                        (20U)
#define PERI_SDMMC2_CLKCR_BIT_SELCLKRX_MASK                         (((1U<<2)-1) << PERI_SDMMC2_CLKCR_BIT_SELCLKRX_SHIFT)

/*--- register ARGR -------------------------------------------------*/
#define PERI_SDMMC2_ARGR_BIT_CMDARG_SHIFT                           (0U)
#define PERI_SDMMC2_ARGR_BIT_CMDARG_MASK                            (((1U<<32)-1) << PERI_SDMMC2_ARGR_BIT_CMDARG_SHIFT)

/*--- register CMDR -------------------------------------------------*/
#define PERI_SDMMC2_CMDR_BIT_CMDINDEX_SHIFT                         (0U)
#define PERI_SDMMC2_CMDR_BIT_CMDINDEX_MASK                          (((1U<<6)-1) << PERI_SDMMC2_CMDR_BIT_CMDINDEX_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_CMDTRANS_SHIFT                         (6U)
#define PERI_SDMMC2_CMDR_BIT_CMDTRANS_MASK                          (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_CMDTRANS_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_CMDSTOP_SHIFT                          (7U)
#define PERI_SDMMC2_CMDR_BIT_CMDSTOP_MASK                           (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_CMDSTOP_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_WAITRESP_SHIFT                         (8U)
#define PERI_SDMMC2_CMDR_BIT_WAITRESP_MASK                          (((1U<<2)-1) << PERI_SDMMC2_CMDR_BIT_WAITRESP_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_WAITINT_SHIFT                          (10U)
#define PERI_SDMMC2_CMDR_BIT_WAITINT_MASK                           (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_WAITINT_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_WAITPEND_SHIFT                         (11U)
#define PERI_SDMMC2_CMDR_BIT_WAITPEND_MASK                          (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_WAITPEND_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_CPSMEN_SHIFT                           (12U)
#define PERI_SDMMC2_CMDR_BIT_CPSMEN_MASK                            (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_CPSMEN_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_DTHOLD_SHIFT                           (13U)
#define PERI_SDMMC2_CMDR_BIT_DTHOLD_MASK                            (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_DTHOLD_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_BOOTMODE_SHIFT                         (14U)
#define PERI_SDMMC2_CMDR_BIT_BOOTMODE_MASK                          (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_BOOTMODE_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_BOOTEN_SHIFT                           (15U)
#define PERI_SDMMC2_CMDR_BIT_BOOTEN_MASK                            (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_BOOTEN_SHIFT)
#define PERI_SDMMC2_CMDR_BIT_CMDSUSPEND_SHIFT                       (16U)
#define PERI_SDMMC2_CMDR_BIT_CMDSUSPEND_MASK                        (((1U<<1)-1) << PERI_SDMMC2_CMDR_BIT_CMDSUSPEND_SHIFT)

/*--- register RESPCMDR -------------------------------------------------*/
#define PERI_SDMMC2_RESPCMDR_BIT_RESPCMD_SHIFT                      (0U)
#define PERI_SDMMC2_RESPCMDR_BIT_RESPCMD_MASK                       (((1U<<6)-1) << PERI_SDMMC2_RESPCMDR_BIT_RESPCMD_SHIFT)

