minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register ACKTIMER -------------------------------------------------*/
#define PERI_SDMMC2_ACKTIMER_BIT_ACKTIME_SHIFT                      (0U)
#define PERI_SDMMC2_ACKTIMER_BIT_ACKTIME_MASK                       (((1U<<25)-1) << PERI_SDMMC2_ACKTIMER_BIT_ACKTIME_SHIFT)

/*--- register IDMACTRLR -------------------------------------------------*/
#define PERI_SDMMC2_IDMACTRLR_BIT_IDMAEN_SHIFT                      (0U)
#define PERI_SDMMC2_IDMACTRLR_BIT_IDMAEN_MASK                       (((1U<<1)-1) << PERI_SDMMC2_IDMACTRLR_BIT_IDMAEN_SHIFT)
#define PERI_SDMMC2_IDMACTRLR_BIT_IDMABMODE_SHIFT                   (1U)
#define PERI_SDMMC2_IDMACTRLR_BIT_IDMABMODE_MASK                    (((1U<<1)-1) << PERI_SDMMC2_IDMACTRLR_BIT_IDMABMODE_SHIFT)
#define PERI_SDMMC2_IDMACTRLR_BIT_IDMABACT_SHIFT                    (2U)
#define PERI_SDMMC2_IDMACTRLR_BIT_IDMABACT_MASK                     (((1U<<1)-1) << PERI_SDMMC2_IDMACTRLR_BIT_IDMABACT_SHIFT)

/*--- register IDMABSIZER -------------------------------------------------*/
#define PERI_SDMMC2_IDMABSIZER_BIT_IDMABNDT_SHIFT                   (5U)
#define PERI_SDMMC2_IDMABSIZER_BIT_IDMABNDT_MASK                    (((1U<<8)-1) << PERI_SDMMC2_IDMABSIZER_BIT_IDMABNDT_SHIFT)

/*--- register IDMABASE0R -------------------------------------------------*/
#define PERI_SDMMC2_IDMABASE0R_BIT_IDMABASE0_SHIFT                  (0U)
#define PERI_SDMMC2_IDMABASE0R_BIT_IDMABASE0_MASK                   (((1U<<32)-1) << PERI_SDMMC2_IDMABASE0R_BIT_IDMABASE0_SHIFT)

/*--- register IDMABASE1R -------------------------------------------------*/
#define PERI_SDMMC2_IDMABASE1R_BIT_IDMABASE1_SHIFT                  (0U)
#define PERI_SDMMC2_IDMABASE1R_BIT_IDMABASE1_MASK                   (((1U<<32)-1) << PERI_SDMMC2_IDMABASE1R_BIT_IDMABASE1_SHIFT)

/*--- register FIFOR -------------------------------------------------*/
#define PERI_SDMMC2_FIFOR_BIT_FIFODATA_SHIFT                        (0U)
#define PERI_SDMMC2_FIFOR_BIT_FIFODATA_MASK                         (((1U<<32)-1) << PERI_SDMMC2_FIFOR_BIT_FIFODATA_SHIFT)

/*--- register VER -------------------------------------------------*/
#define PERI_SDMMC2_VER_BIT_MINREV_SHIFT                            (0U)
#define PERI_SDMMC2_VER_BIT_MINREV_MASK                             (((1U<<4)-1) << PERI_SDMMC2_VER_BIT_MINREV_SHIFT)
#define PERI_SDMMC2_VER_BIT_MAJREV_SHIFT                            (4U)
#define PERI_SDMMC2_VER_BIT_MAJREV_MASK                             (((1U<<4)-1) << PERI_SDMMC2_VER_BIT_MAJREV_SHIFT)

/*--- register ID -------------------------------------------------*/
#define PERI_SDMMC2_ID_BIT_IP_ID_SHIFT                              (0U)
#define PERI_SDMMC2_ID_BIT_IP_ID_MASK                               (((1U<<32)-1) << PERI_SDMMC2_ID_BIT_IP_ID_SHIFT)

/*--- register CR -------------------------------------------------*/
#define PERI_SPDIFRX_CR_BIT_SPDIFRXEN_SHIFT                         (0U)
#define PERI_SPDIFRX_CR_BIT_SPDIFRXEN_MASK                          (((1U<<2)-1) << PERI_SPDIFRX_CR_BIT_SPDIFRXEN_SHIFT)
#define PERI_SPDIFRX_CR_BIT_RXDMAEN_SHIFT                           (2U)
#define PERI_SPDIFRX_CR_BIT_RXDMAEN_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_RXDMAEN_SHIFT)
#define PERI_SPDIFRX_CR_BIT_RXSTEO_SHIFT                            (3U)
#define PERI_SPDIFRX_CR_BIT_RXSTEO_MASK                             (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_RXSTEO_SHIFT)
#define PERI_SPDIFRX_CR_BIT_DRFMT_SHIFT                             (4U)
#define PERI_SPDIFRX_CR_BIT_DRFMT_MASK                              (((1U<<2)-1) << PERI_SPDIFRX_CR_BIT_DRFMT_SHIFT)
#define PERI_SPDIFRX_CR_BIT_PMSK_SHIFT                              (6U)
#define PERI_SPDIFRX_CR_BIT_PMSK_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_PMSK_SHIFT)
#define PERI_SPDIFRX_CR_BIT_VMSK_SHIFT                              (7U)
#define PERI_SPDIFRX_CR_BIT_VMSK_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_VMSK_SHIFT)
#define PERI_SPDIFRX_CR_BIT_CUMSK_SHIFT                             (8U)
#define PERI_SPDIFRX_CR_BIT_CUMSK_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_CUMSK_SHIFT)
#define PERI_SPDIFRX_CR_BIT_PTMSK_SHIFT                             (9U)
#define PERI_SPDIFRX_CR_BIT_PTMSK_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_PTMSK_SHIFT)
#define PERI_SPDIFRX_CR_BIT_CBDMAEN_SHIFT                           (10U)
#define PERI_SPDIFRX_CR_BIT_CBDMAEN_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_CBDMAEN_SHIFT)
#define PERI_SPDIFRX_CR_BIT_CHSEL_SHIFT                             (11U)
#define PERI_SPDIFRX_CR_BIT_CHSEL_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_CHSEL_SHIFT)
#define PERI_SPDIFRX_CR_BIT_NBTR_SHIFT                              (12U)
#define PERI_SPDIFRX_CR_BIT_NBTR_MASK                               (((1U<<2)-1) << PERI_SPDIFRX_CR_BIT_NBTR_SHIFT)
#define PERI_SPDIFRX_CR_BIT_WFA_SHIFT                               (14U)
#define PERI_SPDIFRX_CR_BIT_WFA_MASK                                (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_WFA_SHIFT)
#define PERI_SPDIFRX_CR_BIT_INSEL_SHIFT                             (16U)
#define PERI_SPDIFRX_CR_BIT_INSEL_MASK                              (((1U<<3)-1) << PERI_SPDIFRX_CR_BIT_INSEL_SHIFT)
#define PERI_SPDIFRX_CR_BIT_CKSEN_SHIFT                             (20U)
#define PERI_SPDIFRX_CR_BIT_CKSEN_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_CKSEN_SHIFT)
#define PERI_SPDIFRX_CR_BIT_CKSBKPEN_SHIFT                          (21U)
#define PERI_SPDIFRX_CR_BIT_CKSBKPEN_MASK                           (((1U<<1)-1) << PERI_SPDIFRX_CR_BIT_CKSBKPEN_SHIFT)

/*--- register IMR -------------------------------------------------*/
#define PERI_SPDIFRX_IMR_BIT_RXNEIE_SHIFT                           (0U)
#define PERI_SPDIFRX_IMR_BIT_RXNEIE_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_RXNEIE_SHIFT)
#define PERI_SPDIFRX_IMR_BIT_CSRNEIE_SHIFT                          (1U)
#define PERI_SPDIFRX_IMR_BIT_CSRNEIE_MASK                           (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_CSRNEIE_SHIFT)
#define PERI_SPDIFRX_IMR_BIT_PERRIE_SHIFT                           (2U)
#define PERI_SPDIFRX_IMR_BIT_PERRIE_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_PERRIE_SHIFT)
#define PERI_SPDIFRX_IMR_BIT_OVRIE_SHIFT                            (3U)
#define PERI_SPDIFRX_IMR_BIT_OVRIE_MASK                             (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_OVRIE_SHIFT)
#define PERI_SPDIFRX_IMR_BIT_SBLKIE_SHIFT                           (4U)
#define PERI_SPDIFRX_IMR_BIT_SBLKIE_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_SBLKIE_SHIFT)
#define PERI_SPDIFRX_IMR_BIT_SYNCDIE_SHIFT                          (5U)
#define PERI_SPDIFRX_IMR_BIT_SYNCDIE_MASK                           (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_SYNCDIE_SHIFT)
#define PERI_SPDIFRX_IMR_BIT_IFEIE_SHIFT                            (6U)
#define PERI_SPDIFRX_IMR_BIT_IFEIE_MASK                             (((1U<<1)-1) << PERI_SPDIFRX_IMR_BIT_IFEIE_SHIFT)

