minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_SPDIFRX_SR_BIT_RXNE_SHIFT                              (0U)
#define PERI_SPDIFRX_SR_BIT_RXNE_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_RXNE_SHIFT)
#define PERI_SPDIFRX_SR_BIT_CSRNE_SHIFT                             (1U)
#define PERI_SPDIFRX_SR_BIT_CSRNE_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_CSRNE_SHIFT)
#define PERI_SPDIFRX_SR_BIT_PERR_SHIFT                              (2U)
#define PERI_SPDIFRX_SR_BIT_PERR_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_PERR_SHIFT)
#define PERI_SPDIFRX_SR_BIT_OVR_SHIFT                               (3U)
#define PERI_SPDIFRX_SR_BIT_OVR_MASK                                (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_OVR_SHIFT)
#define PERI_SPDIFRX_SR_BIT_SBD_SHIFT                               (4U)
#define PERI_SPDIFRX_SR_BIT_SBD_MASK                                (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_SBD_SHIFT)
#define PERI_SPDIFRX_SR_BIT_SYNCD_SHIFT                             (5U)
#define PERI_SPDIFRX_SR_BIT_SYNCD_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_SYNCD_SHIFT)
#define PERI_SPDIFRX_SR_BIT_FERR_SHIFT                              (6U)
#define PERI_SPDIFRX_SR_BIT_FERR_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_FERR_SHIFT)
#define PERI_SPDIFRX_SR_BIT_SERR_SHIFT                              (7U)
#define PERI_SPDIFRX_SR_BIT_SERR_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_SERR_SHIFT)
#define PERI_SPDIFRX_SR_BIT_TERR_SHIFT                              (8U)
#define PERI_SPDIFRX_SR_BIT_TERR_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_SR_BIT_TERR_SHIFT)
#define PERI_SPDIFRX_SR_BIT_WIDTH5_SHIFT                            (16U)
#define PERI_SPDIFRX_SR_BIT_WIDTH5_MASK                             (((1U<<15)-1) << PERI_SPDIFRX_SR_BIT_WIDTH5_SHIFT)

/*--- register IFCR -------------------------------------------------*/
#define PERI_SPDIFRX_IFCR_BIT_PERRCF_SHIFT                          (2U)
#define PERI_SPDIFRX_IFCR_BIT_PERRCF_MASK                           (((1U<<1)-1) << PERI_SPDIFRX_IFCR_BIT_PERRCF_SHIFT)
#define PERI_SPDIFRX_IFCR_BIT_OVRCF_SHIFT                           (3U)
#define PERI_SPDIFRX_IFCR_BIT_OVRCF_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_IFCR_BIT_OVRCF_SHIFT)
#define PERI_SPDIFRX_IFCR_BIT_SBDCF_SHIFT                           (4U)
#define PERI_SPDIFRX_IFCR_BIT_SBDCF_MASK                            (((1U<<1)-1) << PERI_SPDIFRX_IFCR_BIT_SBDCF_SHIFT)
#define PERI_SPDIFRX_IFCR_BIT_SYNCDCF_SHIFT                         (5U)
#define PERI_SPDIFRX_IFCR_BIT_SYNCDCF_MASK                          (((1U<<1)-1) << PERI_SPDIFRX_IFCR_BIT_SYNCDCF_SHIFT)

/*--- register DR_00 -------------------------------------------------*/
#define PERI_SPDIFRX_DR_00_BIT_DR_SHIFT                             (0U)
#define PERI_SPDIFRX_DR_00_BIT_DR_MASK                              (((1U<<24)-1) << PERI_SPDIFRX_DR_00_BIT_DR_SHIFT)
#define PERI_SPDIFRX_DR_00_BIT_PE_SHIFT                             (24U)
#define PERI_SPDIFRX_DR_00_BIT_PE_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_DR_00_BIT_PE_SHIFT)
#define PERI_SPDIFRX_DR_00_BIT_V_SHIFT                              (25U)
#define PERI_SPDIFRX_DR_00_BIT_V_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_DR_00_BIT_V_SHIFT)
#define PERI_SPDIFRX_DR_00_BIT_U_SHIFT                              (26U)
#define PERI_SPDIFRX_DR_00_BIT_U_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_DR_00_BIT_U_SHIFT)
#define PERI_SPDIFRX_DR_00_BIT_C_SHIFT                              (27U)
#define PERI_SPDIFRX_DR_00_BIT_C_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_DR_00_BIT_C_SHIFT)
#define PERI_SPDIFRX_DR_00_BIT_PT_SHIFT                             (28U)
#define PERI_SPDIFRX_DR_00_BIT_PT_MASK                              (((1U<<2)-1) << PERI_SPDIFRX_DR_00_BIT_PT_SHIFT)

/*--- register DR_01 -------------------------------------------------*/
#define PERI_SPDIFRX_DR_01_BIT_PE_SHIFT                             (0U)
#define PERI_SPDIFRX_DR_01_BIT_PE_MASK                              (((1U<<1)-1) << PERI_SPDIFRX_DR_01_BIT_PE_SHIFT)
#define PERI_SPDIFRX_DR_01_BIT_V_SHIFT                              (1U)
#define PERI_SPDIFRX_DR_01_BIT_V_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_DR_01_BIT_V_SHIFT)
#define PERI_SPDIFRX_DR_01_BIT_U_SHIFT                              (2U)
#define PERI_SPDIFRX_DR_01_BIT_U_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_DR_01_BIT_U_SHIFT)
#define PERI_SPDIFRX_DR_01_BIT_C_SHIFT                              (3U)
#define PERI_SPDIFRX_DR_01_BIT_C_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_DR_01_BIT_C_SHIFT)
#define PERI_SPDIFRX_DR_01_BIT_PT_SHIFT                             (4U)
#define PERI_SPDIFRX_DR_01_BIT_PT_MASK                              (((1U<<2)-1) << PERI_SPDIFRX_DR_01_BIT_PT_SHIFT)
#define PERI_SPDIFRX_DR_01_BIT_DR_SHIFT                             (8U)
#define PERI_SPDIFRX_DR_01_BIT_DR_MASK                              (((1U<<24)-1) << PERI_SPDIFRX_DR_01_BIT_DR_SHIFT)

/*--- register DR_10 -------------------------------------------------*/
#define PERI_SPDIFRX_DR_10_BIT_DRNL1_SHIFT                          (0U)
#define PERI_SPDIFRX_DR_10_BIT_DRNL1_MASK                           (((1U<<16)-1) << PERI_SPDIFRX_DR_10_BIT_DRNL1_SHIFT)
#define PERI_SPDIFRX_DR_10_BIT_DRNL2_SHIFT                          (16U)
#define PERI_SPDIFRX_DR_10_BIT_DRNL2_MASK                           (((1U<<16)-1) << PERI_SPDIFRX_DR_10_BIT_DRNL2_SHIFT)

/*--- register CSR -------------------------------------------------*/
#define PERI_SPDIFRX_CSR_BIT_USR_SHIFT                              (0U)
#define PERI_SPDIFRX_CSR_BIT_USR_MASK                               (((1U<<16)-1) << PERI_SPDIFRX_CSR_BIT_USR_SHIFT)
#define PERI_SPDIFRX_CSR_BIT_CS_SHIFT                               (16U)
#define PERI_SPDIFRX_CSR_BIT_CS_MASK                                (((1U<<8)-1) << PERI_SPDIFRX_CSR_BIT_CS_SHIFT)
#define PERI_SPDIFRX_CSR_BIT_SOB_SHIFT                              (24U)
#define PERI_SPDIFRX_CSR_BIT_SOB_MASK                               (((1U<<1)-1) << PERI_SPDIFRX_CSR_BIT_SOB_SHIFT)

/*--- register DIR -------------------------------------------------*/
#define PERI_SPDIFRX_DIR_BIT_THI_SHIFT                              (0U)
#define PERI_SPDIFRX_DIR_BIT_THI_MASK                               (((1U<<13)-1) << PERI_SPDIFRX_DIR_BIT_THI_SHIFT)
#define PERI_SPDIFRX_DIR_BIT_TLO_SHIFT                              (16U)
#define PERI_SPDIFRX_DIR_BIT_TLO_MASK                               (((1U<<13)-1) << PERI_SPDIFRX_DIR_BIT_TLO_SHIFT)

/*--- register VERR -------------------------------------------------*/
#define PERI_SPDIFRX_VERR_BIT_MINREV_SHIFT                          (0U)
#define PERI_SPDIFRX_VERR_BIT_MINREV_MASK                           (((1U<<4)-1) << PERI_SPDIFRX_VERR_BIT_MINREV_SHIFT)
#define PERI_SPDIFRX_VERR_BIT_MAJREV_SHIFT                          (4U)
#define PERI_SPDIFRX_VERR_BIT_MAJREV_MASK                           (((1U<<4)-1) << PERI_SPDIFRX_VERR_BIT_MAJREV_SHIFT)

