minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register IDR -------------------------------------------------*/
#define PERI_SPDIFRX_IDR_BIT_ID_SHIFT                               (0U)
#define PERI_SPDIFRX_IDR_BIT_ID_MASK                                (((1U<<32)-1) << PERI_SPDIFRX_IDR_BIT_ID_SHIFT)

/*--- register SIDR -------------------------------------------------*/
#define PERI_SPDIFRX_SIDR_BIT_SID_SHIFT                             (0U)
#define PERI_SPDIFRX_SIDR_BIT_SID_MASK                              (((1U<<32)-1) << PERI_SPDIFRX_SIDR_BIT_SID_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_SPI1_CR1_BIT_SPE_SHIFT                                 (0U)
#define PERI_SPI1_CR1_BIT_SPE_MASK                                  (((1U<<1)-1) << PERI_SPI1_CR1_BIT_SPE_SHIFT)
#define PERI_SPI1_CR1_BIT_MASRX_SHIFT                               (8U)
#define PERI_SPI1_CR1_BIT_MASRX_MASK                                (((1U<<1)-1) << PERI_SPI1_CR1_BIT_MASRX_SHIFT)
#define PERI_SPI1_CR1_BIT_CSTART_SHIFT                              (9U)
#define PERI_SPI1_CR1_BIT_CSTART_MASK                               (((1U<<1)-1) << PERI_SPI1_CR1_BIT_CSTART_SHIFT)
#define PERI_SPI1_CR1_BIT_CSUSP_SHIFT                               (10U)
#define PERI_SPI1_CR1_BIT_CSUSP_MASK                                (((1U<<1)-1) << PERI_SPI1_CR1_BIT_CSUSP_SHIFT)
#define PERI_SPI1_CR1_BIT_HDDIR_SHIFT                               (11U)
#define PERI_SPI1_CR1_BIT_HDDIR_MASK                                (((1U<<1)-1) << PERI_SPI1_CR1_BIT_HDDIR_SHIFT)
#define PERI_SPI1_CR1_BIT_SSI_SHIFT                                 (12U)
#define PERI_SPI1_CR1_BIT_SSI_MASK                                  (((1U<<1)-1) << PERI_SPI1_CR1_BIT_SSI_SHIFT)
#define PERI_SPI1_CR1_BIT_CRC33_17_SHIFT                            (13U)
#define PERI_SPI1_CR1_BIT_CRC33_17_MASK                             (((1U<<1)-1) << PERI_SPI1_CR1_BIT_CRC33_17_SHIFT)
#define PERI_SPI1_CR1_BIT_RCRCI_SHIFT                               (14U)
#define PERI_SPI1_CR1_BIT_RCRCI_MASK                                (((1U<<1)-1) << PERI_SPI1_CR1_BIT_RCRCI_SHIFT)
#define PERI_SPI1_CR1_BIT_TCRCI_SHIFT                               (15U)
#define PERI_SPI1_CR1_BIT_TCRCI_MASK                                (((1U<<1)-1) << PERI_SPI1_CR1_BIT_TCRCI_SHIFT)
#define PERI_SPI1_CR1_BIT_IOLOCK_SHIFT                              (16U)
#define PERI_SPI1_CR1_BIT_IOLOCK_MASK                               (((1U<<1)-1) << PERI_SPI1_CR1_BIT_IOLOCK_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_SPI1_CR2_BIT_TSIZE_SHIFT                               (0U)
#define PERI_SPI1_CR2_BIT_TSIZE_MASK                                (((1U<<16)-1) << PERI_SPI1_CR2_BIT_TSIZE_SHIFT)
#define PERI_SPI1_CR2_BIT_TSER_SHIFT                                (16U)
#define PERI_SPI1_CR2_BIT_TSER_MASK                                 (((1U<<16)-1) << PERI_SPI1_CR2_BIT_TSER_SHIFT)

/*--- register CFG1 -------------------------------------------------*/
#define PERI_SPI1_CFG1_BIT_DSIZE_SHIFT                              (0U)
#define PERI_SPI1_CFG1_BIT_DSIZE_MASK                               (((1U<<5)-1) << PERI_SPI1_CFG1_BIT_DSIZE_SHIFT)
#define PERI_SPI1_CFG1_BIT_FTHVL_SHIFT                              (5U)
#define PERI_SPI1_CFG1_BIT_FTHVL_MASK                               (((1U<<4)-1) << PERI_SPI1_CFG1_BIT_FTHVL_SHIFT)
#define PERI_SPI1_CFG1_BIT_UDRCFG_SHIFT                             (9U)
#define PERI_SPI1_CFG1_BIT_UDRCFG_MASK                              (((1U<<2)-1) << PERI_SPI1_CFG1_BIT_UDRCFG_SHIFT)
#define PERI_SPI1_CFG1_BIT_UDRDET_SHIFT                             (11U)
#define PERI_SPI1_CFG1_BIT_UDRDET_MASK                              (((1U<<2)-1) << PERI_SPI1_CFG1_BIT_UDRDET_SHIFT)
#define PERI_SPI1_CFG1_BIT_RXDMAEN_SHIFT                            (14U)
#define PERI_SPI1_CFG1_BIT_RXDMAEN_MASK                             (((1U<<1)-1) << PERI_SPI1_CFG1_BIT_RXDMAEN_SHIFT)
#define PERI_SPI1_CFG1_BIT_TXDMAEN_SHIFT                            (15U)
#define PERI_SPI1_CFG1_BIT_TXDMAEN_MASK                             (((1U<<1)-1) << PERI_SPI1_CFG1_BIT_TXDMAEN_SHIFT)
#define PERI_SPI1_CFG1_BIT_CRCSIZE_SHIFT                            (16U)
#define PERI_SPI1_CFG1_BIT_CRCSIZE_MASK                             (((1U<<5)-1) << PERI_SPI1_CFG1_BIT_CRCSIZE_SHIFT)
#define PERI_SPI1_CFG1_BIT_CRCEN_SHIFT                              (22U)
#define PERI_SPI1_CFG1_BIT_CRCEN_MASK                               (((1U<<1)-1) << PERI_SPI1_CFG1_BIT_CRCEN_SHIFT)
#define PERI_SPI1_CFG1_BIT_MBR_SHIFT                                (28U)
#define PERI_SPI1_CFG1_BIT_MBR_MASK                                 (((1U<<3)-1) << PERI_SPI1_CFG1_BIT_MBR_SHIFT)

/*--- register CFG2 -------------------------------------------------*/
#define PERI_SPI1_CFG2_BIT_MSSI_SHIFT                               (0U)
#define PERI_SPI1_CFG2_BIT_MSSI_MASK                                (((1U<<4)-1) << PERI_SPI1_CFG2_BIT_MSSI_SHIFT)
#define PERI_SPI1_CFG2_BIT_MIDI_SHIFT                               (4U)
#define PERI_SPI1_CFG2_BIT_MIDI_MASK                                (((1U<<4)-1) << PERI_SPI1_CFG2_BIT_MIDI_SHIFT)
#define PERI_SPI1_CFG2_BIT_IOSWP_SHIFT                              (15U)
#define PERI_SPI1_CFG2_BIT_IOSWP_MASK                               (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_IOSWP_SHIFT)
#define PERI_SPI1_CFG2_BIT_COMM_SHIFT                               (17U)
#define PERI_SPI1_CFG2_BIT_COMM_MASK                                (((1U<<2)-1) << PERI_SPI1_CFG2_BIT_COMM_SHIFT)
#define PERI_SPI1_CFG2_BIT_SP_SHIFT                                 (19U)
#define PERI_SPI1_CFG2_BIT_SP_MASK                                  (((1U<<3)-1) << PERI_SPI1_CFG2_BIT_SP_SHIFT)
#define PERI_SPI1_CFG2_BIT_MASTER_SHIFT                             (22U)
#define PERI_SPI1_CFG2_BIT_MASTER_MASK                              (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_MASTER_SHIFT)
#define PERI_SPI1_CFG2_BIT_LSBFRST_SHIFT                            (23U)
#define PERI_SPI1_CFG2_BIT_LSBFRST_MASK                             (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_LSBFRST_SHIFT)
#define PERI_SPI1_CFG2_BIT_CPHA_SHIFT                               (24U)
#define PERI_SPI1_CFG2_BIT_CPHA_MASK                                (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_CPHA_SHIFT)
#define PERI_SPI1_CFG2_BIT_CPOL_SHIFT                               (25U)
#define PERI_SPI1_CFG2_BIT_CPOL_MASK                                (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_CPOL_SHIFT)
#define PERI_SPI1_CFG2_BIT_SSM_SHIFT                                (26U)
#define PERI_SPI1_CFG2_BIT_SSM_MASK                                 (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_SSM_SHIFT)
#define PERI_SPI1_CFG2_BIT_SSIOP_SHIFT                              (28U)
#define PERI_SPI1_CFG2_BIT_SSIOP_MASK                               (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_SSIOP_SHIFT)
#define PERI_SPI1_CFG2_BIT_SSOE_SHIFT                               (29U)
#define PERI_SPI1_CFG2_BIT_SSOE_MASK                                (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_SSOE_SHIFT)
#define PERI_SPI1_CFG2_BIT_SSOM_SHIFT                               (30U)
#define PERI_SPI1_CFG2_BIT_SSOM_MASK                                (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_SSOM_SHIFT)
#define PERI_SPI1_CFG2_BIT_AFCNTR_SHIFT                             (31U)
#define PERI_SPI1_CFG2_BIT_AFCNTR_MASK                              (((1U<<1)-1) << PERI_SPI1_CFG2_BIT_AFCNTR_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_SPI1_IER_BIT_RXPIE_SHIFT                               (0U)
#define PERI_SPI1_IER_BIT_RXPIE_MASK                                (((1U<<1)-1) << PERI_SPI1_IER_BIT_RXPIE_SHIFT)
#define PERI_SPI1_IER_BIT_TXPIE_SHIFT                               (1U)
#define PERI_SPI1_IER_BIT_TXPIE_MASK                                (((1U<<1)-1) << PERI_SPI1_IER_BIT_TXPIE_SHIFT)
#define PERI_SPI1_IER_BIT_DPXPIE_SHIFT                              (2U)
#define PERI_SPI1_IER_BIT_DPXPIE_MASK                               (((1U<<1)-1) << PERI_SPI1_IER_BIT_DPXPIE_SHIFT)
#define PERI_SPI1_IER_BIT_EOTIE_SHIFT                               (3U)
#define PERI_SPI1_IER_BIT_EOTIE_MASK                                (((1U<<1)-1) << PERI_SPI1_IER_BIT_EOTIE_SHIFT)
#define PERI_SPI1_IER_BIT_TXTFIE_SHIFT                              (4U)
#define PERI_SPI1_IER_BIT_TXTFIE_MASK                               (((1U<<1)-1) << PERI_SPI1_IER_BIT_TXTFIE_SHIFT)
#define PERI_SPI1_IER_BIT_UDRIE_SHIFT                               (5U)
#define PERI_SPI1_IER_BIT_UDRIE_MASK                                (((1U<<1)-1) << PERI_SPI1_IER_BIT_UDRIE_SHIFT)
#define PERI_SPI1_IER_BIT_OVRIE_SHIFT                               (6U)
#define PERI_SPI1_IER_BIT_OVRIE_MASK                                (((1U<<1)-1) << PERI_SPI1_IER_BIT_OVRIE_SHIFT)
#define PERI_SPI1_IER_BIT_CRCEIE_SHIFT                              (7U)
#define PERI_SPI1_IER_BIT_CRCEIE_MASK                               (((1U<<1)-1) << PERI_SPI1_IER_BIT_CRCEIE_SHIFT)
#define PERI_SPI1_IER_BIT_TIFREIE_SHIFT                             (8U)
#define PERI_SPI1_IER_BIT_TIFREIE_MASK                              (((1U<<1)-1) << PERI_SPI1_IER_BIT_TIFREIE_SHIFT)
#define PERI_SPI1_IER_BIT_MODFIE_SHIFT                              (9U)
#define PERI_SPI1_IER_BIT_MODFIE_MASK                               (((1U<<1)-1) << PERI_SPI1_IER_BIT_MODFIE_SHIFT)
#define PERI_SPI1_IER_BIT_TSERFIE_SHIFT                             (10U)
#define PERI_SPI1_IER_BIT_TSERFIE_MASK                              (((1U<<1)-1) << PERI_SPI1_IER_BIT_TSERFIE_SHIFT)

