minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_SPI6_SR_BIT_RXP_SHIFT                                  (0U)
#define PERI_SPI6_SR_BIT_RXP_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_RXP_SHIFT)
#define PERI_SPI6_SR_BIT_TXP_SHIFT                                  (1U)
#define PERI_SPI6_SR_BIT_TXP_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_TXP_SHIFT)
#define PERI_SPI6_SR_BIT_DXP_SHIFT                                  (2U)
#define PERI_SPI6_SR_BIT_DXP_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_DXP_SHIFT)
#define PERI_SPI6_SR_BIT_EOT_SHIFT                                  (3U)
#define PERI_SPI6_SR_BIT_EOT_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_EOT_SHIFT)
#define PERI_SPI6_SR_BIT_TXTF_SHIFT                                 (4U)
#define PERI_SPI6_SR_BIT_TXTF_MASK                                  (((1U<<1)-1) << PERI_SPI6_SR_BIT_TXTF_SHIFT)
#define PERI_SPI6_SR_BIT_UDR_SHIFT                                  (5U)
#define PERI_SPI6_SR_BIT_UDR_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_UDR_SHIFT)
#define PERI_SPI6_SR_BIT_OVR_SHIFT                                  (6U)
#define PERI_SPI6_SR_BIT_OVR_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_OVR_SHIFT)
#define PERI_SPI6_SR_BIT_CRCE_SHIFT                                 (7U)
#define PERI_SPI6_SR_BIT_CRCE_MASK                                  (((1U<<1)-1) << PERI_SPI6_SR_BIT_CRCE_SHIFT)
#define PERI_SPI6_SR_BIT_TIFRE_SHIFT                                (8U)
#define PERI_SPI6_SR_BIT_TIFRE_MASK                                 (((1U<<1)-1) << PERI_SPI6_SR_BIT_TIFRE_SHIFT)
#define PERI_SPI6_SR_BIT_MODF_SHIFT                                 (9U)
#define PERI_SPI6_SR_BIT_MODF_MASK                                  (((1U<<1)-1) << PERI_SPI6_SR_BIT_MODF_SHIFT)
#define PERI_SPI6_SR_BIT_TSERF_SHIFT                                (10U)
#define PERI_SPI6_SR_BIT_TSERF_MASK                                 (((1U<<1)-1) << PERI_SPI6_SR_BIT_TSERF_SHIFT)
#define PERI_SPI6_SR_BIT_SUSP_SHIFT                                 (11U)
#define PERI_SPI6_SR_BIT_SUSP_MASK                                  (((1U<<1)-1) << PERI_SPI6_SR_BIT_SUSP_SHIFT)
#define PERI_SPI6_SR_BIT_TXC_SHIFT                                  (12U)
#define PERI_SPI6_SR_BIT_TXC_MASK                                   (((1U<<1)-1) << PERI_SPI6_SR_BIT_TXC_SHIFT)
#define PERI_SPI6_SR_BIT_RXPLVL_SHIFT                               (13U)
#define PERI_SPI6_SR_BIT_RXPLVL_MASK                                (((1U<<2)-1) << PERI_SPI6_SR_BIT_RXPLVL_SHIFT)
#define PERI_SPI6_SR_BIT_RXWNE_SHIFT                                (15U)
#define PERI_SPI6_SR_BIT_RXWNE_MASK                                 (((1U<<1)-1) << PERI_SPI6_SR_BIT_RXWNE_SHIFT)
#define PERI_SPI6_SR_BIT_CTSIZE_SHIFT                               (16U)
#define PERI_SPI6_SR_BIT_CTSIZE_MASK                                (((1U<<16)-1) << PERI_SPI6_SR_BIT_CTSIZE_SHIFT)

/*--- register IFCR -------------------------------------------------*/
#define PERI_SPI6_IFCR_BIT_EOTC_SHIFT                               (3U)
#define PERI_SPI6_IFCR_BIT_EOTC_MASK                                (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_EOTC_SHIFT)
#define PERI_SPI6_IFCR_BIT_TXTFC_SHIFT                              (4U)
#define PERI_SPI6_IFCR_BIT_TXTFC_MASK                               (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_TXTFC_SHIFT)
#define PERI_SPI6_IFCR_BIT_UDRC_SHIFT                               (5U)
#define PERI_SPI6_IFCR_BIT_UDRC_MASK                                (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_UDRC_SHIFT)
#define PERI_SPI6_IFCR_BIT_OVRC_SHIFT                               (6U)
#define PERI_SPI6_IFCR_BIT_OVRC_MASK                                (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_OVRC_SHIFT)
#define PERI_SPI6_IFCR_BIT_CRCEC_SHIFT                              (7U)
#define PERI_SPI6_IFCR_BIT_CRCEC_MASK                               (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_CRCEC_SHIFT)
#define PERI_SPI6_IFCR_BIT_TIFREC_SHIFT                             (8U)
#define PERI_SPI6_IFCR_BIT_TIFREC_MASK                              (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_TIFREC_SHIFT)
#define PERI_SPI6_IFCR_BIT_MODFC_SHIFT                              (9U)
#define PERI_SPI6_IFCR_BIT_MODFC_MASK                               (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_MODFC_SHIFT)
#define PERI_SPI6_IFCR_BIT_TSERFC_SHIFT                             (10U)
#define PERI_SPI6_IFCR_BIT_TSERFC_MASK                              (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_TSERFC_SHIFT)
#define PERI_SPI6_IFCR_BIT_SUSPC_SHIFT                              (11U)
#define PERI_SPI6_IFCR_BIT_SUSPC_MASK                               (((1U<<1)-1) << PERI_SPI6_IFCR_BIT_SUSPC_SHIFT)

/*--- register TXDR -------------------------------------------------*/
#define PERI_SPI6_TXDR_BIT_TXDR_SHIFT                               (0U)
#define PERI_SPI6_TXDR_BIT_TXDR_MASK                                (((1U<<32)-1) << PERI_SPI6_TXDR_BIT_TXDR_SHIFT)

/*--- register RXDR -------------------------------------------------*/
#define PERI_SPI6_RXDR_BIT_RXDR_SHIFT                               (0U)
#define PERI_SPI6_RXDR_BIT_RXDR_MASK                                (((1U<<32)-1) << PERI_SPI6_RXDR_BIT_RXDR_SHIFT)

/*--- register CRCPOLY -------------------------------------------------*/
#define PERI_SPI6_CRCPOLY_BIT_CRCPOLY_SHIFT                         (0U)
#define PERI_SPI6_CRCPOLY_BIT_CRCPOLY_MASK                          (((1U<<32)-1) << PERI_SPI6_CRCPOLY_BIT_CRCPOLY_SHIFT)

/*--- register TXCRC -------------------------------------------------*/
#define PERI_SPI6_TXCRC_BIT_TXCRC_SHIFT                             (0U)
#define PERI_SPI6_TXCRC_BIT_TXCRC_MASK                              (((1U<<32)-1) << PERI_SPI6_TXCRC_BIT_TXCRC_SHIFT)

/*--- register RXCRC -------------------------------------------------*/
#define PERI_SPI6_RXCRC_BIT_RXCRC_SHIFT                             (0U)
#define PERI_SPI6_RXCRC_BIT_RXCRC_MASK                              (((1U<<32)-1) << PERI_SPI6_RXCRC_BIT_RXCRC_SHIFT)

/*--- register UDRDR -------------------------------------------------*/
#define PERI_SPI6_UDRDR_BIT_UDRDR_SHIFT                             (0U)
#define PERI_SPI6_UDRDR_BIT_UDRDR_MASK                              (((1U<<32)-1) << PERI_SPI6_UDRDR_BIT_UDRDR_SHIFT)

/*--- register CGFR -------------------------------------------------*/
#define PERI_SPI6_CGFR_BIT_I2SMOD_SHIFT                             (0U)
#define PERI_SPI6_CGFR_BIT_I2SMOD_MASK                              (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_I2SMOD_SHIFT)
#define PERI_SPI6_CGFR_BIT_I2SCFG_SHIFT                             (1U)
#define PERI_SPI6_CGFR_BIT_I2SCFG_MASK                              (((1U<<3)-1) << PERI_SPI6_CGFR_BIT_I2SCFG_SHIFT)
#define PERI_SPI6_CGFR_BIT_I2SSTD_SHIFT                             (4U)
#define PERI_SPI6_CGFR_BIT_I2SSTD_MASK                              (((1U<<2)-1) << PERI_SPI6_CGFR_BIT_I2SSTD_SHIFT)
#define PERI_SPI6_CGFR_BIT_PCMSYNC_SHIFT                            (7U)
#define PERI_SPI6_CGFR_BIT_PCMSYNC_MASK                             (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_PCMSYNC_SHIFT)
#define PERI_SPI6_CGFR_BIT_DATLEN_SHIFT                             (8U)
#define PERI_SPI6_CGFR_BIT_DATLEN_MASK                              (((1U<<2)-1) << PERI_SPI6_CGFR_BIT_DATLEN_SHIFT)
#define PERI_SPI6_CGFR_BIT_CHLEN_SHIFT                              (10U)
#define PERI_SPI6_CGFR_BIT_CHLEN_MASK                               (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_CHLEN_SHIFT)
#define PERI_SPI6_CGFR_BIT_CKPOL_SHIFT                              (11U)
#define PERI_SPI6_CGFR_BIT_CKPOL_MASK                               (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_CKPOL_SHIFT)
#define PERI_SPI6_CGFR_BIT_FIXCH_SHIFT                              (12U)
#define PERI_SPI6_CGFR_BIT_FIXCH_MASK                               (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_FIXCH_SHIFT)
#define PERI_SPI6_CGFR_BIT_WSINV_SHIFT                              (13U)
#define PERI_SPI6_CGFR_BIT_WSINV_MASK                               (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_WSINV_SHIFT)
#define PERI_SPI6_CGFR_BIT_DATFMT_SHIFT                             (14U)
#define PERI_SPI6_CGFR_BIT_DATFMT_MASK                              (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_DATFMT_SHIFT)
#define PERI_SPI6_CGFR_BIT_I2SDIV_SHIFT                             (16U)
#define PERI_SPI6_CGFR_BIT_I2SDIV_MASK                              (((1U<<8)-1) << PERI_SPI6_CGFR_BIT_I2SDIV_SHIFT)
#define PERI_SPI6_CGFR_BIT_ODD_SHIFT                                (24U)
#define PERI_SPI6_CGFR_BIT_ODD_MASK                                 (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_ODD_SHIFT)
#define PERI_SPI6_CGFR_BIT_MCKOE_SHIFT                              (25U)
#define PERI_SPI6_CGFR_BIT_MCKOE_MASK                               (((1U<<1)-1) << PERI_SPI6_CGFR_BIT_MCKOE_SHIFT)

