minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_SWPMI_CR_BIT_RXDMA_SHIFT                               (0U)
#define PERI_SWPMI_CR_BIT_RXDMA_MASK                                (((1U<<1)-1) << PERI_SWPMI_CR_BIT_RXDMA_SHIFT)
#define PERI_SWPMI_CR_BIT_TXDMA_SHIFT                               (1U)
#define PERI_SWPMI_CR_BIT_TXDMA_MASK                                (((1U<<1)-1) << PERI_SWPMI_CR_BIT_TXDMA_SHIFT)
#define PERI_SWPMI_CR_BIT_RXMODE_SHIFT                              (2U)
#define PERI_SWPMI_CR_BIT_RXMODE_MASK                               (((1U<<1)-1) << PERI_SWPMI_CR_BIT_RXMODE_SHIFT)
#define PERI_SWPMI_CR_BIT_TXMODE_SHIFT                              (3U)
#define PERI_SWPMI_CR_BIT_TXMODE_MASK                               (((1U<<1)-1) << PERI_SWPMI_CR_BIT_TXMODE_SHIFT)
#define PERI_SWPMI_CR_BIT_LPBK_SHIFT                                (4U)
#define PERI_SWPMI_CR_BIT_LPBK_MASK                                 (((1U<<1)-1) << PERI_SWPMI_CR_BIT_LPBK_SHIFT)
#define PERI_SWPMI_CR_BIT_SWPACT_SHIFT                              (5U)
#define PERI_SWPMI_CR_BIT_SWPACT_MASK                               (((1U<<1)-1) << PERI_SWPMI_CR_BIT_SWPACT_SHIFT)
#define PERI_SWPMI_CR_BIT_DEACT_SHIFT                               (10U)
#define PERI_SWPMI_CR_BIT_DEACT_MASK                                (((1U<<1)-1) << PERI_SWPMI_CR_BIT_DEACT_SHIFT)
#define PERI_SWPMI_CR_BIT_SWPTEN_SHIFT                              (11U)
#define PERI_SWPMI_CR_BIT_SWPTEN_MASK                               (((1U<<1)-1) << PERI_SWPMI_CR_BIT_SWPTEN_SHIFT)

/*--- register BRR -------------------------------------------------*/
#define PERI_SWPMI_BRR_BIT_BR_SHIFT                                 (0U)
#define PERI_SWPMI_BRR_BIT_BR_MASK                                  (((1U<<8)-1) << PERI_SWPMI_BRR_BIT_BR_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_SWPMI_ISR_BIT_RXBFF_SHIFT                              (0U)
#define PERI_SWPMI_ISR_BIT_RXBFF_MASK                               (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_RXBFF_SHIFT)
#define PERI_SWPMI_ISR_BIT_TXBEF_SHIFT                              (1U)
#define PERI_SWPMI_ISR_BIT_TXBEF_MASK                               (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_TXBEF_SHIFT)
#define PERI_SWPMI_ISR_BIT_RXBERF_SHIFT                             (2U)
#define PERI_SWPMI_ISR_BIT_RXBERF_MASK                              (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_RXBERF_SHIFT)
#define PERI_SWPMI_ISR_BIT_RXOVRF_SHIFT                             (3U)
#define PERI_SWPMI_ISR_BIT_RXOVRF_MASK                              (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_RXOVRF_SHIFT)
#define PERI_SWPMI_ISR_BIT_TXUNRF_SHIFT                             (4U)
#define PERI_SWPMI_ISR_BIT_TXUNRF_MASK                              (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_TXUNRF_SHIFT)
#define PERI_SWPMI_ISR_BIT_RXNE_SHIFT                               (5U)
#define PERI_SWPMI_ISR_BIT_RXNE_MASK                                (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_RXNE_SHIFT)
#define PERI_SWPMI_ISR_BIT_TXE_SHIFT                                (6U)
#define PERI_SWPMI_ISR_BIT_TXE_MASK                                 (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_TXE_SHIFT)
#define PERI_SWPMI_ISR_BIT_TCF_SHIFT                                (7U)
#define PERI_SWPMI_ISR_BIT_TCF_MASK                                 (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_TCF_SHIFT)
#define PERI_SWPMI_ISR_BIT_SRF_SHIFT                                (8U)
#define PERI_SWPMI_ISR_BIT_SRF_MASK                                 (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_SRF_SHIFT)
#define PERI_SWPMI_ISR_BIT_SUSP_SHIFT                               (9U)
#define PERI_SWPMI_ISR_BIT_SUSP_MASK                                (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_SUSP_SHIFT)
#define PERI_SWPMI_ISR_BIT_DEACTF_SHIFT                             (10U)
#define PERI_SWPMI_ISR_BIT_DEACTF_MASK                              (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_DEACTF_SHIFT)
#define PERI_SWPMI_ISR_BIT_RDYF_SHIFT                               (11U)
#define PERI_SWPMI_ISR_BIT_RDYF_MASK                                (((1U<<1)-1) << PERI_SWPMI_ISR_BIT_RDYF_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_SWPMI_ICR_BIT_CRXBFF_SHIFT                             (0U)
#define PERI_SWPMI_ICR_BIT_CRXBFF_MASK                              (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CRXBFF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CTXBEF_SHIFT                             (1U)
#define PERI_SWPMI_ICR_BIT_CTXBEF_MASK                              (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CTXBEF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CRXBERF_SHIFT                            (2U)
#define PERI_SWPMI_ICR_BIT_CRXBERF_MASK                             (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CRXBERF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CRXOVRF_SHIFT                            (3U)
#define PERI_SWPMI_ICR_BIT_CRXOVRF_MASK                             (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CRXOVRF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CTXUNRF_SHIFT                            (4U)
#define PERI_SWPMI_ICR_BIT_CTXUNRF_MASK                             (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CTXUNRF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CTCF_SHIFT                               (7U)
#define PERI_SWPMI_ICR_BIT_CTCF_MASK                                (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CTCF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CSRF_SHIFT                               (8U)
#define PERI_SWPMI_ICR_BIT_CSRF_MASK                                (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CSRF_SHIFT)
#define PERI_SWPMI_ICR_BIT_CRDYF_SHIFT                              (11U)
#define PERI_SWPMI_ICR_BIT_CRDYF_MASK                               (((1U<<1)-1) << PERI_SWPMI_ICR_BIT_CRDYF_SHIFT)

/*--- register IER -------------------------------------------------*/
#define PERI_SWPMI_IER_BIT_RXBFIE_SHIFT                             (0U)
#define PERI_SWPMI_IER_BIT_RXBFIE_MASK                              (((1U<<1)-1) << PERI_SWPMI_IER_BIT_RXBFIE_SHIFT)
#define PERI_SWPMI_IER_BIT_TXBEIE_SHIFT                             (1U)
#define PERI_SWPMI_IER_BIT_TXBEIE_MASK                              (((1U<<1)-1) << PERI_SWPMI_IER_BIT_TXBEIE_SHIFT)
#define PERI_SWPMI_IER_BIT_RXBERIE_SHIFT                            (2U)
#define PERI_SWPMI_IER_BIT_RXBERIE_MASK                             (((1U<<1)-1) << PERI_SWPMI_IER_BIT_RXBERIE_SHIFT)
#define PERI_SWPMI_IER_BIT_RXOVRIE_SHIFT                            (3U)
#define PERI_SWPMI_IER_BIT_RXOVRIE_MASK                             (((1U<<1)-1) << PERI_SWPMI_IER_BIT_RXOVRIE_SHIFT)
#define PERI_SWPMI_IER_BIT_TXUNRIE_SHIFT                            (4U)
#define PERI_SWPMI_IER_BIT_TXUNRIE_MASK                             (((1U<<1)-1) << PERI_SWPMI_IER_BIT_TXUNRIE_SHIFT)
#define PERI_SWPMI_IER_BIT_RIE_SHIFT                                (5U)
#define PERI_SWPMI_IER_BIT_RIE_MASK                                 (((1U<<1)-1) << PERI_SWPMI_IER_BIT_RIE_SHIFT)
#define PERI_SWPMI_IER_BIT_TIE_SHIFT                                (6U)
#define PERI_SWPMI_IER_BIT_TIE_MASK                                 (((1U<<1)-1) << PERI_SWPMI_IER_BIT_TIE_SHIFT)
#define PERI_SWPMI_IER_BIT_TCIE_SHIFT                               (7U)
#define PERI_SWPMI_IER_BIT_TCIE_MASK                                (((1U<<1)-1) << PERI_SWPMI_IER_BIT_TCIE_SHIFT)
#define PERI_SWPMI_IER_BIT_SRIE_SHIFT                               (8U)
#define PERI_SWPMI_IER_BIT_SRIE_MASK                                (((1U<<1)-1) << PERI_SWPMI_IER_BIT_SRIE_SHIFT)
#define PERI_SWPMI_IER_BIT_RDYIE_SHIFT                              (11U)
#define PERI_SWPMI_IER_BIT_RDYIE_MASK                               (((1U<<1)-1) << PERI_SWPMI_IER_BIT_RDYIE_SHIFT)

/*--- register RFL -------------------------------------------------*/
#define PERI_SWPMI_RFL_BIT_RFL_SHIFT                                (0U)
#define PERI_SWPMI_RFL_BIT_RFL_MASK                                 (((1U<<5)-1) << PERI_SWPMI_RFL_BIT_RFL_SHIFT)

/*--- register TDR -------------------------------------------------*/
#define PERI_SWPMI_TDR_BIT_TD_SHIFT                                 (0U)
#define PERI_SWPMI_TDR_BIT_TD_MASK                                  (((1U<<32)-1) << PERI_SWPMI_TDR_BIT_TD_SHIFT)

/*--- register RDR -------------------------------------------------*/
#define PERI_SWPMI_RDR_BIT_RD_SHIFT                                 (0U)
#define PERI_SWPMI_RDR_BIT_RD_MASK                                  (((1U<<32)-1) << PERI_SWPMI_RDR_BIT_RD_SHIFT)

