minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register OR -------------------------------------------------*/
#define PERI_SWPMI_OR_BIT_SWP_TBYP_SHIFT                            (0U)
#define PERI_SWPMI_OR_BIT_SWP_TBYP_MASK                             (((1U<<1)-1) << PERI_SWPMI_OR_BIT_SWP_TBYP_SHIFT)
#define PERI_SWPMI_OR_BIT_SWP_CLASS_SHIFT                           (1U)
#define PERI_SWPMI_OR_BIT_SWP_CLASS_MASK                            (((1U<<1)-1) << PERI_SWPMI_OR_BIT_SWP_CLASS_SHIFT)

/*--- register PMCR -------------------------------------------------*/
#define PERI_SYSCFG_PMCR_BIT_I2C1FMP_SHIFT                          (0U)
#define PERI_SYSCFG_PMCR_BIT_I2C1FMP_MASK                           (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_I2C1FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_I2C2FMP_SHIFT                          (1U)
#define PERI_SYSCFG_PMCR_BIT_I2C2FMP_MASK                           (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_I2C2FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_I2C3FMP_SHIFT                          (2U)
#define PERI_SYSCFG_PMCR_BIT_I2C3FMP_MASK                           (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_I2C3FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_I2C4FMP_SHIFT                          (3U)
#define PERI_SYSCFG_PMCR_BIT_I2C4FMP_MASK                           (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_I2C4FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PB6FMP_SHIFT                           (4U)
#define PERI_SYSCFG_PMCR_BIT_PB6FMP_MASK                            (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PB6FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PB7FMP_SHIFT                           (5U)
#define PERI_SYSCFG_PMCR_BIT_PB7FMP_MASK                            (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PB7FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PB8FMP_SHIFT                           (6U)
#define PERI_SYSCFG_PMCR_BIT_PB8FMP_MASK                            (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PB8FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PB9FMP_SHIFT                           (7U)
#define PERI_SYSCFG_PMCR_BIT_PB9FMP_MASK                            (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PB9FMP_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_BOOSTE_SHIFT                           (8U)
#define PERI_SYSCFG_PMCR_BIT_BOOSTE_MASK                            (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_BOOSTE_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_BOOSTVDDSEL_SHIFT                      (9U)
#define PERI_SYSCFG_PMCR_BIT_BOOSTVDDSEL_MASK                       (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_BOOSTVDDSEL_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_EPIS_SHIFT                             (21U)
#define PERI_SYSCFG_PMCR_BIT_EPIS_MASK                              (((1U<<3)-1) << PERI_SYSCFG_PMCR_BIT_EPIS_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PA0SO_SHIFT                            (24U)
#define PERI_SYSCFG_PMCR_BIT_PA0SO_MASK                             (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PA0SO_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PA1SO_SHIFT                            (25U)
#define PERI_SYSCFG_PMCR_BIT_PA1SO_MASK                             (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PA1SO_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PC2SO_SHIFT                            (26U)
#define PERI_SYSCFG_PMCR_BIT_PC2SO_MASK                             (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PC2SO_SHIFT)
#define PERI_SYSCFG_PMCR_BIT_PC3SO_SHIFT                            (27U)
#define PERI_SYSCFG_PMCR_BIT_PC3SO_MASK                             (((1U<<1)-1) << PERI_SYSCFG_PMCR_BIT_PC3SO_SHIFT)

/*--- register EXTICR1 -------------------------------------------------*/
#define PERI_SYSCFG_EXTICR1_BIT_EXTI0_SHIFT                         (0U)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI0_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR1_BIT_EXTI0_SHIFT)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI1_SHIFT                         (4U)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI1_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR1_BIT_EXTI1_SHIFT)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI2_SHIFT                         (8U)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI2_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR1_BIT_EXTI2_SHIFT)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI3_SHIFT                         (12U)
#define PERI_SYSCFG_EXTICR1_BIT_EXTI3_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR1_BIT_EXTI3_SHIFT)

/*--- register EXTICR2 -------------------------------------------------*/
#define PERI_SYSCFG_EXTICR2_BIT_EXTI4_SHIFT                         (0U)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI4_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR2_BIT_EXTI4_SHIFT)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI5_SHIFT                         (4U)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI5_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR2_BIT_EXTI5_SHIFT)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI6_SHIFT                         (8U)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI6_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR2_BIT_EXTI6_SHIFT)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI7_SHIFT                         (12U)
#define PERI_SYSCFG_EXTICR2_BIT_EXTI7_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR2_BIT_EXTI7_SHIFT)

/*--- register EXTICR3 -------------------------------------------------*/
#define PERI_SYSCFG_EXTICR3_BIT_EXTI8_SHIFT                         (0U)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI8_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR3_BIT_EXTI8_SHIFT)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI9_SHIFT                         (4U)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI9_MASK                          (((1U<<4)-1) << PERI_SYSCFG_EXTICR3_BIT_EXTI9_SHIFT)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI10_SHIFT                        (8U)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI10_MASK                         (((1U<<4)-1) << PERI_SYSCFG_EXTICR3_BIT_EXTI10_SHIFT)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI11_SHIFT                        (12U)
#define PERI_SYSCFG_EXTICR3_BIT_EXTI11_MASK                         (((1U<<4)-1) << PERI_SYSCFG_EXTICR3_BIT_EXTI11_SHIFT)

/*--- register EXTICR4 -------------------------------------------------*/
#define PERI_SYSCFG_EXTICR4_BIT_EXTI12_SHIFT                        (0U)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI12_MASK                         (((1U<<4)-1) << PERI_SYSCFG_EXTICR4_BIT_EXTI12_SHIFT)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI13_SHIFT                        (4U)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI13_MASK                         (((1U<<4)-1) << PERI_SYSCFG_EXTICR4_BIT_EXTI13_SHIFT)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI14_SHIFT                        (8U)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI14_MASK                         (((1U<<4)-1) << PERI_SYSCFG_EXTICR4_BIT_EXTI14_SHIFT)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI15_SHIFT                        (12U)
#define PERI_SYSCFG_EXTICR4_BIT_EXTI15_MASK                         (((1U<<4)-1) << PERI_SYSCFG_EXTICR4_BIT_EXTI15_SHIFT)

