minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CCCSR -------------------------------------------------*/
#define PERI_SYSCFG_CCCSR_BIT_EN_SHIFT                              (0U)
#define PERI_SYSCFG_CCCSR_BIT_EN_MASK                               (((1U<<1)-1) << PERI_SYSCFG_CCCSR_BIT_EN_SHIFT)
#define PERI_SYSCFG_CCCSR_BIT_CS_SHIFT                              (1U)
#define PERI_SYSCFG_CCCSR_BIT_CS_MASK                               (((1U<<1)-1) << PERI_SYSCFG_CCCSR_BIT_CS_SHIFT)
#define PERI_SYSCFG_CCCSR_BIT_READY_SHIFT                           (8U)
#define PERI_SYSCFG_CCCSR_BIT_READY_MASK                            (((1U<<1)-1) << PERI_SYSCFG_CCCSR_BIT_READY_SHIFT)
#define PERI_SYSCFG_CCCSR_BIT_HSLV_SHIFT                            (16U)
#define PERI_SYSCFG_CCCSR_BIT_HSLV_MASK                             (((1U<<1)-1) << PERI_SYSCFG_CCCSR_BIT_HSLV_SHIFT)

/*--- register CCVR -------------------------------------------------*/
#define PERI_SYSCFG_CCVR_BIT_NCV_SHIFT                              (0U)
#define PERI_SYSCFG_CCVR_BIT_NCV_MASK                               (((1U<<4)-1) << PERI_SYSCFG_CCVR_BIT_NCV_SHIFT)
#define PERI_SYSCFG_CCVR_BIT_PCV_SHIFT                              (4U)
#define PERI_SYSCFG_CCVR_BIT_PCV_MASK                               (((1U<<4)-1) << PERI_SYSCFG_CCVR_BIT_PCV_SHIFT)

/*--- register CCCR -------------------------------------------------*/
#define PERI_SYSCFG_CCCR_BIT_NCC_SHIFT                              (0U)
#define PERI_SYSCFG_CCCR_BIT_NCC_MASK                               (((1U<<4)-1) << PERI_SYSCFG_CCCR_BIT_NCC_SHIFT)
#define PERI_SYSCFG_CCCR_BIT_PCC_SHIFT                              (4U)
#define PERI_SYSCFG_CCCR_BIT_PCC_MASK                               (((1U<<4)-1) << PERI_SYSCFG_CCCR_BIT_PCC_SHIFT)

/*--- register PWRCR -------------------------------------------------*/
#define PERI_SYSCFG_PWRCR_BIT_ODEN_SHIFT                            (0U)
#define PERI_SYSCFG_PWRCR_BIT_ODEN_MASK                             (((1U<<4)-1) << PERI_SYSCFG_PWRCR_BIT_ODEN_SHIFT)

/*--- register PKGR -------------------------------------------------*/
#define PERI_SYSCFG_PKGR_BIT_PKG_SHIFT                              (0U)
#define PERI_SYSCFG_PKGR_BIT_PKG_MASK                               (((1U<<4)-1) << PERI_SYSCFG_PKGR_BIT_PKG_SHIFT)

/*--- register UR0 -------------------------------------------------*/
#define PERI_SYSCFG_UR0_BIT_BKS_SHIFT                               (0U)
#define PERI_SYSCFG_UR0_BIT_BKS_MASK                                (((1U<<1)-1) << PERI_SYSCFG_UR0_BIT_BKS_SHIFT)
#define PERI_SYSCFG_UR0_BIT_RDP_SHIFT                               (16U)
#define PERI_SYSCFG_UR0_BIT_RDP_MASK                                (((1U<<8)-1) << PERI_SYSCFG_UR0_BIT_RDP_SHIFT)

/*--- register UR2 -------------------------------------------------*/
#define PERI_SYSCFG_UR2_BIT_BORH_SHIFT                              (0U)
#define PERI_SYSCFG_UR2_BIT_BORH_MASK                               (((1U<<2)-1) << PERI_SYSCFG_UR2_BIT_BORH_SHIFT)
#define PERI_SYSCFG_UR2_BIT_BOOT_ADD0_SHIFT                         (16U)
#define PERI_SYSCFG_UR2_BIT_BOOT_ADD0_MASK                          (((1U<<16)-1) << PERI_SYSCFG_UR2_BIT_BOOT_ADD0_SHIFT)

/*--- register UR3 -------------------------------------------------*/
#define PERI_SYSCFG_UR3_BIT_BOOT_ADD1_SHIFT                         (16U)
#define PERI_SYSCFG_UR3_BIT_BOOT_ADD1_MASK                          (((1U<<16)-1) << PERI_SYSCFG_UR3_BIT_BOOT_ADD1_SHIFT)

/*--- register UR4 -------------------------------------------------*/
#define PERI_SYSCFG_UR4_BIT_MEPAD_1_SHIFT                           (16U)
#define PERI_SYSCFG_UR4_BIT_MEPAD_1_MASK                            (((1U<<1)-1) << PERI_SYSCFG_UR4_BIT_MEPAD_1_SHIFT)

/*--- register UR5 -------------------------------------------------*/
#define PERI_SYSCFG_UR5_BIT_MESAD_1_SHIFT                           (0U)
#define PERI_SYSCFG_UR5_BIT_MESAD_1_MASK                            (((1U<<1)-1) << PERI_SYSCFG_UR5_BIT_MESAD_1_SHIFT)
#define PERI_SYSCFG_UR5_BIT_WRPN_1_SHIFT                            (16U)
#define PERI_SYSCFG_UR5_BIT_WRPN_1_MASK                             (((1U<<8)-1) << PERI_SYSCFG_UR5_BIT_WRPN_1_SHIFT)

/*--- register UR6 -------------------------------------------------*/
#define PERI_SYSCFG_UR6_BIT_PA_BEG_1_SHIFT                          (0U)
#define PERI_SYSCFG_UR6_BIT_PA_BEG_1_MASK                           (((1U<<12)-1) << PERI_SYSCFG_UR6_BIT_PA_BEG_1_SHIFT)
#define PERI_SYSCFG_UR6_BIT_PA_END_1_SHIFT                          (16U)
#define PERI_SYSCFG_UR6_BIT_PA_END_1_MASK                           (((1U<<12)-1) << PERI_SYSCFG_UR6_BIT_PA_END_1_SHIFT)

/*--- register UR7 -------------------------------------------------*/
#define PERI_SYSCFG_UR7_BIT_SA_BEG_1_SHIFT                          (0U)
#define PERI_SYSCFG_UR7_BIT_SA_BEG_1_MASK                           (((1U<<12)-1) << PERI_SYSCFG_UR7_BIT_SA_BEG_1_SHIFT)
#define PERI_SYSCFG_UR7_BIT_SA_END_1_SHIFT                          (16U)
#define PERI_SYSCFG_UR7_BIT_SA_END_1_MASK                           (((1U<<12)-1) << PERI_SYSCFG_UR7_BIT_SA_END_1_SHIFT)

/*--- register UR8 -------------------------------------------------*/
#define PERI_SYSCFG_UR8_BIT_MEPAD_2_SHIFT                           (0U)
#define PERI_SYSCFG_UR8_BIT_MEPAD_2_MASK                            (((1U<<1)-1) << PERI_SYSCFG_UR8_BIT_MEPAD_2_SHIFT)
#define PERI_SYSCFG_UR8_BIT_MESAD_2_SHIFT                           (16U)
#define PERI_SYSCFG_UR8_BIT_MESAD_2_MASK                            (((1U<<1)-1) << PERI_SYSCFG_UR8_BIT_MESAD_2_SHIFT)

/*--- register UR9 -------------------------------------------------*/
#define PERI_SYSCFG_UR9_BIT_WRPN_2_SHIFT                            (0U)
#define PERI_SYSCFG_UR9_BIT_WRPN_2_MASK                             (((1U<<8)-1) << PERI_SYSCFG_UR9_BIT_WRPN_2_SHIFT)
#define PERI_SYSCFG_UR9_BIT_PA_BEG_2_SHIFT                          (16U)
#define PERI_SYSCFG_UR9_BIT_PA_BEG_2_MASK                           (((1U<<12)-1) << PERI_SYSCFG_UR9_BIT_PA_BEG_2_SHIFT)

/*--- register UR10 -------------------------------------------------*/
#define PERI_SYSCFG_UR10_BIT_PA_END_2_SHIFT                         (0U)
#define PERI_SYSCFG_UR10_BIT_PA_END_2_MASK                          (((1U<<12)-1) << PERI_SYSCFG_UR10_BIT_PA_END_2_SHIFT)
#define PERI_SYSCFG_UR10_BIT_SA_BEG_2_SHIFT                         (16U)
#define PERI_SYSCFG_UR10_BIT_SA_BEG_2_MASK                          (((1U<<12)-1) << PERI_SYSCFG_UR10_BIT_SA_BEG_2_SHIFT)

/*--- register UR11 -------------------------------------------------*/
#define PERI_SYSCFG_UR11_BIT_SA_END_2_SHIFT                         (0U)
#define PERI_SYSCFG_UR11_BIT_SA_END_2_MASK                          (((1U<<12)-1) << PERI_SYSCFG_UR11_BIT_SA_END_2_SHIFT)
#define PERI_SYSCFG_UR11_BIT_IWDG1M_SHIFT                           (16U)
#define PERI_SYSCFG_UR11_BIT_IWDG1M_MASK                            (((1U<<1)-1) << PERI_SYSCFG_UR11_BIT_IWDG1M_SHIFT)

/*--- register UR12 -------------------------------------------------*/
#define PERI_SYSCFG_UR12_BIT_SECURE_SHIFT                           (16U)
#define PERI_SYSCFG_UR12_BIT_SECURE_MASK                            (((1U<<1)-1) << PERI_SYSCFG_UR12_BIT_SECURE_SHIFT)

