minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register UR13 -------------------------------------------------*/
#define PERI_SYSCFG_UR13_BIT_SDRS_SHIFT                             (0U)
#define PERI_SYSCFG_UR13_BIT_SDRS_MASK                              (((1U<<2)-1) << PERI_SYSCFG_UR13_BIT_SDRS_SHIFT)
#define PERI_SYSCFG_UR13_BIT_D1SBRST_SHIFT                          (16U)
#define PERI_SYSCFG_UR13_BIT_D1SBRST_MASK                           (((1U<<1)-1) << PERI_SYSCFG_UR13_BIT_D1SBRST_SHIFT)

/*--- register UR14 -------------------------------------------------*/
#define PERI_SYSCFG_UR14_BIT_D1STPRST_SHIFT                         (0U)
#define PERI_SYSCFG_UR14_BIT_D1STPRST_MASK                          (((1U<<1)-1) << PERI_SYSCFG_UR14_BIT_D1STPRST_SHIFT)

/*--- register UR15 -------------------------------------------------*/
#define PERI_SYSCFG_UR15_BIT_FZIWDGSTB_SHIFT                        (16U)
#define PERI_SYSCFG_UR15_BIT_FZIWDGSTB_MASK                         (((1U<<1)-1) << PERI_SYSCFG_UR15_BIT_FZIWDGSTB_SHIFT)

/*--- register UR16 -------------------------------------------------*/
#define PERI_SYSCFG_UR16_BIT_FZIWDGSTP_SHIFT                        (0U)
#define PERI_SYSCFG_UR16_BIT_FZIWDGSTP_MASK                         (((1U<<1)-1) << PERI_SYSCFG_UR16_BIT_FZIWDGSTP_SHIFT)
#define PERI_SYSCFG_UR16_BIT_PKP_SHIFT                              (16U)
#define PERI_SYSCFG_UR16_BIT_PKP_MASK                               (((1U<<1)-1) << PERI_SYSCFG_UR16_BIT_PKP_SHIFT)

/*--- register UR17 -------------------------------------------------*/
#define PERI_SYSCFG_UR17_BIT_IO_HSLV_SHIFT                          (0U)
#define PERI_SYSCFG_UR17_BIT_IO_HSLV_MASK                           (((1U<<1)-1) << PERI_SYSCFG_UR17_BIT_IO_HSLV_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_TIM1_CR1_BIT_CEN_SHIFT                                 (0U)
#define PERI_TIM1_CR1_BIT_CEN_MASK                                  (((1U<<1)-1) << PERI_TIM1_CR1_BIT_CEN_SHIFT)
#define PERI_TIM1_CR1_BIT_UDIS_SHIFT                                (1U)
#define PERI_TIM1_CR1_BIT_UDIS_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR1_BIT_UDIS_SHIFT)
#define PERI_TIM1_CR1_BIT_URS_SHIFT                                 (2U)
#define PERI_TIM1_CR1_BIT_URS_MASK                                  (((1U<<1)-1) << PERI_TIM1_CR1_BIT_URS_SHIFT)
#define PERI_TIM1_CR1_BIT_OPM_SHIFT                                 (3U)
#define PERI_TIM1_CR1_BIT_OPM_MASK                                  (((1U<<1)-1) << PERI_TIM1_CR1_BIT_OPM_SHIFT)
#define PERI_TIM1_CR1_BIT_DIR_SHIFT                                 (4U)
#define PERI_TIM1_CR1_BIT_DIR_MASK                                  (((1U<<1)-1) << PERI_TIM1_CR1_BIT_DIR_SHIFT)
#define PERI_TIM1_CR1_BIT_CMS_SHIFT                                 (5U)
#define PERI_TIM1_CR1_BIT_CMS_MASK                                  (((1U<<2)-1) << PERI_TIM1_CR1_BIT_CMS_SHIFT)
#define PERI_TIM1_CR1_BIT_ARPE_SHIFT                                (7U)
#define PERI_TIM1_CR1_BIT_ARPE_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR1_BIT_ARPE_SHIFT)
#define PERI_TIM1_CR1_BIT_CKD_SHIFT                                 (8U)
#define PERI_TIM1_CR1_BIT_CKD_MASK                                  (((1U<<2)-1) << PERI_TIM1_CR1_BIT_CKD_SHIFT)
#define PERI_TIM1_CR1_BIT_UIFREMAP_SHIFT                            (11U)
#define PERI_TIM1_CR1_BIT_UIFREMAP_MASK                             (((1U<<1)-1) << PERI_TIM1_CR1_BIT_UIFREMAP_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_TIM1_CR2_BIT_CCPC_SHIFT                                (0U)
#define PERI_TIM1_CR2_BIT_CCPC_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_CCPC_SHIFT)
#define PERI_TIM1_CR2_BIT_CCUS_SHIFT                                (2U)
#define PERI_TIM1_CR2_BIT_CCUS_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_CCUS_SHIFT)
#define PERI_TIM1_CR2_BIT_CCDS_SHIFT                                (3U)
#define PERI_TIM1_CR2_BIT_CCDS_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_CCDS_SHIFT)
#define PERI_TIM1_CR2_BIT_MMS_SHIFT                                 (4U)
#define PERI_TIM1_CR2_BIT_MMS_MASK                                  (((1U<<3)-1) << PERI_TIM1_CR2_BIT_MMS_SHIFT)
#define PERI_TIM1_CR2_BIT_TI1S_SHIFT                                (7U)
#define PERI_TIM1_CR2_BIT_TI1S_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_TI1S_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS1_SHIFT                                (8U)
#define PERI_TIM1_CR2_BIT_OIS1_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS1_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS1N_SHIFT                               (9U)
#define PERI_TIM1_CR2_BIT_OIS1N_MASK                                (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS1N_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS2_SHIFT                                (10U)
#define PERI_TIM1_CR2_BIT_OIS2_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS2_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS2N_SHIFT                               (11U)
#define PERI_TIM1_CR2_BIT_OIS2N_MASK                                (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS2N_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS3_SHIFT                                (12U)
#define PERI_TIM1_CR2_BIT_OIS3_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS3_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS3N_SHIFT                               (13U)
#define PERI_TIM1_CR2_BIT_OIS3N_MASK                                (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS3N_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS4_SHIFT                                (14U)
#define PERI_TIM1_CR2_BIT_OIS4_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS4_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS5_SHIFT                                (16U)
#define PERI_TIM1_CR2_BIT_OIS5_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS5_SHIFT)
#define PERI_TIM1_CR2_BIT_OIS6_SHIFT                                (18U)
#define PERI_TIM1_CR2_BIT_OIS6_MASK                                 (((1U<<1)-1) << PERI_TIM1_CR2_BIT_OIS6_SHIFT)
#define PERI_TIM1_CR2_BIT_MMS2_SHIFT                                (20U)
#define PERI_TIM1_CR2_BIT_MMS2_MASK                                 (((1U<<4)-1) << PERI_TIM1_CR2_BIT_MMS2_SHIFT)

/*--- register SMCR -------------------------------------------------*/
#define PERI_TIM1_SMCR_BIT_SMS_SHIFT                                (0U)
#define PERI_TIM1_SMCR_BIT_SMS_MASK                                 (((1U<<3)-1) << PERI_TIM1_SMCR_BIT_SMS_SHIFT)
#define PERI_TIM1_SMCR_BIT_TS_SHIFT                                 (4U)
#define PERI_TIM1_SMCR_BIT_TS_MASK                                  (((1U<<3)-1) << PERI_TIM1_SMCR_BIT_TS_SHIFT)
#define PERI_TIM1_SMCR_BIT_MSM_SHIFT                                (7U)
#define PERI_TIM1_SMCR_BIT_MSM_MASK                                 (((1U<<1)-1) << PERI_TIM1_SMCR_BIT_MSM_SHIFT)
#define PERI_TIM1_SMCR_BIT_ETF_SHIFT                                (8U)
#define PERI_TIM1_SMCR_BIT_ETF_MASK                                 (((1U<<4)-1) << PERI_TIM1_SMCR_BIT_ETF_SHIFT)
#define PERI_TIM1_SMCR_BIT_ETPS_SHIFT                               (12U)
#define PERI_TIM1_SMCR_BIT_ETPS_MASK                                (((1U<<2)-1) << PERI_TIM1_SMCR_BIT_ETPS_SHIFT)
#define PERI_TIM1_SMCR_BIT_ECE_SHIFT                                (14U)
#define PERI_TIM1_SMCR_BIT_ECE_MASK                                 (((1U<<1)-1) << PERI_TIM1_SMCR_BIT_ECE_SHIFT)
#define PERI_TIM1_SMCR_BIT_ETP_SHIFT                                (15U)
#define PERI_TIM1_SMCR_BIT_ETP_MASK                                 (((1U<<1)-1) << PERI_TIM1_SMCR_BIT_ETP_SHIFT)
#define PERI_TIM1_SMCR_BIT_SMS_3_SHIFT                              (16U)
#define PERI_TIM1_SMCR_BIT_SMS_3_MASK                               (((1U<<1)-1) << PERI_TIM1_SMCR_BIT_SMS_3_SHIFT)
#define PERI_TIM1_SMCR_BIT_TS_4_3_SHIFT                             (20U)
#define PERI_TIM1_SMCR_BIT_TS_4_3_MASK                              (((1U<<2)-1) << PERI_TIM1_SMCR_BIT_TS_4_3_SHIFT)

/*--- register DIER -------------------------------------------------*/
#define PERI_TIM1_DIER_BIT_UIE_SHIFT                                (0U)
#define PERI_TIM1_DIER_BIT_UIE_MASK                                 (((1U<<1)-1) << PERI_TIM1_DIER_BIT_UIE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC1IE_SHIFT                              (1U)
#define PERI_TIM1_DIER_BIT_CC1IE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC1IE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC2IE_SHIFT                              (2U)
#define PERI_TIM1_DIER_BIT_CC2IE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC2IE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC3IE_SHIFT                              (3U)
#define PERI_TIM1_DIER_BIT_CC3IE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC3IE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC4IE_SHIFT                              (4U)
#define PERI_TIM1_DIER_BIT_CC4IE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC4IE_SHIFT)
#define PERI_TIM1_DIER_BIT_COMIE_SHIFT                              (5U)
#define PERI_TIM1_DIER_BIT_COMIE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_COMIE_SHIFT)
#define PERI_TIM1_DIER_BIT_TIE_SHIFT                                (6U)
#define PERI_TIM1_DIER_BIT_TIE_MASK                                 (((1U<<1)-1) << PERI_TIM1_DIER_BIT_TIE_SHIFT)
#define PERI_TIM1_DIER_BIT_BIE_SHIFT                                (7U)
#define PERI_TIM1_DIER_BIT_BIE_MASK                                 (((1U<<1)-1) << PERI_TIM1_DIER_BIT_BIE_SHIFT)
#define PERI_TIM1_DIER_BIT_UDE_SHIFT                                (8U)
#define PERI_TIM1_DIER_BIT_UDE_MASK                                 (((1U<<1)-1) << PERI_TIM1_DIER_BIT_UDE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC1DE_SHIFT                              (9U)
#define PERI_TIM1_DIER_BIT_CC1DE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC1DE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC2DE_SHIFT                              (10U)
#define PERI_TIM1_DIER_BIT_CC2DE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC2DE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC3DE_SHIFT                              (11U)
#define PERI_TIM1_DIER_BIT_CC3DE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC3DE_SHIFT)
#define PERI_TIM1_DIER_BIT_CC4DE_SHIFT                              (12U)
#define PERI_TIM1_DIER_BIT_CC4DE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_CC4DE_SHIFT)
#define PERI_TIM1_DIER_BIT_COMDE_SHIFT                              (13U)
#define PERI_TIM1_DIER_BIT_COMDE_MASK                               (((1U<<1)-1) << PERI_TIM1_DIER_BIT_COMDE_SHIFT)
#define PERI_TIM1_DIER_BIT_TDE_SHIFT                                (14U)
#define PERI_TIM1_DIER_BIT_TDE_MASK                                 (((1U<<1)-1) << PERI_TIM1_DIER_BIT_TDE_SHIFT)

