minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RCR -------------------------------------------------*/
#define PERI_TIM1_RCR_BIT_REP_SHIFT                                 (0U)
#define PERI_TIM1_RCR_BIT_REP_MASK                                  (((1U<<8)-1) << PERI_TIM1_RCR_BIT_REP_SHIFT)

/*--- register CCR1 -------------------------------------------------*/
#define PERI_TIM1_CCR1_BIT_CCR1_SHIFT                               (0U)
#define PERI_TIM1_CCR1_BIT_CCR1_MASK                                (((1U<<16)-1) << PERI_TIM1_CCR1_BIT_CCR1_SHIFT)

/*--- register CCR2 -------------------------------------------------*/
#define PERI_TIM1_CCR2_BIT_CCR2_SHIFT                               (0U)
#define PERI_TIM1_CCR2_BIT_CCR2_MASK                                (((1U<<16)-1) << PERI_TIM1_CCR2_BIT_CCR2_SHIFT)

/*--- register CCR3 -------------------------------------------------*/
#define PERI_TIM1_CCR3_BIT_CCR3_SHIFT                               (0U)
#define PERI_TIM1_CCR3_BIT_CCR3_MASK                                (((1U<<16)-1) << PERI_TIM1_CCR3_BIT_CCR3_SHIFT)

/*--- register CCR4 -------------------------------------------------*/
#define PERI_TIM1_CCR4_BIT_CCR4_SHIFT                               (0U)
#define PERI_TIM1_CCR4_BIT_CCR4_MASK                                (((1U<<16)-1) << PERI_TIM1_CCR4_BIT_CCR4_SHIFT)

/*--- register BDTR -------------------------------------------------*/
#define PERI_TIM1_BDTR_BIT_DTG_SHIFT                                (0U)
#define PERI_TIM1_BDTR_BIT_DTG_MASK                                 (((1U<<8)-1) << PERI_TIM1_BDTR_BIT_DTG_SHIFT)
#define PERI_TIM1_BDTR_BIT_LOCK_SHIFT                               (8U)
#define PERI_TIM1_BDTR_BIT_LOCK_MASK                                (((1U<<2)-1) << PERI_TIM1_BDTR_BIT_LOCK_SHIFT)
#define PERI_TIM1_BDTR_BIT_OSSI_SHIFT                               (10U)
#define PERI_TIM1_BDTR_BIT_OSSI_MASK                                (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_OSSI_SHIFT)
#define PERI_TIM1_BDTR_BIT_OSSR_SHIFT                               (11U)
#define PERI_TIM1_BDTR_BIT_OSSR_MASK                                (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_OSSR_SHIFT)
#define PERI_TIM1_BDTR_BIT_BKE_SHIFT                                (12U)
#define PERI_TIM1_BDTR_BIT_BKE_MASK                                 (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_BKE_SHIFT)
#define PERI_TIM1_BDTR_BIT_BKP_SHIFT                                (13U)
#define PERI_TIM1_BDTR_BIT_BKP_MASK                                 (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_BKP_SHIFT)
#define PERI_TIM1_BDTR_BIT_AOE_SHIFT                                (14U)
#define PERI_TIM1_BDTR_BIT_AOE_MASK                                 (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_AOE_SHIFT)
#define PERI_TIM1_BDTR_BIT_MOE_SHIFT                                (15U)
#define PERI_TIM1_BDTR_BIT_MOE_MASK                                 (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_MOE_SHIFT)
#define PERI_TIM1_BDTR_BIT_BKF_SHIFT                                (16U)
#define PERI_TIM1_BDTR_BIT_BKF_MASK                                 (((1U<<4)-1) << PERI_TIM1_BDTR_BIT_BKF_SHIFT)
#define PERI_TIM1_BDTR_BIT_BK2F_SHIFT                               (20U)
#define PERI_TIM1_BDTR_BIT_BK2F_MASK                                (((1U<<4)-1) << PERI_TIM1_BDTR_BIT_BK2F_SHIFT)
#define PERI_TIM1_BDTR_BIT_BK2E_SHIFT                               (24U)
#define PERI_TIM1_BDTR_BIT_BK2E_MASK                                (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_BK2E_SHIFT)
#define PERI_TIM1_BDTR_BIT_BK2P_SHIFT                               (25U)
#define PERI_TIM1_BDTR_BIT_BK2P_MASK                                (((1U<<1)-1) << PERI_TIM1_BDTR_BIT_BK2P_SHIFT)

/*--- register DCR -------------------------------------------------*/
#define PERI_TIM1_DCR_BIT_DBA_SHIFT                                 (0U)
#define PERI_TIM1_DCR_BIT_DBA_MASK                                  (((1U<<5)-1) << PERI_TIM1_DCR_BIT_DBA_SHIFT)
#define PERI_TIM1_DCR_BIT_DBL_SHIFT                                 (8U)
#define PERI_TIM1_DCR_BIT_DBL_MASK                                  (((1U<<5)-1) << PERI_TIM1_DCR_BIT_DBL_SHIFT)

/*--- register DMAR -------------------------------------------------*/
#define PERI_TIM1_DMAR_BIT_DMAB_SHIFT                               (0U)
#define PERI_TIM1_DMAR_BIT_DMAB_MASK                                (((1U<<16)-1) << PERI_TIM1_DMAR_BIT_DMAB_SHIFT)

/*--- register CCMR3_Output -------------------------------------------------*/
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5FE_SHIFT                      (2U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5FE_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC5FE_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5PE_SHIFT                      (3U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5PE_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC5PE_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5M_SHIFT                       (4U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5M_MASK                        (((1U<<3)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC5M_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5CE_SHIFT                      (7U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5CE_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC5CE_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6FE_SHIFT                      (10U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6FE_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC6FE_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6PE_SHIFT                      (11U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6PE_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC6PE_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6M_SHIFT                       (12U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6M_MASK                        (((1U<<3)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC6M_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6CE_SHIFT                      (15U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6CE_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC6CE_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5M3_SHIFT                      (16U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC5M3_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC5M3_SHIFT)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6M3_SHIFT                      (24U)
#define PERI_TIM1_CCMR3_OUTPUT_BIT_OC6M3_MASK                       (((1U<<1)-1) << PERI_TIM1_CCMR3_OUTPUT_BIT_OC6M3_SHIFT)

/*--- register CCR5 -------------------------------------------------*/
#define PERI_TIM1_CCR5_BIT_CCR5_SHIFT                               (0U)
#define PERI_TIM1_CCR5_BIT_CCR5_MASK                                (((1U<<16)-1) << PERI_TIM1_CCR5_BIT_CCR5_SHIFT)
#define PERI_TIM1_CCR5_BIT_GC5C1_SHIFT                              (29U)
#define PERI_TIM1_CCR5_BIT_GC5C1_MASK                               (((1U<<1)-1) << PERI_TIM1_CCR5_BIT_GC5C1_SHIFT)
#define PERI_TIM1_CCR5_BIT_GC5C2_SHIFT                              (30U)
#define PERI_TIM1_CCR5_BIT_GC5C2_MASK                               (((1U<<1)-1) << PERI_TIM1_CCR5_BIT_GC5C2_SHIFT)
#define PERI_TIM1_CCR5_BIT_GC5C3_SHIFT                              (31U)
#define PERI_TIM1_CCR5_BIT_GC5C3_MASK                               (((1U<<1)-1) << PERI_TIM1_CCR5_BIT_GC5C3_SHIFT)

/*--- register CCR6 -------------------------------------------------*/
#define PERI_TIM1_CCR6_BIT_CCR6_SHIFT                               (0U)
#define PERI_TIM1_CCR6_BIT_CCR6_MASK                                (((1U<<16)-1) << PERI_TIM1_CCR6_BIT_CCR6_SHIFT)

