minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CCR1 -------------------------------------------------*/
#define PERI_TIM12_CCR1_BIT_CCR1_L_SHIFT                            (0U)
#define PERI_TIM12_CCR1_BIT_CCR1_L_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR1_BIT_CCR1_L_SHIFT)
#define PERI_TIM12_CCR1_BIT_CCR1_H_SHIFT                            (16U)
#define PERI_TIM12_CCR1_BIT_CCR1_H_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR1_BIT_CCR1_H_SHIFT)

/*--- register CCR2 -------------------------------------------------*/
#define PERI_TIM12_CCR2_BIT_CCR2_L_SHIFT                            (0U)
#define PERI_TIM12_CCR2_BIT_CCR2_L_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR2_BIT_CCR2_L_SHIFT)
#define PERI_TIM12_CCR2_BIT_CCR2_H_SHIFT                            (16U)
#define PERI_TIM12_CCR2_BIT_CCR2_H_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR2_BIT_CCR2_H_SHIFT)

/*--- register CCR3 -------------------------------------------------*/
#define PERI_TIM12_CCR3_BIT_CCR3_L_SHIFT                            (0U)
#define PERI_TIM12_CCR3_BIT_CCR3_L_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR3_BIT_CCR3_L_SHIFT)
#define PERI_TIM12_CCR3_BIT_CCR3_H_SHIFT                            (16U)
#define PERI_TIM12_CCR3_BIT_CCR3_H_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR3_BIT_CCR3_H_SHIFT)

/*--- register CCR4 -------------------------------------------------*/
#define PERI_TIM12_CCR4_BIT_CCR4_L_SHIFT                            (0U)
#define PERI_TIM12_CCR4_BIT_CCR4_L_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR4_BIT_CCR4_L_SHIFT)
#define PERI_TIM12_CCR4_BIT_CCR4_H_SHIFT                            (16U)
#define PERI_TIM12_CCR4_BIT_CCR4_H_MASK                             (((1U<<16)-1) << PERI_TIM12_CCR4_BIT_CCR4_H_SHIFT)

/*--- register DCR -------------------------------------------------*/
#define PERI_TIM12_DCR_BIT_DBA_SHIFT                                (0U)
#define PERI_TIM12_DCR_BIT_DBA_MASK                                 (((1U<<5)-1) << PERI_TIM12_DCR_BIT_DBA_SHIFT)
#define PERI_TIM12_DCR_BIT_DBL_SHIFT                                (8U)
#define PERI_TIM12_DCR_BIT_DBL_MASK                                 (((1U<<5)-1) << PERI_TIM12_DCR_BIT_DBL_SHIFT)

/*--- register DMAR -------------------------------------------------*/
#define PERI_TIM12_DMAR_BIT_DMAB_SHIFT                              (0U)
#define PERI_TIM12_DMAR_BIT_DMAB_MASK                               (((1U<<16)-1) << PERI_TIM12_DMAR_BIT_DMAB_SHIFT)

/*--- register AF1 -------------------------------------------------*/
#define PERI_TIM12_AF1_BIT_ETRSEL_SHIFT                             (14U)
#define PERI_TIM12_AF1_BIT_ETRSEL_MASK                              (((1U<<4)-1) << PERI_TIM12_AF1_BIT_ETRSEL_SHIFT)

/*--- register TISEL -------------------------------------------------*/
#define PERI_TIM12_TISEL_BIT_TI1SEL_SHIFT                           (0U)
#define PERI_TIM12_TISEL_BIT_TI1SEL_MASK                            (((1U<<4)-1) << PERI_TIM12_TISEL_BIT_TI1SEL_SHIFT)
#define PERI_TIM12_TISEL_BIT_TI2SEL_SHIFT                           (8U)
#define PERI_TIM12_TISEL_BIT_TI2SEL_MASK                            (((1U<<4)-1) << PERI_TIM12_TISEL_BIT_TI2SEL_SHIFT)
#define PERI_TIM12_TISEL_BIT_TI3SEL_SHIFT                           (16U)
#define PERI_TIM12_TISEL_BIT_TI3SEL_MASK                            (((1U<<4)-1) << PERI_TIM12_TISEL_BIT_TI3SEL_SHIFT)
#define PERI_TIM12_TISEL_BIT_TI4SEL_SHIFT                           (24U)
#define PERI_TIM12_TISEL_BIT_TI4SEL_MASK                            (((1U<<4)-1) << PERI_TIM12_TISEL_BIT_TI4SEL_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_TIM13_CR1_BIT_CEN_SHIFT                                (0U)
#define PERI_TIM13_CR1_BIT_CEN_MASK                                 (((1U<<1)-1) << PERI_TIM13_CR1_BIT_CEN_SHIFT)
#define PERI_TIM13_CR1_BIT_UDIS_SHIFT                               (1U)
#define PERI_TIM13_CR1_BIT_UDIS_MASK                                (((1U<<1)-1) << PERI_TIM13_CR1_BIT_UDIS_SHIFT)
#define PERI_TIM13_CR1_BIT_URS_SHIFT                                (2U)
#define PERI_TIM13_CR1_BIT_URS_MASK                                 (((1U<<1)-1) << PERI_TIM13_CR1_BIT_URS_SHIFT)
#define PERI_TIM13_CR1_BIT_OPM_SHIFT                                (3U)
#define PERI_TIM13_CR1_BIT_OPM_MASK                                 (((1U<<1)-1) << PERI_TIM13_CR1_BIT_OPM_SHIFT)
#define PERI_TIM13_CR1_BIT_DIR_SHIFT                                (4U)
#define PERI_TIM13_CR1_BIT_DIR_MASK                                 (((1U<<1)-1) << PERI_TIM13_CR1_BIT_DIR_SHIFT)
#define PERI_TIM13_CR1_BIT_CMS_SHIFT                                (5U)
#define PERI_TIM13_CR1_BIT_CMS_MASK                                 (((1U<<2)-1) << PERI_TIM13_CR1_BIT_CMS_SHIFT)
#define PERI_TIM13_CR1_BIT_ARPE_SHIFT                               (7U)
#define PERI_TIM13_CR1_BIT_ARPE_MASK                                (((1U<<1)-1) << PERI_TIM13_CR1_BIT_ARPE_SHIFT)
#define PERI_TIM13_CR1_BIT_CKD_SHIFT                                (8U)
#define PERI_TIM13_CR1_BIT_CKD_MASK                                 (((1U<<2)-1) << PERI_TIM13_CR1_BIT_CKD_SHIFT)
#define PERI_TIM13_CR1_BIT_UIFREMAP_SHIFT                           (11U)
#define PERI_TIM13_CR1_BIT_UIFREMAP_MASK                            (((1U<<1)-1) << PERI_TIM13_CR1_BIT_UIFREMAP_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_TIM13_CR2_BIT_CCDS_SHIFT                               (3U)
#define PERI_TIM13_CR2_BIT_CCDS_MASK                                (((1U<<1)-1) << PERI_TIM13_CR2_BIT_CCDS_SHIFT)
#define PERI_TIM13_CR2_BIT_MMS_SHIFT                                (4U)
#define PERI_TIM13_CR2_BIT_MMS_MASK                                 (((1U<<3)-1) << PERI_TIM13_CR2_BIT_MMS_SHIFT)
#define PERI_TIM13_CR2_BIT_TI1S_SHIFT                               (7U)
#define PERI_TIM13_CR2_BIT_TI1S_MASK                                (((1U<<1)-1) << PERI_TIM13_CR2_BIT_TI1S_SHIFT)

/*--- register SMCR -------------------------------------------------*/
#define PERI_TIM13_SMCR_BIT_SMS_SHIFT                               (0U)
#define PERI_TIM13_SMCR_BIT_SMS_MASK                                (((1U<<3)-1) << PERI_TIM13_SMCR_BIT_SMS_SHIFT)
#define PERI_TIM13_SMCR_BIT_TS_SHIFT                                (4U)
#define PERI_TIM13_SMCR_BIT_TS_MASK                                 (((1U<<3)-1) << PERI_TIM13_SMCR_BIT_TS_SHIFT)
#define PERI_TIM13_SMCR_BIT_MSM_SHIFT                               (7U)
#define PERI_TIM13_SMCR_BIT_MSM_MASK                                (((1U<<1)-1) << PERI_TIM13_SMCR_BIT_MSM_SHIFT)
#define PERI_TIM13_SMCR_BIT_ETF_SHIFT                               (8U)
#define PERI_TIM13_SMCR_BIT_ETF_MASK                                (((1U<<4)-1) << PERI_TIM13_SMCR_BIT_ETF_SHIFT)
#define PERI_TIM13_SMCR_BIT_ETPS_SHIFT                              (12U)
#define PERI_TIM13_SMCR_BIT_ETPS_MASK                               (((1U<<2)-1) << PERI_TIM13_SMCR_BIT_ETPS_SHIFT)
#define PERI_TIM13_SMCR_BIT_ECE_SHIFT                               (14U)
#define PERI_TIM13_SMCR_BIT_ECE_MASK                                (((1U<<1)-1) << PERI_TIM13_SMCR_BIT_ECE_SHIFT)
#define PERI_TIM13_SMCR_BIT_ETP_SHIFT                               (15U)
#define PERI_TIM13_SMCR_BIT_ETP_MASK                                (((1U<<1)-1) << PERI_TIM13_SMCR_BIT_ETP_SHIFT)
#define PERI_TIM13_SMCR_BIT_SMS_3_SHIFT                             (16U)
#define PERI_TIM13_SMCR_BIT_SMS_3_MASK                              (((1U<<1)-1) << PERI_TIM13_SMCR_BIT_SMS_3_SHIFT)
#define PERI_TIM13_SMCR_BIT_TS_4_3_SHIFT                            (20U)
#define PERI_TIM13_SMCR_BIT_TS_4_3_MASK                             (((1U<<2)-1) << PERI_TIM13_SMCR_BIT_TS_4_3_SHIFT)

/*--- register DIER -------------------------------------------------*/
#define PERI_TIM13_DIER_BIT_UIE_SHIFT                               (0U)
#define PERI_TIM13_DIER_BIT_UIE_MASK                                (((1U<<1)-1) << PERI_TIM13_DIER_BIT_UIE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC1IE_SHIFT                             (1U)
#define PERI_TIM13_DIER_BIT_CC1IE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC1IE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC2IE_SHIFT                             (2U)
#define PERI_TIM13_DIER_BIT_CC2IE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC2IE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC3IE_SHIFT                             (3U)
#define PERI_TIM13_DIER_BIT_CC3IE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC3IE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC4IE_SHIFT                             (4U)
#define PERI_TIM13_DIER_BIT_CC4IE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC4IE_SHIFT)
#define PERI_TIM13_DIER_BIT_TIE_SHIFT                               (6U)
#define PERI_TIM13_DIER_BIT_TIE_MASK                                (((1U<<1)-1) << PERI_TIM13_DIER_BIT_TIE_SHIFT)
#define PERI_TIM13_DIER_BIT_UDE_SHIFT                               (8U)
#define PERI_TIM13_DIER_BIT_UDE_MASK                                (((1U<<1)-1) << PERI_TIM13_DIER_BIT_UDE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC1DE_SHIFT                             (9U)
#define PERI_TIM13_DIER_BIT_CC1DE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC1DE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC2DE_SHIFT                             (10U)
#define PERI_TIM13_DIER_BIT_CC2DE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC2DE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC3DE_SHIFT                             (11U)
#define PERI_TIM13_DIER_BIT_CC3DE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC3DE_SHIFT)
#define PERI_TIM13_DIER_BIT_CC4DE_SHIFT                             (12U)
#define PERI_TIM13_DIER_BIT_CC4DE_MASK                              (((1U<<1)-1) << PERI_TIM13_DIER_BIT_CC4DE_SHIFT)
#define PERI_TIM13_DIER_BIT_TDE_SHIFT                               (14U)
#define PERI_TIM13_DIER_BIT_TDE_MASK                                (((1U<<1)-1) << PERI_TIM13_DIER_BIT_TDE_SHIFT)

