minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RCR -------------------------------------------------*/
#define PERI_TIM15_RCR_BIT_REP_SHIFT                                (0U)
#define PERI_TIM15_RCR_BIT_REP_MASK                                 (((1U<<8)-1) << PERI_TIM15_RCR_BIT_REP_SHIFT)

/*--- register CCR1 -------------------------------------------------*/
#define PERI_TIM15_CCR1_BIT_CCR1_SHIFT                              (0U)
#define PERI_TIM15_CCR1_BIT_CCR1_MASK                               (((1U<<16)-1) << PERI_TIM15_CCR1_BIT_CCR1_SHIFT)

/*--- register CCR2 -------------------------------------------------*/
#define PERI_TIM15_CCR2_BIT_CCR2_SHIFT                              (0U)
#define PERI_TIM15_CCR2_BIT_CCR2_MASK                               (((1U<<16)-1) << PERI_TIM15_CCR2_BIT_CCR2_SHIFT)

/*--- register BDTR -------------------------------------------------*/
#define PERI_TIM15_BDTR_BIT_DTG_SHIFT                               (0U)
#define PERI_TIM15_BDTR_BIT_DTG_MASK                                (((1U<<8)-1) << PERI_TIM15_BDTR_BIT_DTG_SHIFT)
#define PERI_TIM15_BDTR_BIT_LOCK_SHIFT                              (8U)
#define PERI_TIM15_BDTR_BIT_LOCK_MASK                               (((1U<<2)-1) << PERI_TIM15_BDTR_BIT_LOCK_SHIFT)
#define PERI_TIM15_BDTR_BIT_OSSI_SHIFT                              (10U)
#define PERI_TIM15_BDTR_BIT_OSSI_MASK                               (((1U<<1)-1) << PERI_TIM15_BDTR_BIT_OSSI_SHIFT)
#define PERI_TIM15_BDTR_BIT_OSSR_SHIFT                              (11U)
#define PERI_TIM15_BDTR_BIT_OSSR_MASK                               (((1U<<1)-1) << PERI_TIM15_BDTR_BIT_OSSR_SHIFT)
#define PERI_TIM15_BDTR_BIT_BKE_SHIFT                               (12U)
#define PERI_TIM15_BDTR_BIT_BKE_MASK                                (((1U<<1)-1) << PERI_TIM15_BDTR_BIT_BKE_SHIFT)
#define PERI_TIM15_BDTR_BIT_BKP_SHIFT                               (13U)
#define PERI_TIM15_BDTR_BIT_BKP_MASK                                (((1U<<1)-1) << PERI_TIM15_BDTR_BIT_BKP_SHIFT)
#define PERI_TIM15_BDTR_BIT_AOE_SHIFT                               (14U)
#define PERI_TIM15_BDTR_BIT_AOE_MASK                                (((1U<<1)-1) << PERI_TIM15_BDTR_BIT_AOE_SHIFT)
#define PERI_TIM15_BDTR_BIT_MOE_SHIFT                               (15U)
#define PERI_TIM15_BDTR_BIT_MOE_MASK                                (((1U<<1)-1) << PERI_TIM15_BDTR_BIT_MOE_SHIFT)
#define PERI_TIM15_BDTR_BIT_BKF_SHIFT                               (16U)
#define PERI_TIM15_BDTR_BIT_BKF_MASK                                (((1U<<4)-1) << PERI_TIM15_BDTR_BIT_BKF_SHIFT)

/*--- register DCR -------------------------------------------------*/
#define PERI_TIM15_DCR_BIT_DBA_SHIFT                                (0U)
#define PERI_TIM15_DCR_BIT_DBA_MASK                                 (((1U<<5)-1) << PERI_TIM15_DCR_BIT_DBA_SHIFT)
#define PERI_TIM15_DCR_BIT_DBL_SHIFT                                (8U)
#define PERI_TIM15_DCR_BIT_DBL_MASK                                 (((1U<<5)-1) << PERI_TIM15_DCR_BIT_DBL_SHIFT)

/*--- register DMAR -------------------------------------------------*/
#define PERI_TIM15_DMAR_BIT_DMAB_SHIFT                              (0U)
#define PERI_TIM15_DMAR_BIT_DMAB_MASK                               (((1U<<16)-1) << PERI_TIM15_DMAR_BIT_DMAB_SHIFT)

/*--- register AF1 -------------------------------------------------*/
#define PERI_TIM15_AF1_BIT_BKINE_SHIFT                              (0U)
#define PERI_TIM15_AF1_BIT_BKINE_MASK                               (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKINE_SHIFT)
#define PERI_TIM15_AF1_BIT_BKCMP1E_SHIFT                            (1U)
#define PERI_TIM15_AF1_BIT_BKCMP1E_MASK                             (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKCMP1E_SHIFT)
#define PERI_TIM15_AF1_BIT_BKCMP2E_SHIFT                            (2U)
#define PERI_TIM15_AF1_BIT_BKCMP2E_MASK                             (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKCMP2E_SHIFT)
#define PERI_TIM15_AF1_BIT_BKDF1BK0E_SHIFT                          (8U)
#define PERI_TIM15_AF1_BIT_BKDF1BK0E_MASK                           (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKDF1BK0E_SHIFT)
#define PERI_TIM15_AF1_BIT_BKINP_SHIFT                              (9U)
#define PERI_TIM15_AF1_BIT_BKINP_MASK                               (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKINP_SHIFT)
#define PERI_TIM15_AF1_BIT_BKCMP1P_SHIFT                            (10U)
#define PERI_TIM15_AF1_BIT_BKCMP1P_MASK                             (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKCMP1P_SHIFT)
#define PERI_TIM15_AF1_BIT_BKCMP2P_SHIFT                            (11U)
#define PERI_TIM15_AF1_BIT_BKCMP2P_MASK                             (((1U<<1)-1) << PERI_TIM15_AF1_BIT_BKCMP2P_SHIFT)

/*--- register TISEL -------------------------------------------------*/
#define PERI_TIM15_TISEL_BIT_TI1SEL_SHIFT                           (0U)
#define PERI_TIM15_TISEL_BIT_TI1SEL_MASK                            (((1U<<4)-1) << PERI_TIM15_TISEL_BIT_TI1SEL_SHIFT)
#define PERI_TIM15_TISEL_BIT_TI2SEL_SHIFT                           (8U)
#define PERI_TIM15_TISEL_BIT_TI2SEL_MASK                            (((1U<<4)-1) << PERI_TIM15_TISEL_BIT_TI2SEL_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_TIM16_CR1_BIT_CEN_SHIFT                                (0U)
#define PERI_TIM16_CR1_BIT_CEN_MASK                                 (((1U<<1)-1) << PERI_TIM16_CR1_BIT_CEN_SHIFT)
#define PERI_TIM16_CR1_BIT_UDIS_SHIFT                               (1U)
#define PERI_TIM16_CR1_BIT_UDIS_MASK                                (((1U<<1)-1) << PERI_TIM16_CR1_BIT_UDIS_SHIFT)
#define PERI_TIM16_CR1_BIT_URS_SHIFT                                (2U)
#define PERI_TIM16_CR1_BIT_URS_MASK                                 (((1U<<1)-1) << PERI_TIM16_CR1_BIT_URS_SHIFT)
#define PERI_TIM16_CR1_BIT_OPM_SHIFT                                (3U)
#define PERI_TIM16_CR1_BIT_OPM_MASK                                 (((1U<<1)-1) << PERI_TIM16_CR1_BIT_OPM_SHIFT)
#define PERI_TIM16_CR1_BIT_ARPE_SHIFT                               (7U)
#define PERI_TIM16_CR1_BIT_ARPE_MASK                                (((1U<<1)-1) << PERI_TIM16_CR1_BIT_ARPE_SHIFT)
#define PERI_TIM16_CR1_BIT_CKD_SHIFT                                (8U)
#define PERI_TIM16_CR1_BIT_CKD_MASK                                 (((1U<<2)-1) << PERI_TIM16_CR1_BIT_CKD_SHIFT)
#define PERI_TIM16_CR1_BIT_UIFREMAP_SHIFT                           (11U)
#define PERI_TIM16_CR1_BIT_UIFREMAP_MASK                            (((1U<<1)-1) << PERI_TIM16_CR1_BIT_UIFREMAP_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_TIM16_CR2_BIT_CCPC_SHIFT                               (0U)
#define PERI_TIM16_CR2_BIT_CCPC_MASK                                (((1U<<1)-1) << PERI_TIM16_CR2_BIT_CCPC_SHIFT)
#define PERI_TIM16_CR2_BIT_CCUS_SHIFT                               (2U)
#define PERI_TIM16_CR2_BIT_CCUS_MASK                                (((1U<<1)-1) << PERI_TIM16_CR2_BIT_CCUS_SHIFT)
#define PERI_TIM16_CR2_BIT_CCDS_SHIFT                               (3U)
#define PERI_TIM16_CR2_BIT_CCDS_MASK                                (((1U<<1)-1) << PERI_TIM16_CR2_BIT_CCDS_SHIFT)
#define PERI_TIM16_CR2_BIT_OIS1_SHIFT                               (8U)
#define PERI_TIM16_CR2_BIT_OIS1_MASK                                (((1U<<1)-1) << PERI_TIM16_CR2_BIT_OIS1_SHIFT)
#define PERI_TIM16_CR2_BIT_OIS1N_SHIFT                              (9U)
#define PERI_TIM16_CR2_BIT_OIS1N_MASK                               (((1U<<1)-1) << PERI_TIM16_CR2_BIT_OIS1N_SHIFT)

/*--- register DIER -------------------------------------------------*/
#define PERI_TIM16_DIER_BIT_UIE_SHIFT                               (0U)
#define PERI_TIM16_DIER_BIT_UIE_MASK                                (((1U<<1)-1) << PERI_TIM16_DIER_BIT_UIE_SHIFT)
#define PERI_TIM16_DIER_BIT_CC1IE_SHIFT                             (1U)
#define PERI_TIM16_DIER_BIT_CC1IE_MASK                              (((1U<<1)-1) << PERI_TIM16_DIER_BIT_CC1IE_SHIFT)
#define PERI_TIM16_DIER_BIT_COMIE_SHIFT                             (5U)
#define PERI_TIM16_DIER_BIT_COMIE_MASK                              (((1U<<1)-1) << PERI_TIM16_DIER_BIT_COMIE_SHIFT)
#define PERI_TIM16_DIER_BIT_BIE_SHIFT                               (7U)
#define PERI_TIM16_DIER_BIT_BIE_MASK                                (((1U<<1)-1) << PERI_TIM16_DIER_BIT_BIE_SHIFT)
#define PERI_TIM16_DIER_BIT_UDE_SHIFT                               (8U)
#define PERI_TIM16_DIER_BIT_UDE_MASK                                (((1U<<1)-1) << PERI_TIM16_DIER_BIT_UDE_SHIFT)
#define PERI_TIM16_DIER_BIT_CC1DE_SHIFT                             (9U)
#define PERI_TIM16_DIER_BIT_CC1DE_MASK                              (((1U<<1)-1) << PERI_TIM16_DIER_BIT_CC1DE_SHIFT)
#define PERI_TIM16_DIER_BIT_COMDE_SHIFT                             (13U)
#define PERI_TIM16_DIER_BIT_COMDE_MASK                              (((1U<<1)-1) << PERI_TIM16_DIER_BIT_COMDE_SHIFT)

