minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_TIM16_SR_BIT_UIF_SHIFT                                 (0U)
#define PERI_TIM16_SR_BIT_UIF_MASK                                  (((1U<<1)-1) << PERI_TIM16_SR_BIT_UIF_SHIFT)
#define PERI_TIM16_SR_BIT_CC1IF_SHIFT                               (1U)
#define PERI_TIM16_SR_BIT_CC1IF_MASK                                (((1U<<1)-1) << PERI_TIM16_SR_BIT_CC1IF_SHIFT)
#define PERI_TIM16_SR_BIT_COMIF_SHIFT                               (5U)
#define PERI_TIM16_SR_BIT_COMIF_MASK                                (((1U<<1)-1) << PERI_TIM16_SR_BIT_COMIF_SHIFT)
#define PERI_TIM16_SR_BIT_BIF_SHIFT                                 (7U)
#define PERI_TIM16_SR_BIT_BIF_MASK                                  (((1U<<1)-1) << PERI_TIM16_SR_BIT_BIF_SHIFT)
#define PERI_TIM16_SR_BIT_CC1OF_SHIFT                               (9U)
#define PERI_TIM16_SR_BIT_CC1OF_MASK                                (((1U<<1)-1) << PERI_TIM16_SR_BIT_CC1OF_SHIFT)

/*--- register EGR -------------------------------------------------*/
#define PERI_TIM16_EGR_BIT_UG_SHIFT                                 (0U)
#define PERI_TIM16_EGR_BIT_UG_MASK                                  (((1U<<1)-1) << PERI_TIM16_EGR_BIT_UG_SHIFT)
#define PERI_TIM16_EGR_BIT_CC1G_SHIFT                               (1U)
#define PERI_TIM16_EGR_BIT_CC1G_MASK                                (((1U<<1)-1) << PERI_TIM16_EGR_BIT_CC1G_SHIFT)
#define PERI_TIM16_EGR_BIT_COMG_SHIFT                               (5U)
#define PERI_TIM16_EGR_BIT_COMG_MASK                                (((1U<<1)-1) << PERI_TIM16_EGR_BIT_COMG_SHIFT)
#define PERI_TIM16_EGR_BIT_BG_SHIFT                                 (7U)
#define PERI_TIM16_EGR_BIT_BG_MASK                                  (((1U<<1)-1) << PERI_TIM16_EGR_BIT_BG_SHIFT)

/*--- register CCMR1_Output -------------------------------------------------*/
#define PERI_TIM16_CCMR1_OUTPUT_BIT_CC1S_SHIFT                      (0U)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_CC1S_MASK                       (((1U<<2)-1) << PERI_TIM16_CCMR1_OUTPUT_BIT_CC1S_SHIFT)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1FE_SHIFT                     (2U)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1FE_MASK                      (((1U<<1)-1) << PERI_TIM16_CCMR1_OUTPUT_BIT_OC1FE_SHIFT)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1PE_SHIFT                     (3U)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1PE_MASK                      (((1U<<1)-1) << PERI_TIM16_CCMR1_OUTPUT_BIT_OC1PE_SHIFT)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1M_SHIFT                      (4U)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1M_MASK                       (((1U<<3)-1) << PERI_TIM16_CCMR1_OUTPUT_BIT_OC1M_SHIFT)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1M_3_SHIFT                    (16U)
#define PERI_TIM16_CCMR1_OUTPUT_BIT_OC1M_3_MASK                     (((1U<<1)-1) << PERI_TIM16_CCMR1_OUTPUT_BIT_OC1M_3_SHIFT)

/*--- register CCMR1_Input -------------------------------------------------*/
#define PERI_TIM16_CCMR1_INPUT_BIT_CC1S_SHIFT                       (0U)
#define PERI_TIM16_CCMR1_INPUT_BIT_CC1S_MASK                        (((1U<<2)-1) << PERI_TIM16_CCMR1_INPUT_BIT_CC1S_SHIFT)
#define PERI_TIM16_CCMR1_INPUT_BIT_IC1PSC_SHIFT                     (2U)
#define PERI_TIM16_CCMR1_INPUT_BIT_IC1PSC_MASK                      (((1U<<2)-1) << PERI_TIM16_CCMR1_INPUT_BIT_IC1PSC_SHIFT)
#define PERI_TIM16_CCMR1_INPUT_BIT_IC1F_SHIFT                       (4U)
#define PERI_TIM16_CCMR1_INPUT_BIT_IC1F_MASK                        (((1U<<4)-1) << PERI_TIM16_CCMR1_INPUT_BIT_IC1F_SHIFT)

/*--- register CCER -------------------------------------------------*/
#define PERI_TIM16_CCER_BIT_CC1E_SHIFT                              (0U)
#define PERI_TIM16_CCER_BIT_CC1E_MASK                               (((1U<<1)-1) << PERI_TIM16_CCER_BIT_CC1E_SHIFT)
#define PERI_TIM16_CCER_BIT_CC1P_SHIFT                              (1U)
#define PERI_TIM16_CCER_BIT_CC1P_MASK                               (((1U<<1)-1) << PERI_TIM16_CCER_BIT_CC1P_SHIFT)
#define PERI_TIM16_CCER_BIT_CC1NE_SHIFT                             (2U)
#define PERI_TIM16_CCER_BIT_CC1NE_MASK                              (((1U<<1)-1) << PERI_TIM16_CCER_BIT_CC1NE_SHIFT)
#define PERI_TIM16_CCER_BIT_CC1NP_SHIFT                             (3U)
#define PERI_TIM16_CCER_BIT_CC1NP_MASK                              (((1U<<1)-1) << PERI_TIM16_CCER_BIT_CC1NP_SHIFT)

/*--- register CNT -------------------------------------------------*/
#define PERI_TIM16_CNT_BIT_CNT_SHIFT                                (0U)
#define PERI_TIM16_CNT_BIT_CNT_MASK                                 (((1U<<16)-1) << PERI_TIM16_CNT_BIT_CNT_SHIFT)
#define PERI_TIM16_CNT_BIT_UIFCPY_SHIFT                             (31U)
#define PERI_TIM16_CNT_BIT_UIFCPY_MASK                              (((1U<<1)-1) << PERI_TIM16_CNT_BIT_UIFCPY_SHIFT)

/*--- register PSC -------------------------------------------------*/
#define PERI_TIM16_PSC_BIT_PSC_SHIFT                                (0U)
#define PERI_TIM16_PSC_BIT_PSC_MASK                                 (((1U<<16)-1) << PERI_TIM16_PSC_BIT_PSC_SHIFT)

/*--- register ARR -------------------------------------------------*/
#define PERI_TIM16_ARR_BIT_ARR_SHIFT                                (0U)
#define PERI_TIM16_ARR_BIT_ARR_MASK                                 (((1U<<16)-1) << PERI_TIM16_ARR_BIT_ARR_SHIFT)

/*--- register RCR -------------------------------------------------*/
#define PERI_TIM16_RCR_BIT_REP_SHIFT                                (0U)
#define PERI_TIM16_RCR_BIT_REP_MASK                                 (((1U<<8)-1) << PERI_TIM16_RCR_BIT_REP_SHIFT)

/*--- register CCR1 -------------------------------------------------*/
#define PERI_TIM16_CCR1_BIT_CCR1_SHIFT                              (0U)
#define PERI_TIM16_CCR1_BIT_CCR1_MASK                               (((1U<<16)-1) << PERI_TIM16_CCR1_BIT_CCR1_SHIFT)

/*--- register BDTR -------------------------------------------------*/
#define PERI_TIM16_BDTR_BIT_DTG_SHIFT                               (0U)
#define PERI_TIM16_BDTR_BIT_DTG_MASK                                (((1U<<8)-1) << PERI_TIM16_BDTR_BIT_DTG_SHIFT)
#define PERI_TIM16_BDTR_BIT_LOCK_SHIFT                              (8U)
#define PERI_TIM16_BDTR_BIT_LOCK_MASK                               (((1U<<2)-1) << PERI_TIM16_BDTR_BIT_LOCK_SHIFT)
#define PERI_TIM16_BDTR_BIT_OSSI_SHIFT                              (10U)
#define PERI_TIM16_BDTR_BIT_OSSI_MASK                               (((1U<<1)-1) << PERI_TIM16_BDTR_BIT_OSSI_SHIFT)
#define PERI_TIM16_BDTR_BIT_OSSR_SHIFT                              (11U)
#define PERI_TIM16_BDTR_BIT_OSSR_MASK                               (((1U<<1)-1) << PERI_TIM16_BDTR_BIT_OSSR_SHIFT)
#define PERI_TIM16_BDTR_BIT_BKE_SHIFT                               (12U)
#define PERI_TIM16_BDTR_BIT_BKE_MASK                                (((1U<<1)-1) << PERI_TIM16_BDTR_BIT_BKE_SHIFT)
#define PERI_TIM16_BDTR_BIT_BKP_SHIFT                               (13U)
#define PERI_TIM16_BDTR_BIT_BKP_MASK                                (((1U<<1)-1) << PERI_TIM16_BDTR_BIT_BKP_SHIFT)
#define PERI_TIM16_BDTR_BIT_AOE_SHIFT                               (14U)
#define PERI_TIM16_BDTR_BIT_AOE_MASK                                (((1U<<1)-1) << PERI_TIM16_BDTR_BIT_AOE_SHIFT)
#define PERI_TIM16_BDTR_BIT_MOE_SHIFT                               (15U)
#define PERI_TIM16_BDTR_BIT_MOE_MASK                                (((1U<<1)-1) << PERI_TIM16_BDTR_BIT_MOE_SHIFT)
#define PERI_TIM16_BDTR_BIT_BKF_SHIFT                               (16U)
#define PERI_TIM16_BDTR_BIT_BKF_MASK                                (((1U<<4)-1) << PERI_TIM16_BDTR_BIT_BKF_SHIFT)

/*--- register DCR -------------------------------------------------*/
#define PERI_TIM16_DCR_BIT_DBA_SHIFT                                (0U)
#define PERI_TIM16_DCR_BIT_DBA_MASK                                 (((1U<<5)-1) << PERI_TIM16_DCR_BIT_DBA_SHIFT)
#define PERI_TIM16_DCR_BIT_DBL_SHIFT                                (8U)
#define PERI_TIM16_DCR_BIT_DBL_MASK                                 (((1U<<5)-1) << PERI_TIM16_DCR_BIT_DBL_SHIFT)

/*--- register DMAR -------------------------------------------------*/
#define PERI_TIM16_DMAR_BIT_DMAB_SHIFT                              (0U)
#define PERI_TIM16_DMAR_BIT_DMAB_MASK                               (((1U<<16)-1) << PERI_TIM16_DMAR_BIT_DMAB_SHIFT)

/*--- register TIM16_AF1 -------------------------------------------------*/
#define PERI_TIM16_TIM16_AF1_BIT_BKINE_SHIFT                        (0U)
#define PERI_TIM16_TIM16_AF1_BIT_BKINE_MASK                         (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKINE_SHIFT)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP1E_SHIFT                      (1U)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP1E_MASK                       (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKCMP1E_SHIFT)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP2E_SHIFT                      (2U)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP2E_MASK                       (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKCMP2E_SHIFT)
#define PERI_TIM16_TIM16_AF1_BIT_BKDFBK1E_SHIFT                     (8U)
#define PERI_TIM16_TIM16_AF1_BIT_BKDFBK1E_MASK                      (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKDFBK1E_SHIFT)
#define PERI_TIM16_TIM16_AF1_BIT_BKINP_SHIFT                        (9U)
#define PERI_TIM16_TIM16_AF1_BIT_BKINP_MASK                         (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKINP_SHIFT)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP1P_SHIFT                      (10U)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP1P_MASK                       (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKCMP1P_SHIFT)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP2P_SHIFT                      (11U)
#define PERI_TIM16_TIM16_AF1_BIT_BKCMP2P_MASK                       (((1U<<1)-1) << PERI_TIM16_TIM16_AF1_BIT_BKCMP2P_SHIFT)

/*--- register TIM16_TISEL -------------------------------------------------*/
#define PERI_TIM16_TIM16_TISEL_BIT_TI1SEL_SHIFT                     (0U)
#define PERI_TIM16_TIM16_TISEL_BIT_TI1SEL_MASK                      (((1U<<4)-1) << PERI_TIM16_TIM16_TISEL_BIT_TI1SEL_SHIFT)

