minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR1 -------------------------------------------------*/
#define PERI_TIM17_CR1_BIT_CEN_SHIFT                                (0U)
#define PERI_TIM17_CR1_BIT_CEN_MASK                                 (((1U<<1)-1) << PERI_TIM17_CR1_BIT_CEN_SHIFT)
#define PERI_TIM17_CR1_BIT_UDIS_SHIFT                               (1U)
#define PERI_TIM17_CR1_BIT_UDIS_MASK                                (((1U<<1)-1) << PERI_TIM17_CR1_BIT_UDIS_SHIFT)
#define PERI_TIM17_CR1_BIT_URS_SHIFT                                (2U)
#define PERI_TIM17_CR1_BIT_URS_MASK                                 (((1U<<1)-1) << PERI_TIM17_CR1_BIT_URS_SHIFT)
#define PERI_TIM17_CR1_BIT_OPM_SHIFT                                (3U)
#define PERI_TIM17_CR1_BIT_OPM_MASK                                 (((1U<<1)-1) << PERI_TIM17_CR1_BIT_OPM_SHIFT)
#define PERI_TIM17_CR1_BIT_ARPE_SHIFT                               (7U)
#define PERI_TIM17_CR1_BIT_ARPE_MASK                                (((1U<<1)-1) << PERI_TIM17_CR1_BIT_ARPE_SHIFT)
#define PERI_TIM17_CR1_BIT_CKD_SHIFT                                (8U)
#define PERI_TIM17_CR1_BIT_CKD_MASK                                 (((1U<<2)-1) << PERI_TIM17_CR1_BIT_CKD_SHIFT)
#define PERI_TIM17_CR1_BIT_UIFREMAP_SHIFT                           (11U)
#define PERI_TIM17_CR1_BIT_UIFREMAP_MASK                            (((1U<<1)-1) << PERI_TIM17_CR1_BIT_UIFREMAP_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_TIM17_CR2_BIT_CCPC_SHIFT                               (0U)
#define PERI_TIM17_CR2_BIT_CCPC_MASK                                (((1U<<1)-1) << PERI_TIM17_CR2_BIT_CCPC_SHIFT)
#define PERI_TIM17_CR2_BIT_CCUS_SHIFT                               (2U)
#define PERI_TIM17_CR2_BIT_CCUS_MASK                                (((1U<<1)-1) << PERI_TIM17_CR2_BIT_CCUS_SHIFT)
#define PERI_TIM17_CR2_BIT_CCDS_SHIFT                               (3U)
#define PERI_TIM17_CR2_BIT_CCDS_MASK                                (((1U<<1)-1) << PERI_TIM17_CR2_BIT_CCDS_SHIFT)
#define PERI_TIM17_CR2_BIT_OIS1_SHIFT                               (8U)
#define PERI_TIM17_CR2_BIT_OIS1_MASK                                (((1U<<1)-1) << PERI_TIM17_CR2_BIT_OIS1_SHIFT)
#define PERI_TIM17_CR2_BIT_OIS1N_SHIFT                              (9U)
#define PERI_TIM17_CR2_BIT_OIS1N_MASK                               (((1U<<1)-1) << PERI_TIM17_CR2_BIT_OIS1N_SHIFT)

/*--- register DIER -------------------------------------------------*/
#define PERI_TIM17_DIER_BIT_UIE_SHIFT                               (0U)
#define PERI_TIM17_DIER_BIT_UIE_MASK                                (((1U<<1)-1) << PERI_TIM17_DIER_BIT_UIE_SHIFT)
#define PERI_TIM17_DIER_BIT_CC1IE_SHIFT                             (1U)
#define PERI_TIM17_DIER_BIT_CC1IE_MASK                              (((1U<<1)-1) << PERI_TIM17_DIER_BIT_CC1IE_SHIFT)
#define PERI_TIM17_DIER_BIT_COMIE_SHIFT                             (5U)
#define PERI_TIM17_DIER_BIT_COMIE_MASK                              (((1U<<1)-1) << PERI_TIM17_DIER_BIT_COMIE_SHIFT)
#define PERI_TIM17_DIER_BIT_BIE_SHIFT                               (7U)
#define PERI_TIM17_DIER_BIT_BIE_MASK                                (((1U<<1)-1) << PERI_TIM17_DIER_BIT_BIE_SHIFT)
#define PERI_TIM17_DIER_BIT_UDE_SHIFT                               (8U)
#define PERI_TIM17_DIER_BIT_UDE_MASK                                (((1U<<1)-1) << PERI_TIM17_DIER_BIT_UDE_SHIFT)
#define PERI_TIM17_DIER_BIT_CC1DE_SHIFT                             (9U)
#define PERI_TIM17_DIER_BIT_CC1DE_MASK                              (((1U<<1)-1) << PERI_TIM17_DIER_BIT_CC1DE_SHIFT)
#define PERI_TIM17_DIER_BIT_COMDE_SHIFT                             (13U)
#define PERI_TIM17_DIER_BIT_COMDE_MASK                              (((1U<<1)-1) << PERI_TIM17_DIER_BIT_COMDE_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_TIM17_SR_BIT_UIF_SHIFT                                 (0U)
#define PERI_TIM17_SR_BIT_UIF_MASK                                  (((1U<<1)-1) << PERI_TIM17_SR_BIT_UIF_SHIFT)
#define PERI_TIM17_SR_BIT_CC1IF_SHIFT                               (1U)
#define PERI_TIM17_SR_BIT_CC1IF_MASK                                (((1U<<1)-1) << PERI_TIM17_SR_BIT_CC1IF_SHIFT)
#define PERI_TIM17_SR_BIT_COMIF_SHIFT                               (5U)
#define PERI_TIM17_SR_BIT_COMIF_MASK                                (((1U<<1)-1) << PERI_TIM17_SR_BIT_COMIF_SHIFT)
#define PERI_TIM17_SR_BIT_BIF_SHIFT                                 (7U)
#define PERI_TIM17_SR_BIT_BIF_MASK                                  (((1U<<1)-1) << PERI_TIM17_SR_BIT_BIF_SHIFT)
#define PERI_TIM17_SR_BIT_CC1OF_SHIFT                               (9U)
#define PERI_TIM17_SR_BIT_CC1OF_MASK                                (((1U<<1)-1) << PERI_TIM17_SR_BIT_CC1OF_SHIFT)

/*--- register EGR -------------------------------------------------*/
#define PERI_TIM17_EGR_BIT_UG_SHIFT                                 (0U)
#define PERI_TIM17_EGR_BIT_UG_MASK                                  (((1U<<1)-1) << PERI_TIM17_EGR_BIT_UG_SHIFT)
#define PERI_TIM17_EGR_BIT_CC1G_SHIFT                               (1U)
#define PERI_TIM17_EGR_BIT_CC1G_MASK                                (((1U<<1)-1) << PERI_TIM17_EGR_BIT_CC1G_SHIFT)
#define PERI_TIM17_EGR_BIT_COMG_SHIFT                               (5U)
#define PERI_TIM17_EGR_BIT_COMG_MASK                                (((1U<<1)-1) << PERI_TIM17_EGR_BIT_COMG_SHIFT)
#define PERI_TIM17_EGR_BIT_BG_SHIFT                                 (7U)
#define PERI_TIM17_EGR_BIT_BG_MASK                                  (((1U<<1)-1) << PERI_TIM17_EGR_BIT_BG_SHIFT)

/*--- register CCMR1_Output -------------------------------------------------*/
#define PERI_TIM17_CCMR1_OUTPUT_BIT_CC1S_SHIFT                      (0U)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_CC1S_MASK                       (((1U<<2)-1) << PERI_TIM17_CCMR1_OUTPUT_BIT_CC1S_SHIFT)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1FE_SHIFT                     (2U)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1FE_MASK                      (((1U<<1)-1) << PERI_TIM17_CCMR1_OUTPUT_BIT_OC1FE_SHIFT)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1PE_SHIFT                     (3U)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1PE_MASK                      (((1U<<1)-1) << PERI_TIM17_CCMR1_OUTPUT_BIT_OC1PE_SHIFT)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1M_SHIFT                      (4U)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1M_MASK                       (((1U<<3)-1) << PERI_TIM17_CCMR1_OUTPUT_BIT_OC1M_SHIFT)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1M_3_SHIFT                    (16U)
#define PERI_TIM17_CCMR1_OUTPUT_BIT_OC1M_3_MASK                     (((1U<<1)-1) << PERI_TIM17_CCMR1_OUTPUT_BIT_OC1M_3_SHIFT)

/*--- register CCMR1_Input -------------------------------------------------*/
#define PERI_TIM17_CCMR1_INPUT_BIT_CC1S_SHIFT                       (0U)
#define PERI_TIM17_CCMR1_INPUT_BIT_CC1S_MASK                        (((1U<<2)-1) << PERI_TIM17_CCMR1_INPUT_BIT_CC1S_SHIFT)
#define PERI_TIM17_CCMR1_INPUT_BIT_IC1PSC_SHIFT                     (2U)
#define PERI_TIM17_CCMR1_INPUT_BIT_IC1PSC_MASK                      (((1U<<2)-1) << PERI_TIM17_CCMR1_INPUT_BIT_IC1PSC_SHIFT)
#define PERI_TIM17_CCMR1_INPUT_BIT_IC1F_SHIFT                       (4U)
#define PERI_TIM17_CCMR1_INPUT_BIT_IC1F_MASK                        (((1U<<4)-1) << PERI_TIM17_CCMR1_INPUT_BIT_IC1F_SHIFT)

/*--- register CCER -------------------------------------------------*/
#define PERI_TIM17_CCER_BIT_CC1E_SHIFT                              (0U)
#define PERI_TIM17_CCER_BIT_CC1E_MASK                               (((1U<<1)-1) << PERI_TIM17_CCER_BIT_CC1E_SHIFT)
#define PERI_TIM17_CCER_BIT_CC1P_SHIFT                              (1U)
#define PERI_TIM17_CCER_BIT_CC1P_MASK                               (((1U<<1)-1) << PERI_TIM17_CCER_BIT_CC1P_SHIFT)
#define PERI_TIM17_CCER_BIT_CC1NE_SHIFT                             (2U)
#define PERI_TIM17_CCER_BIT_CC1NE_MASK                              (((1U<<1)-1) << PERI_TIM17_CCER_BIT_CC1NE_SHIFT)
#define PERI_TIM17_CCER_BIT_CC1NP_SHIFT                             (3U)
#define PERI_TIM17_CCER_BIT_CC1NP_MASK                              (((1U<<1)-1) << PERI_TIM17_CCER_BIT_CC1NP_SHIFT)

/*--- register CNT -------------------------------------------------*/
#define PERI_TIM17_CNT_BIT_CNT_SHIFT                                (0U)
#define PERI_TIM17_CNT_BIT_CNT_MASK                                 (((1U<<16)-1) << PERI_TIM17_CNT_BIT_CNT_SHIFT)
#define PERI_TIM17_CNT_BIT_UIFCPY_SHIFT                             (31U)
#define PERI_TIM17_CNT_BIT_UIFCPY_MASK                              (((1U<<1)-1) << PERI_TIM17_CNT_BIT_UIFCPY_SHIFT)

/*--- register PSC -------------------------------------------------*/
#define PERI_TIM17_PSC_BIT_PSC_SHIFT                                (0U)
#define PERI_TIM17_PSC_BIT_PSC_MASK                                 (((1U<<16)-1) << PERI_TIM17_PSC_BIT_PSC_SHIFT)

/*--- register ARR -------------------------------------------------*/
#define PERI_TIM17_ARR_BIT_ARR_SHIFT                                (0U)
#define PERI_TIM17_ARR_BIT_ARR_MASK                                 (((1U<<16)-1) << PERI_TIM17_ARR_BIT_ARR_SHIFT)

