minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CCR1 -------------------------------------------------*/
#define PERI_TIM5_CCR1_BIT_CCR1_L_SHIFT                             (0U)
#define PERI_TIM5_CCR1_BIT_CCR1_L_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR1_BIT_CCR1_L_SHIFT)
#define PERI_TIM5_CCR1_BIT_CCR1_H_SHIFT                             (16U)
#define PERI_TIM5_CCR1_BIT_CCR1_H_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR1_BIT_CCR1_H_SHIFT)

/*--- register CCR2 -------------------------------------------------*/
#define PERI_TIM5_CCR2_BIT_CCR2_L_SHIFT                             (0U)
#define PERI_TIM5_CCR2_BIT_CCR2_L_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR2_BIT_CCR2_L_SHIFT)
#define PERI_TIM5_CCR2_BIT_CCR2_H_SHIFT                             (16U)
#define PERI_TIM5_CCR2_BIT_CCR2_H_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR2_BIT_CCR2_H_SHIFT)

/*--- register CCR3 -------------------------------------------------*/
#define PERI_TIM5_CCR3_BIT_CCR3_L_SHIFT                             (0U)
#define PERI_TIM5_CCR3_BIT_CCR3_L_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR3_BIT_CCR3_L_SHIFT)
#define PERI_TIM5_CCR3_BIT_CCR3_H_SHIFT                             (16U)
#define PERI_TIM5_CCR3_BIT_CCR3_H_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR3_BIT_CCR3_H_SHIFT)

/*--- register CCR4 -------------------------------------------------*/
#define PERI_TIM5_CCR4_BIT_CCR4_L_SHIFT                             (0U)
#define PERI_TIM5_CCR4_BIT_CCR4_L_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR4_BIT_CCR4_L_SHIFT)
#define PERI_TIM5_CCR4_BIT_CCR4_H_SHIFT                             (16U)
#define PERI_TIM5_CCR4_BIT_CCR4_H_MASK                              (((1U<<16)-1) << PERI_TIM5_CCR4_BIT_CCR4_H_SHIFT)

/*--- register DCR -------------------------------------------------*/
#define PERI_TIM5_DCR_BIT_DBA_SHIFT                                 (0U)
#define PERI_TIM5_DCR_BIT_DBA_MASK                                  (((1U<<5)-1) << PERI_TIM5_DCR_BIT_DBA_SHIFT)
#define PERI_TIM5_DCR_BIT_DBL_SHIFT                                 (8U)
#define PERI_TIM5_DCR_BIT_DBL_MASK                                  (((1U<<5)-1) << PERI_TIM5_DCR_BIT_DBL_SHIFT)

/*--- register DMAR -------------------------------------------------*/
#define PERI_TIM5_DMAR_BIT_DMAB_SHIFT                               (0U)
#define PERI_TIM5_DMAR_BIT_DMAB_MASK                                (((1U<<16)-1) << PERI_TIM5_DMAR_BIT_DMAB_SHIFT)

/*--- register AF1 -------------------------------------------------*/
#define PERI_TIM5_AF1_BIT_ETRSEL_SHIFT                              (14U)
#define PERI_TIM5_AF1_BIT_ETRSEL_MASK                               (((1U<<4)-1) << PERI_TIM5_AF1_BIT_ETRSEL_SHIFT)

/*--- register TISEL -------------------------------------------------*/
#define PERI_TIM5_TISEL_BIT_TI1SEL_SHIFT                            (0U)
#define PERI_TIM5_TISEL_BIT_TI1SEL_MASK                             (((1U<<4)-1) << PERI_TIM5_TISEL_BIT_TI1SEL_SHIFT)
#define PERI_TIM5_TISEL_BIT_TI2SEL_SHIFT                            (8U)
#define PERI_TIM5_TISEL_BIT_TI2SEL_MASK                             (((1U<<4)-1) << PERI_TIM5_TISEL_BIT_TI2SEL_SHIFT)
#define PERI_TIM5_TISEL_BIT_TI3SEL_SHIFT                            (16U)
#define PERI_TIM5_TISEL_BIT_TI3SEL_MASK                             (((1U<<4)-1) << PERI_TIM5_TISEL_BIT_TI3SEL_SHIFT)
#define PERI_TIM5_TISEL_BIT_TI4SEL_SHIFT                            (24U)
#define PERI_TIM5_TISEL_BIT_TI4SEL_MASK                             (((1U<<4)-1) << PERI_TIM5_TISEL_BIT_TI4SEL_SHIFT)

/*--- register CR1 -------------------------------------------------*/
#define PERI_TIM6_CR1_BIT_CEN_SHIFT                                 (0U)
#define PERI_TIM6_CR1_BIT_CEN_MASK                                  (((1U<<1)-1) << PERI_TIM6_CR1_BIT_CEN_SHIFT)
#define PERI_TIM6_CR1_BIT_UDIS_SHIFT                                (1U)
#define PERI_TIM6_CR1_BIT_UDIS_MASK                                 (((1U<<1)-1) << PERI_TIM6_CR1_BIT_UDIS_SHIFT)
#define PERI_TIM6_CR1_BIT_URS_SHIFT                                 (2U)
#define PERI_TIM6_CR1_BIT_URS_MASK                                  (((1U<<1)-1) << PERI_TIM6_CR1_BIT_URS_SHIFT)
#define PERI_TIM6_CR1_BIT_OPM_SHIFT                                 (3U)
#define PERI_TIM6_CR1_BIT_OPM_MASK                                  (((1U<<1)-1) << PERI_TIM6_CR1_BIT_OPM_SHIFT)
#define PERI_TIM6_CR1_BIT_ARPE_SHIFT                                (7U)
#define PERI_TIM6_CR1_BIT_ARPE_MASK                                 (((1U<<1)-1) << PERI_TIM6_CR1_BIT_ARPE_SHIFT)
#define PERI_TIM6_CR1_BIT_UIFREMAP_SHIFT                            (11U)
#define PERI_TIM6_CR1_BIT_UIFREMAP_MASK                             (((1U<<1)-1) << PERI_TIM6_CR1_BIT_UIFREMAP_SHIFT)

/*--- register CR2 -------------------------------------------------*/
#define PERI_TIM6_CR2_BIT_MMS_SHIFT                                 (4U)
#define PERI_TIM6_CR2_BIT_MMS_MASK                                  (((1U<<3)-1) << PERI_TIM6_CR2_BIT_MMS_SHIFT)

/*--- register DIER -------------------------------------------------*/
#define PERI_TIM6_DIER_BIT_UIE_SHIFT                                (0U)
#define PERI_TIM6_DIER_BIT_UIE_MASK                                 (((1U<<1)-1) << PERI_TIM6_DIER_BIT_UIE_SHIFT)
#define PERI_TIM6_DIER_BIT_UDE_SHIFT                                (8U)
#define PERI_TIM6_DIER_BIT_UDE_MASK                                 (((1U<<1)-1) << PERI_TIM6_DIER_BIT_UDE_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_TIM6_SR_BIT_UIF_SHIFT                                  (0U)
#define PERI_TIM6_SR_BIT_UIF_MASK                                   (((1U<<1)-1) << PERI_TIM6_SR_BIT_UIF_SHIFT)

/*--- register EGR -------------------------------------------------*/
#define PERI_TIM6_EGR_BIT_UG_SHIFT                                  (0U)
#define PERI_TIM6_EGR_BIT_UG_MASK                                   (((1U<<1)-1) << PERI_TIM6_EGR_BIT_UG_SHIFT)

/*--- register CNT -------------------------------------------------*/
#define PERI_TIM6_CNT_BIT_CNT_SHIFT                                 (0U)
#define PERI_TIM6_CNT_BIT_CNT_MASK                                  (((1U<<16)-1) << PERI_TIM6_CNT_BIT_CNT_SHIFT)
#define PERI_TIM6_CNT_BIT_UIFCPY_SHIFT                              (31U)
#define PERI_TIM6_CNT_BIT_UIFCPY_MASK                               (((1U<<1)-1) << PERI_TIM6_CNT_BIT_UIFCPY_SHIFT)

/*--- register PSC -------------------------------------------------*/
#define PERI_TIM6_PSC_BIT_PSC_SHIFT                                 (0U)
#define PERI_TIM6_PSC_BIT_PSC_MASK                                  (((1U<<16)-1) << PERI_TIM6_PSC_BIT_PSC_SHIFT)

/*--- register ARR -------------------------------------------------*/
#define PERI_TIM6_ARR_BIT_ARR_SHIFT                                 (0U)
#define PERI_TIM6_ARR_BIT_ARR_MASK                                  (((1U<<16)-1) << PERI_TIM6_ARR_BIT_ARR_SHIFT)

