minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register SR -------------------------------------------------*/
#define PERI_TIM8_SR_BIT_UIF_SHIFT                                  (0U)
#define PERI_TIM8_SR_BIT_UIF_MASK                                   (((1U<<1)-1) << PERI_TIM8_SR_BIT_UIF_SHIFT)
#define PERI_TIM8_SR_BIT_CC1IF_SHIFT                                (1U)
#define PERI_TIM8_SR_BIT_CC1IF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC1IF_SHIFT)
#define PERI_TIM8_SR_BIT_CC2IF_SHIFT                                (2U)
#define PERI_TIM8_SR_BIT_CC2IF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC2IF_SHIFT)
#define PERI_TIM8_SR_BIT_CC3IF_SHIFT                                (3U)
#define PERI_TIM8_SR_BIT_CC3IF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC3IF_SHIFT)
#define PERI_TIM8_SR_BIT_CC4IF_SHIFT                                (4U)
#define PERI_TIM8_SR_BIT_CC4IF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC4IF_SHIFT)
#define PERI_TIM8_SR_BIT_COMIF_SHIFT                                (5U)
#define PERI_TIM8_SR_BIT_COMIF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_COMIF_SHIFT)
#define PERI_TIM8_SR_BIT_TIF_SHIFT                                  (6U)
#define PERI_TIM8_SR_BIT_TIF_MASK                                   (((1U<<1)-1) << PERI_TIM8_SR_BIT_TIF_SHIFT)
#define PERI_TIM8_SR_BIT_BIF_SHIFT                                  (7U)
#define PERI_TIM8_SR_BIT_BIF_MASK                                   (((1U<<1)-1) << PERI_TIM8_SR_BIT_BIF_SHIFT)
#define PERI_TIM8_SR_BIT_B2IF_SHIFT                                 (8U)
#define PERI_TIM8_SR_BIT_B2IF_MASK                                  (((1U<<1)-1) << PERI_TIM8_SR_BIT_B2IF_SHIFT)
#define PERI_TIM8_SR_BIT_CC1OF_SHIFT                                (9U)
#define PERI_TIM8_SR_BIT_CC1OF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC1OF_SHIFT)
#define PERI_TIM8_SR_BIT_CC2OF_SHIFT                                (10U)
#define PERI_TIM8_SR_BIT_CC2OF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC2OF_SHIFT)
#define PERI_TIM8_SR_BIT_CC3OF_SHIFT                                (11U)
#define PERI_TIM8_SR_BIT_CC3OF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC3OF_SHIFT)
#define PERI_TIM8_SR_BIT_CC4OF_SHIFT                                (12U)
#define PERI_TIM8_SR_BIT_CC4OF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC4OF_SHIFT)
#define PERI_TIM8_SR_BIT_SBIF_SHIFT                                 (13U)
#define PERI_TIM8_SR_BIT_SBIF_MASK                                  (((1U<<1)-1) << PERI_TIM8_SR_BIT_SBIF_SHIFT)
#define PERI_TIM8_SR_BIT_CC5IF_SHIFT                                (16U)
#define PERI_TIM8_SR_BIT_CC5IF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC5IF_SHIFT)
#define PERI_TIM8_SR_BIT_CC6IF_SHIFT                                (17U)
#define PERI_TIM8_SR_BIT_CC6IF_MASK                                 (((1U<<1)-1) << PERI_TIM8_SR_BIT_CC6IF_SHIFT)

/*--- register EGR -------------------------------------------------*/
#define PERI_TIM8_EGR_BIT_UG_SHIFT                                  (0U)
#define PERI_TIM8_EGR_BIT_UG_MASK                                   (((1U<<1)-1) << PERI_TIM8_EGR_BIT_UG_SHIFT)
#define PERI_TIM8_EGR_BIT_CC1G_SHIFT                                (1U)
#define PERI_TIM8_EGR_BIT_CC1G_MASK                                 (((1U<<1)-1) << PERI_TIM8_EGR_BIT_CC1G_SHIFT)
#define PERI_TIM8_EGR_BIT_CC2G_SHIFT                                (2U)
#define PERI_TIM8_EGR_BIT_CC2G_MASK                                 (((1U<<1)-1) << PERI_TIM8_EGR_BIT_CC2G_SHIFT)
#define PERI_TIM8_EGR_BIT_CC3G_SHIFT                                (3U)
#define PERI_TIM8_EGR_BIT_CC3G_MASK                                 (((1U<<1)-1) << PERI_TIM8_EGR_BIT_CC3G_SHIFT)
#define PERI_TIM8_EGR_BIT_CC4G_SHIFT                                (4U)
#define PERI_TIM8_EGR_BIT_CC4G_MASK                                 (((1U<<1)-1) << PERI_TIM8_EGR_BIT_CC4G_SHIFT)
#define PERI_TIM8_EGR_BIT_COMG_SHIFT                                (5U)
#define PERI_TIM8_EGR_BIT_COMG_MASK                                 (((1U<<1)-1) << PERI_TIM8_EGR_BIT_COMG_SHIFT)
#define PERI_TIM8_EGR_BIT_TG_SHIFT                                  (6U)
#define PERI_TIM8_EGR_BIT_TG_MASK                                   (((1U<<1)-1) << PERI_TIM8_EGR_BIT_TG_SHIFT)
#define PERI_TIM8_EGR_BIT_BG_SHIFT                                  (7U)
#define PERI_TIM8_EGR_BIT_BG_MASK                                   (((1U<<1)-1) << PERI_TIM8_EGR_BIT_BG_SHIFT)
#define PERI_TIM8_EGR_BIT_B2G_SHIFT                                 (8U)
#define PERI_TIM8_EGR_BIT_B2G_MASK                                  (((1U<<1)-1) << PERI_TIM8_EGR_BIT_B2G_SHIFT)

/*--- register CCMR1_Output -------------------------------------------------*/
#define PERI_TIM8_CCMR1_OUTPUT_BIT_CC1S_SHIFT                       (0U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_CC1S_MASK                        (((1U<<2)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_CC1S_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1FE_SHIFT                      (2U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1FE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC1FE_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1PE_SHIFT                      (3U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1PE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC1PE_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1M_SHIFT                       (4U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1M_MASK                        (((1U<<3)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC1M_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1CE_SHIFT                      (7U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1CE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC1CE_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_CC2S_SHIFT                       (8U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_CC2S_MASK                        (((1U<<2)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_CC2S_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2FE_SHIFT                      (10U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2FE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC2FE_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2PE_SHIFT                      (11U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2PE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC2PE_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2M_SHIFT                       (12U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2M_MASK                        (((1U<<3)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC2M_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2CE_SHIFT                      (15U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2CE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC2CE_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1M_3_SHIFT                     (16U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC1M_3_MASK                      (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC1M_3_SHIFT)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2M_3_SHIFT                     (24U)
#define PERI_TIM8_CCMR1_OUTPUT_BIT_OC2M_3_MASK                      (((1U<<1)-1) << PERI_TIM8_CCMR1_OUTPUT_BIT_OC2M_3_SHIFT)

/*--- register CCMR1_Input -------------------------------------------------*/
#define PERI_TIM8_CCMR1_INPUT_BIT_CC1S_SHIFT                        (0U)
#define PERI_TIM8_CCMR1_INPUT_BIT_CC1S_MASK                         (((1U<<2)-1) << PERI_TIM8_CCMR1_INPUT_BIT_CC1S_SHIFT)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC1PSC_SHIFT                      (2U)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC1PSC_MASK                       (((1U<<2)-1) << PERI_TIM8_CCMR1_INPUT_BIT_IC1PSC_SHIFT)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC1F_SHIFT                        (4U)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC1F_MASK                         (((1U<<4)-1) << PERI_TIM8_CCMR1_INPUT_BIT_IC1F_SHIFT)
#define PERI_TIM8_CCMR1_INPUT_BIT_CC2S_SHIFT                        (8U)
#define PERI_TIM8_CCMR1_INPUT_BIT_CC2S_MASK                         (((1U<<2)-1) << PERI_TIM8_CCMR1_INPUT_BIT_CC2S_SHIFT)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC2PSC_SHIFT                      (10U)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC2PSC_MASK                       (((1U<<2)-1) << PERI_TIM8_CCMR1_INPUT_BIT_IC2PSC_SHIFT)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC2F_SHIFT                        (12U)
#define PERI_TIM8_CCMR1_INPUT_BIT_IC2F_MASK                         (((1U<<4)-1) << PERI_TIM8_CCMR1_INPUT_BIT_IC2F_SHIFT)

/*--- register CCMR2_Output -------------------------------------------------*/
#define PERI_TIM8_CCMR2_OUTPUT_BIT_CC3S_SHIFT                       (0U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_CC3S_MASK                        (((1U<<2)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_CC3S_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3FE_SHIFT                      (2U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3FE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC3FE_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3PE_SHIFT                      (3U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3PE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC3PE_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3M_SHIFT                       (4U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3M_MASK                        (((1U<<3)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC3M_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3CE_SHIFT                      (7U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3CE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC3CE_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_CC4S_SHIFT                       (8U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_CC4S_MASK                        (((1U<<2)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_CC4S_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4FE_SHIFT                      (10U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4FE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC4FE_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4PE_SHIFT                      (11U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4PE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC4PE_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4M_SHIFT                       (12U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4M_MASK                        (((1U<<3)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC4M_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4CE_SHIFT                      (15U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4CE_MASK                       (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC4CE_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3M_3_SHIFT                     (16U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC3M_3_MASK                      (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC3M_3_SHIFT)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4M_4_SHIFT                     (24U)
#define PERI_TIM8_CCMR2_OUTPUT_BIT_OC4M_4_MASK                      (((1U<<1)-1) << PERI_TIM8_CCMR2_OUTPUT_BIT_OC4M_4_SHIFT)

/*--- register CCMR2_Input -------------------------------------------------*/
#define PERI_TIM8_CCMR2_INPUT_BIT_CC3S_SHIFT                        (0U)
#define PERI_TIM8_CCMR2_INPUT_BIT_CC3S_MASK                         (((1U<<2)-1) << PERI_TIM8_CCMR2_INPUT_BIT_CC3S_SHIFT)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC3PSC_SHIFT                      (2U)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC3PSC_MASK                       (((1U<<2)-1) << PERI_TIM8_CCMR2_INPUT_BIT_IC3PSC_SHIFT)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC3F_SHIFT                        (4U)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC3F_MASK                         (((1U<<4)-1) << PERI_TIM8_CCMR2_INPUT_BIT_IC3F_SHIFT)
#define PERI_TIM8_CCMR2_INPUT_BIT_CC4S_SHIFT                        (8U)
#define PERI_TIM8_CCMR2_INPUT_BIT_CC4S_MASK                         (((1U<<2)-1) << PERI_TIM8_CCMR2_INPUT_BIT_CC4S_SHIFT)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC4PSC_SHIFT                      (10U)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC4PSC_MASK                       (((1U<<2)-1) << PERI_TIM8_CCMR2_INPUT_BIT_IC4PSC_SHIFT)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC4F_SHIFT                        (12U)
#define PERI_TIM8_CCMR2_INPUT_BIT_IC4F_MASK                         (((1U<<4)-1) << PERI_TIM8_CCMR2_INPUT_BIT_IC4F_SHIFT)

/*--- register CCER -------------------------------------------------*/
#define PERI_TIM8_CCER_BIT_CC1E_SHIFT                               (0U)
#define PERI_TIM8_CCER_BIT_CC1E_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC1E_SHIFT)
#define PERI_TIM8_CCER_BIT_CC1P_SHIFT                               (1U)
#define PERI_TIM8_CCER_BIT_CC1P_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC1P_SHIFT)
#define PERI_TIM8_CCER_BIT_CC1NE_SHIFT                              (2U)
#define PERI_TIM8_CCER_BIT_CC1NE_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC1NE_SHIFT)
#define PERI_TIM8_CCER_BIT_CC1NP_SHIFT                              (3U)
#define PERI_TIM8_CCER_BIT_CC1NP_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC1NP_SHIFT)
#define PERI_TIM8_CCER_BIT_CC2E_SHIFT                               (4U)
#define PERI_TIM8_CCER_BIT_CC2E_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC2E_SHIFT)
#define PERI_TIM8_CCER_BIT_CC2P_SHIFT                               (5U)
#define PERI_TIM8_CCER_BIT_CC2P_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC2P_SHIFT)
#define PERI_TIM8_CCER_BIT_CC2NE_SHIFT                              (6U)
#define PERI_TIM8_CCER_BIT_CC2NE_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC2NE_SHIFT)
#define PERI_TIM8_CCER_BIT_CC2NP_SHIFT                              (7U)
#define PERI_TIM8_CCER_BIT_CC2NP_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC2NP_SHIFT)
#define PERI_TIM8_CCER_BIT_CC3E_SHIFT                               (8U)
#define PERI_TIM8_CCER_BIT_CC3E_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC3E_SHIFT)
#define PERI_TIM8_CCER_BIT_CC3P_SHIFT                               (9U)
#define PERI_TIM8_CCER_BIT_CC3P_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC3P_SHIFT)
#define PERI_TIM8_CCER_BIT_CC3NE_SHIFT                              (10U)
#define PERI_TIM8_CCER_BIT_CC3NE_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC3NE_SHIFT)
#define PERI_TIM8_CCER_BIT_CC3NP_SHIFT                              (11U)
#define PERI_TIM8_CCER_BIT_CC3NP_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC3NP_SHIFT)
#define PERI_TIM8_CCER_BIT_CC4E_SHIFT                               (12U)
#define PERI_TIM8_CCER_BIT_CC4E_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC4E_SHIFT)
#define PERI_TIM8_CCER_BIT_CC4P_SHIFT                               (13U)
#define PERI_TIM8_CCER_BIT_CC4P_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC4P_SHIFT)
#define PERI_TIM8_CCER_BIT_CC4NP_SHIFT                              (15U)
#define PERI_TIM8_CCER_BIT_CC4NP_MASK                               (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC4NP_SHIFT)
#define PERI_TIM8_CCER_BIT_CC5E_SHIFT                               (16U)
#define PERI_TIM8_CCER_BIT_CC5E_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC5E_SHIFT)
#define PERI_TIM8_CCER_BIT_CC5P_SHIFT                               (17U)
#define PERI_TIM8_CCER_BIT_CC5P_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC5P_SHIFT)
#define PERI_TIM8_CCER_BIT_CC6E_SHIFT                               (20U)
#define PERI_TIM8_CCER_BIT_CC6E_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC6E_SHIFT)
#define PERI_TIM8_CCER_BIT_CC6P_SHIFT                               (21U)
#define PERI_TIM8_CCER_BIT_CC6P_MASK                                (((1U<<1)-1) << PERI_TIM8_CCER_BIT_CC6P_SHIFT)

/*--- register CNT -------------------------------------------------*/
#define PERI_TIM8_CNT_BIT_CNT_SHIFT                                 (0U)
#define PERI_TIM8_CNT_BIT_CNT_MASK                                  (((1U<<16)-1) << PERI_TIM8_CNT_BIT_CNT_SHIFT)
#define PERI_TIM8_CNT_BIT_UIFCPY_SHIFT                              (31U)
#define PERI_TIM8_CNT_BIT_UIFCPY_MASK                               (((1U<<1)-1) << PERI_TIM8_CNT_BIT_UIFCPY_SHIFT)

/*--- register PSC -------------------------------------------------*/
#define PERI_TIM8_PSC_BIT_PSC_SHIFT                                 (0U)
#define PERI_TIM8_PSC_BIT_PSC_MASK                                  (((1U<<16)-1) << PERI_TIM8_PSC_BIT_PSC_SHIFT)

/*--- register ARR -------------------------------------------------*/
#define PERI_TIM8_ARR_BIT_ARR_SHIFT                                 (0U)
#define PERI_TIM8_ARR_BIT_ARR_MASK                                  (((1U<<16)-1) << PERI_TIM8_ARR_BIT_ARR_SHIFT)

