minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register RQR -------------------------------------------------*/
#define PERI_USART2_RQR_BIT_ABRRQ_SHIFT                             (0U)
#define PERI_USART2_RQR_BIT_ABRRQ_MASK                              (((1U<<1)-1) << PERI_USART2_RQR_BIT_ABRRQ_SHIFT)
#define PERI_USART2_RQR_BIT_SBKRQ_SHIFT                             (1U)
#define PERI_USART2_RQR_BIT_SBKRQ_MASK                              (((1U<<1)-1) << PERI_USART2_RQR_BIT_SBKRQ_SHIFT)
#define PERI_USART2_RQR_BIT_MMRQ_SHIFT                              (2U)
#define PERI_USART2_RQR_BIT_MMRQ_MASK                               (((1U<<1)-1) << PERI_USART2_RQR_BIT_MMRQ_SHIFT)
#define PERI_USART2_RQR_BIT_RXFRQ_SHIFT                             (3U)
#define PERI_USART2_RQR_BIT_RXFRQ_MASK                              (((1U<<1)-1) << PERI_USART2_RQR_BIT_RXFRQ_SHIFT)
#define PERI_USART2_RQR_BIT_TXFRQ_SHIFT                             (4U)
#define PERI_USART2_RQR_BIT_TXFRQ_MASK                              (((1U<<1)-1) << PERI_USART2_RQR_BIT_TXFRQ_SHIFT)

/*--- register ISR -------------------------------------------------*/
#define PERI_USART2_ISR_BIT_PE_SHIFT                                (0U)
#define PERI_USART2_ISR_BIT_PE_MASK                                 (((1U<<1)-1) << PERI_USART2_ISR_BIT_PE_SHIFT)
#define PERI_USART2_ISR_BIT_FE_SHIFT                                (1U)
#define PERI_USART2_ISR_BIT_FE_MASK                                 (((1U<<1)-1) << PERI_USART2_ISR_BIT_FE_SHIFT)
#define PERI_USART2_ISR_BIT_NF_SHIFT                                (2U)
#define PERI_USART2_ISR_BIT_NF_MASK                                 (((1U<<1)-1) << PERI_USART2_ISR_BIT_NF_SHIFT)
#define PERI_USART2_ISR_BIT_ORE_SHIFT                               (3U)
#define PERI_USART2_ISR_BIT_ORE_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_ORE_SHIFT)
#define PERI_USART2_ISR_BIT_IDLE_SHIFT                              (4U)
#define PERI_USART2_ISR_BIT_IDLE_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_IDLE_SHIFT)
#define PERI_USART2_ISR_BIT_RXNE_SHIFT                              (5U)
#define PERI_USART2_ISR_BIT_RXNE_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_RXNE_SHIFT)
#define PERI_USART2_ISR_BIT_TC_SHIFT                                (6U)
#define PERI_USART2_ISR_BIT_TC_MASK                                 (((1U<<1)-1) << PERI_USART2_ISR_BIT_TC_SHIFT)
#define PERI_USART2_ISR_BIT_TXE_SHIFT                               (7U)
#define PERI_USART2_ISR_BIT_TXE_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_TXE_SHIFT)
#define PERI_USART2_ISR_BIT_LBDF_SHIFT                              (8U)
#define PERI_USART2_ISR_BIT_LBDF_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_LBDF_SHIFT)
#define PERI_USART2_ISR_BIT_CTSIF_SHIFT                             (9U)
#define PERI_USART2_ISR_BIT_CTSIF_MASK                              (((1U<<1)-1) << PERI_USART2_ISR_BIT_CTSIF_SHIFT)
#define PERI_USART2_ISR_BIT_CTS_SHIFT                               (10U)
#define PERI_USART2_ISR_BIT_CTS_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_CTS_SHIFT)
#define PERI_USART2_ISR_BIT_RTOF_SHIFT                              (11U)
#define PERI_USART2_ISR_BIT_RTOF_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_RTOF_SHIFT)
#define PERI_USART2_ISR_BIT_EOBF_SHIFT                              (12U)
#define PERI_USART2_ISR_BIT_EOBF_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_EOBF_SHIFT)
#define PERI_USART2_ISR_BIT_UDR_SHIFT                               (13U)
#define PERI_USART2_ISR_BIT_UDR_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_UDR_SHIFT)
#define PERI_USART2_ISR_BIT_ABRE_SHIFT                              (14U)
#define PERI_USART2_ISR_BIT_ABRE_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_ABRE_SHIFT)
#define PERI_USART2_ISR_BIT_ABRF_SHIFT                              (15U)
#define PERI_USART2_ISR_BIT_ABRF_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_ABRF_SHIFT)
#define PERI_USART2_ISR_BIT_BUSY_SHIFT                              (16U)
#define PERI_USART2_ISR_BIT_BUSY_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_BUSY_SHIFT)
#define PERI_USART2_ISR_BIT_CMF_SHIFT                               (17U)
#define PERI_USART2_ISR_BIT_CMF_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_CMF_SHIFT)
#define PERI_USART2_ISR_BIT_SBKF_SHIFT                              (18U)
#define PERI_USART2_ISR_BIT_SBKF_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_SBKF_SHIFT)
#define PERI_USART2_ISR_BIT_RWU_SHIFT                               (19U)
#define PERI_USART2_ISR_BIT_RWU_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_RWU_SHIFT)
#define PERI_USART2_ISR_BIT_WUF_SHIFT                               (20U)
#define PERI_USART2_ISR_BIT_WUF_MASK                                (((1U<<1)-1) << PERI_USART2_ISR_BIT_WUF_SHIFT)
#define PERI_USART2_ISR_BIT_TEACK_SHIFT                             (21U)
#define PERI_USART2_ISR_BIT_TEACK_MASK                              (((1U<<1)-1) << PERI_USART2_ISR_BIT_TEACK_SHIFT)
#define PERI_USART2_ISR_BIT_REACK_SHIFT                             (22U)
#define PERI_USART2_ISR_BIT_REACK_MASK                              (((1U<<1)-1) << PERI_USART2_ISR_BIT_REACK_SHIFT)
#define PERI_USART2_ISR_BIT_TXFE_SHIFT                              (23U)
#define PERI_USART2_ISR_BIT_TXFE_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_TXFE_SHIFT)
#define PERI_USART2_ISR_BIT_RXFF_SHIFT                              (24U)
#define PERI_USART2_ISR_BIT_RXFF_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_RXFF_SHIFT)
#define PERI_USART2_ISR_BIT_TCBGT_SHIFT                             (25U)
#define PERI_USART2_ISR_BIT_TCBGT_MASK                              (((1U<<1)-1) << PERI_USART2_ISR_BIT_TCBGT_SHIFT)
#define PERI_USART2_ISR_BIT_RXFT_SHIFT                              (26U)
#define PERI_USART2_ISR_BIT_RXFT_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_RXFT_SHIFT)
#define PERI_USART2_ISR_BIT_TXFT_SHIFT                              (27U)
#define PERI_USART2_ISR_BIT_TXFT_MASK                               (((1U<<1)-1) << PERI_USART2_ISR_BIT_TXFT_SHIFT)

/*--- register ICR -------------------------------------------------*/
#define PERI_USART2_ICR_BIT_PECF_SHIFT                              (0U)
#define PERI_USART2_ICR_BIT_PECF_MASK                               (((1U<<1)-1) << PERI_USART2_ICR_BIT_PECF_SHIFT)
#define PERI_USART2_ICR_BIT_FECF_SHIFT                              (1U)
#define PERI_USART2_ICR_BIT_FECF_MASK                               (((1U<<1)-1) << PERI_USART2_ICR_BIT_FECF_SHIFT)
#define PERI_USART2_ICR_BIT_NCF_SHIFT                               (2U)
#define PERI_USART2_ICR_BIT_NCF_MASK                                (((1U<<1)-1) << PERI_USART2_ICR_BIT_NCF_SHIFT)
#define PERI_USART2_ICR_BIT_ORECF_SHIFT                             (3U)
#define PERI_USART2_ICR_BIT_ORECF_MASK                              (((1U<<1)-1) << PERI_USART2_ICR_BIT_ORECF_SHIFT)
#define PERI_USART2_ICR_BIT_IDLECF_SHIFT                            (4U)
#define PERI_USART2_ICR_BIT_IDLECF_MASK                             (((1U<<1)-1) << PERI_USART2_ICR_BIT_IDLECF_SHIFT)
#define PERI_USART2_ICR_BIT_TXFECF_SHIFT                            (5U)
#define PERI_USART2_ICR_BIT_TXFECF_MASK                             (((1U<<1)-1) << PERI_USART2_ICR_BIT_TXFECF_SHIFT)
#define PERI_USART2_ICR_BIT_TCCF_SHIFT                              (6U)
#define PERI_USART2_ICR_BIT_TCCF_MASK                               (((1U<<1)-1) << PERI_USART2_ICR_BIT_TCCF_SHIFT)
#define PERI_USART2_ICR_BIT_TCBGTC_SHIFT                            (7U)
#define PERI_USART2_ICR_BIT_TCBGTC_MASK                             (((1U<<1)-1) << PERI_USART2_ICR_BIT_TCBGTC_SHIFT)
#define PERI_USART2_ICR_BIT_LBDCF_SHIFT                             (8U)
#define PERI_USART2_ICR_BIT_LBDCF_MASK                              (((1U<<1)-1) << PERI_USART2_ICR_BIT_LBDCF_SHIFT)
#define PERI_USART2_ICR_BIT_CTSCF_SHIFT                             (9U)
#define PERI_USART2_ICR_BIT_CTSCF_MASK                              (((1U<<1)-1) << PERI_USART2_ICR_BIT_CTSCF_SHIFT)
#define PERI_USART2_ICR_BIT_RTOCF_SHIFT                             (11U)
#define PERI_USART2_ICR_BIT_RTOCF_MASK                              (((1U<<1)-1) << PERI_USART2_ICR_BIT_RTOCF_SHIFT)
#define PERI_USART2_ICR_BIT_EOBCF_SHIFT                             (12U)
#define PERI_USART2_ICR_BIT_EOBCF_MASK                              (((1U<<1)-1) << PERI_USART2_ICR_BIT_EOBCF_SHIFT)
#define PERI_USART2_ICR_BIT_UDRCF_SHIFT                             (13U)
#define PERI_USART2_ICR_BIT_UDRCF_MASK                              (((1U<<1)-1) << PERI_USART2_ICR_BIT_UDRCF_SHIFT)
#define PERI_USART2_ICR_BIT_CMCF_SHIFT                              (17U)
#define PERI_USART2_ICR_BIT_CMCF_MASK                               (((1U<<1)-1) << PERI_USART2_ICR_BIT_CMCF_SHIFT)
#define PERI_USART2_ICR_BIT_WUCF_SHIFT                              (20U)
#define PERI_USART2_ICR_BIT_WUCF_MASK                               (((1U<<1)-1) << PERI_USART2_ICR_BIT_WUCF_SHIFT)

/*--- register RDR -------------------------------------------------*/
#define PERI_USART2_RDR_BIT_RDR_SHIFT                               (0U)
#define PERI_USART2_RDR_BIT_RDR_MASK                                (((1U<<9)-1) << PERI_USART2_RDR_BIT_RDR_SHIFT)

/*--- register TDR -------------------------------------------------*/
#define PERI_USART2_TDR_BIT_TDR_SHIFT                               (0U)
#define PERI_USART2_TDR_BIT_TDR_MASK                                (((1U<<9)-1) << PERI_USART2_TDR_BIT_TDR_SHIFT)

/*--- register PRESC -------------------------------------------------*/
#define PERI_USART2_PRESC_BIT_PRESCALER_SHIFT                       (0U)
#define PERI_USART2_PRESC_BIT_PRESCALER_MASK                        (((1U<<4)-1) << PERI_USART2_PRESC_BIT_PRESCALER_SHIFT)

