minhduc09777/svd_generate_project/STM32H743/STM32H743_io.h
/*--- register CR -------------------------------------------------*/
#define PERI_WWDG_CR_BIT_T_SHIFT                                    (0U)
#define PERI_WWDG_CR_BIT_T_MASK                                     (((1U<<7)-1) << PERI_WWDG_CR_BIT_T_SHIFT)
#define PERI_WWDG_CR_BIT_WDGA_SHIFT                                 (7U)
#define PERI_WWDG_CR_BIT_WDGA_MASK                                  (((1U<<1)-1) << PERI_WWDG_CR_BIT_WDGA_SHIFT)

/*--- register CFR -------------------------------------------------*/
#define PERI_WWDG_CFR_BIT_W_SHIFT                                   (0U)
#define PERI_WWDG_CFR_BIT_W_MASK                                    (((1U<<7)-1) << PERI_WWDG_CFR_BIT_W_SHIFT)
#define PERI_WWDG_CFR_BIT_EWI_SHIFT                                 (9U)
#define PERI_WWDG_CFR_BIT_EWI_MASK                                  (((1U<<1)-1) << PERI_WWDG_CFR_BIT_EWI_SHIFT)
#define PERI_WWDG_CFR_BIT_WDGTB_SHIFT                               (11U)
#define PERI_WWDG_CFR_BIT_WDGTB_MASK                                (((1U<<2)-1) << PERI_WWDG_CFR_BIT_WDGTB_SHIFT)

/*--- register SR -------------------------------------------------*/
#define PERI_WWDG_SR_BIT_EWIF_SHIFT                                 (0U)
#define PERI_WWDG_SR_BIT_EWIF_MASK                                  (((1U<<1)-1) << PERI_WWDG_SR_BIT_EWIF_SHIFT)

/*------------------------ Device Macro Define ---------------------*/
// Device STM32H743

#define PERI_ADC1                ((adc1_t *) 0x40022000)
#define PERI_ADC12_COMMON        ((adc12_common_t *) 0x40022300)
#define PERI_ADC2                ((adc2_t *) 0x40022100)
#define PERI_ADC3                ((adc3_t *) 0x58026000)
#define PERI_ADC3_COMMON         ((adc3_common_t *) 0x58026300)
#define PERI_AXI                 ((axi_t *) 0x51000000)
#define PERI_BDMA                ((bdma_t *) 0x58025400)
#define PERI_CAN_CCU             ((can_ccu_t *) 0x4000A800)
#define PERI_CEC                 ((cec_t *) 0x40006C00)
#define PERI_COMP1               ((comp1_t *) 0x58003800)
#define PERI_CRC                 ((crc_t *) 0x58024C00)
#define PERI_CRS                 ((crs_t *) 0x40008400)
#define PERI_DAC                 ((dac_t *) 0x40007400)
#define PERI_DBGMCU              ((dbgmcu_t *) 0x5C001000)
#define PERI_DCMI                ((dcmi_t *) 0x48020000)
#define PERI_DELAY_BLOCK_QUADSPI ((delay_block_quadspi_t *) 0x52006000)
#define PERI_DELAY_BLOCK_SDMMC1  ((delay_block_sdmmc1_t *) 0x52008000)
#define PERI_DELAY_BLOCK_SDMMC2  ((delay_block_sdmmc2_t *) 0x48022800)
#define PERI_DFSDM               ((dfsdm_t *) 0x40017000)
#define PERI_DMA1                ((dma1_t *) 0x40020000)
#define PERI_DMA2                ((dma2_t *) 0x40020400)
#define PERI_DMA2D               ((dma2d_t *) 0x52001000)
#define PERI_DMAMUX1             ((dmamux1_t *) 0x40020800)
#define PERI_DMAMUX2             ((dmamux2_t *) 0x58025800)
#define PERI_EXTI                ((exti_t *) 0x58000000)
#define PERI_ETHERNET_DMA        ((ethernet_dma_t *) 0x40029000)
#define PERI_ETHERNET_MAC        ((ethernet_mac_t *) 0x40028000)
#define PERI_ETHERNET_MTL        ((ethernet_mtl_t *) 0x40028C00)
#define PERI_FDCAN1              ((fdcan1_t *) 0x4000A000)
#define PERI_FDCAN2              ((fdcan2_t *) 0x4000A400)
#define PERI_FMC                 ((fmc_t *) 0x52004000)
#define PERI_FLASH               ((flash_t *) 0x52002000)
#define PERI_GPIOA               ((gpioa_t *) 0x58020000)
#define PERI_GPIOB               ((gpiob_t *) 0x58020400)
#define PERI_GPIOC               ((gpioc_t *) 0x58020800)
#define PERI_GPIOD               ((gpiod_t *) 0x58020C00)
#define PERI_GPIOE               ((gpioe_t *) 0x58021000)
#define PERI_GPIOF               ((gpiof_t *) 0x58021400)
#define PERI_GPIOG               ((gpiog_t *) 0x58021800)
#define PERI_GPIOH               ((gpioh_t *) 0x58021C00)
#define PERI_GPIOI               ((gpioi_t *) 0x58022000)
#define PERI_GPIOJ               ((gpioj_t *) 0x58022400)
#define PERI_GPIOK               ((gpiok_t *) 0x58022800)
#define PERI_HRTIM_COMMON        ((hrtim_common_t *) 0x40017780)
#define PERI_HRTIM_MASTER        ((hrtim_master_t *) 0x40017400)
#define PERI_HRTIM_TIMA          ((hrtim_tima_t *) 0x40017480)
#define PERI_HRTIM_TIMB          ((hrtim_timb_t *) 0x40017500)
#define PERI_HRTIM_TIMC          ((hrtim_timc_t *) 0x40017580)
#define PERI_HRTIM_TIMD          ((hrtim_timd_t *) 0x40017600)
#define PERI_HRTIM_TIME          ((hrtim_time_t *) 0x40017680)
#define PERI_HSEM                ((hsem_t *) 0x58026400)
#define PERI_I2C1                ((i2c1_t *) 0x40005400)
#define PERI_I2C2                ((i2c2_t *) 0x40005800)
#define PERI_I2C3                ((i2c3_t *) 0x40005C00)
#define PERI_I2C4                ((i2c4_t *) 0x58001C00)
#define PERI_IWDG                ((iwdg_t *) 0x58004800)
#define PERI_JPEG                ((jpeg_t *) 0x52003000)
#define PERI_LPTIM1              ((lptim1_t *) 0x40002400)
#define PERI_LPTIM2              ((lptim2_t *) 0x58002400)
#define PERI_LPTIM3              ((lptim3_t *) 0x58002800)
#define PERI_LPTIM4              ((lptim4_t *) 0x58002C00)
#define PERI_LPTIM5              ((lptim5_t *) 0x58003000)
#define PERI_LPUART1             ((lpuart1_t *) 0x58000C00)
#define PERI_LTDC                ((ltdc_t *) 0x50001000)
#define PERI_MDIOS               ((mdios_t *) 0x40009400)
#define PERI_MDMA                ((mdma_t *) 0x52000000)
#define PERI_OPAMP               ((opamp_t *) 0x40009000)
#define PERI_OTG1_HS_DEVICE      ((otg1_hs_device_t *) 0x40040800)
#define PERI_OTG1_HS_GLOBAL      ((otg1_hs_global_t *) 0x40040000)
#define PERI_OTG1_HS_HOST        ((otg1_hs_host_t *) 0x40040400)
#define PERI_OTG1_HS_PWRCLK      ((otg1_hs_pwrclk_t *) 0x40040E00)
#define PERI_OTG2_HS_DEVICE      ((otg2_hs_device_t *) 0x40080800)
#define PERI_OTG2_HS_GLOBAL      ((otg2_hs_global_t *) 0x40080000)
#define PERI_OTG2_HS_HOST        ((otg2_hs_host_t *) 0x40080400)
#define PERI_OTG2_HS_PWRCLK      ((otg2_hs_pwrclk_t *) 0x40080E00)
#define PERI_PWR                 ((pwr_t *) 0x58024800)
#define PERI_QUADSPI             ((quadspi_t *) 0x52005000)
#define PERI_RAMECC1             ((ramecc1_t *) 0x52009000)
#define PERI_RAMECC2             ((ramecc2_t *) 0x48023000)
#define PERI_RAMECC3             ((ramecc3_t *) 0x58027000)
#define PERI_RCC                 ((rcc_t *) 0x58024400)
#define PERI_RNG                 ((rng_t *) 0x48021800)
#define PERI_RTC                 ((rtc_t *) 0x58004000)
#define PERI_SAI1                ((sai1_t *) 0x40015800)
#define PERI_SAI2                ((sai2_t *) 0x40015C00)
#define PERI_SAI3                ((sai3_t *) 0x40016000)
#define PERI_SAI4                ((sai4_t *) 0x58005400)
#define PERI_SDMMC1              ((sdmmc1_t *) 0x52007000)
#define PERI_SDMMC2              ((sdmmc2_t *) 0x48022400)
#define PERI_SPDIFRX             ((spdifrx_t *) 0x40004000)
#define PERI_SPI1                ((spi1_t *) 0x40013000)
#define PERI_SPI2                ((spi2_t *) 0x40003800)
#define PERI_SPI3                ((spi3_t *) 0x40003C00)
#define PERI_SPI4                ((spi4_t *) 0x40013400)
#define PERI_SPI5                ((spi5_t *) 0x40015000)
#define PERI_SPI6                ((spi6_t *) 0x58001400)
#define PERI_SWPMI               ((swpmi_t *) 0x40008800)
#define PERI_SYSCFG              ((syscfg_t *) 0x58000400)
#define PERI_TIM1                ((tim1_t *) 0x40010000)
#define PERI_TIM12               ((tim12_t *) 0x40001800)
#define PERI_TIM13               ((tim13_t *) 0x40001C00)
#define PERI_TIM14               ((tim14_t *) 0x40002000)
#define PERI_TIM15               ((tim15_t *) 0x40014000)
#define PERI_TIM16               ((tim16_t *) 0x40014400)
#define PERI_TIM17               ((tim17_t *) 0x40014800)
#define PERI_TIM2                ((tim2_t *) 0x40000000)
#define PERI_TIM3                ((tim3_t *) 0x40000400)
#define PERI_TIM4                ((tim4_t *) 0x40000800)
#define PERI_TIM5                ((tim5_t *) 0x40000C00)
#define PERI_TIM6                ((tim6_t *) 0x40001000)
#define PERI_TIM7                ((tim7_t *) 0x40001400)
#define PERI_TIM8                ((tim8_t *) 0x40010400)
#define PERI_UART4               ((uart4_t *) 0x40004C00)
#define PERI_UART5               ((uart5_t *) 0x40005000)
#define PERI_UART7               ((uart7_t *) 0x40007800)
#define PERI_UART8               ((uart8_t *) 0x40007C00)
#define PERI_USART1              ((usart1_t *) 0x40011000)
#define PERI_USART2              ((usart2_t *) 0x40004400)
#define PERI_USART3              ((usart3_t *) 0x40004800)
#define PERI_USART6              ((usart6_t *) 0x40011400)
#define PERI_VREFBUF             ((vrefbuf_t *) 0x58003C00)
#define PERI_WWDG                ((wwdg_t *) 0x50003000)


#endif